{'title': 'Kaku - Floating Japanese Dictionary (OCR)', 'description': '<b>🌸 The Quickest Way to Lookup Kanji on Your Device</b>\r\nKaku is a fast, powerful Japanese dictionary that stays on top of all your apps. It uses optical character recognition (OCR) technology to recognize kanji on the device screen for you (rather than the slowww tedious process of looking up individual characters manually), making it perfect for Japanese learners who want to study by reading raw manga, play untranslated mobile games, and so on without the hassle of switching apps on Android.\r\n\r\n<b>🌸 Inspired by the Best Japanese Reading Tools</b>\r\nIf you ever used KanjiTomo, this is the Android equivalent. Kaku is also the closest you can get to browser extensions like Rikaikun / Rikaichan / Rikaisama / Yomichan on Android.\r\n\r\n<b>🌸 Open up Endless Study Opportunities</b>\r\nBeing able to quickly lookup kanji inside any app makes it easier to practice Japanese than ever. Use Kaku to:\r\n • Transition to reading your favorite manga in Japanese instead of English\r\n • Play numerous untranslated Japanese mobile games not available in the English\r\n • Easily lookup kanji in apps that don\'t allow copying of text, i.e., Twitter\r\n • Read Japanese in the original app instead of "sharing" the text to another reader app\r\n • Use Kaku with Chrome as Android\'s version of the Rikai-tachis\r\n • Lookup kanji in random images you may encounter\r\n\r\n<b>🌸 Keeping it Classy and Free</b>\r\nKaku works entirely offline and does not collect nor send user data.\r\n\r\n<a href="https://www.google.com/url?q=https%3A%2F%2Fkaku.fuwafuwa.ca&sa=D&sntz=1&usg=AFQjCNFUuTrvhx3Zc-LZt4hjpnJpvTzTrA">https://kaku.fuwafuwa.ca</a>', 'descriptionHTML': '<b>🌸 The Quickest Way to Lookup Kanji on Your Device</b><br>Kaku is a fast, powerful Japanese dictionary that stays on top of all your apps. It uses optical character recognition (OCR) technology to recognize kanji on the device screen for you (rather than the slowww tedious process of looking up individual characters manually), making it perfect for Japanese learners who want to study by reading raw manga, play untranslated mobile games, and so on without the hassle of switching apps on Android.<br><br><b>🌸 Inspired by the Best Japanese Reading Tools</b><br>If you ever used KanjiTomo, this is the Android equivalent. Kaku is also the closest you can get to browser extensions like Rikaikun / Rikaichan / Rikaisama / Yomichan on Android.<br><br><b>🌸 Open up Endless Study Opportunities</b><br>Being able to quickly lookup kanji inside any app makes it easier to practice Japanese than ever. Use Kaku to:<br> • Transition to reading your favorite manga in Japanese instead of English<br> • Play numerous untranslated Japanese mobile games not available in the English<br> • Easily lookup kanji in apps that don&#39;t allow copying of text, i.e., Twitter<br> • Read Japanese in the original app instead of &quot;sharing&quot; the text to another reader app<br> • Use Kaku with Chrome as Android&#39;s version of the Rikai-tachis<br> • Lookup kanji in random images you may encounter<br><br><b>🌸 Keeping it Classy and Free</b><br>Kaku works entirely offline and does not collect nor send user data.<br><br><a href="https://www.google.com/url?q=https%3A%2F%2Fkaku.fuwafuwa.ca&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNFUuTrvhx3Zc-LZt4hjpnJpvTzTrA">https://kaku.fuwafuwa.ca</a>', 'summary': 'Kanji recognition dictionary built for Japanese learners who study by reading.', 'summaryHTML': 'Kanji recognition dictionary built for Japanese learners who study by reading.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.38, 'ratings': 179, 'reviews': 103, 'histogram': [12, 5, 10, 23, 127], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '58M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': '0xBAD1D3A5', 'developerId': '0xBAD1D3A5', 'developerEmail': '0xbad1d3a5@gmail.com', 'developerWebsite': 'https://kaku.fuwafuwa.ca/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5287714392504273330', 'genre': 'Education', 'genreId': 'EDUCATION', 'icon': 'https://lh3.googleusercontent.com/Tllp7eBomioze3G96eGQ5pi4tSX4WNwuso2sCKn2yAZg13LORvu1jN-bqhQGTkCOpJE', 'headerImage': 'https://lh3.googleusercontent.com/F62stUHIWFGIozzRqQ51y9Mim6q17meaUhe75UcqqUnXNdyrm38eZMRxPooGfKh-Ph4', 'screenshots': ['https://lh3.googleusercontent.com/ocIjQk-bzzc_4VAAOONZ42C7LtHRTrEp_LzvyBitfDRuq9S-oLvj2Y8Fp5tQwwPiH40', 'https://lh3.googleusercontent.com/GeIFkp-YdU3oekq0eWRiF_zBr3U1TcrbhqMuTQwnXLGOiueJp02NoQgkFnx1XZwI__E', 'https://lh3.googleusercontent.com/eyoNh58193vLkpd7j4EKKab_SZnEV2QaSS9iq87iqcY1GMbRekbHM1j5HxDHTdqgXyY', 'https://lh3.googleusercontent.com/ltDwfpHgy7yBNJoDrIgPQnnU2Bwehu2z_d5_wZITzwYZP9P-j19ZxIcKQXjD1dD4EmE', 'https://lh3.googleusercontent.com/clJu0qv4NBh2N66cfdNZwAX7i_d1ECuMGeTzyCwiV05njvgdXRVmc-tmJoPRi0nTWQSc', 'https://lh3.googleusercontent.com/M3DwbTGktFfluBBxXyK3tUHRnuiECjbFA9W73pYm0gVpzP8cQWJZhktDr1IJblNcNQ', 'https://lh3.googleusercontent.com/4SFn5CNZU8gXDrwsh6yhhla8ywznILN_EhwR2ROGXPponb0lmHKnWFzYGkXAlxIvwRV9', 'https://lh3.googleusercontent.com/1sEyqa-M0xOSQV1R9ST96GgCJo78HrBEdnSoJAzc68C9GPoLzLLdjCCmrBRVKIbo-p4', 'https://lh3.googleusercontent.com/6a19G3wqRDi9BabgNyVeQddGGAeJ2iYLFUQEIw8x7rxHCA8pMJyuhjTEiIu0vD5a5wo'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 30, 2018', 'updated': 1556071005, 'version': '1.3.64', 'recentChanges': 'Been busy the past month... :( only minor bugfixes for now.', 'recentChangesHTML': 'Been busy the past month... :( only minor bugfixes for now.', 'comments': ['This is one of the most awesome, handy, innovative apps/(learning) tools i found (for Japanese). Amazing how it makes reading and studying easier. Especially when i talk with Japanese or read some Japanese text online for example. It would be even better if you could not only copy the selected text, but also either a kanji/compound/word or meaning. 5 stars if this is taken into improvements!', 'I THANK THE DEVS SO MUCH FOR CREATING THIS APP. it certainly saved the hassle of having to rewrite this unknown kanji and searching for it manually!!! i could read novels (albeit slowly) without having to leave the page,,, just a click and wow we have the onyomi kunyomi even alternative meanings and recommended words?! amazing i love you guys so much may always be blessed', 'Great app. It did take me a while to figure out how to turn pages. Also it seems like the latest Android release might have broken the way you could tap the notification pane to put the window in sleep mode. All in all this is an indispensable app for intermediate Japanese learners who want to use their mobile device to practice reading.', "At first I was an idiot and didn't go through and accept all the permissions. So when I selected a word and tried to open Kaku, it crashed. Now it works great!", "I love this app - it's made me a lot more efficient in my Japanese learning. I like reading manga but it's a lot of work to look up words while read manga on my phone. This app has made that way easier. And being able to highlight text and have it translated right away is another great feature. Since I started using this app I've converted my random reddit reading on the phone into productive Japanese learning. I highly recommend this to anyone who wants to learn Japanese!", "For a long time I've been switching between apps trying to find anything close to Rikai that I could use on my phone, your app is exactly what was missing, so thank you for putting it out! I've been using it for the past few hours playing a Japanese game on my phone and I don't think I've encountered any problems so far. The transition between using the app and playing the game hasn't interfered with the gaming experience. Can't wait use Kaku on more occasions!", "The controls are cumbersome, tedious, and hard to get used to, but this app saves stunningly huge amounts of time and frustration nonetheless. I can't find anything like it elsewhere, so five stars. Better controls, please! Also if it could integrate with some of the other popular Japanese apps like Kanji Study or Anki, that would be awesome.", "some text in Japanese are written in hiragana instead of using the kanji for those words and the app doesn't recognize the word because it doesn't know the Hiragana version of the word,please fix this and it will be a very very useful app.(Though i love that it can recognize various writing style in a lot of texts,+1 on this part congrats)", "Extremely useful app! I've been waiting for something like this for a long time. Two things would get me to go from 4 stars to 5: 1) make it so you can scroll to see captured text that can't fit in the UI overlay. 2) needs a LOT of improvement on ability to translate common kana-only expressions", 'Very useful app. Had an issue where translation cannot be seen, but can do corrections. White color text or maybe rendered behind background?', "First time downloading Kaku app didn't work as none of the features showed up. Contacted the developer who was very helpful and supported me althroughout fixing. Kaku has made reading Japanese on my phone a lot easier. Enables me to learn on the go from any Japanese source without having to switch between 4 different apps every second (which is just demoralising). Interface is very compact on any screen and simple gestures make a lot happen. There's a tool for everything + great tutorial in-app.", "Works great, and makes it a lot easier to play and understand Japanese games on my phone. The ability to check other similar kanji in case the app recognized it incorrectly is very convenient. Being able slide and adjust how well the app sees the character is great too. Only issue is that it occasionally doesn't grab the entire text in the selection box, but a quick retry generally fixes it.", "I love this app it can be a bit hard to get used to using but very helpful since i can't read many kanji very well , I was looking for this kind of thing about a year ago and I'm glad one was finally made also please don't add romaji 😖 people always do that and ruin the app for me (and many others) since I can read kana and I try to avoid romaji its not even good for learning just learn kana it's not even that hard , why did you even get an app like this if you can't even read kana?..がんばって", "I tried it for a little bit, but it did not recognize the kanji well in a photo I took. The kanji and font was standard and very clear, but the app didn't pick up on what it said. I did try it in an app with text and it worked just fine. But I'd to use this technology with photos as well.", 'Why it works on only kanji, not as whole translation tool?', "This app works very well and is handy, it recognizes text accurately in all the Japanese apps I play so far. Although occasionally, when I lock my phone while Kaku is active, I cant unlock it again and I'm forced to restart my phone. EDIT: My bad lol I noticed you can pull down the notification to shutdown the app!", 'I tried it with several apps and it\'s a bit slow even tho my device has more than enough ram and storage room, I think it\'d be much smoother and user friendly if you made the app so that it allows the user to resize the window and specify which word(s) they want read first before they press a "read/scan" button to get the translation directly from the floating dictionary. Thanks for your hard work I\'ll be keeping up with this app.', "This app is a life saver! Using Google Translate's camera function to detect text just so I could look up the words on another site/dictionary app was such a hassle and very time consuming. Kaku is super handy and will hopefully help me learn more Japanese so I can read stories from my favorite games!", 'Takes too long and the recognition rate is very low, especially with less common words and kanji. Tried it now for some weeks with several documents, books, and pdfs. Has not convinced me, unfortunately. I am sure with more development, in the future, it will.', 'hassle free, easy to understand kanji .. thank you developer 👍', 'this is an amazing app and exactly what i needed ❤️♥️ just one feature I hope can be added; to be able to share seperate kanji to other study apps in order to make lists to remember them. There are 4 swipe directions I think and this would make a great addition to the three comands already available 😊', 'Good app, but is a bit too large megabytes wise.', 'Not perfect but the best app that does this sort of thing. Indispensable for people who are bad at Japanese like me', 'Needed something for looking up youtube comments, serves the need perfectly. A feauture request is to have an adjustable pop up box- like the Jisho app, so that anything copied can be looked up instantly (slightly faster than clickiny share and selecting "kaku" )', "An app for people who want to learn Japanese. A quick and simple setup as well as easy to learn controls. It's fast, efficient and accurate with a ton of additional features. I'd highly recommend this app to any Japan lover out there in the world!", 'Great app. The best app for Japanese kanji OCR by far. Although it does fail sometimes, it detects kanji fairly accurately most of the time. Thanks to the developer for such a helpful app.', "nice app, but it didn't really work if the word is too small or there is other mismatch color on the word background PS : Can you add romaji? pretty please! there is some of us who can read romaji but can't read japanese xD no i learn them...but not kanji...arrgh those kanji...!!!! thanks for replying. i just mean the section where we click the word will show how to read that word... because using kaku may separate the word that means for one word for example name. welll...thanks.", 'Very fluid and fast controls. It helps me look up kanji in manga reall quickly. I can continue reading without leaving the page. Highly recommended for Japanese learners.', "With a few adjustments, has greatly helped me read and parse my favorite games! Even some games with unusual Japanese font it detects really clearly; I'm a big fan!", 'pretty poor results. this is supposed to save you from "drawing each kanji while reading manga" but i find myself doing exactly that on top of struggling with the bad controls. just stick to the old fashioned way everyone. this ain\'t it yet.', 'Lengthy "Kaku is loading" with no apparent progress.', 'this is the best! it works on top of other apps and actually tries to help you learn something. really simple too :)', "Great app! If you can add a simple way to copy selected kanji into clipboard (instead of whole sentence), it'd be 5 star. That or a way to integrate into anki.", "Works great, much better than using google translate. I can't seem to scroll the translation box when scanning longer sentences.", 'Phone slows down a lot, im just casually looking up kanji on my anki deck. 5 stars if it can recognize whole words. edit - ok, my bad it works alright. but my phone suddenly slows down a little bit(4gb ram here)', 'it looks like a great app, but i think its not working well for me... it doesnt reconize well the kanjis and doesnt translate. i dont know why.', 'Superbly useful as learning material when doing browsing on android phones. Hopefully this app will last for a very long time. Highly recommended for Japanese learners on the go.', 'Quite good. Would be nice to have vertical support since a lot of japanese books are written vertically.', "Really really useful, even though it's cumbersome to use. I wish there was something like this for Chinese.", 'Wonderful, does the job, especially for games. Still some issues, because OCR has his limit.'], 'appId': 'ca.fuwafuwa.kaku', 'url': 'https://play.google.com/store/apps/details?id=ca.fuwafuwa.kaku&hl=en&gl=us'}
