{'title': 'File Shortcut [V2]', 'description': 'It\'s an app to create shortcuts to open your files.\r\nYou can choose any files such as images, videos, or PDF.\r\n\r\n\r\n[FOR OLD "File Shortcut" USERS]\r\nIt is NOT compatible with older versions.\r\n\r\nThis app is ad free and the source code is public on GitHub.\r\nSource code is here:\r\nhttps://github.com/75py/FileShortcut', 'descriptionHTML': 'It&#39;s an app to create shortcuts to open your files.<br>You can choose any files such as images, videos, or PDF.<br><br><br>[FOR OLD &quot;File Shortcut&quot; USERS]<br>It is NOT compatible with older versions.<br><br>This app is ad free and the source code is public on GitHub.<br>Source code is here:<br>https://github.com/75py/FileShortcut', 'summary': 'Create shortcuts to open your files!\r\n(Free, Ad-Free and Open Source)', 'summaryHTML': 'Create shortcuts to open your files!<br>(Free, Ad-Free and Open Source)', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.13, 'ratings': 195, 'reviews': 142, 'histogram': [76, 9, 9, 11, 87], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.4M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': '75py', 'developerId': '75py', 'developerEmail': 'dev.75py@gmail.com', 'developerWebsite': 'http://blog.nagopy.com/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5094919440529105589', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/Wzwu9uXGf-gqEI6dd-hyxS4havQADYk5BpG9MOVztZoSpau9txjCTIu5LqdW6r73V2zK', 'headerImage': 'https://lh3.googleusercontent.com/sDuHmITArvb34CfdwIMo1rdllE8UVwSthlBKlViGhM8n61Gg30NVx1GvilXnb_gc1dU', 'screenshots': ['https://lh3.googleusercontent.com/_fUzJutIDnWZPbmAPbgh6iRUhBZGZuQehL44QfUYyT5w1-VzBlhUdhbQstXYm9IMuA', 'https://lh3.googleusercontent.com/10XJgZcb1lcj9nx0bxeWqeJdZqy-KTbv2lPyKTt_WZd0gHHmknuSYakXWBK8CcKZdAM'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 31, 2017', 'updated': 1515147664, 'version': '2.1.1', 'recentChanges': '[for Android Oreo] Add a feature to edit created shortcuts.\r\nhttps://github.com/75py/FileShortcut/issues/1\r\n(Created shortcuts by version 2.0.0, shortcut icons cannot restore. Please edit or delete&insert.)', 'recentChangesHTML': '[for Android Oreo] Add a feature to edit created shortcuts.<br>https://github.com/75py/FileShortcut/issues/1<br>(Created shortcuts by version 2.0.0, shortcut icons cannot restore. Please edit or delete&amp;insert.)', 'comments': ["Quick and easy and does exactly what it says. I had a file widget app already but it took up 28 MB! There's no reason such a simple function should take up that much space. This app only shows 3MB as installed. I uninstalled the other app. Also, I prefer the sizing of the home icon on this app because it's the same size as my app icons. The other one put a big icon on my home page.", 'This app saves me a great deal of time. Rather than always searching for a file, I can simply use it to find a file I need (like a PDF document) and make a shortcut to the home screen. So instead of the frantically searching and continuous clicking, I can access the file I need with one simple action. It is an ideal time saver. I use the older version on my old devices and the new version [V2] on my newer ones. Top marks to the developers.', "Simple & Works! My build-in file manager, which I like, won't let me name/rename its shortcuts. To rename with this app, just create new shortcut and delete the old. Duh! Custom icons are a real plus. Thanks!!!", "The option to shortcut the FOLDER the actual file is in would ne nice too please. My main concern is with the shortcut icon itself. For starters, I can NOT rename the file being shortcutted. Secondly, the god awful and ridiculously obnoxious watermark on the icon itself. Even the usual 'work around' of applying the shortcut from the widgets draw doesn't get rid of it on this particular app. Yes, I know this is an Android/OREO/Google issue shoved into the OS now but fix the widget work around!", 'Can put individual files and folders on your home screen... Simple as that!.. (tap on "open file pickers" to find your file.. It fills the "file path" in automatically when you select your file)', 'Cant open a pdf file. It will close abruptly. On Pocophone f1', 'Update 8/6/2019: for Android 7+ the new OS variants break PDF, video, and audio shortcuts. But you can still use images, photos, documents, and spreadsheet shortcuts. Still the best app and one of my most used apps since it was first released. Thanks to the Dev for creating it.', "Disappointing: App crashes each time I attempt to select the target file. I'm on a Samsung S10+", 'So Simple but so CLEVER! I have many reference PDFs that I need to access on a regular basis. This app lets me have a screen with all the PDFs accessible with a single touch. Perfect for my needs.', 'Crashes when you try to create any shortcut with any item. Useless and broken', 'Simple and does exactly what I needed it to do! I spent a few hours trying to figure out how to add a shortcut to a picture file I use as a reference. This app took a few seconds to do it on my S9.', 'Works well if you manually enter the correct full path with "/storage/emulated/0/Download" etc. If you try to use the file picker it crashes out on Android 9', 'Should also support URL shortcuts too. Right now I have to use 2 different apps (one for file, one for URLs). Other than that its 5 stars!', "This app like most so called shortcuts app is stupid because it can only do what the operating system already provided. What l really want is to be able to store the shortcuts in a folder. That way l can organise them. What's the point of putting it at the desktop. You can do it without some dumb app.", 'Created shortcuts easily, quickly and they functioned perfectly. No issues with the icon being the wrong orientation.', 'Excellent! Thank you for updating this fantastic app! It worked fine on Pie.', "App did not even function. Would just close itself after selecting a file. Don't waste your time.", 'Unfortunately seems to have stopped working on latest os update. Android 9 on Samsung S8', 'Works great on Android 8 but just crashes on Android 9.', 'Keeps crashing when trying to make a pdf shortcut', 'Does not work. Just keeps crashing. Uninstalled.', 'Love the simplicity and the thumbnails', "Doesn't work with oneplus 3t. keeps failing", 'Worst app!!!! It closes automatically when we select files', 'Simple, no unnecessary permissions.', 'Super..B App Finding Anything Shortcut..I Love You So Much..Its App', 'Fantastic. Does everything it says and has simple interface', 'does not work with samsung 9 plus.', "After update won't work.. uninstalled....", "Shortcuts don't work anymore", "Doesn't work, keeps closing itself", "Wasn't able to create shortcut to a file shared from Whatsapp.", 'Very very usefull. Good app', 'Crashes everytime i select a file', 'He is note good work.', 'cant keep important files on homescreen.', 'App is not working', 'SUPER USEFULL APP! THANK YOU SO MUCH!', "Can't even make folder shortcuts", 'Its sucks at my phone whenever i created a shortcut'], 'appId': 'com.nagopy.android.fileshortcut', 'url': 'https://play.google.com/store/apps/details?id=com.nagopy.android.fileshortcut&hl=en&gl=us'}
