{'title': 'Aard Dictionary', 'description': "Simple dictionary and offline Wikipedia reader.\r\n\r\nPlease report issues by email, our issue tracker at http://github.com/aarddict/android/issues or forum at http://aarddict.org/forum\r\n\r\nNote that there are no dictionary downloads from within application. Download dictionaries at http://aarddict.org/1/\r\n\r\nIf you're device is Android 4 or newer - check out Aard 2 at https://play.google.com/store/apps/details?id=itkach.aard2", 'descriptionHTML': 'Simple dictionary and offline Wikipedia reader.<br><br>Please report issues by email, our issue tracker at http://github.com/aarddict/android/issues or forum at http://aarddict.org/forum<br><br>Note that there are no dictionary downloads from within application. Download dictionaries at http://aarddict.org/1/<br><br>If you&#39;re device is Android 4 or newer - check out Aard 2 at https://play.google.com/store/apps/details?id=itkach.aard2', 'summary': 'Simple dictionary and offline Wikipedia reader.', 'summaryHTML': 'Simple dictionary and offline Wikipedia reader.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.21, 'ratings': 390, 'reviews': 150, 'histogram': [46, 7, 15, 66, 253], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.8M', 'androidVersion': '2.1', 'androidVersionText': '2.1 and up', 'developer': 'Igor Tkach', 'developerId': 'Igor+Tkach', 'developerEmail': 'itkach@aarddict.org', 'developerWebsite': 'http://aarddict.org', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '6146463993170112943', 'genre': 'Books & Reference', 'genreId': 'BOOKS_AND_REFERENCE', 'icon': 'https://lh3.googleusercontent.com/T7nxYYhpmGDzg5Ckwu3L7Jb4HTHyKdGoz0n2u1RJmghUw7nrwNSXCTNKIDQvqtW3Uv8', 'headerImage': 'https://lh3.googleusercontent.com/LayLBis5awa7PamSuguW2kfZYiNR604RWwcGtpMZMqgfFKdHiVlw3lMYJ89qJjPVy_F3', 'screenshots': ['https://lh3.googleusercontent.com/2HE54tR2BAMXGJ5jUsdQHnD0i0ej5Y_AcQgKiit9HrxOgRcduc05RGaoZgTdnLtL8Zw', 'https://lh3.googleusercontent.com/VVa-ZAWnVzHQamFP_OntZTB4v7U7XTuzoCffEH7vPftY8rBNHRzbuPmKVyqoWkX7TVY', 'https://lh3.googleusercontent.com/EiMT8sZWJCOr8OeITNr2ZwK7S-0FZ8NaIgurqnKLEYy9nkE1SFEQX6pFqqEob7Jh7o03', 'https://lh3.googleusercontent.com/6z_YfGb2ZvSeOdf2-ZXMPiExGLf8m5TC3-vyKJVZhdDtIZJ_RYzPXUmJlWVxolY12Qo', 'https://lh3.googleusercontent.com/bOFtKVDLZE9LLu3ArzjWXbAszDQJ9TGECpx_f61qMu60WhgRMT6ILAKgf_ojA3h8YA', 'https://lh3.googleusercontent.com/ds3p8i2V6hFgZhdbZ_RNauKTF8BrszoYGUL7SVp_S-P4ebs4wgLRJnD8X6YAdGwdRrc'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 12, 2010', 'updated': 1402795409, 'version': '1.6.11', 'recentChanges': 'v. 1.6.11\r\n- Fix following internal links which broke with Android 4.4.3 update\r\n- Revert back button support for in-page links (no longer properly works with the fix above)\r\n\r\nv. 1.6.10\r\n- Phone number links (tel: URIs) now open dialer\r\n- Better handle in-page links (URIs containing only fragment)\r\n\r\nv 1.6.9\r\n- Links containing spaces didn\'t work in some recent dictionaries, fixed \r\n\r\nv 1.6.8\r\n- Fix zoom in/zoom out on Android 4.4\r\n- Fix infinite zoom in on "Find in page" on Android 4.4', 'recentChangesHTML': 'v. 1.6.11<br>- Fix following internal links which broke with Android 4.4.3 update<br>- Revert back button support for in-page links (no longer properly works with the fix above)<br><br>v. 1.6.10<br>- Phone number links (tel: URIs) now open dialer<br>- Better handle in-page links (URIs containing only fragment)<br><br>v 1.6.9<br>- Links containing spaces didn&#39;t work in some recent dictionaries, fixed <br><br>v 1.6.8<br>- Fix zoom in/zoom out on Android 4.4<br>- Fix infinite zoom in on &quot;Find in page&quot; on Android 4.4', 'comments': ['For five years, I have used Aard on a Nook Simple Touch with CoolReader, and find the off-line dictionaries marvellous beyond belief. I access them a couple of dozen times with each reading session. My next eReader simply must have an SD slot to enable Aard.', 'This is a good replacement for WikiDroyd, which has been abandoned by developer, and rendered unusable by some Kitkat phones. Although I don\'t know the difference between the 8Gb and 14Gb version of English wiki data. I chose the bigger one. Please add browse history or favorites option. And maybe bookmark. There\'s so many interlinked interesting articles. Need a way to mark them and go to them in next readings. Also needs an "Exit" button. Why only forward button? Need rewind button too.', "It's also in the Play Store, it's a different file format but better features.", 'die Wiki Files schlucken zwar 3-4 GB, dafür überall und zu jeder Zeit jede Info!', 'I found it perfect app . Faced no problems.', 'The best app for reading offline Wikipedia. Aard 2 is even better.', 'But not working in Lenovo K8 Note ...', 'عالیسسسسسسسست', 'This is a great application. It runs well with 10gb wikipedia, giving instant access to the equal of a few hundred volume encyclapedia set. If as a child you liked reading encyclopedias from cover to cover, you will love this. I wish I could get a one or two paragaph popup preview a underlined link while you hold your finger on a link before jumping. I want this--with pics.', 'Xtremly fast, searches in all loaded Wikis such a Wiktionary.', 'very good', "Right now only results that begin with the searched term is displayed.   If it had a function to search for the entry within the entire name of the result, the output could be a lot more useful to the user.   Example: if I search for 'thermodynamics', the output would only show the result 'thermodynamics (Wikipedia)'.   However, there is actually a Wikipedia entry of 'the first law of thermodynamics (Wikipedia)'. An option should be made so that all results containing the search term is shown.", 'Its a good wiki content reader app. But it should contain pics like kiwix.', 'Great app with wonderful  search method', 'But it must be better if databases are seperated into small size (1 data is lower than 1 GB) Whether English wikipedia is divided into 12 aar data (= 11 Gb)', 'Please provide option for deleting unwanted articles from aard dictionaries.-ravisobhan', 'How can I add articles directly without compiling?', "1. Where is it?  2. Add categories, for wikipedia.  otherwise, old database... Edit: thanks, but don't think it's easy for us, to make a windows converter, also, why not add categories? Wiki taxi is good with this, it has the 2 options available.", 'Exactly what I was looking for. Wasted too much time looking for another offline wikipedia app. Glad I finally found this! THANK YOU!', "Works well on nook simple touch. Needs copy paste. Weird dict format but quality is great. Waybetter than free xdxf's in others.", "Great for when you can't rely on a data connection for all your information needs. High quality free and open source software. Also use this on a Nokia N800, a linux laptop and have recommended it to friends and family. It's fast, light, clean and stable. Biggest drawback is that the full Wikipedia file is unavoidably huge but with flash memory getting cheaper all the time that shouldn’t be much of a barrier.  Highly recommended.", 'Fantastic program! Instant search results and fast, accurate rendering. Wish you could choose or temporarily disable specific "books". Pinch zoom would be great (you can zoom from the settings button). For an up-to-date, full English Wikipedia, Google "aardc slow" and enter the GitHub discussion. A kind soul has been compiling/sharing WP as ~10 GB torrents. Pocket full of awesome even without Internet access!', "A recent (April 2012) compressed copy of the whole Wikipedia is available (takes just 10GB). The latest Aard version doesn't work on Android 1.6 devices like Archos 5IT/48, but the previous version 1.3.1 is just fine (the 1.3.1 apk can be downloaded from other sites).", "I'm using this on my mobile as well as on PC to view offline dictionaries. It is very useful, fast and smooth worthy for 5 star. I will be delighted if it has NIGHT MODE option too.... to save power with amoled screens.", 'Full Wikipedia (eng) needs 10gb off sd-space. Searching in the whole dictionary works superfast. Also math-formulas get shown right with this app. Thanks for this great app!', 'Fast, well formatted and a pleasure to use. I wish there was someway to browse the dictionaries without needing a search string.', 'very good, esp. as for technical articles: undistorted formulae unlike analogs', 'Tries to download from app, starts download then says download unsuccessful! I tried directly from site online and it was still unsuccessful...', 'Open source. The only way to go.', 'Great work', 'This is a very nice app with the simple english wiki(100mb) and wordnet(50mb). Would be perfect if I could copy selected text, it is in the linux version so I guess it just needs to be implemented.', "Wow, Aard is much better than the two wikipedia-specific offline readers I've tried.  It's more stable, more accurate in its conversion of the wikipedia articles, and has more recent data.  Unlike the others, it looks like wikipedia online.  The only downside is the large data-file size (almost 9GB for the English Wikipedia).", "Excellent program: stable, accurate, fast and multiplatform too (has versions for Maemo, Windows and Linux that I've used, probably has others too).", 'Best free offline dictionary/wikipedia!', 'Works fantastically well with the 2,000,000+ entry Wiktionary!', 'Great app. Big plus for non-english speakers: it will find words even when accents and umlauts are missing or misspelled.', 'Good idea but load dict everytime the app is opened, very long and it says the english wiktionary from the website is corrupted...', 'Nice app, good job, works great on HERO', 'Its a waste application', 'Wikipaedia content is outdated,update it plz'], 'appId': 'aarddict.android', 'url': 'https://play.google.com/store/apps/details?id=aarddict.android&hl=en&gl=us'}
