{'title': 'Fit Notifications (for Fitbit)', 'description': 'Fit Notifications allows you to view all your Android notifications on your Fitbit device. See list of compatible devices.\r\n\r\n<b><i>No special permissions required!</i></b>\r\n\r\n<b><u>COMPATIBLE DEVICES:</u></b>\r\nThis app supports any Fitbit device that has text notifications capability. The following is a non-exhaustive list:\r\nFitbit Alta, Alta HR, Charge 2, Blaze, Surge, Ionic, Versa, Versa 2 and any other device supporting text notifications.\r\n\r\nNote: Limited compatibility with Fitbit Flex 2 (lights up the LEDs)\r\n\r\n<b><u>POSSIBLE ISSUES (Troubleshooting):</u></b>\r\n\r\n1. Some users have experienced issues receiving notifications when they enable the "Dismiss placeholder notification" setting within this app. If you are experiencing issues with notifications, please try increasing the delay to dismiss placeholder notifications to 5 seconds or more, or try disabling this setting completely.\r\n\r\n2. Please make sure that you only choose Fit Notifications for the "Text Notifications" for your Fitbit device via the official Fitbit app. If you accidentally set other types of notifications such as Call or Calendar Notification also using \'Fit Notifications\' app, then Fitbit will NOT forward notifications to your device.\r\n\r\n3. If you use "do not disturb" mode (also called silent mode) then you will not receive notifications on your Fitbit device as Android disables notification forwarding. To work around this, you have to change the notifications priority for Fit Notifications app. Instructions are provided in the app to fix this.\r\n\r\n4. You MAY NOT receive notifications if your Fitbit device has low battery. Please refer to information at the official Fitbit website for your particular device model.\r\n\r\n5. You MAY have to restart your phone any time you update the official Fitbit app. Please refer to information at the official Fitbit website for your particular device model.\r\n\r\n<b>NOTE:</b> When having issues, always double check if you can receive regular notifications via the Fitbit app before determining that the issue is with the Fit Notifications app. If you do not even receive a phone call or calendar notification, then there may be a configuration issue with the official Fitbit app. Contact Fitbit to troubleshoot this.\r\n\r\n<b><u><i>Please troubleshoot the app using the instructions and FAQs. These should help you most of the time. If you still have issues, contact me via email.</i></u></b>\r\n\r\nIf you enjoy the app and find it useful, kindly rate the app and leave a useful review below!', 'descriptionHTML': 'Fit Notifications allows you to view all your Android notifications on your Fitbit device. See list of compatible devices.<br><br><b><i>No special permissions required!</i></b><br><br><b><u>COMPATIBLE DEVICES:</u></b><br>This app supports any Fitbit device that has text notifications capability. The following is a non-exhaustive list:<br>Fitbit Alta, Alta HR, Charge 2, Blaze, Surge, Ionic, Versa, Versa 2 and any other device supporting text notifications.<br><br>Note: Limited compatibility with Fitbit Flex 2 (lights up the LEDs)<br><br><b><u>POSSIBLE ISSUES (Troubleshooting):</u></b><br><br>1. Some users have experienced issues receiving notifications when they enable the &quot;Dismiss placeholder notification&quot; setting within this app. If you are experiencing issues with notifications, please try increasing the delay to dismiss placeholder notifications to 5 seconds or more, or try disabling this setting completely.<br><br>2. Please make sure that you only choose Fit Notifications for the &quot;Text Notifications&quot; for your Fitbit device via the official Fitbit app. If you accidentally set other types of notifications such as Call or Calendar Notification also using &#39;Fit Notifications&#39; app, then Fitbit will NOT forward notifications to your device.<br><br>3. If you use &quot;do not disturb&quot; mode (also called silent mode) then you will not receive notifications on your Fitbit device as Android disables notification forwarding. To work around this, you have to change the notifications priority for Fit Notifications app. Instructions are provided in the app to fix this.<br><br>4. You MAY NOT receive notifications if your Fitbit device has low battery. Please refer to information at the official Fitbit website for your particular device model.<br><br>5. You MAY have to restart your phone any time you update the official Fitbit app. Please refer to information at the official Fitbit website for your particular device model.<br><br><b>NOTE:</b> When having issues, always double check if you can receive regular notifications via the Fitbit app before determining that the issue is with the Fit Notifications app. If you do not even receive a phone call or calendar notification, then there may be a configuration issue with the official Fitbit app. Contact Fitbit to troubleshoot this.<br><br><b><u><i>Please troubleshoot the app using the instructions and FAQs. These should help you most of the time. If you still have issues, contact me via email.</i></u></b><br><br>If you enjoy the app and find it useful, kindly rate the app and leave a useful review below!', 'summary': 'Enable all notifications for compatible Fitbit devices', 'summaryHTML': 'Enable all notifications for compatible Fitbit devices', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.9707112, 'ratings': 2425, 'reviews': 1250, 'histogram': [324, 162, 131, 446, 1359], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '4.0M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'Smart Dinosaurs Entertainment', 'developerId': '6750440831050054589', 'developerEmail': 'android@abhijitvalluri.com', 'developerWebsite': 'https://android.abhijitvalluri.com', 'developerAddress': None, 'privacyPolicy': 'https://abhijitvalluri.com/android/privacy/', 'developerInternalID': '6750440831050054589', 'genre': 'Health & Fitness', 'genreId': 'HEALTH_AND_FITNESS', 'icon': 'https://lh3.googleusercontent.com/vhV2yzZDdoyL3r761uc-7g9-jFkGknKPx6oPO3V_NSwW8-rlASwJW_2ITl4VfJCfNJw', 'headerImage': 'https://lh3.googleusercontent.com/S4WDmEsd0Q2a3tjbSlXCspfFCS8z5ScJxW_-H5wq_m7hhT99osGHNNNCphifqS7h_ug', 'screenshots': ['https://lh3.googleusercontent.com/ACGqfgz1j2bM1y5mdT7CnNc3t1TfkwXt-BHcKXKRh81k0oNLC1V1QapH42LJFQ7UxHo', 'https://lh3.googleusercontent.com/xH1JNqc2PU9tP-hC8KEp8zilVGcAlbH9V04bsI6RZ-Ygb6PAiVpV3MIEDcSrB5nXIH4', 'https://lh3.googleusercontent.com/cO5TQgWv2qadV3Xr88gQrYo5GaM4uIXroyiYHjVs5pFMme4A9DjoEuQII_MF-w84BV0', 'https://lh3.googleusercontent.com/WZ_NdPAAc138QiL4JEotDcAuxZaTfopXCl61wxJXYTwgCgaL5mvIXqC2xLRTtNf7JAo', 'https://lh3.googleusercontent.com/872bM4017fWQeDhkm7079Pgz0RbccDF-Fy9ctTpSiVpgg7D46ZR_1fbZ7Y_zgOvurQ', 'https://lh3.googleusercontent.com/UvJqO7jDgHBBdNkF1eB79JDhQn2lonTFwLPZvjOOwKIq-EwHs9eB__L3ixZSvKHkCMlw', 'https://lh3.googleusercontent.com/iEq6nL1kGxIp7_qfiYl3FvhhytcfmH3WLAcVgbtLzJ_I5iANMt6Go9Go1uxClt-F6Cja', 'https://lh3.googleusercontent.com/jGgqdW5pnmY7ELWx65w11vzkYEsEmabD55GiDZ1dkAmElCUFKk-v-5dgG1kjz1NCRy0'], 'video': 'https://www.youtube.com/embed/hHmacLdXPe8?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/hHmacLdXPe8/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 4, 2016', 'updated': 1581289629, 'version': '2.10.0', 'recentChanges': '+ Updated app with Android 10 platform, and general stability improvements.\r\n\r\n+ Fixed issue on Android 10 where the placeholder notification is suppressing the notification sound of the actual notification.\r\n\r\nIf your Fitbit device does not vibrate but still receives notifications, then please try enabling the "Always Vibrate" setting in the Fitbit app, under the "Notifications" settings for your Fitbit device.', 'recentChangesHTML': '+ Updated app with Android 10 platform, and general stability improvements.<br><br>+ Fixed issue on Android 10 where the placeholder notification is suppressing the notification sound of the actual notification.<br><br>If your Fitbit device does not vibrate but still receives notifications, then please try enabling the &quot;Always Vibrate&quot; setting in the Fitbit app, under the &quot;Notifications&quot; settings for your Fitbit device.', 'comments': ["No different than Fitbit's own services. I installed and set it up to be able to read Snapchat messages. It does exactly what Fitbit does when I receive one: It reverts to my clock face, opening the message on my phone instead. And yes, I've triple checked my settings and app setups to make sure Snapchat is allowed through Fit Notifications.", 'This app is great!! It makes it so you can get notifications from apps on your phone. You can adjust settings for individual apps as well including removing empty notifications from apps. I use it with my Fitbit Alta.', "Fitbit Doesn't work with Note 10 plus only work with 7.0 systems nothing past a note 7 so there unless with anything else. So don't but one get a galaxy watch don't bother with a fitbit unless you got a old phone. O yes the knock off fitbit the 3pluse will work with you 9.0 system too", 'Same as Fitbit app... neither work. Not this apps fault, but be very careful which phone you have before buying a Fitbit.', 'Outstanding app. Always works without fail. Really useful and is just great in general!', "It's awesome, when I got a Fitbit charge 2 thinking it would give me snapchat notifications I thought I'd never see a snapchat notification, but thanks to this app I get notifications from whatever app is on my phone!! It's super easy to use as well!!!", "Syncing issue constantly it won't sync or get notifications should've stuck with charge 2 or better still get a huawei watch or galaxy watch", "Doesnt work on my fitbit charge 2. Have tried EVERYTHING and it did work for a day or two but now...nothing. I dont think it's the app I wonder if it's my phone so not going to bag the app. My Samsung A8+ is most likely the problem.", 'Would be great if it had a mute timer for notifications (for example not forward all notifications of an app if we receive 30msg in a row within 1mn). Tier Miband notification app does it', 'It just works! Why do we need a 3rd party app to push notifications to the Fitbit when Fitbit themselves should be able to do it.', 'It worked for about a week and then it just stopped. But while it worked I enjoyed having it.', 'Great workouts and easy to execute!', 'Works really well for all the devices it says it works for', 'Works great now I can get snapchat notifications no problem', 'Functional. Free. Perfect app!', 'The app works great! You are able to get notifications from all apps onto your Fitbit device, you can add filters, and change settings. Unfortunately for some reason I am not getting notifications from my Gmail even if my watch is right next to my phone...', 'It is good fit notifications bc it gives you notification on your fibit every time you get a notification', "Sometimes it comes late or doesn't come. But it's ok😉", 'Great idea, failed execution. I use an app called xdrip+ that has a permanent notification which displays info from a continuous blood glucose monitors. It updates the notification every five minutes with new data. I really wanted this info conveyed to my Alta hr. I disabled the "disregard ongoing notification" option, but I still rarely ever get these notifications. Hope the developer continues to battle Fitbit stupidity. It\'s the only reason I gave it a neutral rating.', 'Was so excited to find this app to receive my Google Voice notifications, Airbnb messages, and more that was ready to send $ to developer. But message delivery is imconsistent. UPDATE: 1/10/2020 Android Jan 2020 update to Pixel 2+ phones fixed notifications problem and will roll ouy other phonrs soon.Google it. App notifications still turn off sometimes as does Notificatuon Access, so have to check those 2 settings regularly.', 'Worked great for me since day 1. Gives exactly what i wanted, Facebook notifications and messages from snapchat.', "Very useful. I can get notifications that I normally wouldn't and I can answer emails any texts or send a quick message when I get a call that I can not answer.", "+1 on this app. The stock Fitbit software on Pixel 3 has issues sending text notifications to the Fitibit Blaze. Phone calls notify properly. Anyhow, I installed Fit Notifications and it addressed the issue. It's been working perfectly for both messages and other applications. An added plus is that it has more flexibility than the Fitbit notifications. I never write reviews but I had to share my joy on this one. Well done!", "Installed so that I could get notifications of texts as well as from other apps such as WhatApp, Messenger & my calendar from my Samsung Galaxy Note 8 on my Charge2. Set it all up, test message came through fine, great. Unfortunately that's as good as it got, I do get notifications, about 1 out of every 20 to 30 received. I don't appear to get any at all from some apps & it's very sporadic for others.", 'Loved it for two years, till Android 9. This app worked great at giving me notifications from my SMS messages, WeChat, calendar, phone calls, DOT road alerts. But once my phone recent updates to Android, all I get it "unknown" whenever someone calls, don\'t get SMS messages at all. This really sucks. I know it was Android that caused the problem, but that pretty much broke this app, and made it useless. :(', 'I installed the app and it worked for the test message, then one text--then stopped. I was so disappointed--I thought I had my Versa working again after not receiving notifications for over a month.', "Fantastic app. When the Fitbit app stopped sending text notifications to my Alta HR after the Android 10 update, I switched to this app. Fitbit has apparently fixed their app (finally), but I'll stick with this one. It allows notifications from multiple messaging apps, which I have grown to like, and it seems more reliable than the Fitbit app.", "I thought this would be a great solution and it is when it works, however most of the time it stops working so I don't receive any notifications.", "Love this. Should be a feature in the main app, and it's very clever. I would have never thought of something like this had I developed the app 😂 However. I wouldn't mind if you could have the option of making the placeholder notification have an invisible/fully transparent icon. So that it doesn't show up on the notification bar.", "This app is very good I thought there was no way to get snapchat notifications but now boom because of the developers it's better than having to buy a smartwatch when these smart people did it themselves I had doubt about this app working but you guys shot me right up into happiness!, 😊😊😊☺️☺️☺️", "So far I've enjoyed Fit Notifications quite a bit. i use Signal, for the encrypted privacy it offers, and was concerned that it would cause problems. Fit Notifications was fairly easy to install (I'm in the IT biz, and am always on the lookout for gaps in documentation or unobvious walk throughs). Fit Notifications does deserve 5 stars imho.", 'Thanks it works perfectly, my unsupported device (poco f1) now gets notifications on my fitbit (inspire hr). If you would make an option to donate via the app itself I would have done it. Just make like a pro version or a no ad version or something thats like 1 or 2 euro. I would like to donate.', "I haven't had any notifications on my Fitbit charge 2 since I changed phones to the Huawei P20 'lite' I'm just about to change my phone as for 6 months I've muddled along turning Bluetooth on and off restarting my watch and phone I then installed this app and tbh wasn't expecting much but ATM it's working perfectly Admittedly this is only day 2 but I'm very hopeful this is the fix Why couldn't Fitbit do this? Very happy thank you", 'Worked for the test notification && now nothing at all. I thought this app would fix my notification issue with the fitbit app. Disappointing to say the least', 'Its not what i thought it would be. never get my phone call etc does not calculate my steps. will not sync to my samsung health. not satified at all', 'Needs reconnecting all of the time. Very frustrating.', "The app is good but the down side is the notification does not stay on for too long. I have only used it for three days and I keep having to turn on the notification all the time. I am using a 1plus 5 phone, I don't know if anyone else has the same problem.", "Won't sync to my phone that you said is compatible.", "Great app!!... only been using a few days but so far it's brilliant!", 'Works well, altho a bit fiddly to set initially. I get notifs from any apps I want now. I thought it was unreliable but that was caused by Fitbit Bluetooth comms (tested conclusively). No problems with this app at all.'], 'appId': 'com.abhijitvalluri.android.fitnotifications', 'url': 'https://play.google.com/store/apps/details?id=com.abhijitvalluri.android.fitnotifications&hl=en&gl=us'}
