{'title': 'Eclair Mobile Testnet', 'description': 'Eclair Mobile is a next generation, Lightning-ready Bitcoin wallet. It can be used as a regular Bitcoin wallet, and can also connect to the Lightning Network for cheap and instant payments.\r\n\r\nThis software is based upon <a href="https://www.google.com/url?q=https%3A%2F%2Fgithub.com%2FACINQ%2Feclair&sa=D&sntz=1&usg=AFQjCNGx3lXbXLadXyaQDy5Ix8Ml6IOh8A">Eclair</a>, and follows the Lightning Network standard.', 'descriptionHTML': 'Eclair Mobile is a next generation, Lightning-ready Bitcoin wallet. It can be used as a regular Bitcoin wallet, and can also connect to the Lightning Network for cheap and instant payments.<br><br>This software is based upon <a href="https://www.google.com/url?q=https%3A%2F%2Fgithub.com%2FACINQ%2Feclair&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNGx3lXbXLadXyaQDy5Ix8Ml6IOh8A">Eclair</a>, and follows the Lightning Network standard.', 'summary': 'Lightning Network Wallet for Bitcoin Testnet', 'summaryHTML': 'Lightning Network Wallet for Bitcoin Testnet', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.45, 'ratings': 218, 'reviews': 86, 'histogram': [15, 4, 15, 15, 167], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '27M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'ACINQ', 'developerId': 'ACINQ', 'developerEmail': 'mobile@acinq.co', 'developerWebsite': 'https://acinq.co', 'developerAddress': '10 rue de Penthièvre\n75008 Paris\nFRANCE', 'privacyPolicy': 'https://github.com/ACINQ/eclair-wallet/wiki/Privacy', 'developerInternalID': '5783042970258036775', 'genre': 'Finance', 'genreId': 'FINANCE', 'icon': 'https://lh3.googleusercontent.com/fgSF8QiNSW43wpJCaxLgLb-h-kKKSt9va6fLQLhN9PqKpsU0oetXZfiiZbBbi6E3uI2X', 'headerImage': 'https://lh3.googleusercontent.com/s9VnToQrppJR_jm5bBY0PHoK-t7np7OQf6Ds9VRghdVxwCxCE0fVTuSRwIc9D-YNCIs', 'screenshots': ['https://lh3.googleusercontent.com/caNSYp1tNphkBokyAU_sYciGGq9j0c4tPxMrW80NZ43dJFY5mUQprfUG0SZ1ubCNKxg1', 'https://lh3.googleusercontent.com/_YzwcSzE9mnU3AtUpmpKz5yQQR9c3f8mYD5sGthw4qrOkaj2oOzJMZekXqQluyhBX56Q', 'https://lh3.googleusercontent.com/feuw6QE7xe3fcKYFhkiSAMJQ6jA5bDjt9dcRfLCgFBNoP4iU5AJbTy-Hk-3ndXJw-A', 'https://lh3.googleusercontent.com/UR3kiEN8Sh8sJ-PGAOfJWySSrBFxtZroRwjoTjMDkOcsYJ8INpEAhN4wiA5LMYYSBL0', 'https://lh3.googleusercontent.com/OX6TZdqWNLi36qn6X-EvZMwG92DCpN8NjI6rqwAKXnZfw2E7o6POmYsWsPavNwv-7g'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 20, 2017', 'updated': 1587376819, 'version': '0.4.11', 'recentChanges': '- Add Biometric authentication (fingerprint, ...)\r\n- Improvements and bug fixes.', 'recentChangesHTML': '- Add Biometric authentication (fingerprint, ...)<br>- Improvements and bug fixes.', 'comments': ['great wallet concept with state of the art bitcoin lightning network capabilities.', "forces phone to restart and doesn't work", 'How do I export the wallet address and private key in plain text?', 'Is autopilot coming?', "While I could pay at Starblocks, I couldn't send some funds to a HTLC.me \nwallet. It failed every time. Also, I couldn't connect to a node of my \nchoice. I found a couple of nodes near me using the Acinq network explorer, \nbut the connection doesn't happen :-(", 'The wallet for Bitcoin in future BUT it is only on testnet', 'Life changer!', "Update: the new version seems a lot more efficient and stable. A few regressions that I noticed: - Opening a yalls payment link gives me an error. The starblocks links work.  - When I tap a LN payment link on yalls or starblocks eclair is no longer a suggested option, only the lightning wallet is.   This has me really excited for LN but for the love of all things, be consistent with the units used, it's all over the place!   In some parts of the app the amount is shown in Satoshi, others in mBTC and others yet in Bitcoin, what is this madness?! I think I also saw milliSatoshi somewhere.", "*Doesn't show expiration time of a channel. *Channels and the funds get stuck often. *Opening 10 channels heats up and crashes the device * Not able to buy test coffee,teied many times, transactions stuck or fail. * Now the app doesn't even start anymore.", 'Unnecessary struggle because Blockstream Corp. hijacked the Bitcoin project. Thanks to Bitcoin Cash we don\'t have to "open channels" and whatnot, simply make on-chain payment like Bitcoin intended to be from the start. This is why Bitcoin Cash IS Bitcoin, and LN BCore coin is defenetly not. Good luck all, let the best invetion win!', "*bug report: 'seed is unreadable' on startup. Previously worked fine, opened some channels, ordered some blockaccinos. Also, payment link no longer opens wallet.", 'They claimed to lose the signing keys to allowing them to update the app. This is why you stick with the original Bitcoin (cash)', 'Super job!', 'Tutorial is better', 'Amazingly fast', 'This is pretty amazing! I would just make it *much* more clear you can swipe on the main page... I\'m not sure how, but it was very very not apparent how to open a channel at first. It should have some kind of "nudge" like MacOSX icons in the bottom jumping when they need something.  A Bitcoin symbol should jump from the left side saying "send me some $$$ to spend!" and the right side should have a lightning bolt annoy you to open new channels :)', 'Poor user experience. Took a lot of tries to get it to sync. Maybe underlying electrum server issue but should detect and switch or it becimes useless. Anyway, after finally got a balance then tried channel and to buy coffee. Tx never went thru. Channel closed. Balance vanished again and seem to now be on stuck server again. An experience like this will destroy any hope for LN.', "Love the gui.  I'm not sure if this is the best place for feedback, but I couldn't find another.  1. Can I request a payment from a peer? 2. Can I send an LN payment to a peer who is also running this app? 3. Bug... When sending BTC on chain, I clicked the fee setting button and it changed to Low.  There was no way to change it back to High.  I was able to manually enter a fee.  Looking good so far, and a great way to help people understand how LN will work for day to day buying.", "Looks good. Trying to buy a coffee on starblocks however I can't seem to open a chanel when selecting 'paste a node uri'. The auto connect node gives me an error no route.", "You guys have really done an amazing job but you should really think about opening it up to a mainnet alpha. You can cap the number of users and make sure there is a sign up process so that everyone knows funds can be lost given the experimental nature. I just really think there is nothing like real life bug bounties for software like this. Everyone that's excited about what your team is doing would be happy to potentially burn 100 bucks to make your LN app better.", 'A+. Would be neat to view all transactions associated with a particular channel. Tap a channel to get a drop-down of all previous transactions in that channel. How about an explorer to see if your friend is connected to you through the network.', 'Bought some coffee from starblocks, also paid for a few friends when they bought on their phones and showed me the QR code. Worked almost flawlessly. This could be the future of money.', 'Addicted to the blockachinos! Thanks guys!', 'I just "lost" 1.6 Bitcoin.  :(    I open a lighting channel. I sent to another phone my 1.6 Bitcoin and that was the last time I saw then. They never arrive to the intended phone but they are not in my phone.', 'Keep getting your LN channel not ready ..wait few blocks. Cannot pay. Also tried connecting to other channels', 'By sendin coins, put fiat equivalent. Or better let write directly fiat. For example 2.59 Eur', "Excited to be able to test lightning network. It's a historic event doing this for the first time ever", "Can't wait for mainnet!!! Seriously... great work.", 'Amazing app. Lightning payments are great! I hope there is a mainnet release soon!', "Nice app!! I can't create a channel with my test node with ipv6.", 'Quality app, easy setup,  infinite Blockaccinos!', 'Good job.  Waiting for main net version', 'Awesome! Keep it up guys. This is big!!!', 'I can see the future', 'Game changer!', 'Fabulous!', 'Very nice software that very clearly shows the cons and pros about the Lightning Network.  Everyone should try this before commenting on LN.', 'Nice demo app. I look forward to contributing once it is Open Source.  OLD: Latest version refused to load unless I deleted app data. I followed the demand and it also deleted all coins and open channels. Just testnet coins, but still this is not a good sign.  Old review: Great to see this MVP Lightning wallet! Still no Android source code available :-( Where do we post bugs / suggestions? Thanks!)', 'This is nothing short of revolutionary! I am absolutely amazed and the creativity of all involved! Incredible work and great to see the effect on widespread adoption', 'Is it possible to receive lightning channeled coin? Can only figure out how to pay currently, and that works awesome.'], 'appId': 'fr.acinq.eclair.wallet', 'url': 'https://play.google.com/store/apps/details?id=fr.acinq.eclair.wallet&hl=en&gl=us'}
