{'title': 'Plumble - Mumble VOIP', 'description': 'Experience Mumble servers on your Android device to the fullest with Plumble- Android\'s premier Mumble client. With voice activity and push-to-talk input, communicate with your friends on any Mumble 1.2+ server.\r\n\r\nThis is the donate version. Proceeds help to finance the development of this free and open source app.\r\n\r\nEXCLUSIVE DONATOR FEATURES:\r\n- Access to beta releases on Google+ (https://plus.google.com/communities/111632822797311522891)\r\n- Email support\r\n- Feeling good\r\n\r\nFeatures:\r\n- UI optimized for Android 5.0 Lollipop\r\n- Voice activation (with customizable threshold) and push-to-talk\r\n- Dual-pane channel and chat with gestures\r\n- Tablet layout (optimized for both 7 and 10 inch tablets)\r\n- Channel tree view\r\n- Draggable overlay\r\n- Auto-reconnect\r\n- Bluetooth headset support\r\n- Customizable theming\r\n- Improved Jellybean notifications\r\n- View rich text comments\r\n- Local mute users\r\n- Recording amplifier\r\n- Certificate generation, import from desktop, and self-registration support\r\n- Proximity sensor utilizing "Voice Call" mode\r\n- Access tokens\r\n- Push to talk \'hot corners\' toggleable in settings\r\n- Hardware push-to-talk key support\r\n- Chat notifications\r\n- Channel search\r\n- Private messaging\r\n- Text to Speech\r\n- Server sharing\r\n- Public server browsing (with auto-finder)\r\n- Opus support for 1.2.4 servers\r\n- Admin controls\r\n- Image embedding\r\n\r\nThis app is licensed under the GNU GPL version 3.\r\nThe source code can be found here:\r\nhttps://github.com/Morlunk/Plumble', 'descriptionHTML': 'Experience Mumble servers on your Android device to the fullest with Plumble- Android&#39;s premier Mumble client. With voice activity and push-to-talk input, communicate with your friends on any Mumble 1.2+ server.<br><br>This is the donate version. Proceeds help to finance the development of this free and open source app.<br><br>EXCLUSIVE DONATOR FEATURES:<br>- Access to beta releases on Google+ (https://plus.google.com/communities/111632822797311522891)<br>- Email support<br>- Feeling good<br><br>Features:<br>- UI optimized for Android 5.0 Lollipop<br>- Voice activation (with customizable threshold) and push-to-talk<br>- Dual-pane channel and chat with gestures<br>- Tablet layout (optimized for both 7 and 10 inch tablets)<br>- Channel tree view<br>- Draggable overlay<br>- Auto-reconnect<br>- Bluetooth headset support<br>- Customizable theming<br>- Improved Jellybean notifications<br>- View rich text comments<br>- Local mute users<br>- Recording amplifier<br>- Certificate generation, import from desktop, and self-registration support<br>- Proximity sensor utilizing &quot;Voice Call&quot; mode<br>- Access tokens<br>- Push to talk &#39;hot corners&#39; toggleable in settings<br>- Hardware push-to-talk key support<br>- Chat notifications<br>- Channel search<br>- Private messaging<br>- Text to Speech<br>- Server sharing<br>- Public server browsing (with auto-finder)<br>- Opus support for 1.2.4 servers<br>- Admin controls<br>- Image embedding<br><br>This app is licensed under the GNU GPL version 3.<br>The source code can be found here:<br>https://github.com/Morlunk/Plumble', 'summary': 'A powerful, slick, and easy to use Mumble client.', 'summaryHTML': 'A powerful, slick, and easy to use Mumble client.', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.14, 'ratings': 993, 'reviews': 462, 'histogram': [109, 39, 99, 99, 645], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '5.3M', 'androidVersion': '2.3', 'androidVersionText': '2.3 and up', 'developer': 'Andrew Comminos', 'developerId': 'Andrew+Comminos', 'developerEmail': 'support@morlunk.com', 'developerWebsite': 'https://www.morlunk.com/', 'developerAddress': None, 'privacyPolicy': 'https://comminos.com/etc/plumble-privacy.html', 'developerInternalID': '7966363886358448849', 'genre': 'Communication', 'genreId': 'COMMUNICATION', 'icon': 'https://lh3.googleusercontent.com/FQN-LuPBQ8SHkNwA-z7CglU27_50F9tHL210I8Lk5KyCl_YQJZWV_TrGmylfSg2XjzM', 'headerImage': 'https://lh3.googleusercontent.com/E_4Hw4V2YIJhkshOWS1rC_enRtJPN2eZGhNOhSPnceKOjwqRcDsRsC1WYWjqTmk4F7Xm', 'screenshots': ['https://lh3.googleusercontent.com/V_6vcAW8I5tTGB4vKU11AhIzWa28pSztBCT8FmISteot0iCG45mc43yPNqEkc1YdvA', 'https://lh3.googleusercontent.com/WLEnKCqvyN3FF6ecnCNQ4OwNevoWVlSW0Ce1bADM9CPkX2flQ33eU4G7CZnUEKBgA0T1', 'https://lh3.googleusercontent.com/iTEGVHL0cWHoPoZKCvsji2dsgoSqTtNs365IF_xoPL3wbK-yWDsHzBreqmYMb0K7G48', 'https://lh3.googleusercontent.com/lz3Vz7mongh0sOsWOe3WB2NgoOKGBuvjuPPzcSKSAUQ0_VFq2GjJjHIVq5S_Nf2nskw', 'https://lh3.googleusercontent.com/grkL4ZoRIqL3VYlSzxkoOb_fuCI82pmUUPXgrJxdYN6X2uBPmBbqI5ql_E_cvMppvPU', 'https://lh3.googleusercontent.com/Ck4VIbmRYMOTruLF6ktZPmg_hz33il2on-GigFiZ4re8x6Yy9q3GNDh3McrO2CNk0gY', 'https://lh3.googleusercontent.com/lbYKiZF_AoaGUE33SSSufAAzDl3eGkHB73ICMvfAPx1Mp9iITQKiyG9bIJ6crUfmVfWO', 'https://lh3.googleusercontent.com/BQCsy52stk1Yky_RFWuGuXIsCNDgAE_k_-vutITc2SYKBiadhnH8-0IgZjC5VhKO8Uc'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 23, 2012', 'updated': 1414478490, 'version': '3.2.0', 'recentChanges': '3.2.0:\r\n- Visual revamp for Android Lollipop\r\n- Avatar view support\r\n- Improved channel list view stability\r\n- Public server retrieval fixes\r\n- Use concurrent decoding on multithreaded devices\r\n- Native audio optimizations\r\n- Solarized theming fixes', 'recentChangesHTML': '3.2.0:<br>- Visual revamp for Android Lollipop<br>- Avatar view support<br>- Improved channel list view stability<br>- Public server retrieval fixes<br>- Use concurrent decoding on multithreaded devices<br>- Native audio optimizations<br>- Solarized theming fixes', 'comments': ['Works with mumble 1.3.0 on android 10 (aosp). Shows warning, but works.', 'The app kept on saying that I need to check internet settings. I refresh everything yet still it mentions that I need to check internet settings, error. Nakakainis!', 'Not working on Android 10. "This app is for an older version of Android", crashes when I got okay and no update is available. Please update! I pay for a server and would like to be able to use it!!', "Last updated 2014, guess it isn't maintained any longer and F-Droid with 2016 doesn't make it better", "This app works perfectly! The only reason why I didn't give it 5 star rating is because no button switch for whisper/shout! :(", "best voice communications without a doubt. also great to host your own server so the disgusting staff of other things (discord) can't police you and steal your data", 'It works well but it does not collect the public servers', 'Love the app, any chance we can get the hardware ptt even when app is minimised, in the same way the Zello et al do, as this would make use of the app sooooo much easier', "Doesn't connect. Won't load the public servers and can't connect when manually entered.", 'Recent Samsung update causes app to disconnect if screen turns off.', "The app works as intended, however there isn't a way to move between channels within the server", 'Just works as supposed to . Great work btw', 'Kick me out of any server after 30 seconds for no reason', 'Look for version 3.3.0-rc1 on F-Droid for working admin tools.', 'Very good experience', 'It worked well until murmur 1.3', 'Great for my job at church.', 'A little buggy since the most recent android update - mic on Bluetooth headsets no longer activates. Incoming phone calls should auto mute mumble. Phone notification sounds should not play through mumble. I hope those can be fixed.... This app is worth the paid version. Despite those issues, the app is very good and I would still recommend using it.', "I had to pick this app up due to moving but still needing to be at a meeting on mumble. I imported my desktop security certificate and logged in flawlessly. The audio quality was awesome and my phone worked great with my headset. No one had any idea I wasn't on my pc. I strongly recommend this app for anyone who needs a good mumble experience but can't use a computer.", "It's a good app the only problem i have is that the chat jumps to the bottom whenever someone sends something. So I will be reading through messages trying to catch up on a conversation and every time someone types something i lose my place. Other than that, it's great.", 'Two complaints: 1 Though I have authorization for my user I am unable to move/kick others. It worked in the past but something changed in this client. 2 The proximity detection feature is a complete waste of my time. If the app is running, even in the background, and I move a finger towards the proximity sensor then the screen turns off. I would like to disable this. I often use my browser or messaging app in handset mode.', "Whenever my screen locks on my phone I stop being able to hear what's happening in the server, yet everyone in my server can hear me. Is there any way to change this? I'm on the galaxy s4", "I love everything you've done with this app.  When I lock my phone or change to another app and come back to it the screen defaults to the server select screen instead of the server I'm connected to. So I have to change it over to be able to talk in the app again. A fix for this would be appreciated.", 'I used the free version for less than 4 hours and fell in love. This was every bit worth the small donation price.  I used another app and had issues with audio for myself/others skipping/sounding like robots on a 45mb down by 15mb up internet connection. I thought maybe the Wi-Fi was going out on my phone but turns out it was the other app.', "I'm all set up with my guilds server but when I try to connect I get a message saying the my certificate is wrong for the listed username or password. Both of which are correct.", 'Good interface. Just wish that it would be a little more Lollipop or Marshmallow like. Long presses on items would be cool. There is an issue when if you loose connection, like transitioning from WiFi to cell, the app will force close.', 'Murmer server running on FREENAS 9.10. Tested on the LAN, 2 users connected using paid Plumble. Pressed talk and get really nasty feedback, loud and nasty. Chat works. Both using lollipop. Any reason?', 'I can one-up Justin. I used the free version for 4 minutes and decided to buy. Thanks to the devs for their hard work!', "I like this for Mumble on Android. I can't figure out how to make the left \ncolumn chat text wider, and the right column with the users names more \nnarrow. Also, I would like to be able to copy portions of the chat text \nfrom the left column, and paste it from the clipboard. Thanks!", 'Plumble is the best option for Mumble on Android, the rest are not even remotely close. However, I gave it 4/5 because the Push To Talk experience is lacking. I wish there was a way to make the button much bigger (custom size preferably) so it could be done without looking.', "I love the app as a whole, the interface is sensible and intuitive. The only feature I'd like to see is an option to prevent the screen locking, having to unlock when using on screen push to talk mode can be the difference between a wipe and a successful run.", "Had the free app for a very short amount of time. It's clean, fast, and comprehensive. The best app for Mumble on Android. Why isn't this one suggested first?", 'Would like to hear an announcement when a new person enters room, would like an option to keep screen awake while using mumble. Everything else about the app is amazing.', 'A great app, and works very well for Radio over IP (ROIP) interfacing.   Feature request: Please add "Half Duplex PTT" option to the main server menu for easy selection!   Thanks for a great app!', "Works very well both on WiFi and mobile (internet speeds may limit you to text chat only). Can't wait for more admin features to become available!", "I really love the interface but I've experienced a MASSIVE amount of breaking in and out audio issues as well as laggy audio. I checked my ping on the server from the main screen and its averaging 30-70ms, but my friends are saying things 10-15 seconds before I hear it. Not sure if I'm doing something wrong or not.", 'Works flawlessly, just like the Windows client. Had no issues connecting to murmur 1.3.0 server running Win Server 2016 x64 DC.', 'It has some flaws like disconnecting randomly and not joining the channel it disconnected on. But it is the best out there. I love my Mumble!', "This application, BY DEFAULT, changed my volume from MUTE to an exceptionally loud volume and broadcasted some very misunderstandable conversation. THIS IS NOT ACCEPTABLE BEHAVIOR FOR A VOIP CLIENT TO DO BY DEFAULT. Mumble is about privacy and security, and not only that, I felt that changing my volume was a violation of my wishes as the user. I had not changed any settings in your application, this happened automatically. Please change this behavior, I don't know if it's a bug, or what... but I am no longer a happy user of your application. How can I trust that this won't happen again?", "I use this for work and it functions perfectly. It's simple and its design but give me all the features of the base program on my desktop. It is great to allow me to continue working on projects without continually opening the mumble program on my computer taking up screen space or bandwidth."], 'appId': 'com.morlunk.mumbleclient', 'url': 'https://play.google.com/store/apps/details?id=com.morlunk.mumbleclient&hl=en&gl=us'}
