{'title': 'kboard', 'description': 'kboard is a powerful productivity tool that can be used alongside your regular keyboard. \r\n\r\nEach key is customizable, and can be a word, sentence, a set of commands to execute (like a macro). It can now even get some data from the internet and send it as a message - all in one tap of a key! \r\n\r\nExamples of uses are:\r\n\r\n* storing repetitive messages (e.g. happy birthday)\r\n\r\n* Custom text emoji/faces (e.g. ¯\\_(ツ)_/¯, ( ͡° ͜ʖ ͡°))\r\n\r\n* retrieve and send an answer from Wolfram Alpha\r\n\r\n* a key to convert a song title to a Youtube video\r\n\r\n* a key that outputs a random title from a subreddit like /r/AskReddit\r\n\r\n* convert search terms into site-specific searches.\r\n\r\nMore examples of use (and a list of available commands) on the wiki - https://github.com/adgad/kboard/wiki', 'descriptionHTML': 'kboard is a powerful productivity tool that can be used alongside your regular keyboard. <br><br>Each key is customizable, and can be a word, sentence, a set of commands to execute (like a macro). It can now even get some data from the internet and send it as a message - all in one tap of a key! <br><br>Examples of uses are:<br><br>* storing repetitive messages (e.g. happy birthday)<br><br>* Custom text emoji/faces (e.g. ¯\\_(ツ)_/¯, ( ͡° ͜ʖ ͡°))<br><br>* retrieve and send an answer from Wolfram Alpha<br><br>* a key to convert a song title to a Youtube video<br><br>* a key that outputs a random title from a subreddit like /r/AskReddit<br><br>* convert search terms into site-specific searches.<br><br>More examples of use (and a list of available commands) on the wiki - https://github.com/adgad/kboard/wiki', 'summary': 'Keyboard with customizable one-click responses and powerful automation commands.', 'summaryHTML': 'Keyboard with customizable one-click responses and powerful automation commands.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.8396227, 'ratings': 1067, 'reviews': 586, 'histogram': [211, 60, 60, 90, 644], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.4M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': '#13point7', 'developerId': '%2313point7', 'developerEmail': '13.7apps@gmail.com', 'developerWebsite': 'https://github.com/adgad/kboard/wiki/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5627369084201247003', 'genre': 'Personalization', 'genreId': 'PERSONALIZATION', 'icon': 'https://lh3.googleusercontent.com/V8qIL86NErXKAoNOyjvXoJ9cqa2OkQk6M7QAvtRWtfYYl5LnLGxcT3JvVBtKXN37uUk', 'headerImage': 'https://lh3.googleusercontent.com/cBkq-8jWHWZt8B_HQlLlMSkRZgAGIy-cC6IJ5IcnUmHTbQ07unP4xgsQKFT6F9zyuw', 'screenshots': ['https://lh3.googleusercontent.com/H8g7aNXjKkAp4rff2Ml-nFE3UH-n458Virc1xoAw3rcsaZHwIdeL8dMCL8uFp9fsQyg', 'https://lh3.googleusercontent.com/-bCjMpo1m5pxtXEUVjoTxh1E4mIOptFoPCmH-Qsp99wqZZw67vYL6JBJ8fQYL8XhMuk', 'https://lh3.googleusercontent.com/PnHCMxG7EtI5StupvvQok1w8LcLFW_FSknIhGKYf3D_Udb7nTGm3QyNgxeVf56mYyQ', 'https://lh3.googleusercontent.com/5qDclaNnfaMZGHgDV2RZg2RhwNcz6yy5KJpQr6bx3nhVDQJMVzsZq8OfPRN2FpoKYuzR', 'https://lh3.googleusercontent.com/DrlZiDVh0mvR7pyXB-SWALgG7fsz3pybb-a-3h5vOo4s2XwtQIWyG0R-Q7GQ_ikmv6Y', 'https://lh3.googleusercontent.com/ifPJw9wshxqWrC1Rvb2Zcvna1-9p-ikDi1jJqtgvdAMZVvwX9ycsOd2N4CLzieVnHA', 'https://lh3.googleusercontent.com/azeVvL_We-L96dPCTpfXUPBD1C25ZR8dkN0mDPG8-ILgo1BWKNLwYTGCEjjL-lRQpsc'], 'video': 'https://www.youtube.com/embed/h3i5U2tk364?ps=play&vq=large&rel=0&autohide=1&showinfo=0&start=9', 'videoImage': 'https://i.ytimg.com/vi/h3i5U2tk364/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 11, 2015', 'updated': 1566440085, 'version': '4.2.0', 'recentChanges': 'Added new img command to share images from URLS! e.g. img(https://imgflip.com/s/meme/Gollum.jpg). Only in supported apps (like WhatsApp)', 'recentChangesHTML': 'Added new img command to share images from URLS! e.g. img(https://imgflip.com/s/meme/Gollum.jpg). Only in supported apps (like WhatsApp)', 'comments': ['Have almost anything I want. I only have some suggestions: - increase and decease columns - easy way to move the keys, maybe allowing to create a key between two others - a command like random but listing in sequence everytime you click that key - backup/restore of my personal keyboard in xml', 'Awesome so far! (but only just installed it) only complaint is that when editing from "custom keys" list, the entries can be swiped (left) to be removed... I had already deleted 2 by the time I realized what was happening. I think there needs to be an "undo" button that pops up, or remove the swipe and possibly add checkboxes to use instead... I have been looking for this app for seriously YEARS, glad to find it\'s finally a reality!', "WOW! Amazing project, literally. Hope it will add support to swipe through pages instead of click to change page. It is really a great idea sir. Also add a guiding line somewhere that If you are using gboard/indic keyboard, touch the 'browser icon' to switch to kboard.Had difficulty to find it out. At last, THANK YOU, VERY MUCH!", "Genius! Absolute genius! Exactly what I need! The fact that it's so modular is very nice. Though we need a more complete wiki of API we cand use. Something like Google Translate API or Wiki API or something like that.", 'Great but no ability to back up settings. Users will also want to edit their custom keys through a 3rd party text editor or at least provide a raw text field where we can dump all our macros into at once as Clicking to add macros one by one is tedious.', 'Everything fine but a "tab" button instead of enter/next should be made available in first page itself. Not able to use it because of absence of "tab" button', 'Was exactly what I needed. Would be an excellent keyboard for MUDs.', "I'm impressed with this app. Developer is also very helpful on my inquiries, so it deserves 5 stars in my opinion.", 'Pretty handy sidekick for your main keyboard. Although it would be nice if the dev gave us a color picker instead of pre defined colors', "For god's sake, never install this app because, Attention: This keyboard can record everything you type, including passwords, credit card numbers, and other personal data.", 'not installing on Lollipop. Xiaomi Redmi Note 2. tried to do a pull request on GitHub. Not building. Will try again.', "can you please fix the send button. it won't send on the RAVE app!!. i will update the star when you respond, because right now it's annoying having to switch keyboards just to send. thank you", 'How do you quickly swap between swiftkey and kboard? I never saw the "choose input method" list in the demo video', 'Awesome product but can you made it for jelly bean version also.', 'would be nice if we can choose custom background colour', 'Works fine. Needs more but welp I like this. I filled it with dongers/lenny faces. ( ͡° ͜ʖ ͡°)', 'Please remove full network permission.', 'THIS APP IS SOOOO USEFULL, U CAN SAVE ANY WORD U WANT AND EASILY USE UR SAVED WORDS.', 'Looking something like this and accidentally found this..', 'Nice if you hate typing/using a keyboard.', 'IT NEVER GAVE ME THE KEYBOARD', 'Version 4.2.0 nice (◕‿◕)', 'Liga a opção de mandar ao tocar, e baixa um autoclicker', 'bahut hi baadhiya aap hai i satisfied afrer use the aap', '❤', 'Good', 'nice', 'Great app. Work perfectly. There are ads but only in the app, not on the \nkeyboard. My main complaint is you can\'t just drag the keyboard buttons up \nand down to change their order, if you want to change the order you have to \ndo it one at a time which is time consuming. Oh, also I wish there was a \nway to save all the clips to a backup file, or some kind of cloud backup to \nuse the same clips on multiple devices. The iOS app "Clips" has cloud \nbackup and easily moveable buttons. This is the best alternative on Android \ntho. There are a few things that could make it better, but still 5 stars \nbecause it\'s free and works well.', "haha lol! thanks sorry no thanks ಠ_ಠ  doesn't support my device. The keyboard looks annoyingly funny.", 'Awesome keybord for simple setting.. but i need to know command for ENTER, SPACE, DEL, TOOL  Thank you', 'Wow super', 'Work great.', 'Outstanding!   Would you please add custom key width or base it on the length of the text string (I want to pack more buttons on the screen at once)?   And is there a way to edit the keys via a text file somewhere or does it have to be through the app?', 'k lol! 👍 ¯\\_(ツ)_/¯  sure, whatever maybe cool', 'For this to be perfect, it needs a *select all* command', 'A lot more useful than I expected to be, and very customisable.', 'Words are not fitting in the keys and cross the boarder', 'Please add size options', 'Hey there, the keyboard works as it should be but I cannot seem to find how to switch between my normal and this.   Going everytime to settings &gt; language & input &gt; Current keyboard and selecting is not the right way I hope.   Any suggestions? Ok so I just had to swipe down and go to the notifications area. Simple!', 'LOV3 IT'], 'appId': 'com.adgad.kboard', 'url': 'https://play.google.com/store/apps/details?id=com.adgad.kboard&hl=en&gl=us'}
