{'title': 'AdGuard: Content Blocker for Samsung and Yandex', 'description': "AdGuard Content Blocker\r\n\r\n<b>Adblocker Only for Yandex.Browser and Samsung Internet</b> with customizable filters.\r\n\r\nAdGuard Content Blocker is a free Android app that blocks ads in the Yandex browser and Samsung Internet mobile browser without root permissions. This AdGuard’s ad-blocking app works specifically in these two web browsers.\r\n\r\n<b>Save battery and data</b>\r\nIntrusive ads distract your attention and steal your time, and heavy-media ads, especially video ads, also drain your battery and data on your device. With AdGuard Content Blocker, you'll finally be able to leave the house without a charger and treat yourself to an extra coffee thanks to the data you saved. \r\n\r\n<b>20+ adblock lists</b>\r\nChoose from the most complete of all the existing filter lists, designed both by our highly skilled specialists and by prominent community members. Enable general lists that cover most common ads, and combine them with language-specific lists to ensure the best protection in your country: France, Spain, Germany, Korea, and other countries and language regions.\r\n\r\n<b>Whitelist</b>\r\nSupport your favorite websites and content creators by adding their websites to the list of exceptions. You can whitelist entire domains or specific pages. There’s no need to turn AdGuard off every time you're about to visit a known, trustworthy website that doesn't have any intrusive ads. \r\n\r\n<b>Custom filters</b>\r\nOur app gives you control over the filtering process. Add your own custom rules to block ads or hide any elements on the page, and allow them back at any point in the future.\r\n\r\n<b>Secure your privacy</b>\r\nAdGuard Team considers users' privacy as a main priority. We have years of experience in developing award-winning ad-blocking and privacy protection tools. Also, we’ve made a name for ourselves as a vigilant guardian of online safety by publishing multiple research papers in which we expose hazardous apps and unveil shady schemes used to steal your personal data. \r\n\r\n<b>Open Source</b>\r\nAdGuard Content Blocker is an open-source ad blocker with the full project code available on GitHub: https://github.com/adguardteam/contentblocker. We want to be as transparent as possible to our users.", 'descriptionHTML': 'AdGuard Content Blocker<br><br><b>Adblocker Only for Yandex.Browser and Samsung Internet</b> with customizable filters.<br><br>AdGuard Content Blocker is a free Android app that blocks ads in the Yandex browser and Samsung Internet mobile browser without root permissions. This AdGuard’s ad-blocking app works specifically in these two web browsers.<br><br><b>Save battery and data</b><br>Intrusive ads distract your attention and steal your time, and heavy-media ads, especially video ads, also drain your battery and data on your device. With AdGuard Content Blocker, you&#39;ll finally be able to leave the house without a charger and treat yourself to an extra coffee thanks to the data you saved. <br><br><b>20+ adblock lists</b><br>Choose from the most complete of all the existing filter lists, designed both by our highly skilled specialists and by prominent community members. Enable general lists that cover most common ads, and combine them with language-specific lists to ensure the best protection in your country: France, Spain, Germany, Korea, and other countries and language regions.<br><br><b>Whitelist</b><br>Support your favorite websites and content creators by adding their websites to the list of exceptions. You can whitelist entire domains or specific pages. There’s no need to turn AdGuard off every time you&#39;re about to visit a known, trustworthy website that doesn&#39;t have any intrusive ads. <br><br><b>Custom filters</b><br>Our app gives you control over the filtering process. Add your own custom rules to block ads or hide any elements on the page, and allow them back at any point in the future.<br><br><b>Secure your privacy</b><br>AdGuard Team considers users&#39; privacy as a main priority. We have years of experience in developing award-winning ad-blocking and privacy protection tools. Also, we’ve made a name for ourselves as a vigilant guardian of online safety by publishing multiple research papers in which we expose hazardous apps and unveil shady schemes used to steal your personal data. <br><br><b>Open Source</b><br>AdGuard Content Blocker is an open-source ad blocker with the full project code available on GitHub: https://github.com/adguardteam/contentblocker. We want to be as transparent as possible to our users.', 'summary': 'Ad Blocker App: Block All Online Ads in Samsung Internet and Yandex Browser', 'summaryHTML': 'Ad Blocker App: Block All Online Ads in Samsung Internet and Yandex Browser', 'installs': '5,000,000+', 'minInstalls': 5000000, 'score': 4.4068274, 'ratings': 43053, 'reviews': 15599, 'histogram': [3623, 775, 1459, 5798, 31396], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '5.3M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'ADGUARD SOFTWARE LIMITED', 'developerId': 'ADGUARD+SOFTWARE+LIMITED', 'developerEmail': 'support@adguard.com', 'developerWebsite': 'https://adguard.com/', 'developerAddress': '3rd floor Iris House, John Kennedy St.,\n3106, Limassol,\nCyprus', 'privacyPolicy': 'https://adguard.com/privacy.html', 'developerInternalID': '5478515753427263072', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/pCqOLS2w-QaTI63tjFLvncHnbXc4100EQI3FAD0RZEFWjGMa_54M4x2HD7j48qMSv3kk', 'headerImage': 'https://lh3.googleusercontent.com/yGw4yz17mrNTpx0sOzhtQx3ooLu9hwT6OsltmpHRbMUU7xA49qJ8XT6wTgPgeCmS-g', 'screenshots': ['https://lh3.googleusercontent.com/WQLLoer_h_AG8jmFjnaoUpBVVIxe50dYu_nU9bqGFWmwRVHEEEO0aDFHYPCprmXvkD0', 'https://lh3.googleusercontent.com/E3i5qk3TDWvnHvD8CRsLriaNMGfKjxoKddSySuteLpoV-aPAi1Gh_AyreCOwjrGstw', 'https://lh3.googleusercontent.com/JoCjPkzblVbieyodNg5qG1Op-SZypG-qFkwcP1V4bjzw46S0ZrKSYrvjfMpPsDjav6Nz', 'https://lh3.googleusercontent.com/HnBoh8zc8I5Z3VjBW-Kr-SxBQEU8FB_Fs3BBQ5quWRoHcZWhZQQJkSlUbPBs6cJz7hyV'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 23, 2016', 'updated': 1588845245, 'version': '2.6.2', 'recentChanges': 'Improved Ad-Blocking Quality and Speed', 'recentChangesHTML': 'Improved Ad-Blocking Quality and Speed', 'comments': ["Adguard+Samsung Internet = fastest browsing speed & battery saving. For those that complained it's not working. Google doesn't support adblocker on Chrome, not this app's fault. Read instructions on how to configure it properly. Dig into the app Settings of any apps and learn what they have available is the first thing you should do for any new apps. Lastly, research and learn how to configure the app properly before you say something that make you look stupid...😁 This app works beautifully!", "Just installed current version to use with Samsung internet browser. Just not the same as using Chrome. For some reason can't get adguard icon to show in quick settings anymore. This was the easiest way of enabling and disabling the app temporarily. Now I have to launch the app. Why do all these software companies keep breaking things that used to work perfectly.", "It works perfectly on youtube when i open it through internet browser. Blocks 100% of ads. When you install it read the instructions on the screen, it's so simple. When I put adguard on my phone it told me what browsers I had to support it, only open youtube with that browser and it works fine, not the yt app, ads still come up on the preinstalled yt app but they're blocked in the yt opened with the browser. 10/10👍🤤", "Doesn't block if anything I get more ads.. on my homescreen I get one or two ads if I'm not using another app or open, YouTube videos pause and ads pop up, ads on my music player.... ads, ads, ads, ADS! If you want more or the same amount of ads with no decrease or system change to prevent ads.. this is for you.... uninstall and does nothing.. DO NOT INSTALL!! :)", 'Probably the best free ad blocker, allows you to specify which of multiple lists to use for blocking ads in different regions or blocking annoyances like ad blocker blockers and social media buttons. I wish it was easier to whitelist sites though.', "It does what it should for the most part blocks 99% of the ads when I uncheck show acceptable ads. Would like to see couple of more options one block videos from automatically playing a lot of websites are doing this now and it's really annoying. But also some add still get through like ones that creep up from the bottom or from the top. It's the only one that works though with Samsung or Yandex the others don't even work.", "As a user of the full app I looked into the add on in order to easily add user rules of html elements of my choice like I can on pc. Sadly it isn't possible and I must enter the app and enter the element url manually. A long press context menu option to block element would be awesome", 'LOVE IT! One small suggestion, though: I wish there was a way to stop or cut down on animations. Not just gifs, but all the little things websites have that bounce around and flicker and slide.', 'I though it was a general Ad blocker ( in every app blocker ), but is just a browser ad blocker, and not even a usefull one i mean, the browsers that this supports already have the adblock function... for chrome you have to install another app', 'Perfect 👌 specially for galaxy, had it on my s9 now on my s20... to the point. Blocks ALL add, with no unnecessary installs... other apps have install a whole bunch of other programs and stuff, highly recommend it!', "Of all the content blockers I've tried for Samsung Internet browser, this one is the best IMO. Lots of options to customize. This app does what it says much better than any other similar I've tried.", 'One of the best adblockers out there. Get AdGuard and you WILL be happy! No Youtube ads, no Google ads, anti-tracking custom lists. Thank you for your service. EDIT: I changed to 4 stars (originally 5) - will revert back when they support more browsers.', 'I have enjoyed not having adds pop up since downloading this app. It has done everything it said it would do. I am very happy with it. Thank you.', 'As a long time user of ad guard on my PCs, I love that I can now block all the ads on my phone. I love AdGuard!!!', 'Only used it a few times, but so far seems to be filtering just like it does on my PC. I really enjoy not having to scroll through enormous ads while reading an article on line. Thank you!', "The best ad blocker app ever! I'm am very pleased with this, having no problems at all. Thank you", "Works mostly. No ads on videos but still have visual ads appearing on pages. But I like no ads when playing videos so not interrupted when watching videos. The pop ups ads don't appear anymore by fixing the settings .", "In my experience, this is true ad blocker. I use it on my laptop too and it doesn't allow any kind of advertisement.", "this app works great with samsung browser. However, it doesn't allow adding third-party filters (not user filters). The pre-installed lists are not enough for me if possible, please add this feature. Thank you", 'Wow this app is really good and flawless. I never thought there was an app that effectively blocked ads and popups so easily. My thanks to you.', "I had the issue of GOOGLE ads on my phone. Went into settings to TURN OFF personalized ads but they were still popping up. After I downloaded this they've stopped completely. thank you!", 'Excellent app. It does exactly what it says on the tin. No fuss, no unnecessary nonsense, just blocks unwanted content effectively. Thanks a million for creating this terrific app.', "It's interesting how it's an external download, but I'm glad Samsung has integrated it into their browser. It truly does work and I'm happy to report a good review.", "What are ad blockers supposed to do exactly? I still get ads on my phone when I'm not even on the damn internet. They just randomly pop up when my phone is sitting there plugged in.", 'I love this app. Not having to duck and dodge all of the pop ups and unsolicited ads.', 'Best adblock i have used. This is more than just an adblock. It blocks trackers and other annoying stuffs in the web.', 'Excellent!!! Finally found an ad block app that does what it says...yaaaaay!! I hope this continues to work as well as it does right now. Thank you! 😁👍👍', '2020 April update: Have been failing these last few days. Ads are popping up like crazy. Some even managed to change my background data setting and turn of adguard!', 'constantly crashing on the latest version- 2.6.2 when using Samsung browser. Went back to v2.6.1 and crashing stopped.', 'Amazing app!!!! It just blocked all the stupid ads i used to see...thank you Update: it just slowed my phone and not handy..when my phone keeps crashing', 'Excellent Ad Blocker! Simple to setup. Runs in the background.', "Loving the filter options, very easy to understand what each options purpose is Solid 4/5 so far Will update my view after I've experienced more time with the app", "Hello adguard, I us your app with Samsung internet explorer but it doesn't block any ads. There is something wrong for approximately month. Could you help me in that? Thanks", "Stops advertising dead in its tracks, excellent app. Had it on my tablet for about a year, and wouldn't be without it.", "There are only two compatible browsers. -Yandex Browser, from a shady Russian company that regularly hands over personal information to the Russian government. -Samsung Internet Browser, which, let's face it, is no Chrome.", 'Blocks most ads and pop-ups and interfaces easy to understand would recommend.', 'I got the full app because a 3 month extended trial was offered, but I was only given a week. No product key was sent to my account. Edit: They sent me the key now. All is well, and ads are blocked effectively.', 'Nice app that allows me to view both webpages and Youtube without the garbage I was getting using Youtube app. Not bad!!', 'This app is Must Have! I was trying different browsers , and Bing or Chrome infected all my browsers with ads. Im using Yandex , with this blocker , and i have pure experince.', 'Great Adblocker app, I have tried even Paid apps, but nothing matches with this one. Top rated one for a reason.'], 'appId': 'com.adguard.android.contentblocker', 'url': 'https://play.google.com/store/apps/details?id=com.adguard.android.contentblocker&hl=en&gl=us'}
