{'title': 'Universal Password Manager', 'description': "NOTE: UPM is no longer being actively developed or supported. It's being left here so existing users can continue using it but new users are encouraged to use a different password manager.\r\n\r\nUniversal Password Manager allows you to store all your usernames, passwords, URLs and notes in an AES encrypted database protected by one master password. \r\n\r\nInternet access is only needed if you use the Remote Database feature. See website for details.", 'descriptionHTML': 'NOTE: UPM is no longer being actively developed or supported. It&#39;s being left here so existing users can continue using it but new users are encouraged to use a different password manager.<br><br>Universal Password Manager allows you to store all your usernames, passwords, URLs and notes in an AES encrypted database protected by one master password. <br><br>Internet access is only needed if you use the Remote Database feature. See website for details.', 'summary': 'UPM is a cross platform password manager for storing sensitive information', 'summaryHTML': 'UPM is a cross platform password manager for storing sensitive information', 'installs': '500,000+', 'minInstalls': 500000, 'score': 4.4259257, 'ratings': 4296, 'reviews': 1613, 'histogram': [318, 79, 222, 509, 3166], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.5M', 'androidVersion': '2.2', 'androidVersionText': '2.2 and up', 'developer': 'Adrian Smith', 'developerId': 'Adrian+Smith', 'developerEmail': 'adrian+upm@17od.com', 'developerWebsite': 'http://upm.sourceforge.net', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '7505654068607735244', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/G_nGQKlDzJuqX3B4xdy_BCL_a1hAlpuNRObCpxscgtXjE7MVX3IsrokwVXn11u7VEnLC', 'headerImage': 'https://lh3.googleusercontent.com/GSgjpD8zdwsZjT_y2FtaDBVZmx_oxVfyMj01Use5kgYTnY2PruZsBw54uu1oviMFYT5I', 'screenshots': ['https://lh3.googleusercontent.com/O13cV15okqI_Nxes-1gjp5h2cX7-sCy2viriVIBTQxDhsi_se5YYHc9Du1PG2ishHg', 'https://lh3.googleusercontent.com/Di23AHmWjcFro7t_wY1OIppZJpFMDDrqjE5o88kcESO79eNai6QprK4bRHcXgYujsA', 'https://lh3.googleusercontent.com/lAYpe0zaiJ6sB-dZFCqiWhrfoOdyNSFUbsniy30nOoWbh212dShD6tW9w259FAPckjw', 'https://lh3.googleusercontent.com/yDVkXZNG1YmDq2ULTLfOZ7MrUahUIiG8Cs4GZdNUWuvyF2valZyZUxoKZRbNPC1LLyBE'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': None, 'updated': 1508186806, 'version': '1.17', 'recentChanges': 'Upgraded to work with Dropbox v2 API', 'recentChangesHTML': 'Upgraded to work with Dropbox v2 API', 'comments': ['I use this app a lot. But I am thinking of switching over to Keypass2 as there is a plugin which emulates a USB keyboard so that it can send login and password keys to a computer. Make it a "UPM Pro" feature and I\'ll buy it.', 'I love this app, I use it daily. It has got to be one of my favorite apps. No ads, No in app purchased. Just a GREAT app for keeping track of my passwords and other important information.', 'Definitely a five star app. It would be great if in addition to PW, fingerprint authentication was also available.', "Love this app. Even deleted it from my phone by accident and redownloaded it thinking I would have to start over and it kept all my passwords. I'm so thankful! Would be awesome if they made an option to print them all as backup.", "Let me start by saying digital stuff makes my blood boil. I just changed phones and tried to restore the UPM from micro SD backup, but it didn't work. I nearly smashed my new phone because I need this app to work. Then I read about the Dropbox restore and managed to slog my way thru it and, BOOM!!...app restored. Worked great for me!", "Love this app...you only need to remember the password to get into it....I have over 80 different websites and apps in the APN....It's a no brainier for keeping all your passwords in one place....Great app.", "It's simple and easy. I have a ton of passwords saved. I have backed up and restored them twice now with no problems. Once when I got a new phone and once when I did a factory reset. The method I use for backing up it Dropbox. The only thing I can think of to make it better  is if it was cloud based so you can access them on a computer.", 'I have been using this app for many many years and on many different phones and it has worked wonderfully on each. I have read other reviews about the misfortune of not being able to transfer over to another phone. I Had this happen on my 1st one and with some investigsting found that if you will make a copy of the upm file that your info is stored on to your card or cloud you can copy that back to your phone when you switch and all will be there. This method also assures you a backup. Thanks', 'I have using this app for years and never had a reason to change. Makes it feasible to keep up with many passwords as and changes.', "great for keeping your passwords. and does back up to dropbox... but when you get a new phone and try to transfer all the saved info to the app on the new phone... it doesn't work... when I try to access the upm file on dropbox.. it says it can't open the file type. so now I have to manually enter all the info from my other phone to my new phone.... this app is useless if you happen to lose your phone.", 'Brilliant but needs finger print reader. This is my 5th android phone and 3rd tablet and have had UPM since the first incarnations. Every time you get a new device, install UPM, open it, access your Dropbox and it recovers everything automatically in a matter of seconds. Really takes a special kind of retard to not be able to figure that out. Great idea brilliantly executed. Only wish it could be opened with iris/finger print reading instead of having to type in the password like a neanderthal!', 'I love the app. However it quit backing up on my phone galaxy s10+. When i try to back up it says "problem performing file operation". It works on my tab2 and older mot droid. Ive deleted and reinstalled and also tried to make a new file but nothing seems to help. I can still use it but it wont backup at all.', "I've been using UPM for a long time, it's a great way to remember multiple passwords while only having to remember 1 to get into it. One thing that would make UPM even better is to start using finger print login (biometrics)", 'Great, secure app. I use it for user ids & passwords.', "Started using this app on a blackberry about 11 years ago, then on every android phone I've owned. Works great for keeping up with all of accounts and passowrds. Able to use dropbox to transfer over everything when switching phones.", 'Works on all my computers and Android. 100% reliable on all platforms. Easy clean consistent UX. I would like a button to copy the password. Great job.', "Great app. I've been using it for years. I started on a Samsung S4 and now use it on my new Samsung Note 9 with no issues whatsoever. I highly recommend this app.", "It's clean and it works. I've been using this for almost ten years. I like that i can use Dropbox to sync this to a new phone. I also like that i can sync with multiple devices.", 'I have used this app on 4 different phones and it worked perfectly.', "A Great Reliable App. I've used it for many years on different phones and pc's and tablets and it always works perfectly.", 'Been using for a while but something seems off about it. Now when I sync or save, passwords are not being saved..', 'It is good and useful apps, but it fail to restore from upm.db when I change to new hp. It show message of error in file operation.', 'Excellent app. I have used it for years and transferred to many different phones.', "Works very well, back's up to Dropbox. Be nice to have the fingerprint scan to open it.", 'Simple and works great, Sync with Dropbox for seamless transfer when changing devices.', 'excellent method of password storage. easy to access and enter websites.', 'unable to restore. it does not allow to select file and also none of the other retrieval mothid works including dripbox. bad ...', 'Had it for over 5 years. Secure. Works great.', 'simple and secure. no extra fluff, its perfect.', 'A must have app. Am Using this app for nearly 5 years now. Have had no issues. convenient and Handy.', 'excellent, but would benifit from a copy and paste feature', 'Back up option is not there. If it was enabled, good one. Best for use.', 'so many PW for work and personal and sync with all my devices.', "Have been using this app for years, it's simple and good.", 'great app few things could be improved but for a free app great thanks', 'LOVE THIS APP! Been using this app for years! Wont change to another password app ever.', 'Awesome, helps with remembering so many passwords!!!', 'Simple and easy. Would be great if can sync with google drive or similar', "I find it easy to use and it's very handy. Thanks!", 'Simplistic and useful'], 'appId': 'com.u17od.upm', 'url': 'https://play.google.com/store/apps/details?id=com.u17od.upm&hl=en&gl=us'}
