{'title': 'Sabbath School', 'description': 'Meet the new Sabbath School app for Android! Study the Word of God with these awesome features:\r\n\r\n- Swipe navigation between days\r\n- Different Bible versions: ASV, KJV, NKJV, NASB, NIV\r\n- Text Highlighting \r\n- Comments\r\n- Bible Verses\r\n- Daily Reminders\r\n- Reading Modes\r\n\r\nAdventech 2019 Â®', 'descriptionHTML': 'Meet the new Sabbath School app for Android! Study the Word of God with these awesome features:<br><br>- Swipe navigation between days<br>- Different Bible versions: ASV, KJV, NKJV, NASB, NIV<br>- Text Highlighting <br>- Comments<br>- Bible Verses<br>- Daily Reminders<br>- Reading Modes<br><br>Adventech 2019 Â®', 'summary': 'Seventh-Day Adventist Quarterly Sabbath School Lessons. Study every day with us!', 'summaryHTML': 'Seventh-Day Adventist Quarterly Sabbath School Lessons. Study every day with us!', 'installs': '500,000+', 'minInstalls': 500000, 'score': 4.777942, 'ratings': 40804, 'reviews': 19361, 'histogram': [553, 201, 604, 5033, 34411], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '10M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Adventech', 'developerId': 'Adventech', 'developerEmail': 'lim.vitaliy@gmail.com', 'developerWebsite': 'http://vitalikl.github.io/ss', 'developerAddress': None, 'privacyPolicy': 'https://adventech.io/privacy-policy', 'developerInternalID': '8756014950091319530', 'genre': 'Books & Reference', 'genreId': 'BOOKS_AND_REFERENCE', 'icon': 'https://lh3.googleusercontent.com/wbJMNHtoB1vdF419CBUw03ZxZWAMNMYLJe4v1YS-PjwxiueI6pPGurgBdv0XEp7RUA', 'headerImage': 'https://lh3.googleusercontent.com/7gbIbRR7-8c7wdj4Vv3IGv24ZVxmDe48XuczQu31jhyonIoGOjC3fX50KqcpvyqmrA', 'screenshots': ['https://lh3.googleusercontent.com/vQ0-SJ6Zcg9WuiNHC5xDiu_9ylLi6CowdrqCzAkTyGLR19A8AKs_GkdjU5_4IW5YNoQ', 'https://lh3.googleusercontent.com/53_-k_jON7L8N8sciyviCT3ormUPB2agguJBr_0KiSu8VUuUFeK0LDgZ-euVxwD8VFY', 'https://lh3.googleusercontent.com/Z6U7vTjFogtOBZ5b_eagliW1ES4kDpsZoxRyi7ePeoXgfIu-aE3gU4uokg3pSzi3oP0', 'https://lh3.googleusercontent.com/XkLOnKtJEPHANSwZumBTCULUAfOJl1ZkYk37f-uTj1vqHNCULPyX3wTS0LqDshzHm4A', 'https://lh3.googleusercontent.com/j95PCg5-ZPpPGrZsUPRnj3psl212eMV7QI3oxJyIB4QHKg7BSDsi8PT20f98pRUWy3Q', 'https://lh3.googleusercontent.com/-n2sGBrOcZzWd9IGt66JjM13p7fwVGeevGt4RV8EKLniCHGEPDkgb_SGXTa-rIqDQOA', 'https://lh3.googleusercontent.com/4UaJb6RmuYgrdKR_Yu68m2SnGsUw3TqgV4q4yulU2Mmsj1gVvjQ4Sw9XqKsuPXvZrQ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 15, 2014', 'updated': 1589731739, 'version': '3.4.1539', 'recentChanges': '- New! Select different versions of the lesson.\r\n- New language selection interface.\r\n- Bug fixes and improvements.', 'recentChangesHTML': '- New! Select different versions of the lesson.<br>- New language selection interface.<br>- Bug fixes and improvements.', 'comments': ["I like the functions because I'm able to customize the text and select the version of the bible that I wish to use. Also, it's a real convenience to have the earlier editions of the quarterly available and the support of related Ellen G. White's writings is wonderful. Keep up the good work!", 'Very good app in that in addition to being a faithful and complete version of the regular adult quarterly it contains notes from E.G. White. I also appreciate very much the ability to enter and preserve my answers to questions. Thanks for providing this means of studying the lessons, especially now in this time of Covid 19 virus when paper editions may not be easily obtained by many of us.', 'Love this app! more Bible translations to compare and different languages to use. very convenient to use.', 'Why have removed the easy reading and the Cq edition in this new version? It was so better in previous version than this? Or what is the problem?', "Such a wonderful Sabbath School Quarterly. Works well and looks good on my phone. Users can choose from three color display options, four typefaces and five fonts. Highlighting and underlining are also available. One can also schedule a daily reminder. Is 'note adding' available? I'll have to check. Nevertheless, very satisfied with this one.", 'Outstanding apps..! The best quarterly apps I have ever used and it comes in different languages even!! Praise the Lord and kudos to you Bros & sisters who made this possible. God bless!!!', 'Wonderful contribution. I like the multilingual feature and intuitive navigation. Well developed application with attractive design.', "So far this all has been maintained consistently. Sadly that already press it above most Sabbath school at I've used. But beyond that it has a clean look that's easy to navigate. The easy reader edition is an interesting touch. For the most part I'm happy with that. Overall a very nicely done app.", "I like this particular Sabbath School Lesson app because it has EGW quotes that elaborate on each day's topic. Well organized and structured app too", 'Very excellent app. It will be more exceptional if it was a KJV bible added otherwise its five stars from me', 'Love this app! Easy to use. Nice to have both lesson and comments.', "Very easy to use. Simple interface. Got a major problem now. App won't download lesson. Says I'm offline even when connected to Wi-Fi. Same thing on my wife's phone. Help!!", "i don't have a reason as to why I cannot give this app all the stars it good well organized easy to understand further more it has all the previous tackled lessons thank you for this", 'The app is easy to use, opens to the current day, lets you easily flick through days before and after and displays the text by touching on it without the need to look it up.', "Works perfectly and even downloads offline so once downloaded you don't need wifi to access your lesson...", 'Thanks this app has been great help. I travel daily with my study guide , a bible and additional read without the wait. Continue to be inspired. God bless you...', 'A great app ... O love it ... only sometimes it shuts down when opening it', 'Excellent app. Love that I can easily read the Bible verses in the lesson with just a tap. The additional comments are very helpful and I really like the Inside Story included each week. It has been very consistent and reliable so far. Great app.', "This is the best Quarterly Lesson app I've found. It's so easy to use and you can download the lesson so that you can use it whenever you need it, wether you're connected to internet or you're offline. I repeat, this is the Best Quarterly Lesson App!", 'A suggestion would be to add a "Notes" section for each day. When you have a hardcopy, one can write additional notes in the margin. It would be nice to have that available in the app. Other than that, I\'ve enjoyed using it.', 'Fantastic, I always liked the paper copy because I could mark it, now I can mark this lesson as I go. I can share my thoughts and mark points that are interesting. Great App.', 'I prefer this SS app version over the other one I have because it allows the Bible to be read in more translations and it also opens all the texts at one time instead of having to individually click on each.', 'Clean and simple to use, verses are ready to go as well as the quick response boxes, I am Bilingual loving the quick language change, and they Have EGW writings at the bottom for a deeper read if desired <3', 'I enjoy the scripture text options, my only complaint is i cant seem to go ahead in the study for the following week? Im only able to stay on the current week study. Nice app otherwise ðŸ‘', "This app has everything I looked for in a Sabbath School Lesson app. The reason I didn't give it 5 stars is because at the first of the quarter for the first few weeks the is always information lacking from the app. It maybe EGW comments or the teachers helps, it has even been the lesson it's self. I'm not sure why this is, but it can be very frustrating, as I try to depend on it as my lesson plan, and then it's not all there. I have however recommended it to a number of people.", 'Very user friendly. Easy to understand. Quarterly and and any version of the bible at your fingertips. Amazing app.', 'Cool and fresh looking app. Everything is easy to navigate but unable to locate the current CQ lesson. Help!', 'User friendly. Easy to back and forward the articles. Translation is good enough, easy and simple.', 'Excellent and detailed analysis. Great with EGW comments. Love the easy read option too and the young adults section. Also love the bible options used.', 'Pretty good app except it crashes once in a while and it needs to be reinstalled. The customization is limited.', 'Easy to use and I particularly like the Bible verse links and how they have more than one verse in the link when required.', 'Good app. I like the additional notes at each lesson from EGW and the smooth look the theme gives. Last but not lease the ease of navigation through this app', 'Very useful app. I like the additional notes. Very enriching.', 'Amazing. Awesome. Excellent in all aspects. The Techer\'s comment brings everything together in a most concise way. Not to mention the EGWhite comments its just the icing on the cake. Confirmed again, and over many times its "The best SS lesson review "ever. Thank God for your hard work and your love for Jesus. God bless.', 'I love the idea of the SOP quotes and the easy access to the bible verses that supports the review. Awesome!', 'Excellent! Great design. Easy to use.', 'I love to use it. The Bible verses are available in many bible translations. It also has Ellen G. White quotations from her books.', 'Clear and easy to understand...flowing through very nicely and makes me not even miss having a paperback edition! Really great.', 'Very good, but needs audio.', 'Great interactive app. It creates a need in your heart to want to study and stay connected!'], 'appId': 'com.cryart.sabbathschool', 'url': 'https://play.google.com/store/apps/details?id=com.cryart.sabbathschool&hl=en&gl=us'}
