{'title': 'Split APKs Installer (SAI)', 'description': "SAI is an app for installing and exporting split APKs - apps that consist of multiple APKs.\r\nSAI can install apps using standard Android API, using root access or using Shizuku.\r\n\r\nSAI is an open-source app, you can get the source code on its GitHub repo - github.com/Aefyr/SAI\r\n\r\nPlease note that SAI only installs user-provided files and is not responsible for those apps behavior.\r\nPlease also note, that some devices/ROMs aren't supported by SAI, that has to do with bad Android API implementation in said ROMs and can't be fixed on app side.", 'descriptionHTML': 'SAI is an app for installing and exporting split APKs - apps that consist of multiple APKs.<br>SAI can install apps using standard Android API, using root access or using Shizuku.<br><br>SAI is an open-source app, you can get the source code on its GitHub repo - github.com/Aefyr/SAI<br><br>Please note that SAI only installs user-provided files and is not responsible for those apps behavior.<br>Please also note, that some devices/ROMs aren&#39;t supported by SAI, that has to do with bad Android API implementation in said ROMs and can&#39;t be fixed on app side.', 'summary': 'SAI lets you install and export split APKs', 'summaryHTML': 'SAI lets you install and export split APKs', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 4.257143, 'ratings': 6036, 'reviews': 1749, 'histogram': [639, 182, 395, 588, 4230], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '4.5M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'polychromaticfox', 'developerId': 'polychromaticfox', 'developerEmail': 'polychromaticfox+sai@gmail.com', 'developerWebsite': 'https://github.com/Aefyr/SAI', 'developerAddress': 'Russia, Moscow, 109012, DO VOSTREBOVANNIYA Petr Goryanskiy', 'privacyPolicy': 'https://aefyr.github.io/sai/privacy_en.html', 'developerInternalID': '7502722835435591592', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/jEiqOnF-ks0pnbYAfO5CIRKtcIj69VGLe1qbcVV0zigGbnLcI5hl7m3blZZqMtBMfAw', 'headerImage': 'https://lh3.googleusercontent.com/dVL1OvOQqZ-DVMAKubEfQ-9r37lKPm7fBUZa5HC7v_dHJoDzhY9rfA8P6YF_XytzwOs', 'screenshots': ['https://lh3.googleusercontent.com/airNpk9oqwql1z8qIbex2slk7YjviOIdbO92QroeZFN0oXwb8UINxaxDaX5C0vt__w', 'https://lh3.googleusercontent.com/mzwdQss6CYgIgLoA4s-1q0zIYo8hpvViSEtH2o3Yw-RE1zXB272Xk6u1THCLA4i00Q', 'https://lh3.googleusercontent.com/DeHl3OHF-9TvlQkyp82_LF1Hv1iFU9cOChOUBrewM3UINTKFGk2GMeaqSQ8-4ZGOJR6d', 'https://lh3.googleusercontent.com/UkykwoTnGlKEf8RFTQkSn0GN7OnaQMNx2Gy5mj73bx_HfCKzvsXhmaYSHPjaQyZHBWw'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 20, 2019', 'updated': 1591375596, 'version': '4.0', 'recentChanges': '4.0:\r\n• Added managed backups (beta)\r\n• Added new themes\r\n• UI Fixes\r\n• Updated translations\r\n\r\n3.12:\r\n• Fix app crashing when Firebase is disabled\r\n• UI fixes\r\n• Updated translations\r\n\r\n3.11:\r\n• In Pro mode, SAI can now parse APK files directly to get app metadata\r\n• Split APK parts size is now shown in Pro mode\r\n• Backup splits selection dialog now names parts according to their purpose\r\n• Pro mode fixes/improvements\r\n• UI fixes/improvements\r\n• Updated translations', 'recentChangesHTML': '4.0:<br>• Added managed backups (beta)<br>• Added new themes<br>• UI Fixes<br>• Updated translations<br><br>3.12:<br>• Fix app crashing when Firebase is disabled<br>• UI fixes<br>• Updated translations<br><br>3.11:<br>• In Pro mode, SAI can now parse APK files directly to get app metadata<br>• Split APK parts size is now shown in Pro mode<br>• Backup splits selection dialog now names parts according to their purpose<br>• Pro mode fixes/improvements<br>• UI fixes/improvements<br>• Updated translations', 'comments': ["Edit: oops its working just fine. I disabled miui optimisation for this individual app(it's the one all apps usually ask for), not the one included in the developer settings. I didn't knew there where another option . Not at all working in my Redmi even after giving all permissions. Below i copied error report. I have miui 11. INSTALL_FAILED_INTERNAL_ERROR: Permission Denied", 'User apps are those which either have been installed by the user (by any means) or updated on the system apps which come pre-installed on a device (actually, and technically, user-updated apps are and treated the same as user-installed apps, because Android ignores the original system apps which have been updated, and only considers the updated versions as installed apps on a device). The app excludes the 2nd mentioned part from user apps. Actually both mentioned groups contain user apps; therefore both should be included under user apps. Please take a look at "Apps Backup Restore" by "touchfield" on Play Store, which correctly groups user apps. Thanks. Great! Thanks for your true support. Waiting for the next update to see the option there. Thanks again.', 'Thanks for the MANAGED BACKUP feature. But, why all the apps are backed up using .apks extension? You need to work on it.', 'I didnt like the experience of using Split APKs Installer (SAI). I LOVED it! But the reason why I put 4 stars is because when i was downloading one of my toca boca games, there was an error! Error: INSTALL_FAILED_DUPLICATE_PERMISSION: Package com.tocaboca.tocaneighborhood attempting to redeclare permission com.tocaboca.LIFE_WORLD_CONNECTIVITY already owned by com.tocaboca.tocalifeworld.amazon) I use my kindle fire by the way. what do I do?!', 'Due to the whiteness of the details in the panel notification, the default theme makes it difficult to display and does not show the available items at all. However, this problem is solved by changing the theme to dark colors. Message boxes have an invisible background during operations inside the software, and the text is not clear.', 'Everything is great, sorry for my previous negative review. It started working well on MIUI 11 (xiaomi.eu) after: 1) turning on root mode of the installer inside the app; 2) application of Android patches "signature verification status always true" and "disable .apk signature verification" in Lucky Patcher.', "This is great app for installing split apks, the ui, pack split apps and you can signed the app before install! So we dont need to install another apps. Edit :Too bad, it seems ruby theme is doesn't really well with my device. Anyway, thanks for your answer dev, it's helpful. Keep made a wonderful apps.", "First of all I want to thank the developer for making such a nice & lucid app. If you don't have access of a Wi-Fi or you want to save data but there is a problem, u find ur normally backed up base apps 'can't be installed'. Then SAI is the perfect app to backup those apps which contain split apps. It does the work in the most easiest way 1. Tap→backup 2. Tap→install. Nowadays Google often removes alot of apps from play store. But your beloved split app will be perfectly installable. Kudos dev!", "Used this to install YouTube vanced, worked perfectly. Only thing I couldn't get to work was the different themes, it seems stuck on the white one for some reason (coincidentally so was YouTube vanced even though I selected dark theme). Anyhoo, great app that looks good and works great.", "Guys, the reason why YouTube Vanced is split it's because the YouTube app in recent versions has been split to reduce the size of the application and to make installation more efficient. Before I discovered this app, I've always used Lucky Patcher to install split apks, either using it's backing up feature or archiving the apks myself, but it in itself has its limitations. This app fixed my problems with installing split apks, kudos to the developer for developing a very useful app.", "Please add a progress bar. Edit: Thanks dev for the response! The reason why I wanted that feature is because some Chinese games have apk with the obb files built-in, which causes them a long time to install, so I thought that it might've been useful but if there's no point of having a progress bar because there's no actual way of knowing how much the app is installed then it's understandable why there's no progress bar. Anyway, Thanks dev for making this awesome app!", 'Older version was better because older version only exports split apps as .apks extension and all non split apps are exported as .apk extension as usual which was better than new version because new version exports all types of apps(split or non- split) as .apks extension which is not good at all.', "Installed in miui....thanks for the warning........ One thing i noticed is ,if by any chance you had installed microg before in miui....go to manage apps and uninstall it....later uninstall YouTube vanced (if you couldn't log in) ..then start the process again...now first install split installer ,install youtube vanced (if showing failed ,follow my orders from first) and now install microg...", 'Edit: Thank you very much for the tip (which I now see is in help)! I wish I could rate higher than 5 stars now. Will support when I can. Review: Works well so far. Only good apks installer. To install from sd card, select app to install and select "open with" then choose "SAI".', "Well, it works! The only missing feature is upload to APKMirror. The UI is very good, but the UX is bad, but that's okay. It takes a lot more clicks to view system vs user apps than it could take, I don't think the filters at the bottom is a good idea.", 'I\'m giving 3 stars because before update when i took backup a normal apk file then i can install easily app easily from anywhere mean any file manager. But after updating when i took normal apk backup it convert in "apks" format. Same issue', 'I uninstalled SAI and reinstalled it again for more than 10 times. But it doesn\'t work on my phone (5.1). I tried it on a higher android version and a lower android version there it worked. But on this phone whenever I tried to install .apk, .apks it showed "Your ROM is incompatible with rootless installer. Try selecting another installer in SAI settings." And the other installers also didn\'t work. So all the attempts were miserably failed wasting my time and effort. IT\'S ROM IS PERFECTLY FINE.', "It really works! I was having this problem where my phone (Android) was unable to install MOD apks of games and showed 'unable to install app' but after using this app the game was successfully installed. It solved my problem, really glad that to have this amazing app.", 'Great app, first I was confused when I found the app with .apks extension rather than .apk, first time saw an app bundle. But this app worked fine and the application was installed.', 'Yes. I have already checked it. It can show all apps and manually i can take backup all apps one by one. But in three dot menus there is option to take backup of all split Apks. By using that i can take backup of all split Apks. But i want to take backup of all Apps including non split apks. Please add option to take backup all apps including system updated apps. 😊🙂', "Tis app works like an angel, I was swearing so hard because I couldn't download a 2gb app with my data, and this angel saved me, it describes what is the error precisely to you so that you know what's stopping you from downloading an all, thanks man", 'The app says "INSTALL_FAILED_DUPLICATE_PERMISSION: Package com.vanced.android.youtube attempting to redeclare permission com.mgoogle.android.c2dm.permission.RECEIVE already owned by com.mgoogle.android.gms" Now I don\'t know what to do...', "I've successfully jnstalled YouTube Vanced on my device before without this app. To install the new version the website says to use this app. When I tried to install it, I was met with this error. Your app sucks. INSTALL_FAILED_NO_MATCHING_ABIS: Failed to extract native libraries, res=-113", "Just a useless app it doesn't works after disabling MIUI optimization. I suggest not to install it. Also it hacks our data.", 'Worked brilliantly! Just had to mess around with the MIUI a bit, but the app itself has clear instructions on what to do.', 'Very good app. It have a bug in samsung s5 and it is when app go to background exported apps notification in status bar not to seen. Please fix it. Exported apps notification in status bar not to seen when the SAI go to background. This bug in samsung s5 g900h.With thanks for your attention', 'I am getting error installing an apks file Error: INSTALL_FAILED_NO_MATCHING_ABIS: Failed to extract native libraries, res=-113 Please fix it Edit: thanx for actively replying I found the cause, it was not SAI issue, I was trying to install an app with different architecture. My bad😜', "Great app that fills the gap in Titanium Backup (can't backup or restore split apks/bundles). I can now keep using TB as it backs up the data nicely and use SAI to backup and restore split apks.", 'App works fine but the incompatibility with MIUI optimization is reallly annoying, since disabling and reenabling the option causes a few bugs (e.g. all apps losing all authorizations); not sure if developer can do anything about it, but it is a really big issue for me', 'Tested 3.12 -- Functions very well. I never heard about "split APKs" until yesterday when I could not backup and transfer an app using my normal methods. Thanks polychromaticfox for this app.', 'I can\'t install Youtube Vanced and it kepp giving me "No storage with enough free space;res-1" error. Here is the full error: java.io.IOException: No storage with enough free space; res=-1 at android.util.ExceptionUtils.maybeUnwrapIOException(ExceptionUtils.java:39) at android.content.pm.PackageInstaller.createSession(PackageInstaller.java:299) at com.aefyr.sai.installer2.impl.rootless.RootlessSaiPackageInstaller.install(RootlessSaiPackageI', "Please help me. With the following error, it's shows up whenever I tried to open you tube vanced java.lang.SecurityException: Failed to find provider com.mgoogle.android.gsf.gservices for user 0; expected to find a valid ContentProvider for this authority at android.os.Parcel.createException(Parcel.java:1953) at android.os.Parcel.readException(Parcel.java:1921) at android.os.Parcel.readException(Parcel.java:1871) at android.content.IContentService$Stub$Proxy.registerContentObserver(IContent", 'Clean and simple UI, no ads, does what it says and only requests a donation once. Also very small size', 'it was not working in MIUI. So I just read the page after installing that you should turn off the MIUI optimiser. I did it and and it working great now!', 'INSTALL_FAILED_NO_MATCHING_ABIS: Failed to extract native libraries, res=-113', "It does not install split Apks (which are Xapks, Apk and Obb together which can't be extracted) as it advertises itself to do. Really disappointed.", "Does the job perfectly with a few bells and whistles. Good UX and UI with all the features I didn't know I needed. Great app.", 'Worked so far but, for some reason, it kept crashing when trying to extract citra emulator', "Bad, can't install. Waste time. Just grab the old vanced. Says Your ROM is incompatible with rootless installer. Try selecting another installer in SAI settings.", 'Great app! Does what it needs to do, nice material design and themes, simple layout. Flawless.'], 'appId': 'com.aefyr.sai', 'url': 'https://play.google.com/store/apps/details?id=com.aefyr.sai&hl=en&gl=us'}
