{'title': 'DotDash Keyboard', 'description': 'Are you looking for an on-screen keyboard that will work with your phone\'s small screen and slow CPU? Do you know or are you willing to learn Morse code? If you answered "yes" to both of these questions, then this may be the keyboard for you!\r\n\r\nDotDash Keyboard is a drop-in replacement for Android\'s on-screen keyboard. It allows you to enter text via untimed Morse code, using three main buttons: Dot, Dash, and Space (as well as Shift and Delete).\r\n\r\n - Type a letter by entering its series of dots and dashes\r\n - Press Space to end a letter and move on to the next one\r\n - Press Space twice to insert a space between words\r\n - Press Delete to clear the letter in progress, or delete the last letter typed if there is no letter in progress\r\n - Type the symbol ".-.-" for the Enter key\r\n - Swipe up off the keyboard for a Morse code cheat sheet\r\n\r\n\r\n(IMPORTANT: This is an "Input Method", also known as a "soft keyboard" or IME. It acts as a replacement for the default Android on-screen keyboard. As such, it doesn\'t show up in your applications list. Instead, after installing it you will need to go to your phone\'s "Language & keyboard" settings screen and tick the checkbox next to "DotDash Keyboard" to activate it. Then, (if you\'re using Android 3 or later) when you use any text field you will see a keyboard icon in your notifications bar. Tap on that and select "Choose input method" from your notifications list.)\r\n\r\n\r\nFREQUENTLY ASKED QUESTIONS:\r\n\r\nQ: Isn\'t this an awful lot like that "Gmail Tap" April Fool\'s Day joke?\r\n\r\nA: It is quite similar, but it\'s no joke. This is a real, working on-screen keyboard which I\'ve been using full time on my cheapo phone since February 2012. Imagine my surprise when my personal software project was perfectly replicated two months later in Google\'s April Fool\'s Day video, right down to my rationale for designing it! I was planning to add a few more features before releasing it, but the video made me decide to publish this sparse but fully functional version ahead of schedule.\r\n\r\n\r\nQ: This is nothing like the setup I use for ham radio.\r\n\r\nA: No it isn\'t. Sorry! I\'d like to add some more ham-friendly features, such as audio feedback, and timing-based input using one paddle, two paddles, and/or iambic, but I haven\'t gotten there yet.\r\n\r\n\r\nQ: But really, why three buttons instead of just one?\r\n\r\nA: This was actually a design decision. Not only does my phone have a tiny screen, it also has a very slow CPU. I found that input methods based on drawing on screen (or other usage of timing) frequently screwed up when my phone\'s CPU would bog down. By having a separate button for dot, dash, and space, it doesn\'t matter how slow the phone processes things, as long as it eventually registers each screen tap in the correct sequence.\r\n\r\n\r\nQ: Can I switch back and forth between this and my original keyboard?\r\n\r\nA: Sure! Just go to your phone\'s "Language & keyboard" screen and make sure both keyboards are ticked. Then, use the "Choose input method" option in your notifications menu. This will let you switch back and forth as much as you want.\r\n\r\n\r\nQ: Where did you get all those Morse code groups for punctuation marks?\r\n\r\nA: I made \'em up! See the Github page for this project, for more details.\r\n\r\n\r\nQ: Where can I report a bug?\r\n\r\nA: https://github.com/agwells/dotdash-keyboard-android/issues\r\n\r\n\r\nQ: Are you sure this isn\'t a joke? It doesn\'t show up in my applications list.\r\n\r\nA: This is an "Input Method", and so it doesn\'t show up in your applications list. See the note labelled "IMPORTANT" at the top of this description for setup instructions.', 'descriptionHTML': 'Are you looking for an on-screen keyboard that will work with your phone&#39;s small screen and slow CPU? Do you know or are you willing to learn Morse code? If you answered &quot;yes&quot; to both of these questions, then this may be the keyboard for you!<br><br>DotDash Keyboard is a drop-in replacement for Android&#39;s on-screen keyboard. It allows you to enter text via untimed Morse code, using three main buttons: Dot, Dash, and Space (as well as Shift and Delete).<br><br> - Type a letter by entering its series of dots and dashes<br> - Press Space to end a letter and move on to the next one<br> - Press Space twice to insert a space between words<br> - Press Delete to clear the letter in progress, or delete the last letter typed if there is no letter in progress<br> - Type the symbol &quot;.-.-&quot; for the Enter key<br> - Swipe up off the keyboard for a Morse code cheat sheet<br><br><br>(IMPORTANT: This is an &quot;Input Method&quot;, also known as a &quot;soft keyboard&quot; or IME. It acts as a replacement for the default Android on-screen keyboard. As such, it doesn&#39;t show up in your applications list. Instead, after installing it you will need to go to your phone&#39;s &quot;Language &amp; keyboard&quot; settings screen and tick the checkbox next to &quot;DotDash Keyboard&quot; to activate it. Then, (if you&#39;re using Android 3 or later) when you use any text field you will see a keyboard icon in your notifications bar. Tap on that and select &quot;Choose input method&quot; from your notifications list.)<br><br><br>FREQUENTLY ASKED QUESTIONS:<br><br>Q: Isn&#39;t this an awful lot like that &quot;Gmail Tap&quot; April Fool&#39;s Day joke?<br><br>A: It is quite similar, but it&#39;s no joke. This is a real, working on-screen keyboard which I&#39;ve been using full time on my cheapo phone since February 2012. Imagine my surprise when my personal software project was perfectly replicated two months later in Google&#39;s April Fool&#39;s Day video, right down to my rationale for designing it! I was planning to add a few more features before releasing it, but the video made me decide to publish this sparse but fully functional version ahead of schedule.<br><br><br>Q: This is nothing like the setup I use for ham radio.<br><br>A: No it isn&#39;t. Sorry! I&#39;d like to add some more ham-friendly features, such as audio feedback, and timing-based input using one paddle, two paddles, and/or iambic, but I haven&#39;t gotten there yet.<br><br><br>Q: But really, why three buttons instead of just one?<br><br>A: This was actually a design decision. Not only does my phone have a tiny screen, it also has a very slow CPU. I found that input methods based on drawing on screen (or other usage of timing) frequently screwed up when my phone&#39;s CPU would bog down. By having a separate button for dot, dash, and space, it doesn&#39;t matter how slow the phone processes things, as long as it eventually registers each screen tap in the correct sequence.<br><br><br>Q: Can I switch back and forth between this and my original keyboard?<br><br>A: Sure! Just go to your phone&#39;s &quot;Language &amp; keyboard&quot; screen and make sure both keyboards are ticked. Then, use the &quot;Choose input method&quot; option in your notifications menu. This will let you switch back and forth as much as you want.<br><br><br>Q: Where did you get all those Morse code groups for punctuation marks?<br><br>A: I made &#39;em up! See the Github page for this project, for more details.<br><br><br>Q: Where can I report a bug?<br><br>A: https://github.com/agwells/dotdash-keyboard-android/issues<br><br><br>Q: Are you sure this isn&#39;t a joke? It doesn&#39;t show up in my applications list.<br><br>A: This is an &quot;Input Method&quot;, and so it doesn&#39;t show up in your applications list. See the note labelled &quot;IMPORTANT&quot; at the top of this description for setup instructions.', 'summary': "The world's most popular open-source Morse code keyboard for Android!", 'summaryHTML': 'The world&#39;s most popular open-source Morse code keyboard for Android!', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.77, 'ratings': 242, 'reviews': 115, 'histogram': [45, 7, 26, 38, 123], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '89k', 'androidVersion': '1.6', 'androidVersionText': '1.6 and up', 'developer': 'Aaron Wells', 'developerId': 'Aaron+Wells', 'developerEmail': 'dotdashkeyboard@iowaline.net', 'developerWebsite': 'https://github.com/agwells/dotdash-keyboard-android', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8205893070921134428', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/Tmr-p5IkXPq2cGhxrtc2Tmo2IJmhavs_-QlEs_zGcCL3ZYLM7xVIbYa5it6g88JYUw', 'headerImage': 'https://lh3.googleusercontent.com/zZ4HUte1ZLVeXME2AWr46VkWw7M1KM8rPgkR9mR6QMUVMsmoaC6kqVpZFxDdwOctSdQ', 'screenshots': ['https://lh3.googleusercontent.com/w0kVAvlL4X032mkAL5ZsqPr-kvZVvWyxL-mDzwklNwj-182VPH1dWTJ5tnnxIZxpUtai', 'https://lh3.googleusercontent.com/GK4mz7AQrC5RuX3fRO8wN9WNv93E3K6TP_6EN7KPAa29v-tIkq11j-mj0IiEaEcJIAc', 'https://lh3.googleusercontent.com/Uj5qHj1lwLIwArER6CYPq7o-Vu1l9FsZukEQk-YvXbQkeqNrujyx0n7_IN8BMh7hUikm', 'https://lh3.googleusercontent.com/BknfoWXymxd7KgDAGLOYhtxn8bVxmifLO4CnlZ2pfiWaBTbBAQ9hdYYKmULQgs8JibQ', 'https://lh3.googleusercontent.com/oPgadBAe6YvnYkofSOseQ1nalh7v0ZJ8iUk_wik-2I1gIh5gpvT2zZjjiIOe-La27g'], 'video': 'https://www.youtube.com/embed/y5g5OHfjRWA?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/y5g5OHfjRWA/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Apr 2, 2012', 'updated': 1449991473, 'version': '1.2.1', 'recentChanges': '1.2.1\r\n - Bug fix for old Android versions\r\n\r\n1.2.0\r\n - Updated the theme\r\n\r\n1.1.7\r\n - Added Morse code groups for several new punctuation marks: * [ ] { } < > ~ % ^ \\ |\r\n\r\n1.1.6\r\n - Larger "dot" and "dash" graphics on the keys\r\n - Added ". . . . - -" for the # character', 'recentChangesHTML': '1.2.1<br> - Bug fix for old Android versions<br><br>1.2.0<br> - Updated the theme<br><br>1.1.7<br> - Added Morse code groups for several new punctuation marks: * [ ] { } &lt; &gt; ~ % ^ \\ |<br><br>1.1.6<br> - Larger &quot;dot&quot; and &quot;dash&quot; graphics on the keys<br> - Added &quot;. . . . - -&quot; for the # character', 'comments': ['Requires to press another button to "submit" the keyed character, no acoustic feedback, and doesn\'t act like a dual paddle (can\'t push both buttons at the same time), does not repeat dits and dahs when keeping a button pressed.', 'Great keyboard app if you know morse code. The keypads are much easier to select as compared to the qwerty kepad on the cellphone. It is my primary keyboard.', "love it! would be handy to have a spell check feature though. I would send a smile but there isn't one avalabe.", "Didn't appear in my list of keyboards. Further I think a morse keyboard should have one button only, not 4.", 'Given no option to change my keyboard to this or any access to the app itself', "Doesn't work on Xiaomi 4x", 'i like it alot but i wish enter had its own button', 'Dot and dashes not appearing after I write', 'please make more design options', 'I love this aap', 'please add sound', "Didn't opened whe I installed it", 'im typing this using your keyboard', 'Does not appear.', 'not had it yet.', 'Beri noice hahayes', 'this is without a doubt the best morse code keyboard i have been able to find, but it falls short in a few places...  for one, it lacks a way to capitalize letters, aside from the option to automatically capitalize the first letter of each sentence.  It also lacks any form of autocorrect and an enter button.', "I really love this app. This was really made for the person which has difficulties in typing using the standard QWERTY keyboard. Since I didn't master it, please replace the method. Instead of swiping up the space bar, I mostly prefer the one press method, adding a button for showing the alphabet board. I will make it 5 stars if you made it.", "Unless there's a way to instantly choose a normal keyboard it's a totally useless app. Takes up so many pixels on the screen and no button for help or other symbols. Caps mode is only really good if a fully fledged keyboard is also available.", 'Doesn\'t show up at all on my Moto X Pure Edition running 6.0.  It\'s not in the keyboard list at all (Language & Input).  Uninstalled and re-installed, still not there.  Shows up on m LG G4 running 5.1, though.  (edit: if you go into your Language and Input, click on "current keyboard" then click on "change keyboard" you have to turn on the switch for DotDash Keyboard.  Then you have to go back and select it as your current keyboard then it works.  Fantastic developer support for the problem I had.', 'this is a well made, ad free app that does exactly what is written on the package. I would pay money to have a bar on top for punctuation and numbers as those items make for some complicated tapping', "I tried out a few Morse code keyboards but this one is perfect. Doesn't require timing, so you can go as fast as you like, and pause whenever you like. Great way of showing the caps lock status, so obvious. Doesn't take long to learn morse code and good to learn a new skill. Wouldn't change anything.", "The app did not show up under my keyboards and I couldn't access it on my phone in the settings or otherwise. I'm super disappointed because I'm looking for a quicker way to type", "I love it but it doesn't have a send button.... I'm on Snapchat a lot and I need a button to press send. This app takes away the send sadly please fix it??", "It works perfectly but...what's the point of using a morse keyboard if it just automatically translates it into words? If someone is looking for a morse keyboard it's probably because they want to actually speak to another person in code, not just type in it. There's no point.", 'This is quite well done, but still could use some extra features.  A tab key would be nice, and a special characters pallette, etc.  But over-all, very well done.', 'I gotta say that this works way better than it has any right to. My phone screen is large, but in the past I have had dollar store phones where this definitely would have come in handy. I am using it to brush up on my Morse skills. BTW I am writing this with dotdash keyboard; it really works.', "I used this on my old phone but on my new one I can't figure out how to set \nthe keyboard and be able to use it", 'Confession: this review typed on a conventional keyboard', "It's very entertaning but lat of an   Enter key can be problamatic", 'I use this all the time. For me, it is more reliable than a normal QWERTY or Swype keyboard, and faster too!', 'Not showing on home screen neither settings. I use Lenovo Phab', 'Great app. A nice touch would be to allow customising special characters keybinds. typed with app :P', 'Poderia ter uma opcao de tutorial das opcoes do app', 'Zuper ! I would love however a way of sending messages direcly in morse', 'Wonderful! Typed with keyboard. Also, swipe up for decoder.', 'what hath god wrought', 'Bad UX', 'So good', 'Fixed'], 'appId': 'net.iowaline.dotdash', 'url': 'https://play.google.com/store/apps/details?id=net.iowaline.dotdash&hl=en&gl=us'}
