{'title': 'Zandy', 'description': "Access your Zotero library from your mobile device! Edit and view your library, sync, and work offline. Zandy provides a simple interface to all your research. Browse and modify the items in your library, add new items, view attachments, take and edit item notes, search your library, and add webpages from the Android browser, with more features coming soon!\r\n\r\nSee http://www.gimranov.com/avram/w/zandy-user-guide for a complete guide to using Zandy. If you have Zandy 1.0 already, see the update note, http://wp.me/p1i2jM-2U\r\n\r\nFor more information on the Zotero project, the premier system for managing research and bibliographic data, see the project site at http://www.zotero.org/. \r\n\r\nZandy is a free software project, licensed under the Affero GPL v3. By buying the paid application on Google Play, you support the future development of this app and ensure its further improvement. All future releases of the software will be free updates bringing new capabilities and bugfixes.\r\n\r\nTo file bug reports or feature requests, please see the project repository at https://github.com/avram/zandy/. The full source code is also available at that address.\r\n\r\nIf you find that Zandy doesn't fit your needs, satisfaction is guaranteed: just send me an email at zandy@gimranov.com, and I'll refund the purchase price.\r\n\r\nPlease note that Zandy has no official connection to the Zotero project and its home institution at the Center for History and New Media at George Mason University.", 'descriptionHTML': 'Access your Zotero library from your mobile device! Edit and view your library, sync, and work offline. Zandy provides a simple interface to all your research. Browse and modify the items in your library, add new items, view attachments, take and edit item notes, search your library, and add webpages from the Android browser, with more features coming soon!<br><br>See http://www.gimranov.com/avram/w/zandy-user-guide for a complete guide to using Zandy. If you have Zandy 1.0 already, see the update note, http://wp.me/p1i2jM-2U<br><br>For more information on the Zotero project, the premier system for managing research and bibliographic data, see the project site at http://www.zotero.org/. <br><br>Zandy is a free software project, licensed under the Affero GPL v3. By buying the paid application on Google Play, you support the future development of this app and ensure its further improvement. All future releases of the software will be free updates bringing new capabilities and bugfixes.<br><br>To file bug reports or feature requests, please see the project repository at https://github.com/avram/zandy/. The full source code is also available at that address.<br><br>If you find that Zandy doesn&#39;t fit your needs, satisfaction is guaranteed: just send me an email at zandy@gimranov.com, and I&#39;ll refund the purchase price.<br><br>Please note that Zandy has no official connection to the Zotero project and its home institution at the Center for History and New Media at George Mason University.', 'summary': 'Mobile access to your Zotero library', 'summaryHTML': 'Mobile access to your Zotero library', 'installs': '1,000+', 'minInstalls': 1000, 'score': 2.65, 'ratings': 168, 'reviews': 118, 'histogram': [57, 23, 28, 38, 20], 'price': 1.99, 'free': False, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.0M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Avram Lyon', 'developerId': 'Avram+Lyon', 'developerEmail': 'zandy@gimranov.com', 'developerWebsite': 'http://www.gimranov.com/forum/', 'developerAddress': '89 S Seminary\nGalesburg, IL 61401', 'privacyPolicy': None, 'developerInternalID': '8627456239470732761', 'genre': 'Education', 'genreId': 'EDUCATION', 'icon': 'https://lh3.googleusercontent.com/pjlRDaATuF9CaQDtnU7pwrsPb3xrCU4LCNL3j4THISabnV5qTyf_EjiXW9gv5tMVo6A', 'headerImage': 'https://lh3.googleusercontent.com/UJhJWupvbQcaP8UOw6y6BycTifh9Hv-xDe7UaeQodrIH_adfuHerosh29nov7SJpQfko', 'screenshots': ['https://lh3.googleusercontent.com/eAcudlM9vb13j40HSzY6U_djTk5B_rw6A8xgVLT55-F0XSOxX0LWLGIL_SgvIrxVEw', 'https://lh3.googleusercontent.com/tWhroLPsB_2KnR0j-z7aX2ZQiEkPwAzZoHGdb70xQNaP26bdDg2WjyWzhXyhSZPKet3F', 'https://lh3.googleusercontent.com/Vkslk3NWEN5uZhfmr8GIoGX8_6bcZ6pO6lJ9fLZ2XqdAga5pEhY-TUq7-i2kuXABeVc', 'https://lh3.googleusercontent.com/CCsYoMcoRcRtGCIjqCj_ciid04HdAihHuRxglv6Ywv72jfTPTzloXoo_EuC3dUZ9PA', 'https://lh3.googleusercontent.com/TOjGeUH632zsxgEMx4ErqPpNkYBdJoz7QY192J2AxXFKW5-d7bh4KdcixJHBjxskD74'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 5, 2011', 'updated': 1552634962, 'version': '1.4.6.1', 'recentChanges': 'Removes old version of Crashlytics crash reporting that triggered temporary removal.\r\n\r\nThis version includes recent fixes to DOI linking contributed by @katrinleinweber and some preliminary work towards modernization.\r\n\r\nAlso fixes some handling of local attachments.', 'recentChangesHTML': 'Removes old version of Crashlytics crash reporting that triggered temporary removal.<br><br>This version includes recent fixes to DOI linking contributed by @katrinleinweber and some preliminary work towards modernization.<br><br>Also fixes some handling of local attachments.', 'comments': ['This is a good app. There is only one feature that I feel is missing: I use links to local files in the desktop version of Zotero, and with relative instead of absolute paths I can get my files across several computers. However, with this app I cannot view my linked pdfs in my tablet, even though I have them synced in a local folder in my device. Having the same feature as the desktop versions is important.', "the best zotero app , the only one that edits data and n well .. works... kinda... could be great if someone just takes an interest in further developing it... - lost data with the app wouldn't sync properly - I recomend Mendeley as an zotero alternative, it syncs with zotero is free highly professional and the app is a hundred times better", "I need to sync my annotations to the webdav pcloud but it didn't work for me. I gave it a second chance by buying it again after being refunded the first time. It attempts to write something in the webdav but up to now I cannot synchronise the annotated pdf back to the webdav.", "Can't scan by ISBN. Edit: Rather, the scanner linked can't read ISBNs", 'sorry for giving one single star for this app. it needs longer time for inputting items.', 'Not useful for my use case because I sync my files myself. I need to access a custom zotero path.', 'Of all the Zotero apps on the app store, this is the only one that actually works. Sad to say that the functionality and user interface still leave a lot to be desired. Als, really needs a tablet-centric interface.', 'I am hoping that the developer will soon understand why so many users are frustrated with this app. This being the only Zotero app for Android, the app has huge market, if developed well.', "At first I gave a low score because I couldn't add content, just view. After being informed that I must be doing something wrong, I realized that some things can be added on the go. But - and I may just be technologically deficient, as this is my first smart phone - I can only add material to an existing folder already created in the full Zotero program. I cannot seem to use the app to start a new line of research from scratch.   It is a very good idea. And I hope that the app is expanded - even if what is needed is user education.", 'Very Helpful on the whole I use this app frequently, both on my Blackberry Passport and on my Samsung Note 8. It syncs well with my Zotero references. My only concern is that I am unable to enter new references using ISBN numbers. When I enter the ISBN number using the "add by identifer" command. the app seems to go into an infinite loop and never adds the requested information. This happens both on the Passport and the Note 8. This severely limits its utility for mobile use in libraries, bookstores, etc. If this problem is fixed, I would give it 5 stars.', 'sir , sometimes it downloads sometimes it corrupts the file New review : For those who cant download....just change the name....keep...names as minimum as possible...because software appends its own code....to the file ...then it doesnt work.... Now my app works fine UPDATE do not download ZOTABLE...it doesnt works and developer doesnt reply at all', 'Have had problems syncing (no automatic sync) and it is impossible to open files via the webdav function (How does one do it?). Without this I think this app is not suitable for research; I organise all my working papers on Zotero and use a webdav cloud to sync everything. I would love a papership type app in my device, that would let me access and read the files. Android is behind ios in terms of research tools. Zandy is going in the right direction, but is not quite there yet (look at papership for good ideas!). Hope this is changed soon, I am willing to reconsider my review if this changes. The interface could also be a bit more polished and offer a white background possibility. (also, smart searches and tagging support would be welcome)', 'But it is a mess. Wish someone would take over development.', 'Downloaded this so I can coordinate my reading and sync my Zotero library when "on the go" while toting my Android tablet. I use webdav on my personal server space to store my files. It does everything I need it to do: stay synced with my online Zotero library and provide me the pdfs from my webdav space when I need them. Thanks Avram!', "The app works somewhat but it is very, very clunky. User interface is unintuitive. I still don't get how sync works as some collections show items within them and some dont. Bottom line - requires a lot of improvements before this app can be ready for primetime. This aint no papership like available for ios.", "(1) Altho it syncs existing items w/ cloud when changed (eg, added line to existing note), can't get an item first created on Zandy to sync with (get uploaded to) the cloud. (2) The keyboard overlays bottom of Note and there's no scroll bar to move window's contents. (That's the same problem with this data entry right now on the play store, so maybe that's Android vs the app?) Downloaded Zandy today from Android app store on Samsung S4 running Android 5.0.1.", 'Totally happy for having a reference manager app . Still improvements to be done, keep on the good work.', "It works well for the basics, but i would love to see support for group libraries. As it is, it covers my own research, but I'd love it to work for my collabs as well.", "I bought this in order to use Zotero with Webdav. It's working, so I'm happy!", "Given the relatively low overall reviews, I hesitated to pay for and download this app.  Now that I have, I have nothing but good things to say about it.  Apart from a somewhat uninspiring UI, it does what it claims to do and does it very well, at least for me.  I have had absolutely no sign-in problems and the sync has been flawless so far.  I can't say the same for seemingly more popular and less functional (though prettier) reference manager apps out there.  A refresh to the UI would get things to five stars, but I am still going to make very good use of this until then!.  Well done, Avram!", "Most of my important references lie in shared libraries; unfortunately they don't show up in the app.", "No support for group libraries -- this isn't mentioned anywhere in the documentation. Completely useless to me without this functionality. I want my money back.", "Sync works well and I can (eventually) find what I'm looking for. Not the most user friendly. I think if I used categories more on my Zotero then Zandy would be friendlier!", 'Dev has left this to wallow for far too long. BibTex-based apps are the way to go, still keeping Zotero - check out Eratosthenes, autozotbib and zotero-better-bibtex.', "I'm very happy to have Zandy, and it does work. I'd give it 5 stars, except for:  -What's going on when it's syncing? It pops up a little box, briefly, when syncing starts, and then when it's over. But I'd rather not sit there waiting for it. Zandy doesn't seem to handle the WiFi arrow very well, so that's a very unreliable way to tell if Zandy is busy or not.  -Attachment downloading confusion: Zandy seems to start downloading another copy of an attachment when my tablet (Lenovo S6000) dims the screen, when I go to another app, or just kind of at random. There will be multiple download message boxes for the same item alternating with each other. Again, it's impossible to figure out what's going on.  -Won't see attachments without parent items: This is just kind of annoying, but as far as I can tell if you have a file -- PDF, say -- that you've put in Zotero without yet creating a parent item, Zandy can't find it.", "Doesn't show sync progress or history. Attachments must be downloaded manually one by one. No search. Poor interface.  Zotero is great and easy whereas Zandy is disappointing.", 'Please,  fix this feature to enable box integration.  Without  that the app is useless..', 'The app does a great job at pulling up my zotero information. I have not added anything to my account yet using zandy. I do have some suggestions. A sort feature would be nice to sort by date added, title, maybe author. An icon to indicate if there is an attachment to the reference item. Long press to copy information to clipboard, email reference info, export item, maybe generate citation.  Look forward to updates.', 'It would be nice if there was support for group collections', 'Promising. WebDAV works after some wrestling (but not with http digest auth, alas--and attachment viewing takes a lot of clicks (3) and download time (compared to downloading in a browser)). I look forward to reading papers on this.', 'WebDav downloading/unzipping is slow sync may give duplicated items Modified attachments not uploaded', "It keeps asking for login and key, even tho I was successful each time\tCan't get past login and key stage in order to get my collection.", "After being at first put off by the negative reviews, but seeing that it's getting regular updates and feedback from the developer, I decided to try the app. For now I'll mostly be using it for the WebDAV file attachment retrieval because the UI is still rudimentary. Some suggestions to mirror what has been said before : (1) a quicker way to access the attachment (an icon on the far right side for example). (2) integration with a pdf reader app after download completes (just an option to choose an app or at least to go to the folder where the file is stored). Keep up the good work.", "Crashes on log-in, 'sync error' when API number is entered manually. I didn't receive help from the developers within three days. Requesting a refund. Android 2.2., Samsung GT P1000  The latest update didn't solve anything", "The app works. I can access my online synced library and via webdav also the pdfs that are attached. I had to set the API keys manually as the link from the browser back to zandy did not work. The app itself could be a bit better. For one, the number of clicks to get to the pdf's is too many. Also a link back to the library (e.g. via the logo in the top-left) would be helpful to reduce the number of back-back-back clicks.", 'I bought the application just to support the developer. Unfortunately,  the application is minimal in its current status and needs a big improvement to be really useful. After opening some attachments,  I get unsupported format message although they are usual PDFs. * update: I can now open the PDF files after resetting my application handlers. However,  Zandy still needs more development to be a mature application.', 'Not flashy but it works consistently for me.  I second other users comments that it can be annoying to navigate. Easy to set up and definitely helps me out.  Three thoughts on improvements. 1. Indicate downloaded files in collection menu, and allow access to documents there (either local or request download). 2. Functionality to delete local files from the program.  3.  Integration with a reader.  Thanks!', 'This is seeming to do what I need which is to be able to work in zotero without having to be in front of my computer, just using my tablet.  I am a doctoral student, and a mom of three little kids, and reading new sources constantly.  This allows me to file new articles, and open read, highlight and make notes about an article and enter it directly into zotero from my tablet. And be at the park with my kids at the same time.  Perfect.', 'I purchased the app in a hope to support the developer despite the low reputation of the product. After a good deal of attempts to get used to the interface and the behavior of the app I had to give up because it lacks even the basic functionality to make it useful. Unreliable and uncontrollable syncs. Multiple instances of the same record made in Zandy keep reappearing in Zotero after being deleted. No search. Awkward navigation...', 'The app uses the web browser for the login. After authorization of the application keys, the url loaded does not go back to the app, so the log in never completes.   Please fix!'], 'appId': 'com.gimranov.zandy.app', 'url': 'https://play.google.com/store/apps/details?id=com.gimranov.zandy.app&hl=en&gl=us'}
