{'title': 'Inno Setup Extractor', 'description': "Extract Inno Setup files, such as those from GOG.com, directly on your Android device without using a PC!\r\n\r\n<b>Please note that this app can only extract .exe files which are valid Inno Setup installer packages.</b> It can't extract just any random .exe file. If you're not sure whether you need this app, you probably don't.\r\n\r\nThis app is a port of the excellent InnoExtract tool by Daniel Scharrer: http://constexpr.org/innoextract/\r\n\r\nThis app is licensed under the MIT license. Please feel free to fork or clone my GitHub repository: https://github.com/alanwoolley/innoextract-android", 'descriptionHTML': 'Extract Inno Setup files, such as those from GOG.com, directly on your Android device without using a PC!<br><br><b>Please note that this app can only extract .exe files which are valid Inno Setup installer packages.</b> It can&#39;t extract just any random .exe file. If you&#39;re not sure whether you need this app, you probably don&#39;t.<br><br>This app is a port of the excellent InnoExtract tool by Daniel Scharrer: http://constexpr.org/innoextract/<br><br>This app is licensed under the MIT license. Please feel free to fork or clone my GitHub repository: https://github.com/alanwoolley/innoextract-android', 'summary': 'Extract Inno Setup files directly on your Android device without using a PC!', 'summaryHTML': 'Extract Inno Setup files directly on your Android device without using a PC!', 'installs': '500,000+', 'minInstalls': 500000, 'score': 2.2764504, 'ratings': 2940, 'reviews': 813, 'histogram': [1786, 170, 110, 130, 742], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Alan Woolley', 'developerId': 'Alan+Woolley', 'developerEmail': 'alan@armedpineapple.co.uk', 'developerWebsite': 'http://www.armedpineapple.co.uk/projects/inno-setup-extractor/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8051985352638074449', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/cyHjcvY64mu9OjpcO63pcZ7QSj0R93-bhL_tAJ49KPfQ7VF2kBFUazNZhcYbkPDZ2L0', 'headerImage': 'https://lh3.googleusercontent.com/1Ybn1yCEt5FWt5Lu8Tb6YP94X21bq9OjvqD4OEWaMlbC8ypidj3x-9S67yQCSZ26Zac', 'screenshots': ['https://lh3.googleusercontent.com/IYNbGEnw22W3gvswoyqHH8fggujQ4-f_5rF_TbpID4K8wB6h6gnB78xaQSA1RPFAF310', 'https://lh3.googleusercontent.com/WFTJS3a6T1jUxJaTQjncmzvQ3asDRUw2aHVv_BJgYM0D4jm3Y0dUQsSJWsc3ZIHbzl0r', 'https://lh3.googleusercontent.com/YGyxPTHBgN334UjZmOqcQ0YwKwjns3l3oTfTfhT0tvimIVjXVeSsxCx0sAaOxBmTQz8C', 'https://lh3.googleusercontent.com/qLu3K0e-VckDUu-UlPf3XBWNqkmvtLhimKTOS2GisZIfeDlPxXJb9j8o-vjFsrHFSJs', 'https://lh3.googleusercontent.com/-rHYaGiT5zc0DvWb7U3boyGQs25ARMVleQzduoaETTpSkItluWecAjQQEsdUNhqRM7Fj'], 'video': 'https://www.youtube.com/embed/QYtKNp80ENo?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/QYtKNp80ENo/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 15, 2013', 'updated': 1517157936, 'version': '3.1.0', 'recentChanges': 'Optimized application for arm64, x86 and x86_64 platforms\r\nSmaller and faster application\r\nBug fixes', 'recentChangesHTML': 'Optimized application for arm64, x86 and x86_64 platforms<br>Smaller and faster application<br>Bug fixes', 'comments': ["Update: Even though you explain in your description that your app opens inno files, the fact still remains it's listed under opening EXE FILES, which says to me that it does BOTH, I did not see in your description where it says inno files ONLY, so I suggest that YOU take that up with Google since it's your app. If it says inno ONLY, then I can see, but I did not see that.", "People, please read the description. This is not for running or even extracting your average exe file. Me, I wanted to use Quake 2 in Quad Touch. This app allows extraction from specific GoG installers, so in this case I could take the files I needed and include it in Quad Touch. It's not that hard to understand when you read the instructions.", 'I will give you five star for this! Thank you. This app will not open .exe files game to your android device. This app will extract the exe setup files to your android device without the help of PC. All of you please read the description first before installing it.', 'Wow. I don\'t mean to hate but I got recommend this and a bunch of YouTubers were like "oh, its the easiest exe opener" but no. I can\'t even run Roblox studio on here. It says "wrong kind of file". I\'m seriously disappointed.', "I understand this works for .inno setup files, and .exe setups aren't supported, and as such works as intented. I just recommend not advertising GoG anymore as most of their games made after 2000 have .exe setup files. Or at least all my games (including Arcanum 1-7 and Baldur's Gate 2 and GeneForge, etc.) are .exe setup files. Maybe I'm doing something wrong, but there's no instructions or recommended guides I know of that are not from a computer screen or phone emulator for pc. Recommendations?", 'Ive used this on a dozen gog games to boot, from arcanum to star empires 4. It all works flawlessly and i love how i can just unpack it right into the exagear folder. It does exactly what it says itll do. Only real complaint is the percentage numbers are a bit wonky but it always unpacks at the end. Great work', 'I completely understand that this app is designed to bypass the set up, and downright extract files such as game files or other software that you normally require PC to extract. But sadly this app cannot extract "encrypted" setup files. Which most people doesn\'t understand that this app is designed for that specific purpose.', 'Useless app! Downloaded this to open .exe files(as Google search results suggested) but this app straight away said "not valid document for inno setup" NOT RECOMMENDED', "Only does inno setup files won't help you with no other exe files so this is labeled and tagged for everything wrong not worth the data to download", 'Works on GOG games. The percentage counter is way off though. Thanks!', 'Never download this sucking app on your phone. I think it is better to break your phone. Never download it please. It is Corona Virus of all apps.', 'It is saddening that this app has been unjustly scored. It works without a hitch and is mighty convinient. Thank you for developing this!', 'Its good, I like that it can extract SOME exe file setups. But most just say Not a valid Setup. If i could get help on this NOT TO BE RUDE!! or anything cause everyone else just sounds rude about it', 'This app is cool, but why do people say you can """""run""""" exe files? Just extract it and rearrange it to a ZIP renamed to a APK. Edit: Cannot open Kalles Fraktaler.', "Worthless doesn't even extract Inno files. I know it's NOT for .exe files. The Inno files whenever I tried to extract them says error.", 'This app probably opens other PC files but the thing is that a lot of people, including me were tricked into downloading this to open .exe files', 'i hate the update. it opens folders instead of .exe files', 'Advertising features are not present in your app. Simply waste of time', "Worthless. The exe file said it wasn't valid. Waste of time downloading this", 'Good Tool! Very Simple and Light! Thank You Dev!', 'I kept getting an error message every time I try to run an exe file, the sole reason I downloaded this thing', 'Can\'t launch exe apps because it\'s "not inno launcher compatible"', 'Amazingly simple and a must have ! 10/10', "Very bad app. It doesn't open .exe files.", 'Worked exactly as described. Great app!!!', "App can't access SD card", 'Going to try this to see if I can play Hitman 6 on android. Hope it works', 'apparently this app was made for extracting exe files made with this app? I type in exe extracter in the google store get this app read about online people say it can extract exe files. Maybe you can big put in big bold font useless for 99% of users so you dont waste peoples time that 3star score is deserved dont kid yourselves.', 'App is awesome. Really guys you need to read the description..', 'Could not extract a converter to change train simulator files to a format usable on my phone', 'it is showing not a valid inno setup file', "Rubbish app. I tried using a setup and the actual exe, doesn't work.", "Worst app doesn't extract files properly", "Doesn't work for .exe games, not worth having.", 'Dev should improve this more. Try better and harder next time.', 'Not working on my samsung tab 3', 'said it could run exe but doesn\'t. what even is an "inno setup file"???', 'Inno Needs a Major Upgrade!!!', 'will not run exe. setup for router', "Wouldn't work for an exe file... The whole reason I downloaded it..."], 'appId': 'uk.co.armedpineapple.innoextract', 'url': 'https://play.google.com/store/apps/details?id=uk.co.armedpineapple.innoextract&hl=en&gl=us'}
