{'title': 'DNG Processor', 'description': "DNG Processor waits for new RAW images captured using a supported camera app, and then processes them in the background. It does this by using the power of your phone's graphics unit for up to a few seconds. The results have more details, higher dynamic range, and can improve over time when the application gets updated. No set-up required!", 'descriptionHTML': 'DNG Processor waits for new RAW images captured using a supported camera app, and then processes them in the background. It does this by using the power of your phone&#39;s graphics unit for up to a few seconds. The results have more details, higher dynamic range, and can improve over time when the application gets updated. No set-up required!', 'summary': "Take better photos by using all data from your phone's camera sensor", 'summaryHTML': 'Take better photos by using all data from your phone&#39;s camera sensor', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.217949, 'ratings': 78, 'reviews': 38, 'histogram': [9, 3, 5, 6, 55], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '243k', 'androidVersion': '7.0', 'androidVersionText': '7.0 and up', 'developer': 'Amir Zaidi', 'developerId': '8393360416371912006', 'developerEmail': 'azaidi@live.nl', 'developerWebsite': 'https://github.com/amirzaidi', 'developerAddress': "Wetering 25\n3295GR 's-Gravendeel\nNederland", 'privacyPolicy': 'https://amirzaidi.github.io/privacy.html', 'developerInternalID': '8393360416371912006', 'genre': 'Photography', 'genreId': 'PHOTOGRAPHY', 'icon': 'https://lh3.googleusercontent.com/QfOFCJxXYm9FedFOVYlkslKaWzR6blVZZwNV2fvwfgEfs-bCwe-fVKb2I3od9vrIqq0', 'headerImage': 'https://lh3.googleusercontent.com/Uo8RFy62zjiHo0XLv8oNRjFnyeo-xgZRTBu1_H5J8smQlSAMkXFdeFtvXZJr-ysW17Q', 'screenshots': ['https://lh3.googleusercontent.com/9wHuleHF5fAXvE8sbkdLurLYeAl90o-Lizfqdbw8bydiuDb6cjxApHgyBjmYJv9Ip_i0', 'https://lh3.googleusercontent.com/vl-hDdpaDXIz1qIWurHqDU7eRJT7BXAzukv8zucUGEuTHCRRiXIb6pSPj8OdiBKo4Zk', 'https://lh3.googleusercontent.com/y_8OLmjrmS7m3TSiSwlfCfCrMx7pEDRmMLUIdVhpXtiRBpdMMgF5xGd0viTloNc31HTv'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 25, 2019', 'updated': 1553620299, 'version': '5', 'recentChanges': 'Remove black dots in highlights on OnePlus 5 and 5T\r\nPrevent crash from missing noise-profile, which is not used yet\r\nFix low light getting washed out by local contrast enhancement\r\nDecrease saturation on devices without overrides by 10%, increase it by 10% for Xiaomi', 'recentChangesHTML': 'Remove black dots in highlights on OnePlus 5 and 5T<br>Prevent crash from missing noise-profile, which is not used yet<br>Fix low light getting washed out by local contrast enhancement<br>Decrease saturation on devices without overrides by 10%, increase it by 10% for Xiaomi', 'comments': ['I am using Realme X2 pro. The images i have clicked around few days back, the app is giving an error that it cannot be processed. Please share some reason', 'splendid app! ,processes are subtle and with good taste, very realistic results, perfect if you have raw/dng in your phone and want a quick automatic processing without having to edit yourself , time saving app , thank you', "Noticable improvements on my OnePlus 5T. Paired with OpenCamera I can snap just RAW files and allow DNG Processor to output much more detailed images than the base OnePlus camera. No real issues with speed, but OnePlus's aggressive background suppression means I have to manually trigger it sometimes. A Tasker plug in might be a nice feature to trigger it after closing the camera. Much better alternative than trying to figure out all the half working Gcam ports. EDIT: Whitelisted!", "Incredible app that I never thought could exist. It reliably improves the output of my OnePlus 5T's camera, and without the need of root. I've also seen it in action in a Huawei P20 Lite and the quality, specially in dim conditions, is very noticeable. Definitely something worth trying if your device supports taking pictures in RAW.", "Wow this does the job it describes and does it well. i have LOS running on my Galaxy S7 edge and which doesn't have the best camera quality, but this works wonders with RAWs from OpenCamera. My only problem is that OpenCamera's preview stutters pretty bad when this app is processing RAWs, but reading the app description it is understandable I suppose.", "Does a pretty good job and the colors are good too. I've been using a LG G5 with Open Camera to take the pictures. Noise is still a tad grainy on high ISO setting compared to stock. Hopefully we can see some settings to configure noise reduction.", 'Hey developers. i have google pixel 2 with me.and this app is not working with this device.i also tried it manually but its not working yet.plz make a fix on it i need this so crazyly 😔', "Very good! It's no substitute for manual tuning, of course, but it quickly produces good quality jpgs.", "ay man this some crazy stuff right here, I usually give some in-depth reviews but all I can say for this is that it's doing something incredible with raw images... 10/10 must have for advanced users.", "the app just doesn't work for DNG files produced by the V30. All the photos come out as blank white with randomer black dots. unfortunate.", "No idea how it works but it's great, nice accurate colours and improved detail from the u ultra camera (no good gcam ports). Can't reccomend enough", 'Works well but, there is more noise in photos than the camera-processed photos .', 'Genius idea for us without a Gcam Port.Waiting for the next updates :D', "Can you add a camera icon to open camera on the app so I don't have to have the app continously running in the background? Thanks!", "don't load my dng files. moto g5s plus gcam 6.2 port", 'Supper work ....what an idea for an app ...app does what it says excellently', 'Does not work with pixel 3a', 'Not loading pics on my Pixel 2', 'Best and works great!! Congratulations!', 'Very glad i discovered this.. Thank you sir', 'realmeX2 not working this aap please solve problems', 'Can we do custom amount for Donations or just those two amounts? I got some Google Credit i have lying around', 'Outstanding images.', 'Very useful', 'Genius. Congrats !!', 'awful'], 'appId': 'amirz.dngprocessor', 'url': 'https://play.google.com/store/apps/details?id=amirz.dngprocessor&hl=en&gl=us'}
