{'title': 'andOTP - Android OTP Authenticator', 'description': "andOTP implements <b>Time-based One-time Passwords (TOTP)</b> like specified in RFC 6238 (HOTP support is currently in beta testing). Simply scan the QR code and login with the generated 6-digit code.\r\n\r\n<b>Features</b>:\r\n•  Free and Open-Source\r\n•  Requires minimal permissions:\r\n •  Camera access for QR code scanning\r\n •  Storage access for import and export of the database\r\n•  Encrypted storage with two backends:\r\n •  Android KeyStore (can cause problems, please only use if you absolutely have to)\r\n •  Password / PIN\r\n•  Multiple backup options:\r\n •  Plain-text\r\n •  Password-protected\r\n •  OpenPGP-encrypted\r\n•  Sleek minimalistic Material Design with three different themes:\r\n •  Light\r\n •  Dark\r\n •  Black (for OLED screens)\r\n•  Great Usability\r\n•  Compatible with Google Authenticator\r\n\r\n<b>Backups</b>:\r\nTo keep your account information as secure as possible andOTP only stores it in encrypted data files. There are two methods of encryption which can be used: the <b>Android KeyStore</b> or a <b>Password / PIN</b>.\r\n\r\nThe KeyStore is a system component of Android for securely storing cryptographic keys, the advantage of this approach is that the key is kept separate from the apps data and, as a bonus, can be backed by hardware cryptography (if your device supports this). However, due to that separation, backups with 3rd-party apps like Titanium Backup can not be used if this method is chosen. Such apps only backup the encrypted data files and not the encryption key, which renders them useless. <b>In this case you will have to rely on the internal backup functions provided by andOTP!</b>\r\n\r\nThe KeyStore is known to cause a lot of problems, so please only use it if you absolutely have to and know what you are doing. In that case please make sure to make regular backups in case something goes wrong. <b>It is always recommended to use a password or PIN instead!</b>\r\n\r\n<b>Beta testing</b>:\r\nIf you found a bug during beta testing, please submit your feedback directly on Github (https://github.com/andOTP/andOTP/issues) because for some reason I don't always get notified when new beta feedback is submitted on the Google Play Store.\r\n\r\n<b>Open source</b>:\r\nThis app is fully open source (licenses under the MIT license), you can check out the source on GitHub: https://github.com/andOTP/andOTP\r\n\r\nandOTP is a fork of the great OTP Authenticator app written by Bruno Bierbaumer, which has sadly been inactive for a while. All credit for the original version goes to Bruno. You can find his app here: https://play.google.com/store/apps/details?id=net.bierbaumer.otp_authenticator", 'descriptionHTML': 'andOTP implements <b>Time-based One-time Passwords (TOTP)</b> like specified in RFC 6238 (HOTP support is currently in beta testing). Simply scan the QR code and login with the generated 6-digit code.<br><br><b>Features</b>:<br>•  Free and Open-Source<br>•  Requires minimal permissions:<br> •  Camera access for QR code scanning<br> •  Storage access for import and export of the database<br>•  Encrypted storage with two backends:<br> •  Android KeyStore (can cause problems, please only use if you absolutely have to)<br> •  Password / PIN<br>•  Multiple backup options:<br> •  Plain-text<br> •  Password-protected<br> •  OpenPGP-encrypted<br>•  Sleek minimalistic Material Design with three different themes:<br> •  Light<br> •  Dark<br> •  Black (for OLED screens)<br>•  Great Usability<br>•  Compatible with Google Authenticator<br><br><b>Backups</b>:<br>To keep your account information as secure as possible andOTP only stores it in encrypted data files. There are two methods of encryption which can be used: the <b>Android KeyStore</b> or a <b>Password / PIN</b>.<br><br>The KeyStore is a system component of Android for securely storing cryptographic keys, the advantage of this approach is that the key is kept separate from the apps data and, as a bonus, can be backed by hardware cryptography (if your device supports this). However, due to that separation, backups with 3rd-party apps like Titanium Backup can not be used if this method is chosen. Such apps only backup the encrypted data files and not the encryption key, which renders them useless. <b>In this case you will have to rely on the internal backup functions provided by andOTP!</b><br><br>The KeyStore is known to cause a lot of problems, so please only use it if you absolutely have to and know what you are doing. In that case please make sure to make regular backups in case something goes wrong. <b>It is always recommended to use a password or PIN instead!</b><br><br><b>Beta testing</b>:<br>If you found a bug during beta testing, please submit your feedback directly on Github (https://github.com/andOTP/andOTP/issues) because for some reason I don&#39;t always get notified when new beta feedback is submitted on the Google Play Store.<br><br><b>Open source</b>:<br>This app is fully open source (licenses under the MIT license), you can check out the source on GitHub: https://github.com/andOTP/andOTP<br><br>andOTP is a fork of the great OTP Authenticator app written by Bruno Bierbaumer, which has sadly been inactive for a while. All credit for the original version goes to Bruno. You can find his app here: https://play.google.com/store/apps/details?id=net.bierbaumer.otp_authenticator', 'summary': 'Open source two-factor authentication for Android', 'summaryHTML': 'Open source two-factor authentication for Android', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.58, 'ratings': 829, 'reviews': 294, 'histogram': [58, 16, 16, 33, 704], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '6.2M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'Jakob Nixdorf', 'developerId': 'Jakob+Nixdorf', 'developerEmail': 'andotp@shadowice.org', 'developerWebsite': 'https://github.com/andOTP/andOTP', 'developerAddress': None, 'privacyPolicy': 'https://github.com/andOTP/andOTP/wiki/Privacy-policy', 'developerInternalID': '5602370298149726431', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/YXQSuenHxNvP-xGV8DNGEIvIh__zTqLem9x91Sh65mOseMt2I7DA4iejFgUCQdVDRaI', 'headerImage': 'https://lh3.googleusercontent.com/wq14dOAKQQ_lSeZWxfAsmMqejHvSmOUy4X6q4mH0tbXttG92wRN_DYDDInnRvKN9giMk', 'screenshots': ['https://lh3.googleusercontent.com/eIjPSuHuu07G_SVVMgaA70G5zbIfYivhFyvySuayjdFj2ksOtdDvtQ7auhq2vU_1c7A', 'https://lh3.googleusercontent.com/VpDqaHKBV-pcyRCaw1DarAcTxLVXGbBw9ENlmOsN7L_i7wYqqYXHiFnR7ytvOD2q-Q', 'https://lh3.googleusercontent.com/jbGRNk39BBAlrddmGuO0nPo5GqIRxQcuMWqp1urykyZLnNRaGgd7Kl3QsUrLjPlWCA', 'https://lh3.googleusercontent.com/3NlOkTKkjmp7UUWmd-TdLA0UpD70OnlERukc_bJG-nnWz9GTI5GaReZtRRBOUp5Yt5g', 'https://lh3.googleusercontent.com/H_HJSjZmtaBTAsyh5KMBtnEWluG9lJLZHFXl-emd_IYlJFJq3J7U_TCy59Fe4vHcCGRg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Apr 13, 2018', 'updated': 1590467675, 'version': '0.7.1.1-play', 'recentChanges': 'https://github.com/andOTP/andOTP/blob/master/CHANGELOG.md', 'recentChangesHTML': 'https://github.com/andOTP/andOTP/blob/master/CHANGELOG.md', 'comments': ['Wonderful OTP app. I did not fail once for me. Lightweight and simple.', "Would be better if I didn't have to enter my PIN a bajillion times in app after changing settings.", 'Great TOTP app, but please support barcode-chosen icons like FreeOTP does (but without the bugs). This feature consists of the "image" parameter in the barcode, and code to "download" that image and store the actual image along with the other data for the account.', "The absolute best time-based one-time password app available! It's open source, works with all OTP implementations, even Blizzard after jumping through a few hoops - which means freeing up separate apps that do the same job.", 'No extra permission. Only Camera and storage. No full network access, No view network connection, No wifi access, No receive data from internet and No SMS Verification feels it is 100% safe. Totally 100% uers control.', "Definitely one of the better TOTP apps. The backup functionality is also a very great feature. My only (small) wish is that the app have the feature to match the phone's dark mode (or light mode) theme instead of being manually set.", 'Extremely neat and easy-to-use app which shows a "countdown bar" for when the shown codes expire. Also great 1-tab copy function and backup. But ould be really nice being able to set fingerprint to unlock. You CAN just use the phone\'s unlock mechanism, however, it\'s awkward when you got iris unlock activated to easily check if you got notifs, but you don\'t wanna ACCIDENTALLY unlock the app by staring at your screen with it open', "Better than any other authentication app out there. The best part is that it lets you backup your accounts and it's open source.", 'This is a great open-source alternative to Google Auth and others. Sweet backup options and I like the dark theme and compact layout.', 'I\'m unable to set my encryption from password/pin to Android Keystore. I recieve "encryption key not loaded" and no further information to resolve. I don\'t want to have to use a password to view these, so unfortunately I can\'t seem to get the app to function correctly.', "Amazing features with great user interface. Easy to use and it's very user friendly.", 'Simple and does the job well. I like that it can let me backup the otp json file which is invaluable and saves me lot of time.', "Excellent TOTP app. It allows passwords to block the app and encrypt the database. You can also export your encrypted database for backup purposes. It's also open source. It has everything I need in an app of this type.", "Many times using otp i never felt so happy using your apps, great otp for android and i can custom icon otp of the web i've using 2fa secured. Keep it up bro!", 'Love this, easy to use, backups works perfectly to copy to another device. It would be nice to be able to import my own thumbnails for the image.', 'I just want one tiny feature... To use system default theme so it becomes dark (or black) at night when my system goes to dark mode.... Thanks Dev', 'Better than Authy and much better than Google authenticator! Open source, proper backup, password protected.', 'Love the app, its great, but is it possible to add fingerprint authentication instead of just pin/password?', 'Very happy that this app has backup and many security features', 'Easy to setup and use. A must for proper 2FA security.', 'Nice. Everything you want in an authenticator and free!', 'Extremely lightweight and does the job very well.', "This is the best free OTP app that I've ever used. It's a clear challenger to Yubico, but actually free.", 'Very nice app ..has no complication like others', 'Everything you need in a TOTP Authenticator app.', 'Thank you for this great app! Please do continue doing great. .', 'Overall app is good and secure. When you lost your device, how can you access to your secret keys when you install andOTP in new device? I found a chrome extension named "andOTP" is that the real one?', 'Open source and responsive developer - awesome Has a vast set of security features that will make your security team happy. Nice use of Android UI designs. Allows for grouping of codes (work, mail, social, as you wish), ability to add custom images to a code, and entering codes by scanning the 2D bar code or entering manually, with the ability to edit advanced options. Started using this after my phone died and I lost my Google Authenticator data. This is my go to OTP authenticator.', 'Perfect, exactly what I was looking for. I imported my Google Authenticator codes (required root) and voila. Far more secure and far more userfriendly.', "Phenomenal. Absolutely amazing. I have been first a Google Authenticator user, until the license went proprietary. Then I switched to FreeOTP. After preparing to switch phones, I realized that FreeOTP doesn't backup the entries. I was able to get a backup through adb and decrypt and extract the tokens.xml, to get my secrets. Then I discovered andOTP. I successfully rescanned all my secrets into andOTP.  I LOVE that I can hide entries by default. I LOVE that it supports PIN/Password locking. I LOVE that it has backups, and supports OpenPGP. Everything about this app is amazing.  My only gripe would be the red text on green background, which isn't very visible for red/green color blindness. But that's not worth taking away a star.  Phenomenal app.", "Fingerprint login: I'm using the workaround in the FAQ for now, but I hope you find the time to work on it for a proper implementation. Thank you.", 'Excellent app it has everything one would need and it is open source! Awesome job, for those looking for the fingerprint options, just look at the wiki and FAQ, I initially thought the feature was missing!', "I just spent the last 2 hours turning off Two Factor and then re-enabling because I got a new phone. In the future I'm so glad I will be able to switch devices and restore all of my accounts.  I wish you would add support for custom icons though. I have a couple of accounts like Mail Chimp, and Zoho and a couple of games I could use some icons for, to complete the aesthetic.", "Works like a charm on my OnePlus 6. I specifically wanted a local backup feature, and it works perfectly. No need to trust my credentials to the server of a mysterious company who didn't even update their Google Search company details (Authy) or hope I never lose, replace, or damage my phone (Google Auth). Also, dark theme! Yay!", "Thank you for providing a great alternative to other Authenticators! I read in one of your posts that you're rewriting the app from scratch? If so, is Webdav compatibility (Nextcloud/Owncloud) for backup destinations on the todo list with scheduled exports? Keep up the great work! I also agree with others that you should have a donation version for those that appreciate your efforts and are more than happy to send some funds your way.", "The app and its features are great. The thing I'd definitely change are its color combinations extremely hard to read, specially if users have color blindness (O tested that with a daltonic user, huge nightmare!) Another thing: where to help on translating the app to Spanish and French ?", "Wiped out! I just changed the authentication and label font size, and.. voilà ! They're gone. I don't know what or how it happened, but is there any way to get them back? I've never experienced this `bug` before since I installed it, and this is very very bad. Please help!", 'Recent convert from Authenticator Plus. Have some difficulties importing from there so I had to add my accounts manually. Outside of that, love the flexibility of adding accounts that provide 6-8 digits on any timer outside the default 6/30. Backup options are a major plus and it just works. Happy to be here!', "Best OTP out there, allow backup of key and plus app has no internet access at all compare to google/authy. You got to ask yourself, why does Google OTP need internet access? Is definitely not for backup, as it doesn't it support offline backup. Also it would nice to add custom logo/icons.", 'Works great. Better than Google authenticator and authy. Supports backups and restore of otp database. Thanks dev!'], 'appId': 'org.shadowice.flocke.andotp', 'url': 'https://play.google.com/store/apps/details?id=org.shadowice.flocke.andotp&hl=en&gl=us'}
