{'title': 'MoneyWallet - Expense Manager', 'description': '<b>WHAT IS IT?</b>\r\nMoneyWallet will help you keep track of your money.\r\nWith simple and intuitive graphics you can check the progress of expenses.\r\nUser interface in pure Material Design has been designed to be extremely customizable and\r\ncolored depending on the needs of the user. The ability to perform backups in the cloud will ensure\r\nyou to never lose your data.\r\n\r\n<b>FEATURES</b>\r\n• Material Design UI\r\n• Backup on Dropbox or Google Drive or your external SD card\r\n• Pin code, pattern or fingerprint (if supported by the device) unlock\r\n• Currency converter in real time (requires an internet connection to download updated data)\r\n• Ability to analyze more wallets thanks to the introduction of a "total wallet"\r\n• Great customization options thanks to the many icons and the ability to choose the colors of the theme\r\n• Ability to choose the color of inflow and outflow\r\n• Integrated calculator\r\n\r\n<b>COMPLETELY FREE AND OPEN SOURCE</b>\r\nThe application is now completely free, there are no more limitations on the number of wallets. The source code is available at https://github.com/AndreAle94/moneywallet under the GPL3 license.\r\n\r\n<b>CREDITS</b>\r\n• <u>Adam Lapinski</u> author of the awesome logo. Take a look here: http://www.yeti-designs.com.\r\n• <u>Freepik</u> source of first-start images\r\n• <u>RoundIcons</u> source of the internal icon-pack.', 'descriptionHTML': '<b>WHAT IS IT?</b><br>MoneyWallet will help you keep track of your money.<br>With simple and intuitive graphics you can check the progress of expenses.<br>User interface in pure Material Design has been designed to be extremely customizable and<br>colored depending on the needs of the user. The ability to perform backups in the cloud will ensure<br>you to never lose your data.<br><br><b>FEATURES</b><br>• Material Design UI<br>• Backup on Dropbox or Google Drive or your external SD card<br>• Pin code, pattern or fingerprint (if supported by the device) unlock<br>• Currency converter in real time (requires an internet connection to download updated data)<br>• Ability to analyze more wallets thanks to the introduction of a &quot;total wallet&quot;<br>• Great customization options thanks to the many icons and the ability to choose the colors of the theme<br>• Ability to choose the color of inflow and outflow<br>• Integrated calculator<br><br><b>COMPLETELY FREE AND OPEN SOURCE</b><br>The application is now completely free, there are no more limitations on the number of wallets. The source code is available at https://github.com/AndreAle94/moneywallet under the GPL3 license.<br><br><b>CREDITS</b><br>• <u>Adam Lapinski</u> author of the awesome logo. Take a look here: http://www.yeti-designs.com.<br>• <u>Freepik</u> source of first-start images<br>• <u>RoundIcons</u> source of the internal icon-pack.', 'summary': 'MoneyWallet is the best app to manage your finances whenever you want', 'summaryHTML': 'MoneyWallet is the best app to manage your finances whenever you want', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.49, 'ratings': 798, 'reviews': 381, 'histogram': [15, 7, 63, 191, 518], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '19M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'AndreAle', 'developerId': 'AndreAle', 'developerEmail': 'orionteamx@gmail.com', 'developerWebsite': 'https://github.com/AndreAle94/moneywallet', 'developerAddress': 'Milano, Lombardia, Italia', 'privacyPolicy': 'https://github.com/AndreAle94/moneywallet/blob/master/PRIVACY.md', 'developerInternalID': '7751983929837419141', 'genre': 'Finance', 'genreId': 'FINANCE', 'icon': 'https://lh3.googleusercontent.com/MNJnBPSefKzUnIiqEMHJN0XtsufbhY1l4EtXK1io3SZT3ujKioIuEqSRf-kc9x7aQy8', 'headerImage': 'https://lh3.googleusercontent.com/0M_OsY4EiX7oZ2Dycl9yKTR9u2AsArG_BaH2XAXufcQ5cnsu9_O4Ig-DXFAlPsce8A', 'screenshots': ['https://lh3.googleusercontent.com/LFThmyC4MsUtwKZR20UbjQyhEerpUDIoNqR667j7O7TjGEgk-o-g8vh0cMZBGXKChdA', 'https://lh3.googleusercontent.com/LoQkofRiB0c1FphaQy1Nagt7xLyzAjIqCuTMUCZfrGH60ZtPFqjhJ7qNzlvnPOIoJnEp', 'https://lh3.googleusercontent.com/lSVwHFezqhxb736qTlOS9WeRn_DJ3oXxo9EIamjDJJj7LzhL7i3XpuXhtNuAZ--Q7A', 'https://lh3.googleusercontent.com/NjiB2fvYWvNu-KX156Ml2OPjJp9PA4CPIshEMFxNvHkEuyVuHt2HRtD0H0xOxvAGDA', 'https://lh3.googleusercontent.com/_dttSr1Ym8jkbXD3NDcd1V6PCIjkyRlyE6Cwb4-saKcy2BEwzgqTWuesKX-_mjA8rcYE', 'https://lh3.googleusercontent.com/uxW6iUss9NrnxWJBDt-d8xK-pe7KJLhRuqd3VHuufGlxmmGqcelUlB0yIgkJa-tTgxk', 'https://lh3.googleusercontent.com/4Udsw7_5OmITqEmmTy2T8B8pnEspmK1znMOLl7uLhb3vEZ0CgLt-oUG7rWJ6WfS3kA', 'https://lh3.googleusercontent.com/wzhIaw2E0hzUqXqRn3mRXAb0v1OB1-f9iKBxpkNVEd_QcDL5OyvOC-wtAx8aknieYA', 'https://lh3.googleusercontent.com/hHk7thV0aKHDRCNEdDFfhdetD9slTnbn7g-Amq1fffF7wg2_wd8bWktbCaHEsawVoco', 'https://lh3.googleusercontent.com/iq0dLjgchgnSrJfNFCwN25PWGUurXJKdBUxGgPw9PmqdC21m5Zr7yUc-L4C4e9wFZCk', 'https://lh3.googleusercontent.com/CGflMvR2aQ5L0_r4Q6EI0P8_bLLddEXKBWyBvqBrnAeQLV8ism_TxQqSdoLfmeqfK14', 'https://lh3.googleusercontent.com/ViDrK0v_B9D37N4qijaII083nZekL93dZnDDbtOjO8maphnkveRZR2__wxUv6sYNcQ', 'https://lh3.googleusercontent.com/t9DeH6JnRzmvReOQUmqQBOthYe9EdHnO6E8aLWdGiYM_ba7rXy0GdLMtnPphlfxAAA', 'https://lh3.googleusercontent.com/_H9kQbPnn2SMFyue0vAF1OcjM4oIo6qo8dqHzFzfYk8rgbZiRzSdF6ehSKlWA0WFgqQ', 'https://lh3.googleusercontent.com/hV1hD9JVmzLzVdATQrLoHwdAlErXpG2_ASJzGR--_grW_C7hb73SjTBt7B-PjR_s8w'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 28, 2014', 'updated': 1578331776, 'version': '4.0.5.6', 'recentChanges': '* ability to sort wallets\r\n* ability to sort categories\r\n* manage custom currencies\r\n* minor bugfix', 'recentChangesHTML': '* ability to sort wallets<br>* ability to sort categories<br>* manage custom currencies<br>* minor bugfix', 'comments': ["I was a Money Manager user, migrated to this app because that app no longer works & I couldn't restore backups. Exported the data from there, & messed with the CSV files a while before I could get everything restored on this app. The import & export actually works, but it would be great if there is a simple tutorial telling the user about the formatting of the CSV, like it uses what columns, double quoted data, etc. I had to run Marco scrips to format my old data in order to make it work.", 'There cannot ever be a better money record keeping app then this. The UI is love. Its literally sexy!', 'This is a cool application. The UI is a little bad. I hope you will continue to work on the application ♥️ Create crowdin please', 'Good app helping me manage my expenses and everything', "Great app but can you add that we can see all transactions and recurring payments when the Total Wallet is selected? Also, the calender should have abview where you don't have to click on everu day individually to see the entries.", 'Best open source app to monitor and manage expenses.', "drive backup and restore is not that reliable. Sometimes doesn't show any backups, or just miss restoring most of the enteries.", 'Hidden gem of an app, amazing work', 'Please make an option of default activity on app startup.', "Amazing!! Edit! This app was soo good but the development was stopped for almost 2 years(mostly) i am soo happy that it's back on track", 'Nice App', 'Ottima app tra molte. Felice di vedere nuovamente degli sviluppi. Fix tempestive! Complimenti!', "It's great all the features I need are here but there are too many money terms so it takes me too much time to decide (1-2s is too long). How about adding the debt/credit within inflow/outflow yet still works the way it does? I use this a lot so to go back and forth to transactions is like.. Tsk... Very few other finance manager has the 'pay' debt/credit feature but there are more that are easier & faster to use without this feature.", 'Loved the app except the following : 1. I am a pro user but whenever i use the app offline it shows to upgrade. 2. Notification option does not work at all. 3. Put a search option in icon menu and a custom icon add option. 4. Please add a split option for a perticular transaction for which i have paid now but will recive the solit portion from others.', "It does everything I need! user experience could be improved/simplified. for example I would like to see current balance without having to swipe the left menu! anyway it's not a big deal. still getting 5 stars", "Almost the app I was looking for. Icons are too huge and it's a pain to scroll down again and again. Development was last more than a year ago. Ability to attach a contact with transactions missing. Calculator too big and fuzzy -- one hand operation is impossible.", "Great app. I'm really considering switching to this. However, it is lacking one thing I would really like to have in expense managers: transaction templates and matching widgets. I would like to be able to input daily transactions as quickly as possible and templates would really help with that.  I will buy the pro version as soon as this feature is added.  Some other less notable stuff I want to see: Widgets (Wallet Overviews, etc.), a persistent notification with a specific wallet's balance and a quick add button.", "My search for a functional expense manager with material design ends here. I really love it and upgraded to pro. However I'm not able to find the details pane with the ring chart shown in the preview above.", "It's great! But, I think that the whole thing with incomes and outcomes could have been more strict. You know, the difference had to be more clear. That's what I want! Everything else is perfect!", 'How exactly does saving work? and the converter keeps giving me rates of 1:100, regardless of what currencies I choose.', 'I really appreciate the design and simplicity of this app. However, the lack of an active sync makes it unusable for me. Being unable to share info among multiple devices and with my wife has forced me to look for alternatives.', "The only addition I'd like to see is allowing the user to pick custom category icons. I've got a couple that are really specific and there isn't an icon that matches them well enough.", 'One of the best app for money management, having all the tools needed and saving options also.Appearance of app also awesome and easy to use.Shows overall flowchart and graphical use of all money consumed. Best app keep this way and improve with other functions and surprise us with new features update.', "A modern design and alot of options give a perfect app with cheap price it's just perfect... I decreased the rating because money convert tool not working and there is no live sync between devices", 'Suggestion for 5 stars: 1) Option to not include Savings & Debt in total calculation & report. 2) Customizeable time period in all sections including transactions, reports etc 3) Average expenses for each category within a customized time period or at least monthly. 4) Everytime hit the button to add expense, calculator automatically appear. It will make adding expenses faster.  Everything else is awesome and is what i need in an expense manager app.', 'Really good app with a lot of control, would love the option to group overview and transactions different, for instance one as month and one as week, at the moment you can but it always resets itself!', "The export function doesn't work. The currency symbol doesn't go even after changing the setting either. Lovely custom options otherwise, would have been a great app but for the export not working", "I added debts and it's counted as inflow, to the point of appearing in my total balance... am I doing something wrong?", "The most important thing to me for an expenses app is that it should be easy and fast to put in new entries before I forget (isn't that the hardest part of financial discipline!?), especially for low value items without receipts. I can always add in details later. So please don't make it compulsory to insert payee & category before the entry can go in, and please please add a widget!! In any case, I already love this app so much I bought it. Thanks for the good(-looking!) work, ladies & gentlemen!!", 'Totally killer! Great app, cheap in app purchase, lots of customization, only one thing is missing. Android wear companion app! Being able to quickly add transactions with a wear device can be a a great addition.  Thanks for this amazing piece of software', "This app is really good. The only pitfall I've found is the broken currency converter.", 'Great app! Bought the paid version. Really nice material design. One feature it is missing is the ability to create transactions in another currency than the one set to a particular account.', 'Yes....finally i got what i want. debt/lend management with repayment tracking, full category customization and export data with cloud backup all in 1 app. i really wish the app could have an additional feature for payer and payee input', 'shame u only get one list on free', 'How to get rid of pounds symbol?  Needs subcategory and tags.  Location and picture screen hogging gimmicks.', "Even the free version doesn't have ad. And the pro one only cost you $1.2, a very acceptable price. Nice app", "Would be great if the icon selection screen could be sorted by tabs so we don't have to scroll so much. Anyway,  good job!", 'Grate app I use daily for my budget plan and goals. Very helpful! The only one I want is to get auto sync with my Gmail...', 'I used till now Expenses manager pro but this is way better. Easy to use and good option along with selective pictures for each category.', 'Outstanding balance in a wallet is not shown at every transaction. Time field of a transaction is missing. No update since a long time. Can we expect any update in the near future?'], 'appId': 'com.oriondev.moneywallet', 'url': 'https://play.google.com/store/apps/details?id=com.oriondev.moneywallet&hl=en&gl=us'}
