{'title': 'Todo Agenda', 'description': 'Todo Agenda is home screen widgets for your Android device. Each widget has its own settings and displays configured list of calendar events and tasks so that you can easily have a glimpse at your due, current and upcoming appointments.\r\n    Features:\r\n    * No advertising. Free and Open Source.\r\n    * Displays events from your calendars and task lists for the selected periods in the past and in the future.\r\n    * Automatically updates when you add/delete/modify an event. Or you may update the list instantly.\r\n    * Select only the calendars and task lists that you want to see in the widget.\r\n    * Create several widgets, if you need. Each widget has its own settings, including layouts, colors, filters, selected calendars and task lists.\r\n    * Customize background colors and transparency of different widget parts, black and white shading for texts.\r\n    * Scroll through the list of events. Use Go to Today button to return to today instantly.\r\n    * Customize the text size of the widget.\r\n    * Fully resizable widget with alternative layouts.\r\n    * Indicators for alerts and recurring events.\r\n    * Lock time zone when travelling to different time zones.\r\n    * Turn off Widget header, Day headers, event icons, Days from today, etc. and see only what you need.\r\n    * Hide duplicated events.\r\n    * Backup and restore settings, cloning widgets on the same or different devices.\r\n    * Android 4+ supported. Supports Android tablets.', 'descriptionHTML': 'Todo Agenda is home screen widgets for your Android device. Each widget has its own settings and displays configured list of calendar events and tasks so that you can easily have a glimpse at your due, current and upcoming appointments.<br>    Features:<br>    * No advertising. Free and Open Source.<br>    * Displays events from your calendars and task lists for the selected periods in the past and in the future.<br>    * Automatically updates when you add/delete/modify an event. Or you may update the list instantly.<br>    * Select only the calendars and task lists that you want to see in the widget.<br>    * Create several widgets, if you need. Each widget has its own settings, including layouts, colors, filters, selected calendars and task lists.<br>    * Customize background colors and transparency of different widget parts, black and white shading for texts.<br>    * Scroll through the list of events. Use Go to Today button to return to today instantly.<br>    * Customize the text size of the widget.<br>    * Fully resizable widget with alternative layouts.<br>    * Indicators for alerts and recurring events.<br>    * Lock time zone when travelling to different time zones.<br>    * Turn off Widget header, Day headers, event icons, Days from today, etc. and see only what you need.<br>    * Hide duplicated events.<br>    * Backup and restore settings, cloning widgets on the same or different devices.<br>    * Android 4+ supported. Supports Android tablets.', 'summary': 'Home screen widgets displaying events from selected calendars and task lists', 'summaryHTML': 'Home screen widgets displaying events from selected calendars and task lists', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.44, 'ratings': 413, 'reviews': 272, 'histogram': [37, 4, 20, 28, 322], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.4M', 'androidVersion': '7.0', 'androidVersionText': '7.0 and up', 'developer': 'Yuri Volkov (yvolk)', 'developerId': 'Yuri+Volkov+(yvolk)', 'developerEmail': 'calendar.widget.android@gmail.com', 'developerWebsite': 'https://github.com/andstatus/todoagenda#readme', 'developerAddress': 'Moscow, Russia', 'privacyPolicy': 'https://github.com/andstatus/todoagenda/wiki/Privacy-Policy', 'developerInternalID': '6600714490203152019', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/fyDGmbMXousr_TQiwfw0Mzl8DWyGLzIxd3h-6SliFJPEwk0hwqNfqBs1SjyndYY6xA', 'headerImage': 'https://lh3.googleusercontent.com/zxgQ8jJv1ZPxlviDexErPFL4kLUdpZIKJ6Gys5iAEhmQYA4momm9Uz0CB5JQ7dFRHw', 'screenshots': ['https://lh3.googleusercontent.com/LJuwnmLE_NlXV8_svaXPYgPrlhGzofUs1rZdTcnz2oAeE7ScIPf-7FGoTufJvD66', 'https://lh3.googleusercontent.com/2KlH2K9DnIUXI87GVjvuntU_zVsn1LP_WakU0GY1ZkJkJAf8h1IYmjiJxPg4_eoS-nM', 'https://lh3.googleusercontent.com/NpVlrCBICELiz7Ee0OGSVg3UbxYdHE4IVPKG0IFyO46vJzI9-6N0C21U1kCLPP159D4', 'https://lh3.googleusercontent.com/3clODSlGCgNDsFptIERU_Z7hVexww8PyPE0nAtJaKi9iLVtShsE4ctHXsidVZ9c_eGJq', 'https://lh3.googleusercontent.com/LDWpP8ut1Wm6U6qdS9QTnnUGYjU0fx1ac779sgk4_QQu_9qkqvQpeyvhXUSCdNtPLw27', 'https://lh3.googleusercontent.com/ugXPvMv9pGpExEYmfP3Ha5J7tyNLLl6PgzcAzZFOvdfJC1a9oS9FxkyQPqOVQ2p4mw', 'https://lh3.googleusercontent.com/puRXcLuoVmoNSSEm-ajQMfX6NLmGRPgknsexWy8MNfXAAxka-ByomtdHEj35qOZO108', 'https://lh3.googleusercontent.com/dMIOvkkqFblF8_Up6bhG35dBRjld3gBsas1UMj8iBYcDIGfo-H0ObAYk8cMWhiMphjU', 'https://lh3.googleusercontent.com/SZgiYlslxpx4dLg4AnhI9EwpRaMAFmo4A8DFOB0aPKYL8AE49f8mSaWx2xz9CVJrZ00'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 23, 2018', 'updated': 1588134353, 'version': '4.0.13-675', 'recentChanges': '4.0.13 Translations updated', 'recentChangesHTML': '4.0.13 Translations updated', 'comments': ["Good simple widget BUT the buttons on the widget don't work. I can't add (+), open calendar, go to settings or tap directly on an event to open it. I used to be able to do it on the old name/version. Using a Xiaomi Redmi Note 8 Pro. Still the best looking widget, but not as useful as it could be.", 'I really like this widget! One suggestion: Have a + button on each day header to create an event on that day. Otherwise... very happy :-)', "Just started using this today, but so far it's everything I've been looking for in a customizable calendar widget and more! Really looking forward to using this on a daily basis.", 'Just purchased a new tablet and now realizing this app is a newer version. I am now seeing a number underneath some of my calendar dates. For the life of me I cannot figure how turn that off or if is possible?', 'Perfect! Everything is customizable. Love it.', "Sometimes the widget has a white field on the top-shelf, which obscures a couple of day's events. Other than an app update, is there any way to stop this? The colors & shading had been reset! I suspect an app update caused it, because it was fine for several days, and then the colors changed to white & light for background & text. I reset them. If it happens again, I'll contact you.", 'Awesome super-customizable any-size including 1x1 calendar widget', 'This is a great widget! I keep it on my home page and prefer its customization to Samsung\'s built-in Calendar widget. Quick developer response also! Thank you for explaining how to open the widget\'s "Settings" after the user selects "Hidden" layout header.', 'Being using this for years, very reliable and regularly updated, thank you for the hard work', 'Like a lot of others says - with the new version, refresh doesnt work any more. So, the app is useless, if you cant get new events on the screen. I reinstalled it, but still the same problem.', 'Excellent! Just what I needed, and open source as well😍', 'The widget configuration does exactly what I was looking for.', "Latest update 25/2 changed all my date style settings, but once I'd got them back to how I like it, all's good.", "Buggy on latest Android release... I did try all of that. The widget refresh no longer works. Only the add new widget button works now. So even at 11pm I see meetings from 8am that day now... Which it didn't used to do. Used to be I could hit the refresh circle and past apps would be hidden. Update 3/7/2020...now with the 3/1/2020 update it crashes all the time even in the background and is 100% unusable even after u installing and reinstalling.", "The old widget almost 90% of times would automatically refresh when I changed a calendar entry. But this new one does not. PLS FIX THIS. The widget MUST refresh when a calendar entry is modified. I am re-installing the old widget as it does not have this MAJOR issue. I think its not android issue, but app's issue. Pls check and fix.", 'This is a great app, I have used this since its first release. It really is the best out there. One point for development though, it does not seem to acknowledge shared google Calendars so using it for a family agenda is not great. For a personal agenda though, first class.', 'Awesome - running two separate widgets from two Gmail accounts on the same device - awesome. Really like the transparent background in the widgets.', 'Widget stopped working. No longer refreshes its state. I have gone through all steps with uninstalling/rebooting/installing and still nothing happens. I have tried to add it again to the home screen, but no matter what I choose in options the layout stays default.', 'Hi, is it possible to have the day header to the left of the event box, so that multiple events on the same day can be seen under one "header" to the left of it? This will save some vertical real estate and push more events in the widget.', 'Hoping to get a widget to display my daily calendar, but this did not synch with Google calendar, or even offer me the option. When I went into settings: select calendar, nothing at all is displayed. No option to use Google calendar. Uninstalled.', "This used to be my goto calendar widget. worked great for years across three phones. I loved the linear vertical layout. now it suddenly stopped syncing with google calendar.all the sync connection are fine. google calendar app works fine. the only thing that worked was to wipe the data and cache, uninstall then reboot. then reinstall and find it hadn't wiped the data at all. exact same custom setting I had before. it worked and synced for about a week after that and then stopped again. when it can't be depended on to sync what use is it? I missed a very important meeting because it wouldn't sync. I'm not going to get that contract back. use to be great, what happened?", 'I have a Pixel 2 XL, and my last phone was a Pixel XL. Ever since the Pixel Launcher made the "at a glance" widget permanent (which shows the current date in large letters), I\'ve been annoyed with the default Google Calendar widget because it ALSO shows the current date, and you can\'t shut it off. So I\'m forced to have current date twice on my home screen in big letters. I\'ve tried MANY other calendar widgets, and the only one which let you remove the current date heading was Business Calendar, which is a nice widget, but clicking on a task takes you to Business Calendar instead of Google Calendar! So that\'s annoying, since I just want to use Google Calendar but I want a widget that doesn\'t look stupid with the stock Pixel Launcher. I was about to write my own but I decided to try this first and it\'s exactly what I was looking for. It\'s nice and simple, and I just have to uncheck the "Show widget header" box to make it look right on my home screen under the "at a glance" widget. Thanks!', 'very clean looking calendar widget. I wish though it had a preview of the appearance changes right in the app. currently you have to switch back and forth. the app "your calendar widget" does it better, though costs more. another small nitpick is that Android does not recognize that the F-Droid and play store version of this app are the same one. anyways if there is a way to throw you a donation let me know!', "Excellent widget! The best of it's kind I've used so far. Keep up the good work! Some improvement possibilities: 1. It sometimes does not update the date when the date changes (new day). Need to refresh manually to do that by accessing the settings and save it. 2. There are a lots of customization options, please provide an option to save the sattings externally, so that when the phone is reset, the settings could be reloaded.", 'I\'m using this app for years now, started when it was called Calendar Widget - glad it returned to Store. I have one issue though... past events are not disappearing automatically from the widget however they are disabled in Settings. I need to scroll down in the list and scroll up again to have them gone (basically it\'s not refreshing automatically). Can you fix this? 19/Oct: after today\'s update, if I check "Hide Duplicates", the app constantly crashes. If unchecked, it\'s okay. Samsung S9+', "Love this app, have been using for a couple years now. Being able to see all calendar appointments on the homescreen is a must for me, stops me from being late or missing them entirely as I am quite forgetful. My only question is can I link this to Google Tasks as well? When I go to Calendars and Tasks in the settings it only shows my calendars, I guess I'm missing something or have misunderstood the description?", 'Love this Calendar Widget!!! Very easy to use. I love being able to have multiply widgets with different calendars on my phone. My only wish or suggestion is being able to put the calendar name in the header in place of the date. That would be so cool. Correction.... I meant Widgit name in the header in place of the date.', "It's simple, clean, good-looking, costomizable. Glad it's back again! The best todo widget I've been using so far. I got some adives... It'd nice if the color bar can be thiner. And the event in the upcoming month can be display in one section. Check 'Your Calendar Widget' made by Manuel Shenavai.", "I dropped my old phone earlier this week, and one of the most annoying parts was trying to remember what the agenda widget I liked was. This was it. What an odd experience! I don't know what it is about this particular widget that makes it so important to me, but it's a foundational part of my daily life.", "The best calendar widget that exists, I've used it for years, since the days it was called Calendar Widget. Simple, intuitive, with attractive, configurable presentation. Only one permission. Now has a 'goto today' button in the header. Disappointed that the event time is now not the same text size or aligned vertically with the event text, makes it look messy, hence 4 instead of 5 star.", 'Amazing app, and I would be happier if this app contained a little independent built-in alarm separate from the system. Thank you for your effort, update : the independent alarm would be much helpful and quicker, see app "Calendar Widget: month + agenda" in Google store', 'The widget itself is useful and pretty clean. I just can\'t give 5 starts due the fact that, in my Xiaomi MI8, it stops loading events and show the message: "no events". I need to remove the widget and put it again to start to working again. Can you please fix it?', 'The app works flawlessly as described, but please add more options to choose font Colors, more background Colors, and also the option to keep only the next event on display rather than all the remaining ones in the list. Make it little less clunky', 'Was great for a long time. Few days ago just stoped to respond on touch (scroll was ok??). Reinstalled, but without any improvement.', 'Excellent widget! I love the clean, elegant, minimalist design and transparent background and a ton of configuration options. I only wish you would also create an e-mail widget like this!', 'I love the ability to customize this widget, it is great. I wish it had a current time bar across the widget so I can quickly glance to see what all of my calendars events are at the moment, ie: what class are my kids in, or if my husband in a meeting.', "I've been using this calendar widget for a long time. It can take a few tries to get it set up just the way you want it, but it's still the best one I've come across. The latest update has a bug where the text size randomly increases.", 'The "cleanest" calendar widget available, great results with dark backgrounds, a lot of customization options (and I would like to have more: user defined date format, in example) and smart options. And it\'s free and open source, by the way.', 'Excellent, good looking, very configurable agenda widget. The first widget I add to a new phone, and one I use daily.', 'Excellent calendar widget. Glad its back in the store. Would like to see option to change colors for specific calendars. Currently you are stuck with the colors assigned. Otherwise love it!'], 'appId': 'org.andstatus.todoagenda', 'url': 'https://play.google.com/store/apps/details?id=org.andstatus.todoagenda&hl=en&gl=us'}
