{'title': 'Tram Hunter', 'description': "The original android client to Yarra Trams tram TRACKER速 service for real-time location of Melbourne trams, Open Source under the GPLv3 license.\r\n\r\nFollow @tram_hunter on Twitter for updates.\r\n\r\nIf you're having problems or experiencing 'force closed' errors, please file an issue on the Github project page, or email me.", 'descriptionHTML': 'The original android client to Yarra Trams tram TRACKER速 service for real-time location of Melbourne trams, Open Source under the GPLv3 license.<br><br>Follow @tram_hunter on Twitter for updates.<br><br>If you&#39;re having problems or experiencing &#39;force closed&#39; errors, please file an issue on the Github project page, or email me.', 'summary': 'Android client to tramTRACKER速 for real-time location of Melbourne trams.', 'summaryHTML': 'Android client to tramTRACKER速 for real-time location of Melbourne trams.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.42, 'ratings': 1392, 'reviews': 553, 'histogram': [13, 41, 167, 292, 876], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '4.0M', 'androidVersion': '2.3', 'androidVersionText': '2.3 and up', 'developer': 'Andy Botting', 'developerId': 'Andy+Botting', 'developerEmail': 'tramhunter@andybotting.com', 'developerWebsite': 'http://tramhunter.andybotting.com', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5561181762929502595', 'genre': 'Travel & Local', 'genreId': 'TRAVEL_AND_LOCAL', 'icon': 'https://lh3.googleusercontent.com/MTlRKT2dw9Ld7O35mX7EB40F_KsaQXRKPZh4h5k3g6EcYZirT6viROcWYBXp9I8FIA', 'headerImage': 'https://lh3.googleusercontent.com/VI98maSOqQUnZ_EzdOv_2noPgTZZTvTJnRx7pykrN10MuH9zdxktnjBVIDapz2TEOlU', 'screenshots': ['https://lh3.googleusercontent.com/F5xtaEkUO152W0vJMFjeBV6oI_lcuNRuiaAZkI1SEUu06EvCx9Llm5WoRy2EWU5FBPM', 'https://lh3.googleusercontent.com/OwhOp-0xA0U7tyf9hI9OkCHFmPFPzJL2VnibCYbAklFad2PUA2Pkg91KgOs8Ej4rwQ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 4, 2010', 'updated': 1500980826, 'version': '1.7', 'recentChanges': 'Finally, a new release. Thanks to @rockgecko-dev for much of the API update work!\r\n\r\n- Updated DB to include new route changes (e.g. Route 58)\r\n- Updated Network Map\r\n- Update to newer Android API\r\n- Update Google Maps to API v2', 'recentChangesHTML': 'Finally, a new release. Thanks to @rockgecko-dev for much of the API update work!<br><br>- Updated DB to include new route changes (e.g. Route 58)<br>- Updated Network Map<br>- Update to newer Android API<br>- Update Google Maps to API v2', 'comments': ['How good is this app? Well this is apparently used by many tram staff instead of the yarra trams generic bloated adware. It doesn\'t trouble the user, runs in real time. no endless "are you sure". Its a GREAT app.', 'Perfect in every way', "Since the last update the search stop option has been replaced by search vehicle number. Why the heck would I want to search vehicle numbers, if I knew the vehicle number I'd already be on the vehicle. At any rate, the search function can't connect to the server so I can't test whether it still searches for stops. Please fix.", 'Simple, clean and functional: all things the official Yarra Trams app is \nnot. One of my oldest installed apps and going nowhere.', 'Location of nearby stops no longer works', "Been 30 years since I caught a tram. What I want is. I have a given tram stop Nmbr. I need to get off one stop before that. What's that stop No? Doesn't show on map. Now I have GPS enabled, so show me nearest boarding point. Nope. Can't do that either on this app.", "Just the best tool for anyone who has to put up with Melbourne's woeful tram network. Makes it much easier to tolerate. Don't wait for a tram in the rain without it!", "I've used Tram Hunter for several years and found it great. However recently it has often been displaying errors with retrieving data. Don't know if this is a problem with the app or with Yarra trams / PTV data feed", 'Early adopters of Android only had this app to use for years before yarra trams finally made an android port of their app. This one works just as well and is less cluttered.', 'Right now the stops in Melbourne CBD are closed but your app shows trams are coming!!!!', 'Loads, functions and delivers information quicker and more efficiently than the "official app" which is bloated by comparison and slow.  Best tram app available.', "Easy to use.  Gives me the next few trams, which the other app doesn't.", 'Solid app. Better than ptv/tram tracker. Need to see the quotes again.', 'It would be good if you could automatically show the mins until departure for your favourite stops on the startup screen', "I've used this for a very long time and have not had any issues whatsoever!", "I've not seen the addition of the NEW Route 58 replacing the former Route 8?", 'I now have Train Trapper and this.. Wonderful.. :D', 'Please update with new tram routes. Some tram routes have merged.', 'Needs updating for the new route 58 tram', 'So easy to use', 'Better than the official app.', 'So good!', 'Very accurate.   Straight forward. No nonsense', 'Love it, works great.', 'The best', 'Simple and work well', 'Much better than "TramTracker"!', 'great app!', 'Handy and simple', 'Must have for Melbournians!  New JSON API option seems to have resolved performance issues, great return to form... Lucky this got fixed, none of the other tram apps were ever really any good. :)', 'Would be so much easier if there was a live map (not just a network map) with GPS positioning and public transport icons. Other versions have this feature but lack the easy bookmarking ability.', '.very fast. Very professional software. After updated, it does not work any more. I uninstalled your app and give you one star.', 'You can see ALL coming trams immediately in chronological order and you can manage your favourite list very easily. Great job! But it would be even better if you could group your favourites like in tramTRACKER', "Pretty good, but sometimes it'll say a tram is a minute away for 10 minutes until it actually shows up", "We need this for Melbourne's buses as well. Unlike the trams, buses tend to go AWOL and one waits 30 mins for the next one. These real time trackers tend to keep the drivers honest.", "The app is only showing me now or next day services, and it's 10am! No help...", 'My preferred tram app that has got better and better. Simple and easy to use. Love it.', 'Please please please bring back the quotes.  They made waiting for the tram bearable', 'By a top guy.', 'Simple and awesome.'], 'appId': 'com.andybotting.tramhunter', 'url': 'https://play.google.com/store/apps/details?id=com.andybotting.tramhunter&hl=en&gl=us'}
