{'title': 'Torchie - Volume Button Torch', 'description': '<font color="#27ae60">Turn on/off super bright flashlight / LED / torch on your phone instantly by holding both volume buttons / keys together! It\'s quick, fast, innovative. It works in screen on, lock screen and screen off (when enabled from settings). Just works anytime! It makes you feel that you have a handy conventional battery operated torch with physical hardware button access! it\'s tiny, small, free and runs silently as a SERVICE. Absolutely no root required!</font>\r\n\r\n<b>This app uses Accessibility services<b>\r\nTorchie requires a service to run in background to intercept PHYSICAL VOLUME BUTTON KEY presses. Since a normal \'Service\' cannot intercept Hardware Key presses, an \'Accessibility Service\' is needed for this purpose. It does not do anything apart from intercepting Volume Key presses! I promise!\r\n\r\n<b>TORCHIE IS OPEN SOURCE NOW!</b> \r\nGet the full source code here : https://github.com/anselm94/Torchie-Android \r\n\r\n<font color="#8e44ad"><b>FEATURES:</b>\r\n★ Turn on/off torch / flashlight / LED just by holding volume Buttons / keys together\r\n★ Works in screen on, lock screen, even while screen off (when enabled from Settings)\r\n★ Open Source (Source code: https://github.com/anselm94/Torchie-Android)\r\n★ Optimized (zero) Battery usage (unless enabled in screen off via settings)\r\n★ Standalone torch / flashlight / LED app too!\r\n★ Easy, innovative and handy Material Design UI\r\n★ Very light, tiny and small (~1 MB)\r\n★ Super fast and reliable\r\n★ Brightest guaranteed\r\n★ Innovative, simple & handy\r\n★ No privacy / security issues\r\n★ No Root required\r\n★ No framework / plugin required\r\n★ No Ads and No spyware\r\n★ Completely free and ever will be \r\n❤ Donation is available as In-App purchase</font>\r\n\r\n<b>ABOUT THE PERMISSION</b>\r\n<i>"...Can observe the text you type and actions you do..."</i>\r\nAlas! It\'s threatening isn\'t it? Torchie needs permission to listen to your physical hardware (volume Button) Key presses only.\r\nHowever if a phone has a physical keyboard, it is possible to intercept every key press (including Passwords etc). But, recent Android phones (except Blackberry Priv) have only three hardware physical keys i.e. one power button and two volume buttons. Actually, It is <font color="#c0392b">Android\'s flaw</font> showing this buggy permission to you!\r\n\r\nhttps://github.com/anselm94/Torchie-Android/wiki/FAQs\r\n\r\nAlso, Torchie does not have \'Internet Permission\'. So it\'s impossible to send anything to anyone!\r\n\r\nTorchie\'s source code is available here https://github.com/anselm94/Torchie-Android. You can go through every line of code!\r\n\r\n<i>Give a second thought please before giving NEGATIVE REVIEWS</i>\r\n\r\nWe aren\'t a company. We are brothers. We have no reason to collect anything from you! We made Torchie out of passion to make something innovative. So, If you find Torchie useful, please <b>donate</b> to support us! It\'ll greatly help us! :)\r\nhttps://torchieapp.wordpress.com/donate\r\n\r\n\r\n<b>NOTE:</b> \r\n<i>1. For Android 4.0.3 ICS, 4.1 JB, 4.2 JB users ONLY</i>\r\nFlashlight / torch / LED may turn on if you swipe to change volume in volume Panel. (<b>Tip:</b> Disable for screen on) \r\n<i>2. Screen off will not work by default</i>\r\nTorchie functionality is disabled by default in screen off, to prevent battery drain. Using in lock screen will not cause/accelerate battery drain. Advice is that using in lock screen is handy\r\nLearn more: https://torchieapp.wordpress.com/help \r\n\r\n\r\n<b>PERMISSIONS EXPLAINED:</b>\r\n1. In-app purchases\r\n Donate us conveniently from within the app.\r\n2. Camera \r\n Camera and flash are treated as same unit till Android version 6.0 (Marshmallow)\r\n3. Bind to an accessibility service\r\n To detect your hardware physical volume key presses\r\n4. Prevent device from sleeping\r\n Needed only when enabled for screen off\r\n5. Control flashlight\r\n6. Control vibration\r\n\r\n<b>Having any issues?</b>\r\nHelp & FAQ @ https://github.com/anselm94/Torchie-Android/wiki\r\nOpen a issue @ https://github.com/anselm94/Torchie-Android/issues\r\nContact Us  @ https://torchieapp.wordpress.com/contact</b></b>', 'descriptionHTML': '<font color="#27ae60">Turn on/off super bright flashlight / LED / torch on your phone instantly by holding both volume buttons / keys together! It&#39;s quick, fast, innovative. It works in screen on, lock screen and screen off (when enabled from settings). Just works anytime! It makes you feel that you have a handy conventional battery operated torch with physical hardware button access! it&#39;s tiny, small, free and runs silently as a SERVICE. Absolutely no root required!</font><br><br><b>This app uses Accessibility services<b><br>Torchie requires a service to run in background to intercept PHYSICAL VOLUME BUTTON KEY presses. Since a normal &#39;Service&#39; cannot intercept Hardware Key presses, an &#39;Accessibility Service&#39; is needed for this purpose. It does not do anything apart from intercepting Volume Key presses! I promise!<br><br><b>TORCHIE IS OPEN SOURCE NOW!</b> <br>Get the full source code here : https://github.com/anselm94/Torchie-Android <br><br><font color="#8e44ad"><b>FEATURES:</b><br>★ Turn on/off torch / flashlight / LED just by holding volume Buttons / keys together<br>★ Works in screen on, lock screen, even while screen off (when enabled from Settings)<br>★ Open Source (Source code: https://github.com/anselm94/Torchie-Android)<br>★ Optimized (zero) Battery usage (unless enabled in screen off via settings)<br>★ Standalone torch / flashlight / LED app too!<br>★ Easy, innovative and handy Material Design UI<br>★ Very light, tiny and small (~1 MB)<br>★ Super fast and reliable<br>★ Brightest guaranteed<br>★ Innovative, simple &amp; handy<br>★ No privacy / security issues<br>★ No Root required<br>★ No framework / plugin required<br>★ No Ads and No spyware<br>★ Completely free and ever will be <br>❤ Donation is available as In-App purchase</font><br><br><b>ABOUT THE PERMISSION</b><br><i>&quot;...Can observe the text you type and actions you do...&quot;</i><br>Alas! It&#39;s threatening isn&#39;t it? Torchie needs permission to listen to your physical hardware (volume Button) Key presses only.<br>However if a phone has a physical keyboard, it is possible to intercept every key press (including Passwords etc). But, recent Android phones (except Blackberry Priv) have only three hardware physical keys i.e. one power button and two volume buttons. Actually, It is <font color="#c0392b">Android&#39;s flaw</font> showing this buggy permission to you!<br><br>https://github.com/anselm94/Torchie-Android/wiki/FAQs<br><br>Also, Torchie does not have &#39;Internet Permission&#39;. So it&#39;s impossible to send anything to anyone!<br><br>Torchie&#39;s source code is available here https://github.com/anselm94/Torchie-Android. You can go through every line of code!<br><br><i>Give a second thought please before giving NEGATIVE REVIEWS</i><br><br>We aren&#39;t a company. We are brothers. We have no reason to collect anything from you! We made Torchie out of passion to make something innovative. So, If you find Torchie useful, please <b>donate</b> to support us! It&#39;ll greatly help us! :)<br>https://torchieapp.wordpress.com/donate<br><br><br><b>NOTE:</b> <br><i>1. For Android 4.0.3 ICS, 4.1 JB, 4.2 JB users ONLY</i><br>Flashlight / torch / LED may turn on if you swipe to change volume in volume Panel. (<b>Tip:</b> Disable for screen on) <br><i>2. Screen off will not work by default</i><br>Torchie functionality is disabled by default in screen off, to prevent battery drain. Using in lock screen will not cause/accelerate battery drain. Advice is that using in lock screen is handy<br>Learn more: https://torchieapp.wordpress.com/help <br><br><br><b>PERMISSIONS EXPLAINED:</b><br>1. In-app purchases<br> Donate us conveniently from within the app.<br>2. Camera <br> Camera and flash are treated as same unit till Android version 6.0 (Marshmallow)<br>3. Bind to an accessibility service<br> To detect your hardware physical volume key presses<br>4. Prevent device from sleeping<br> Needed only when enabled for screen off<br>5. Control flashlight<br>6. Control vibration<br><br><b>Having any issues?</b><br>Help &amp; FAQ @ https://github.com/anselm94/Torchie-Android/wiki<br>Open a issue @ https://github.com/anselm94/Torchie-Android/issues<br>Contact Us  @ https://torchieapp.wordpress.com/contact</b></b>', 'summary': 'Innovative physical hardware button key for flashlight. No Root. Open Source!', 'summaryHTML': 'Innovative physical hardware button key for flashlight. No Root. Open Source!', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.6779027, 'ratings': 2685, 'reviews': 1235, 'histogram': [613, 160, 231, 150, 1528], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '1.3M', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'Anselm and Anselm', 'developerId': '8665847201884714790', 'developerEmail': 'hello@anselm.in', 'developerWebsite': 'http://torchieapp.wordpress.com', 'developerAddress': 'India', 'privacyPolicy': 'https://torchieapp.wordpress.com/privacy-policy/', 'developerInternalID': '8665847201884714790', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/P7Ezb0agm_YOPB4U9tQ4gQ6Bp4qLly8qFgW-akLmss0gx9s_0NZ56wo5zdjK4o59Wow', 'headerImage': 'https://lh3.googleusercontent.com/zfS-h_oM2BXKLKzpaTLWktei9LTYYdubxRvmwc166OHkC3jDc9PKTfcF01kCJv4n-D4', 'screenshots': ['https://lh3.googleusercontent.com/unfORIEHkLyLKV0EQfpgPSlWwmCfnN7di2K6ZglvK0w9OvTuSnLVjZJdHxoHkrunKR3k', 'https://lh3.googleusercontent.com/glF6wkZGG3X0kpH_ptVWBhJkISaJCJlYDz3faN3Pmn0nlA-_xsOoDzG7VQSP0saZBwAm', 'https://lh3.googleusercontent.com/bSzF7A5_clFyhvOqeuaqIFaZRUp4g_--6MWe95etlvI4lo863Bx5G1YQZ8y0ghIUsQ', 'https://lh3.googleusercontent.com/8N66jhaU19Vrok2olanVRgeyBCvRAOuibK9-LtvGeKHnkzyFd35DyNfKlEsG3axCrcg', 'https://lh3.googleusercontent.com/813bt4ahpi3y1A8xmPA98opl7babIQytAWyjdAcVHAa03IVL79kxoVeONg1SXmLbNA'], 'video': 'https://www.youtube.com/embed/v3RLzxn8u8s?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/v3RLzxn8u8s/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 11, 2015', 'updated': 1559922107, 'version': '3.2.1', 'recentChanges': '* [FIX] Screen Off mode not working on devices running Android 9.0 Pie\r\n* [FIX] Removed in-app language change settings\r\n* [FIX] Few settings like Proximity Sense not getting persisted\r\n* [FIX] Other fixes & improvements', 'recentChangesHTML': '* [FIX] Screen Off mode not working on devices running Android 9.0 Pie<br>* [FIX] Removed in-app language change settings<br>* [FIX] Few settings like Proximity Sense not getting persisted<br>* [FIX] Other fixes &amp; improvements', 'comments': ["Giving 3 stars for now to be polite, but the app doesn't appear to work for me. In lock screen, I can get the app to turn on, but flashlight doesn't turn on. When screen is off, I get no response. Accessibility has been turned on. Not an Android expert, not sure what else to do. I've followed the provided instructions, I believe.", "Please fix for note10+ 5g? Used this app daily for years, Galaxy Note 6,7,8 and 9 all worked like magic. Can't get it to function on note 10 but still works great on old devices s8 for certain, yet I see no update in like a year... So rip? Or are devs still there?", 'It does what it says. Most of the times. Sometimes it wont react. Then you have to turn on screen and retry. Extremely useful. I just wish it would be more reliable', 'Ironically this is only working with screen off on my LG V60. If screen is on at all, volume buttons will not toggle torch at all (even locked on the lock screen). Works perfectly when screen is off (after turning on accessibility service of course)', 'It just work flawlessly, im running android 10 GSI. And to be honest, i enjoy the use of both volume keys instead of "hold-power-button" to use the torch when screen is off, havnt had it miss fire once compared to "hold-power-button" which miss fired once or twice everyday.', "At first it seems like you'll never use it, and you sometimes accidentally activate it, however it is Handy when you need it.", "It's a great app. You need to advertise it for more downloads. It is very useful and easy method app.", 'Exactly what I was looking for! Moving from Samsung, I had a Bixby button shortcut to toggle the flashlight and this is a perfect replacement.', "Great another thing on my s9 phone that doesn't work. All I want in 2020 is an easy way to turn on a flashlight when needed. Is that too much to ask Samsung? Instead we waste our time looking for solutions. Just make phones with features we can use.", 'Good , but it must work to holding volume key up or down , holding volume up and down is horrible job 👎', "I've used this app happily on many Android devices. However, when I installed it on my Nokia 6.1 (Android 9), I discovered that it won't function with the screen on and the phone unlocked. It still works when the screen is off, and on the lock screen, but not when the device is unlocked. Maybe the recent fix for Android 9 devices has something to do with this glitch? I look forward to seeing this issue get fixed, which would bump my review to five stars because otherwise this app rocks!", "Isn't quite ready for Android 10. After you assign it to the power keys, you press both keys together instantly and let go and it works. That's where it starts having oddities. It could be a feature on my phone, but pressing both vol keys together mutes the volunteer if the phone, so using this turns media down. Annoying but whatever Then every time you click up vol it toggles light off and on. Just a little too weird to be useful. Easier to unlock phone and drag top drawer down on my phone.", "This is an awesome application. Thank you for the hard work. Can you add a setting that let's you turn on the flashlight immediately when you launch the app? Then turns it off if you launch it and the flashlight is on already? I am thinking this will make a great toggle in addition to using the volume buttons.", "It's unreliable on the Samsung Galaxy J7 2017 (EU). It only works on the lockscreen and barely on the home screen. UPDATE: I managed to get it working with the phone unlocked: Press the volume up button and then right after, the volume down. Though, it is still kinda buggy and it doesn't work with a turned off screen.", "It works perfectly when my phone is off. A little finicky when it's on for some reason, but still easily deserving of 5 stars.", "I have been using this for almost a year now and a few days ago I factory reset my phone because it had a few issues. Those few days when this wasn't installed were so painful. I never realised how much I needed this till I didn't have it. Great app", "Instantaneous torchlight Does exactly what it says on the tin and it's there when you need it. Permissions can be denied and background data limited to reduce battery consumption etc.", "Of the many hardware button activated flashlight apps I've tried, this is the best.", 'Amazing but needs have the feature auto restart after restart or reboot', "It's pretty hard to press both volume buttons at the same time. I would like if I could press one volume Button for long to turn on the light... (And maybe make that only work when there is no music playing) But great wort still! :)", 'I like the idea and if it worked properly I would definitely use it up the wazoo. But right now it only works at the lock screen. I cant seem to get it to work with the screen off or with the phone unlocked.', 'Excellent app. Been using it for years and have been waiting for years before that for somebody build this exact functionality. Thanks heaps. Great developer too, promptly responded to an update for android Pie and now works as well as expected!!!', "Doesn't seem to work with my Pixel 3XL. When I hit the volume buttons, the light does turn on but then the volume increases to the max and the light won't go back off by pressing the buttons again. I assume this is an issue with the new OS but idk for sure.", "It works, and quickly became an essential feature of my phone. Only problem is that it doesn't work if the display is off, unless you choose to disable 'volume up' and 'volume down' when the display is off.", 'Does not work on my LG phone as the volume buttons pressed simultaneously starts Capture+ by default. Many menus in the app cause it to crash when opened. May work for others, but not for me.', 'Great app... Until the latest android update for the Note series. It quit working. Check off accessibility settings just to be sure, but. nothing.', 'Xiaomi A2. Does not work the way it should. Holding the volume buttons turns off the functionality. And with the settings off pressing the volume buttons does turn on the light but not when the screen is off.', "Rubbish. Doesn't work as advertised, doesn't remember settings changes, volume buttons stop working (for anything).", 'Fixed for android pie. . Hold volume up and down in for 3 seconds even with screen off. Works with phone again. Thanks so much!', "Lightweight, efficient, no nonsense. This is what own source is about. Clean UI, clear functions, no nonsense, transparent actions. Thank you so much guys. I'll definitely donate! <3", 'This is great, does exaclty what it says, easy, clean and simple to use, defs recommend!', 'Battery hog. Keep device awake and using CPU (25 minutes of CPU time and over 11000 wakelocks over 24 hours time). Seriously guys? Something fishy about this application. Uninstalled immediatelly. Total garbage!!!', "Great app. Let's me turn my phone's light on without fumbling for a widget or the settings. Great work guys. Keep it up.", "downloaded the app, hit the volume buttons as instructed and... turned up the volume, no light on. I tried several times, and it wouldn't work.", "Brilliant App! I regularly walk on dark rural roads and need a quick light to make sure cars know I'm there.  Big fan!", "Doesn't work on lock screen. Messes with volume setting when you hold both volume buttons (turns volume up or down).", 'Does exactly what it says and works great on my device. Some devices though you will have issues with pressing the buttons at the same time however with practise it is fine', 'Does not work on Redmi 3s. In spite of giving all permissions and setting auto run on settings, holding down Volume buttons does not start the torch light. Sad!', 'Intermittent functionality, including with battery optimization disabled.', 'Incredibly hard to engage the torch. Would make much more sense as a long press.'], 'appId': 'in.blogspot.anselmbros.torchie', 'url': 'https://play.google.com/store/apps/details?id=in.blogspot.anselmbros.torchie&hl=en&gl=us'}
