{'title': 'ÉTSMobile', 'description': "ÉTSMobile est un portail étudiant mobile regroupant les principaux services accessibles aux étudiants de l'École de technologie supérieure. Cette application est conçue et réalisée par les membres du club étudiant ApplETS en partenariat avec les systèmes d'entreprise de l'ÉTS. C'est une application faite PAR et POUR les étudiants où chacun est libre de contribuer à son évolution. Si vous désirez vous impliquer activement dans le développement de cette application, vous adresser aux représentants du club.\r\n\r\n*** Cette version requiert un code universel et un mot de passe étudiant ***\r\n\r\nParmi les fonctionnalités offertes:\r\n- Résultats d'évaluations\r\n- Horaire des cours\r\n- Documents de cours via Moodle\r\n- Nouvelles provenant des divers médias d'information de l'ÉTS\r\n- Bottin des employés de l'ÉTS\r\n- Consultation du solde courant\r\n- Accès au catalogue de la bibliothèque\r\n- Procédures d'urgence\r\n- Commentaires", 'descriptionHTML': 'ÉTSMobile est un portail étudiant mobile regroupant les principaux services accessibles aux étudiants de l&#39;École de technologie supérieure. Cette application est conçue et réalisée par les membres du club étudiant ApplETS en partenariat avec les systèmes d&#39;entreprise de l&#39;ÉTS. C&#39;est une application faite PAR et POUR les étudiants où chacun est libre de contribuer à son évolution. Si vous désirez vous impliquer activement dans le développement de cette application, vous adresser aux représentants du club.<br><br>*** Cette version requiert un code universel et un mot de passe étudiant ***<br><br>Parmi les fonctionnalités offertes:<br>- Résultats d&#39;évaluations<br>- Horaire des cours<br>- Documents de cours via Moodle<br>- Nouvelles provenant des divers médias d&#39;information de l&#39;ÉTS<br>- Bottin des employés de l&#39;ÉTS<br>- Consultation du solde courant<br>- Accès au catalogue de la bibliothèque<br>- Procédures d&#39;urgence<br>- Commentaires', 'summary': 'ÉTSMobile includes many services available to students at ETS.', 'summaryHTML': 'ÉTSMobile includes many services available to students at ETS.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.03, 'ratings': 305, 'reviews': 86, 'histogram': [33, 18, 30, 45, 176], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '19M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'École de Technologie Supérieure', 'developerId': '%C3%89cole+de+Technologie+Sup%C3%A9rieure', 'developerEmail': 'info@clubapplets.ca', 'developerWebsite': 'http://applets.etsmtl.ca', 'developerAddress': None, 'privacyPolicy': 'http://www.etsmtl.ca/Services/sTI/Etudiants/applications-institutionnelles/Portail-ETS-Mobile', 'developerInternalID': '7207922049703400092', 'genre': 'Education', 'genreId': 'EDUCATION', 'icon': 'https://lh3.googleusercontent.com/RBLNT1dlGm0ZH4FGgDKAhiGOk8VCpIwGvS9PSSlCWJYJQ63VavJDYKQYQexxbRaxRsq2', 'headerImage': 'https://lh3.googleusercontent.com/vS9J7PPLmUrs9X1VOf0YQPwj9__NOXlR2otA9MeffAaPL6gQNG0NrGgiTKOMLDJYJcY', 'screenshots': ['https://lh3.googleusercontent.com/WVpgrvim3ihHupZoHiJU1tERNygAAqDRv3S4lCa1Zt0ZTqFyF5iUg18fAou7Sb5X-60', 'https://lh3.googleusercontent.com/p7q3MTPH4y7C42Z9vRE0rhLh0EY1MNtYbRIM0v7vHL4d5NKDUsra8x8aSFu7FI_T_64', 'https://lh3.googleusercontent.com/xj5sn61QEJpDd_Yr5Hc9quIRtH5vwJ2iZbGFX3YM3k4838QhB0PZs6m3GVp6TGtMaQ', 'https://lh3.googleusercontent.com/xWegC8xQ0DWhjJV3Ep56ifnqeBj43nBizYbImCbfvi-NJgvoeRSpR09anw8oeP-tthY', 'https://lh3.googleusercontent.com/-0sSiTc7woUld3T6MfYrOj1h2d23GgCIjd5NY6yj_leSmGh9ykqN3ZPAmO52CsLq1yE4', 'https://lh3.googleusercontent.com/GdRy4bjzTal9pLAfSDQStyQyJ1ytaGHYUq0tQFGJlEvfg_maOcF1zpFAgxRUoTjKxw', 'https://lh3.googleusercontent.com/uQ2rXOh7kBaGUDt11dFwKieULaMsVQYyF-YU8w_TOKKY9cB4aIPcuPkH8RM-fSDYfw', 'https://lh3.googleusercontent.com/MgVBodtlAs20COdzSE8Dr9a9XJhpRGdNiRKszT2VRQ-8fgVOkDoOkRBZsAGyDqBv_qo'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Feb 4, 2013', 'updated': 1554492136, 'version': '2.37', 'recentChanges': 'V.2.37:\r\n- Réglage d\'un problème pour certains suite à la mise-à-jour de la version V.2.36\r\n\r\nV.2.36:\r\n- Ajustements concernant la réception de notifications "push"\r\n- Ajout d\'une section concernant la version beta de l\'application\r\n- Autres correctifs mineurs\r\n\r\nV.2.35:\r\n- Réglage de problèmes sur des appareils fonctionnant sur Android 8.0 et ultérieur\r\n- Réglage de problèmes concernant la connectivité sur des appareils ayant des versions antérieures d\'Android\r\n- Autre changements mineurs', 'recentChangesHTML': 'V.2.37:<br>- Réglage d&#39;un problème pour certains suite à la mise-à-jour de la version V.2.36<br><br>V.2.36:<br>- Ajustements concernant la réception de notifications &quot;push&quot;<br>- Ajout d&#39;une section concernant la version beta de l&#39;application<br>- Autres correctifs mineurs<br><br>V.2.35:<br>- Réglage de problèmes sur des appareils fonctionnant sur Android 8.0 et ultérieur<br>- Réglage de problèmes concernant la connectivité sur des appareils ayant des versions antérieures d&#39;Android<br>- Autre changements mineurs', 'comments': ["Great app but i can't export my schedule anymore. Updated : it's because it didn't have the permission but the app did not ask me permission.", 'Je reçois les notifs mais elles ne sont pas affichées dans la liste.', "Très bien dans l'ensemble, par contre l'application n'envoie plus aucunes notifications pour les nouvelles notes sur signets et Moodle. C'est réellement fachant.", "Les notification n'update plus et lorsqu'une note est reçue il affiche un pop-up avec plusieurs autres vieilles notification", "Quel potentiel, mais je ne peux pas me connecter! À l'ÉTS et à la maison \nmes informations de connexion fonctionnent, mais sur l'application les \nmêmes informations sont invalides. Des octets 100% inutiles dans votre \ntéléphone intelligent 😭", "L'application n'est pas compatible avec S9+ , page blanche pour les notes \net horaire etc..", "Impossible de connecter (code universel invalide alors que c'est le Bon, et ça n'accepte pas le code permanent non plus). Dommage.", "Il y a tjr une erreur de synchronisation, à chaque fois il faut que je me déconnecte. Et pour se connecter, en deux reprises, il m'a fallu la desinstallé puis l'installer à nouveau car je n'arrive pas à me contacter ! !!", "Interface sympa, mais les délais de mise à jour des notes sont vraiment long et l'app semble moins fluide qu'autrefois. Est-ce que ce sont les serveurs moodle qui sont lents?", 'La nouvelle mise à jour bouffe 50% de ma batterie avec des activités en background....', 'I hope MonETS has a English version', "Dernière mise à jour fait planter l'application sans qu'elle puisse s'ouvrir. Nécessite une réinstallation complète. Performance beaucoup moins bonne depuis la mise à jour (bcp plus long à s'ouvrir et changer d' onglet)", "J'ai réinstallé la nouvelle version, l'application crash au login, totalement inutilisable. Sur un Nexus 6p.", "Très bien fait, cependant l'application cesse de fonctionner lorsque j'essaie de consulter mon horaire. À suivre!", 'Le moniteur pour le bandwith ne fonctionne plus, plusieurs collègue om comfirme que ca ne marchait plus aussi sur leur cellulaire', "Besoin de modification, les cours à 2 locaux n'affiche que un local", 'La fonction piur verifier la consommation ne fonctionne plus!', "Vraiment beau et J'aime l'utiliser.", 'Continue à intégrer de nouvelles fonctions', 'Big app big time', 'A+++', "Il n'y a pas à dire, le GUI est définitivement magnifique et beaucoup plus attirant que la dernière version! Mais le app est devenu beaucoup plus lent et rencontre beaucoup de lag, l'ancienne version n'était pas aussi belle mais en fonctionnalité elle performait 10x mieux", "Bon finalement une version de l'application qui touche l'esthétique! C'est très bien fait :)", 'Belle intégration de moodle.', 'Parfait', "Fonctionne no1 mais pourrait être mieux selon moi avec l'ajout de fonctions:  - Proposer d'exporter le calendrier en format Google ou Outlook. - Intégrer un client imap plutôt que OWA.", "Manque d'informations sur le tim horton", 'Tres bien!', 'Very useful, simple and fast', 'Update efficace', "L'application est très bien et dans l'ensemble très utile, mais depuis l'update du 4 Sept., l'horaire ne fonctionne plus et crash l'application.", 'Lhoraire ne marche plus depuis le dernier update', "Super rapide et l'interface est bien conçu. Good job!", 'So far so good', 'Très bien dans l\'ensemble! La possibilité de voir ses notes et son horaire directement de cette application rend les choses beaucoup plus simple. Faire une integration a google calendar serait bien agréable pour avoir des alertes et éviter de tout devoir retranscrire à la main. Par contre, la map dans la section "Sécurité" est beaucoup trop grosse. Elle cache les informations plus basse. Ne lachez pas!', 'Excellent app où il est facile de consulter notre dossier étudiant sans passer par le site web', "La liste des notes n'est pas fiable. Je préfère encore ouvrir Signets pour consulter mes notes.", 'Fonctionne très bien sur le nexus 7.', "Il serait intéressant de pouvoir synchroniser le calendrier de nos cours directement dans Google Calendar par exemple. Sinon c'est bien, mais il nous manque toujours la possibilité d'avoir accès à cheminot via mobile.", "Vraiment bien! C'était temps pour une version sur android"], 'appId': 'ca.etsmtl.applets.etsmobile', 'url': 'https://play.google.com/store/apps/details?id=ca.etsmtl.applets.etsmobile&hl=en&gl=us'}
