{'title': 'Lullaby Songs - Relax Music for Baby Sleep - 2020', 'description': '<b>Make your baby sleep listening relaxing music.</b>\r\n\r\nLullaby music app contains 25 baby songs and animals. \r\n\r\n•\t25 lullaby songs\r\n•\tWorks in screen-off mode\r\n•\tAndroid Auto supported\r\n•\tChromecast supported\r\n•\tVolume control\r\n•\tMaterial design\r\n\r\nPlease support us with ★★★★★!', 'descriptionHTML': '<b>Make your baby sleep listening relaxing music.</b><br><br>Lullaby music app contains 25 baby songs and animals. <br><br>•\t25 lullaby songs<br>•\tWorks in screen-off mode<br>•\tAndroid Auto supported<br>•\tChromecast supported<br>•\tVolume control<br>•\tMaterial design<br><br>Please support us with ★★★★★!', 'summary': '25 lullabies works in screen-off mode. \r\n#1 Baby sleep music for relax time.', 'summaryHTML': '25 lullabies works in screen-off mode. <br>#1 Baby sleep music for relax time.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.745614, 'ratings': 1153, 'reviews': 458, 'histogram': [30, 10, 40, 60, 1011], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '9.4M', 'androidVersion': '4.2', 'androidVersionText': '4.2 and up', 'developer': 'Yuliia Ashomok', 'developerId': '7572373447067384777', 'developerEmail': 'ashomokdev@gmail.com', 'developerWebsite': 'http://ashomok.azurewebsites.net/', 'developerAddress': 'Yuliia Ashomok\nprosp Vatutina Generala\n24.\nKiev 02183\nUkraine\n+380954123297', 'privacyPolicy': 'https://sites.google.com/view/lullaby-privacy-policy/home', 'developerInternalID': '7572373447067384777', 'genre': 'Music & Audio', 'genreId': 'MUSIC_AND_AUDIO', 'icon': 'https://lh3.googleusercontent.com/6e3QwA2sgka50iQJ9RkNBUToWbVHfp8Va3irjguRIHFDqma8ujAYfy79uyV4LbxKJz0', 'headerImage': 'https://lh3.googleusercontent.com/koy88p93fSoN0szUxTwB9S5PFDzv6tFEyBb69V1cZ95ykjx63sxoSMYGhwsM655mPya4', 'screenshots': ['https://lh3.googleusercontent.com/qHvroYlkU24QiGPJWjPpLcdF-ivAuNOkMmg3WwxVD6XXJMnJofcCUgP7cGllPIlYZMU', 'https://lh3.googleusercontent.com/6xDaJNvhOoO4zpa9cyfiCAq5W8ju_AqcqxDHUnBwIHqcet02EwxGM1clkeg22YCmYKc', 'https://lh3.googleusercontent.com/D34E5-gf6Ut3sHxkEkcfPeO_2i22PSFchaTFMl-o7VB7VuNB0rcRozpI5UzDhvHhpg', 'https://lh3.googleusercontent.com/DhgqWf4p9wOV6zpX36oNd5bD77GVmj0ybPMcT_KGQKWgn_IOvLLziwpxNPmdLffngQ', 'https://lh3.googleusercontent.com/yaRHhpHwHQAx-W1LQMoXkgjU8v-JpsnvLDdJJ8b8DpNhCZqjDyUVj4fXW4TZBANV4Ho', 'https://lh3.googleusercontent.com/VKT7H6TDd7DJ2z39pz9CoIpp4WFHji-2mvAhp64fKyTETcKYVrwvc5CuGrp02t8ilA', 'https://lh3.googleusercontent.com/U2RKnyqFDoq7qQUBrBTm1xGO03aOitLonPXP4UmlzD6x41IsoY23sQIkoLgmALCYBsuo', 'https://lh3.googleusercontent.com/y9oE8Drq0a6bOXtQxKIZXQ1Rtxg8z51UirdFijluiugRLTOgbdosUokTBdpCWVTusTE', 'https://lh3.googleusercontent.com/Z4zoporYJQtF9h1s2lpgoQgTyF27IN89_7zyp_SpGw4wEdvoMBYWPoBlXDyTkWp9agk', 'https://lh3.googleusercontent.com/pjU5avbxYZWo6393QHv0GjFWCyOwvRtBORL0gniiu0tJjmTz41sAMtWZ546VS1Qz2Xk', 'https://lh3.googleusercontent.com/2iqtqPaaeHHbC0eYkyKYOiU3vyD21itbgfLUtyecITDBvVphiZgg0Fisz3A-uOpQpZw', 'https://lh3.googleusercontent.com/TU1ZwNFYgDAV3FopF_ym72P-HhAZqA0xUG7nQEvGWS31yvhHtt5BwEXtXtsz6d-cxEY', 'https://lh3.googleusercontent.com/kWC_eDXTwa0UVbVM6mAe3egk2TQ1QGPFGtYh_exq2EKnLxbriAWqu77paV3WPsxKMlJI', 'https://lh3.googleusercontent.com/ubGM-DFofKa7MCTsKDy0KWWZo1UJ5e03ytiC0jlsWLONcYmjPvgUzDGYZAf_23aOXYoe', 'https://lh3.googleusercontent.com/TAwbMr-YxlgVhE_Xu5svruaZlKnLUPGKzDP9dHZY6x2HZmQQRBTb7USfXYajQ8oOrQ'], 'video': 'https://www.youtube.com/embed/PG2jr_a04qU?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/PG2jr_a04qU/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': True, 'containsAds': True, 'released': 'Apr 21, 2016', 'updated': 1588265278, 'version': '4.3', 'recentChanges': '•\tBugs fixed', 'recentChangesHTML': '•\tBugs fixed', 'comments': ["Love the music... Out it on and leave my phone to play; however if I need to do something on my phone, the music continues to play in the background. The 'Mums songs' are lovely... Wish there were a couple more though", 'Your lullaby is very soothing but lack of timer. Normally i would set 1 hour after my baby went to sleep. Add a timer and it would be perfect.', 'Absolutely love this app. Had a fussy baby installed this and 2 minutes later and she is out. Allowed me to play songs and play apps all at the same time. Thank you I will be using this a lot.', 'I love this app it is so calm and amazing to use when trying to sleep and I played it for 30 mins and my brother fell asleep that is why I love this app so much it the best thing so I give it five stars it so amazing you should download it', 'Not only does it relax my baby, but its soothing to me as well, no ADS, i am very happy.. Thank you.', "This is a good app, especially because it doesn't interfere with other apps even when it's open.", "It's really work on helping baby to relax and sleep. I love this app! I hope there will be more update on the music :)", 'My baby is almost 10 months old and this music helps him to sleep everytime. Thank you 💙', 'This lullaby songs works wonders for lil one,i love it', "It doesn't take even 2 minutes for him to sleep the music do wonders", 'Love this app puts baby to sleep very fast it has no ads', 'I love the song "Time To Go To Bed", I had never heard it, and it is now my favorite song to sing to my son at bedtime.', 'This app is great my baby sis fall strat to sleep', 'Such beautiful music it brings tears to my eyes because I love my little AnnaLee so much I thank God I have her!!!!!', 'I never had a baby that gave me hard time to go to sleep until I meet my nice brea. She o love to fight going to go to sleep. That why I love this app..', 'I love this app my daughter is asleep after like 3 songs', 'My son loves this app. I have been using this app since he was 6 weeks old to help sooth him and help him fall asleep. He immediately calms down when I turn it on.', "Calms our 3 month old Granddaughter right down for a nice peaceful nap as well down for the night. I even turn it on for her 3am bottle! I'm so glad that I found this app and down loaded it. It does not turn off until you turn it off! Thats a great big plus as it just keeps playing in a continuous circle. We also enjoy the songs it plays!", '🤗Wonderful lullabies...my 2 yr old Granddaughter asks for "lullabies" when I say NapTime. The music is soft and relaxing for any age. Peaceful instrumentals evoking simpler times.....Highly RECOMMEND!', "Wonderful app, really helpful for getting my little one to sleep. And the best part, the songs don't become annoying after playing them 7 billion times! Lol", "this app was good at first. .ever since I was pregnant to my son ,I usually play the lullaby songs closer to my tummy till my son was born .so he's used to it especially for his bed time .and now I couldn't access to it any longer which makes me frustrated since my son couldn't sleep without his lullaby . please whoever created this app, could you assist me to get it play.with thanks !", "It's really a good lullaby for babies especially for my little brother. I only unistalled because it creeps me out when it automatically plays out of the blue even tho I'm not using my phone. Installed it again last week and it happened again. I don't know if this happens to others. I don't know why.", 'Was a TERRIFIC app until it just recently needs an internet connection to work. Poor guys was one of the Best free Apps. Sorry.', 'Consistent on no music....once it worked. After that no sound. Ive installed and reinstalled with no success.', 'I love, love this. I wish I could download an an MP3 file. I would gladly pay for the album.', 'Really love this app alot because it actually helped put my baby girl to sleep. There are even tunes that you can sing along to and my baby loves it so much when i sing to her. So yes i recommend this app to anyone.', 'Love it! Only just started using it but you can pause it when you close the app! And the pictures are super cute!', 'I work with very young children and find this app helps them relax. The variations and different tones means there is something for everyone. Only just started this as a trial and seems to be very helpful.', 'Great, calm music for my little one. In the first three songs, she goes to sleep. Not too much noisr as well. Thanks. 😊', 'Bed time is always hard...I needed to try something...I downloaded the app...he fell asleep within 6min! (Yes I timed it! Lol) A big plus was the no ads....to disturb your little one as they drift into a nice sleep :)', 'I use this app all the time it helps me sleep even though I am not little, its hadd for me to sleep in the city sounds. this is very relaxing. :)', 'Best App ever Thank you.calms my baby from birth .now he is 5 months .works every time.', 'Works great for our son. He loves it. It does a great job of relaxing him and putting him to sleep. Works for mom too.', "This app is the perfect bedtime helper, i't never seemed to fall with my grand daughter or grand son. My daughter and son both even downloaded it and that says a lot!", "Modern song tunes 😡 made to sound like lullabies. A little entertaining for baby, but certainly won't help with sleep. Not traditional lullabies unfortunately.", 'helps with toddler when its time to sleep. love it. she goes into a trance.', 'Should follow through with next song without having to touch it to play', "My kiddo loves the lullabies! He's usually fast asleep within the first 2 songs! This app has made bed time a little bit more manageable!", 'Soft and calm music for young children. Good.', 'Great app, very nice melodies. My baby always fall a sleep!'], 'appId': 'com.ashomok.lullabies', 'url': 'https://play.google.com/store/apps/details?id=com.ashomok.lullabies&hl=en&gl=us'}
