{'title': 'BetterBatteryStats', 'description': 'With BetterBatteryStats you can analyse the behavior of your phone, find applications causing the phone to drain battery while it is supposed to be asleep and measure the effect of corrective actions:\r\n- Spot drainers based on detailed information about the root cause\r\n- measure the effect of actions to reduce drain, following a simple method\r\n- detect changes in the awake/sleep profile and quickly find the causes (rogue apps)\r\n\r\nIn other words BetterBatteryStats helps you gettings the best experience with your smartphone.\r\n\r\n<b>Unrooted devices</b>\r\nBetterBatteryStats supports unrooted devices but there are a few manual steps for you to complete (on rooted devices there steps will be completed by the app).\r\nPlease run following commands from your computer where ADB was installed:\r\n<blockquote>\r\nadb -d shell pm grant com.asksven.betterbatterystats android.permission.BATTERY_STATS\r\nadb -d shell pm grant com.asksven.betterbatterystats android.permission.DUMP\r\n</blockquote>\r\n\r\nOn Lolipop and forward additionally run:\r\nadb -d shell pm grant com.asksven.betterbatterystats android.permission.PACKAGE_USAGE_STATS\r\n\r\n\r\nPlease check the website for more info.\r\n\r\n<b>Support:</b>\r\nPlease don\'t use the rating system for support. In case of issues or for any question or suggestion please contact me by e-mail or use the contact information from the about box.\r\n\r\nIf you experience problems with your superuser app keeping asking to grant su rights don\'t blame BetterBatterStats but try another superuser app instead.\r\n\r\n<b>Permissions:</b>\r\n- android.permission.WRITE_EXTERNAL_STORAGE is used only for writing dumps to the SD. In case you don\'t need that feature please feel free to revoke that permission. It won\'t have any side effect besides disabling that feature\r\n- android.permission.BATTERY_STATS is obviously the permission to access the internal statistics and can not be revoked without making the app unusable (from Kitkat on BBS will have to be installed as a system app to access this permission)\r\n- android.permission.DUMP from Kitkat on BBS can be installed as a system app to access this permission. It is required to access dumpsys without root for a better performance\r\n- android.permission.ACCESS_WIFI_STATE is required since Android Marshmallow in order to access stats. In pre-6.0 version this permission can be revoked\r\n- android.permission.ACCESS_NETWORK_STATE This permission can be revoked\r\n- android.permission.RECEIVE_BOOT_COMPLETED is required for cleaning references. Revoking this permission may affect the results of kernel wakelocks and custom reference until new references were saved\r\n- android.permission.READ_PHONE_STATE is required to detect when the phone was turned on/off in order to store references for advanced diagnosis\r\n- android.permission.DEVICE_POWER is required to detect when the phone is disconnected from the charger and store the corresponding kernel wakelock reference. Revoking this permission will lead to losing "since unplugged"\r\n- android.permission.BLUETOOTH is required to fix a bug where the communication to the batteryinfo service stops working\r\n- android.permission.READ_LOGS is required to allow logcat dumps to be saved. You can revoke this right and will lose only the ability to save logcats\r\n- android.permission.GET_TASKS is required to read the list of running tasks (ps)\r\n- android.permission.WAKE_LOCK is required to hold a wakelock in order to save references when the screen goes off\r\n    \r\nBetterBatteryStats is open source so you can inspect/review/contribute and submit issues or feature requests. Please check the about dialog for further details.', 'descriptionHTML': 'With BetterBatteryStats you can analyse the behavior of your phone, find applications causing the phone to drain battery while it is supposed to be asleep and measure the effect of corrective actions:<br>- Spot drainers based on detailed information about the root cause<br>- measure the effect of actions to reduce drain, following a simple method<br>- detect changes in the awake/sleep profile and quickly find the causes (rogue apps)<br><br>In other words BetterBatteryStats helps you gettings the best experience with your smartphone.<br><br><b>Unrooted devices</b><br>BetterBatteryStats supports unrooted devices but there are a few manual steps for you to complete (on rooted devices there steps will be completed by the app).<br>Please run following commands from your computer where ADB was installed:<br><blockquote><br>adb -d shell pm grant com.asksven.betterbatterystats android.permission.BATTERY_STATS<br>adb -d shell pm grant com.asksven.betterbatterystats android.permission.DUMP<br></blockquote><br><br>On Lolipop and forward additionally run:<br>adb -d shell pm grant com.asksven.betterbatterystats android.permission.PACKAGE_USAGE_STATS<br><br><br>Please check the website for more info.<br><br><b>Support:</b><br>Please don&#39;t use the rating system for support. In case of issues or for any question or suggestion please contact me by e-mail or use the contact information from the about box.<br><br>If you experience problems with your superuser app keeping asking to grant su rights don&#39;t blame BetterBatterStats but try another superuser app instead.<br><br><b>Permissions:</b><br>- android.permission.WRITE_EXTERNAL_STORAGE is used only for writing dumps to the SD. In case you don&#39;t need that feature please feel free to revoke that permission. It won&#39;t have any side effect besides disabling that feature<br>- android.permission.BATTERY_STATS is obviously the permission to access the internal statistics and can not be revoked without making the app unusable (from Kitkat on BBS will have to be installed as a system app to access this permission)<br>- android.permission.DUMP from Kitkat on BBS can be installed as a system app to access this permission. It is required to access dumpsys without root for a better performance<br>- android.permission.ACCESS_WIFI_STATE is required since Android Marshmallow in order to access stats. In pre-6.0 version this permission can be revoked<br>- android.permission.ACCESS_NETWORK_STATE This permission can be revoked<br>- android.permission.RECEIVE_BOOT_COMPLETED is required for cleaning references. Revoking this permission may affect the results of kernel wakelocks and custom reference until new references were saved<br>- android.permission.READ_PHONE_STATE is required to detect when the phone was turned on/off in order to store references for advanced diagnosis<br>- android.permission.DEVICE_POWER is required to detect when the phone is disconnected from the charger and store the corresponding kernel wakelock reference. Revoking this permission will lead to losing &quot;since unplugged&quot;<br>- android.permission.BLUETOOTH is required to fix a bug where the communication to the batteryinfo service stops working<br>- android.permission.READ_LOGS is required to allow logcat dumps to be saved. You can revoke this right and will lose only the ability to save logcats<br>- android.permission.GET_TASKS is required to read the list of running tasks (ps)<br>- android.permission.WAKE_LOCK is required to hold a wakelock in order to save references when the screen goes off<br>    <br>BetterBatteryStats is open source so you can inspect/review/contribute and submit issues or feature requests. Please check the about dialog for further details.', 'summary': 'A high battery drain is a limiting factor for a great user experience.', 'summaryHTML': 'A high battery drain is a limiting factor for a great user experience.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.051479, 'ratings': 11324, 'reviews': 3616, 'histogram': [1810, 434, 446, 1302, 7330], 'price': 1.99, 'free': False, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Sven Knispel', 'developerId': '4779531605840595501', 'developerEmail': 'sven.knispel@gmail.com', 'developerWebsite': 'https://better.asksven.io/betterbatterystats/', 'developerAddress': 'Sven Knispel\nEnsenerweg 46\n51149 Köln', 'privacyPolicy': 'https://better.asksven.io/betterbatterystats/privacy/', 'developerInternalID': '4779531605840595501', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/DSLujq1PE693R3kijROyQ32idYpCzVs5Z008ia8q5sbqeg_RD4DNdv2MHmMjEhpTfYBx', 'headerImage': 'https://lh3.googleusercontent.com/dxTbvRm-UUlorBFGvmQ5XdtiYRMgf9rYYBsXWvMwWytGN3CqmLxiS0jKdVBzeiGbiQ', 'screenshots': ['https://lh3.googleusercontent.com/VY12VFncU00pj-3trEnVVVJH2WBXVkj5ZBkelrh5qgB07o-FLcEi6mT-dyryZbZuag8', 'https://lh3.googleusercontent.com/LHBVoMUE9waUuuZyoOQp6-85DWmJZOe0UG7_EJscReqLBPpSy0G09k5QdztX_bQ9dUQ', 'https://lh3.googleusercontent.com/RqD0dPV41TjTTVV1d0CnLVSWc29qxUCtkS_9A-xn87UI0jTYEZRtiAqQfy3VOC6aow', 'https://lh3.googleusercontent.com/_EzRCzrQiZbrR2_ZgPwy_s85W1OtHXmicAhF3xDhuTtQ9YBGS2kcpZWYmpJwsmT6SWJ1', 'https://lh3.googleusercontent.com/MkrnrnLT5H8TjSQYrxThsvDJUOfcTD7kAR4lyETTbHx0cgSv9vNNGjKmSUmQ5YTPKJiv', 'https://lh3.googleusercontent.com/aNEs0roGKDqcSUJsKhcFnaGeH0MUIyLp2InhTK6AvofMaT4bVom-gkpx90JGi-q3gQ', 'https://lh3.googleusercontent.com/iU815ku3TVW9ox5XLhe2A_D04KlDua7DX_0JAFkPVBPCFGiJHScRZKf_KMX31rwerL0', 'https://lh3.googleusercontent.com/5tN6aq7nRSbLoCqs_s7mRTsM9gNLLSIcPCyEazI9wP4j8BtDVJlCvBVcCyae3GluAGs', 'https://lh3.googleusercontent.com/vUY22-6w2J2OL54_fr26U3-9YN-9fDZ2zFEyLl3qe6Xc7mR6HINy0_ei9-41FzDaFg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Aug 17, 2011', 'updated': 1572191569, 'version': 'Varies with device', 'recentChanges': 'Fixed preferences export/import\r\nI18N\r\nAndroid Pie support\r\nRemoved dependency to root for anything else that granting BBS the right permissions', 'recentChangesHTML': 'Fixed preferences export/import<br>I18N<br>Android Pie support<br>Removed dependency to root for anything else that granting BBS the right permissions', 'comments': ['Staple. A necessary app in the arsenal of tools for a rooted phone. I\'ve used it for so long, taking it out only when I need it and then freezing it. "Something about this rom(?) is draining battery, break out the BBS." I just realized I never reviewed it. Great app!!! Been using it for years.', 'Terrible program. Does not work at Android 10 Samsung device. Even after giving all adb permissions, program works till first reboot. Then just writes: "fall back" to "since boot". Author refuses to fix it or refund money. Do not buy it, tooking the bait, be careful', 'One of my all-time favorite apps.  This single-handedly saved me.  My unrooted stock Moto G5 Plus kept showing very high Keep Awake times for "Android OS" and "Google Play"...not very helpful.  BBS allowed me to not have to root (and reset) my phone and see exactly what was causing the wakelocks that were spiking my CPU and draining battery.  Cannot recommend this app enough.', 'Wow! Works on OP6 on Android 10! After upgrading to 10, had terrible screen off time. Saw CPU was not going to Deep Sleep state. Wanted to try something other than "wipe the phone and see if that fixes it". Based on all the negative reviews was expecting it to not work with my (unrooted) device - but after granting the required permissions over ADB it showed me the app holding wakelock (another popular battery monitoring app) and I was able to fix it. Saved me so much time vs resetting!', 'Great! Was finally able to diagnose standby drain that only happened while moving - when turning off all location settings in all apps and system did not help. Was the HORRIBLE and rouge google rewards app that kept wakelock but more importantly caused GPSD wakelocks... even when asked NOT to provide surveys on places visited AND location history turned off in account. Seriously such aggressive and unethical apps can only be identified and kicked out with help of BBS.', 'Seems to have stopped working after some time, showing incorrect battery stats, also says 0 seconds since unplugged all the time (which is false).', 'Paid for the app but not working. Raw statistics are empty except for Alarm and CPU states and charts are empty. I got a message "batteryinfo service cannot be contacted". I configured the app for English but still the interface is localized. Maybe that some problems are related to the device - Samsung A50, Pie - but I give 1 star because the behaviour of the app looks buggy and above all the developer has not bothered to answer to my support request.', 'Paid for it since it was so low priced. Waste of money, it will not tell me anything about my power usage on a galaxy s10.', "Haven't even used this app yet and it's getting 1 star. Just trying to OPEN the app crashed my phone twice, and it refused to open at all for about 10 minutes (sat on a blank white screen, crashed my launcher, locked my phone up and sent me to the lockscreen). Finally after reboots and force closes I got the app to request root, which it then locked up and I couldn't allow root through the magisk dialogue so it auto-denied after the timer ran out, and I had to go manually enable root in the magisk app, at which point it will FINALLY open properly. This app has some really serious issues and is an awful experience to start up.", "Hi, I have an un rooted Huawei P20 Pro, have done the adb grant thingy. However it's showing since unplugged 7 days. Well it's 7 days since I granted with adb.  On my galaxy s7 edge it was fine it reset automatically after each charge unplugged. Any help please?", "Security exception: grantRuntimePermission:  For non rooted user you have to enable in developer options both USB debugging AND USB debugging (Security Settings) [at least with MIUI - Xiaomi Devices] to be able to give permission.   This APP doesn't need a review!!! :D", 'Helped me find the app that was draining my battery by using the "partial wakelocks" stats. I have a Moto G6 Play with Android 8 (non-rooted). I enabled the required permissions with ADB.', 'App does not work. Provided extra permissions which also worked, but App is not collecting any information. Tried to contact the developer directly, but no reply. Now I am stuck with something which does not work. (Samsung S10e)', 'Paid for the app but not able to use it, even after last update most of the features are not working on my note 10 (showing no stats have been collected yet). Unfortunately, developer is not replying to emails as well.', "i bought this app 2-3 days ago and since then it has always been stuck with no stats collected yet, I've given it the proper permissions through adb. Samsung Galaxy S10e", 'RIP off!! Would not collect any data despite granting permissions. Conflict w/ Note 9.', 'Overall very good but previously on android 6,now on 7, since unplug references as if the unplug was a couple days ago,ignoring the recent recharges.', 'Waste of time & money. Have spent about 3 hours trying to get some meaningful data out of this app. It seems you need extra software and specific skills to do it.', "Paid for this app. Now broken. Says 'appopps_usage_stats' permission not granted. But no mention in documentation about granting that with adb. Android Pie. LG G7", 'Works perfectly on my Note 10 plus. Worth every penny.', 'This is garbage. After running it and granting superuser access it just throws some error saying selected from and to reference could not be loaded. Refunded.', "I get error messages when trying to use the app on my samsung note 8. I'm not sure what the problem is at all but it certainly does not work", "Refunded due to permissions related error. Granted permissions from the ui but according the log I'm required to manually use the terminal and use adb to grant permission.", "This no longer functions on my device. And it's a PAID app! Therefore, automatic 1-star rating.", 'No stats have been collected yet. $2 out the window', 'App opens to an error message and provides no guidance for proceeding.', "Can't even use without complicated unlocking work for App Rights through use of third party software", 'Stopped working after a few days- no stats connected', 'nice but, bug? my WiFi is off completely but so does WiFi as on and running at 100%??', 'It works as it intended to. Great work!', 'best way to see what drains battery, period.', 'fall back since boot. no stats recording except alarms and CPU states even though enabled through adb. refund?', 'garbage. freezes on startup, never runs.', "hey guys. is there anyway you can authorize a redund? if not it's cool since I screwed up. just didn't know I needed to root it or do other things to make it run. I just saw the app recommended and downloaded it. Figured something like that would be higer up in the description.", 'Not working on p40 pro. Asks for permissions..', 'I just wanted to make sure, is an ongoing notification saying "Event processing" normal and expected?', "Couldn't get all access to root", 'I did buy the app but it doesnt work on my s10 plus i want refund!!!!', "Doesn't work on S8. Uninstalled", "No mention that it's worthless without root access."], 'appId': 'com.asksven.betterbatterystats', 'url': 'https://play.google.com/store/apps/details?id=com.asksven.betterbatterystats&hl=en&gl=us'}
