{'title': 'Better Wifi On/Off', 'description': 'Better Wifi on/off aims at giving you the control of the Wifi state, optimizing your battery life without losing on user experience.\r\n\r\nThe app is free, fully featured with ads.\r\n\r\n*What is the motivation behind controlling Wifi?*\r\nOn paper Wifi is less power hungry than 3G but... some apps behave differently when Wifi is on and the well known wlan_rx kernel wakelock is a symptom of wakeups caused by uncontrolled Wifi hotspots, the Wifi sleep policy is not working consistently and does solve all problems.\r\n\r\nSupport: the rating tool is not the right place to submit bugs or feature requests.\r\nIf you have questions or want to report bugs please send me a mail, post your question in the support thread at xda (http://goo.gl/oc8MR).\r\n\r\nKeywords: battery life, control wifi, save battery, battery drain, saving battery\r\n\r\nPermissions:\r\n- android.permission.ACCESS_WIFI_STATE: detect if wifi is on or off\r\n- android.permission.CHANGE_WIFI_STATE, CHANGE_NETWORK_STATE and android.permission.UPDATE_DEVICE_STATS: change wifi state \r\n- android.permission.WAKE_LOCK: hold a wakelock\r\n- android.permission.BATTERY_STATS and android.permission.DEVICE_POWER: detect if on charger\r\n- android.permission.INTERNET and android.permission.ACCESS_NETWORK_STATE: required for ads\r\n- android.permission.WRITE_EXTERNAL_STORAGE: save logcat\r\n- android.permission.RECEIVE_BOOT_COMPLETED: start service on boot\r\n- android.permission.READ_PHONE_STATE: detect screen on/off/unlock \r\n    \r\nBetterWifiOnOff is open source so you can inspect/review/ contribute and submit issues or feature requests. Please check the about dialog for further details.', 'descriptionHTML': 'Better Wifi on/off aims at giving you the control of the Wifi state, optimizing your battery life without losing on user experience.<br><br>The app is free, fully featured with ads.<br><br>*What is the motivation behind controlling Wifi?*<br>On paper Wifi is less power hungry than 3G but... some apps behave differently when Wifi is on and the well known wlan_rx kernel wakelock is a symptom of wakeups caused by uncontrolled Wifi hotspots, the Wifi sleep policy is not working consistently and does solve all problems.<br><br>Support: the rating tool is not the right place to submit bugs or feature requests.<br>If you have questions or want to report bugs please send me a mail, post your question in the support thread at xda (http://goo.gl/oc8MR).<br><br>Keywords: battery life, control wifi, save battery, battery drain, saving battery<br><br>Permissions:<br>- android.permission.ACCESS_WIFI_STATE: detect if wifi is on or off<br>- android.permission.CHANGE_WIFI_STATE, CHANGE_NETWORK_STATE and android.permission.UPDATE_DEVICE_STATS: change wifi state <br>- android.permission.WAKE_LOCK: hold a wakelock<br>- android.permission.BATTERY_STATS and android.permission.DEVICE_POWER: detect if on charger<br>- android.permission.INTERNET and android.permission.ACCESS_NETWORK_STATE: required for ads<br>- android.permission.WRITE_EXTERNAL_STORAGE: save logcat<br>- android.permission.RECEIVE_BOOT_COMPLETED: start service on boot<br>- android.permission.READ_PHONE_STATE: detect screen on/off/unlock <br>    <br>BetterWifiOnOff is open source so you can inspect/review/ contribute and submit issues or feature requests. Please check the about dialog for further details.', 'summary': 'Gives you control of the Wifi state and optimizes your battery life.', 'summaryHTML': 'Gives you control of the Wifi state and optimizes your battery life.', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.13, 'ratings': 755, 'reviews': 261, 'histogram': [75, 30, 60, 143, 445], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.1M', 'androidVersion': '2.1', 'androidVersionText': '2.1 and up', 'developer': 'Sven Knispel', 'developerId': '4779531605840595501', 'developerEmail': 'sven.knispel@googlemail.com', 'developerWebsite': 'http://blog.asksven.org/tagged/betterwifionoff', 'developerAddress': 'Sven Knispel\nEnsenerweg 46\n51149 Köln', 'privacyPolicy': 'http://better.asksven.org/bwof-privacy/', 'developerInternalID': '4779531605840595501', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/0bfHcNTbDYHxOOP1oWnBXMk08Wk5B4vT8Vs6NeETEPHQMOxshdwZWzQ1tpWLrJYB3fY', 'headerImage': 'https://lh3.googleusercontent.com/1EqDOscOU2mD_kXQon19mEeXangxQBANTQ-WgaxLjXVSUqLNzt8c_tX4KnMtvhk6kug', 'screenshots': ['https://lh3.googleusercontent.com/2ZVnJ2kjuxH8fF6XEU1XOKZ-qU3NxVHBPvkzFr0m3f8rELy8I_cGgRIocS0qDESSE1Cw', 'https://lh3.googleusercontent.com/BNYjZssW5xN_DczzWhQSuyun2oiSP0sTs-NWXuMRxdLGt-vb_Vv4yIRTLe1yjvrAzcOi'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': True, 'containsAds': True, 'released': 'Oct 19, 2012', 'updated': 1371331236, 'version': '2.1.0.0', 'recentChanges': '- Updated russian translations\r\n- Add option to leave wifi on when screen goes off but a connection is active\r\n- Loading application whitelist is now asynchronous\r\n- Added timed checks: regularly turn Wifi on (all rules apply)\r\n- Fixed event log for enabling/disabling from the widget\r\n- A better detection of the donate version\r\n- Fixed alarm "null" error leaving Wifi on\r\n- Fixed event log for power connected / disconnected\r\n- Implemented more sophisticaled cage detection', 'recentChangesHTML': '- Updated russian translations<br>- Add option to leave wifi on when screen goes off but a connection is active<br>- Loading application whitelist is now asynchronous<br>- Added timed checks: regularly turn Wifi on (all rules apply)<br>- Fixed event log for enabling/disabling from the widget<br>- A better detection of the donate version<br>- Fixed alarm &quot;null&quot; error leaving Wifi on<br>- Fixed event log for power connected / disconnected<br>- Implemented more sophisticaled cage detection', 'comments': ['Works great with Android 10. Expert mode is even better with more controls like working even in Airplane mode and other more specific settings.', 'One feature "missing" : WiFi off even if screen is on, when there is no network traffic in X seconds. In all other aspects, a MUST HAVE APP.', 'Upgraded my Samsung tablet to Android version 9 and this app no longer works when airplane mode is enabled', 'This is the best of the best auto Wi-Fi app I have ever seen, especially in the expert mode. check it out. you will love it', "For some reason wifi settings doesn't save from Android settings. This app does the job.", 'Seems to be broken under Android 9, used it for years with previous versions. Hope it will be updated.', 'This app has given my battery a new life. It proves to me that WiFi is battery hungry', 'Does exactly what it says, brilliant!', 'this app is now a must have app for me! excellent app with widget that is truly useful!!!!', 'Took a few days to work out why it was turning Wi-Fi off while had the screen on. Seems the option to keep it on when in use affects when screen is on, not just when off as settings say. Happy with it now as s4 used default of 15 minutes before turning it off! Had one app not being recognized as white listed when it was.', 'Stop breaking it to demand I rate it. I hate G+ and intend to delete my account after this.   Your prompt to rate pauses parts of the app and gives no indication beyond not leaving wifi awake. Fix or stop bloody prompting me and the rating will be fixed to something more fitting to this app.', 'Since upgrading to android 5.1 the app has had trouble with airplane mode. I use a tasker script to toggle airplane mode while at work as I have poor signal. During times when airplane mode is on the app seems to not be able to alter the wifi state. Have you seen similar problems? Would debug logs be of any use to you in solving this?', 'that\'s what I\'m talking about, especially expert mode is awesome! That\'s what I\'ve been looking for. But small issue on good old Android Gingerbread is that your app is not an exception among the others that wifi "timed checks" sometimes cause wifi to disappear completely for some reason; so I had to disable this feature.', 'Saves me at least 30% of my battery life, once you change the settings it goes smoothly from there. Now the only thing I need is something like this for cellular service.', "Doesn't turn off wifi when screen goes off and there is no active connection. Please fix and ill give 5 stars. I am using kitkat on international galaxy note 4. Thank you", 'Amazing app for controlling wifi state. Allows to shut off wifi when phone is sleeping (but only if nothing is downloading/uploading, etc) or when wifi not in use, etc, etc. Very dedicated developer, will fix bugs and loves to take suggestions for new features', 'All I want the program to do is to turn the WiFi on when I am near a whitelist router and off any time else. I have tried numerous times and have been unable to achieve this goal. Given a little bit of help, my rating might have been higher if I could resolve the issues and get the program to work properly.', "Only trouble is all wifi toggling apps seem to break the wifi status icon! :(  Galaxy 2s.  However it has solved my battery drain problem on my galaxy 2s good job. :)  EDIT: Latest update is broken. DO NOT UPDATE until this is fixed. (Program crashes when foreground is ended) If you update you can get the older version from the developer's website. EDIT 2: Thanks for replying - do you have any idea about the crashing on 8.1 compared with 8.0? To reproduce - launch app, minimise it, close it, reopen.", '30 sec delay before WiFi goes off. Go to expert settings to change. Wish it had data options so one star off for no data.', 'I was hoping this could make my wifi stay on, even if the screen is off. It doesn\'t do that. For the most part, it appears to be pretty much one of those "power-saving" applications, used to regulate your internet and turn it off for you when you may have forgotten it. It would get 5 stars from me if it could keep my wifi on.', 'Everyone should install it and save the environment and battery life. Tried out this free one, liked it so got the donation one too..only 1 buck! Thanks Sven.', "Stopped working after L update. Wifi settings don't even open. Not sure if it is a problem with lollipop or the applications.", "Not sure if it's just a placebo...  L, haters make like beez.....", 'Excelent app. Just what I was looking for - and, as Steve Jobs used to say: "It just works!".', "I have given 3 star not because it's a bad app, only because it is a bit confusing, all i want is the wifi to switch on and off automatically when I leave and return to my wifi at home, and never turn on my data...... Paul,,,,,,,,,well i have tested this and found that like all other apps that ment to automatically switch on and off wifi, don't work,,1star uninstaling", 'I know it\'s not designed for kindle fire, so I still give 3 stars.  after installing the app, turning on/off wifi manually became extremely slow, nearly impossible.  My kindle stuck in the "turning on wifi..." status for many many minutes.', "I have been using this app, for years, on various devices. Recently, I found it to be especially useful on my N7 with Pure Nexus ROM. The system wifi setting to disable wifi when sleeping didn't work, but Better WiFi does, and provides unbelievable standby time. Thanks for a great app!", 'This is the only wifi app i have found that does exactly what I need it to do. The ssid whitelist is genius. With this app my WiFi is only ever on when I need it to be on. Brilliant.', 'Been using with new phone to get a handle on battery and also for security.reasons. Gets the job done.', 'Does exactly what I need it to do.  Plenty of options.  I donated for the pay version.  Glad I did.  The best WiFi app I have tried... and I tried at least 15 or 20.', 'It works great and does what it said right but how can I leave wifi on when the screen turns off? I want to listen to my online radio please', 'You have to figure out the advanced settings to get it to do exactly what you want. But after that it works really well.', 'Great App to keep your WiFi in check for longer battery life. A whitelist for apps that can turn WiFi on if active (for location finding for example) would be nice though.', "doesn't work when delay time for check wifi status set to 0 .", 'just perfect, what android does not have natively', "If you want to have basically instant access to your home wifi network while saving battery life, this is the app you've been lookin for.", 'Works on many different devices and you can pick which apps keep wifi active. Good clear logging so you can see what is happening. Recommended', 'Free app! Has simple mode  and advanced mod for geeks. Recommended!', 'Brilliant app. Really work to stable wifi connection even the wifi is poor.. use this app. if your phone wifi suddnly not work..', 'Out performs any battery saver app on the market.deserves a much wider customer base'], 'appId': 'com.asksven.betterwifionoff', 'url': 'https://play.google.com/store/apps/details?id=com.asksven.betterwifionoff&hl=en&gl=us'}
