{'title': 'Resplash', 'description': 'Resplash is powered by Unsplash.com\r\n\r\nBeautiful, free photos.\r\nGifted by the world’s most generous community of photographers.\r\n\r\n• Browse over 1,200,000+ HD photos\r\n• New wallpapers everyday\r\n• Automatically refresh your home screen with a new random wallpaper\r\n• Dark and black (AMOLED) theme\r\n• Download raw photos\r\n• Set as wallpaper straight from the app\r\n• View user profiles, curated collections, photo stats and EXIF data\r\n• Log in to like photos and update your profile\r\n• Various layout options\r\n\r\nUnsplash - Free (do whatever you want) high-resolution photos.', 'descriptionHTML': 'Resplash is powered by Unsplash.com<br><br>Beautiful, free photos.<br>Gifted by the world’s most generous community of photographers.<br><br>• Browse over 1,200,000+ HD photos<br>• New wallpapers everyday<br>• Automatically refresh your home screen with a new random wallpaper<br>• Dark and black (AMOLED) theme<br>• Download raw photos<br>• Set as wallpaper straight from the app<br>• View user profiles, curated collections, photo stats and EXIF data<br>• Log in to like photos and update your profile<br>• Various layout options<br><br>Unsplash - Free (do whatever you want) high-resolution photos.', 'summary': 'Unsplash on Android | Beautiful Wallpapers from Unsplash', 'summaryHTML': 'Unsplash on Android | Beautiful Wallpapers from Unsplash', 'installs': '500,000+', 'minInstalls': 500000, 'score': 4.3670297, 'ratings': 6476, 'reviews': 2007, 'histogram': [292, 282, 533, 1017, 4350], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Brandon Lam', 'developerId': 'Brandon+Lam', 'developerEmail': 'whoisbrandonlam@gmail.com', 'developerWebsite': 'https://b-lam.github.io', 'developerAddress': '29 Annette St.\nToronto, ON\nCanada', 'privacyPolicy': 'https://b-lam.github.io/projects/resplash/privacy_policy', 'developerInternalID': '7181027311083753444', 'genre': 'Personalization', 'genreId': 'PERSONALIZATION', 'icon': 'https://lh3.googleusercontent.com/ZFjEtsDKsjMoW0SYIpCp6qV8CveusOwG3DlG0ZXFJ1Lli4wRi7cDR4a6iB9InFjScJTx', 'headerImage': 'https://lh3.googleusercontent.com/6XfRXSaorW3ute1nmXQq1rjzqJfaY9TcTZ6m7LssEiMynLcLcAp8AogQ1PeTWJ0PRRo', 'screenshots': ['https://lh3.googleusercontent.com/-2wV-vCwZnclCsURbNj7-CQGcGszdYfSD16I8U8EQ0fkT_Do7Dlxtb5cL3aasWyhHfg', 'https://lh3.googleusercontent.com/SRZYOK0devtGAz8bZj1PMy3QRkxvR-cqgx5XeV-diPQti9EGOGsP7tWzH4iiEvwwJzpD', 'https://lh3.googleusercontent.com/H9ZmpI1j7hk_JusilU5G11zFoBCrG0i6msN_vtYe9slzqgTeJKGDsy7jlvNHNbOgsu4', 'https://lh3.googleusercontent.com/Z_2K2fvNLq11V9PkiuBbObE5mIrzBPGQAH7s5GnqqmydwayHodZR_xKEHBY0ZgAgxySO', 'https://lh3.googleusercontent.com/I0arhdpGlQzG1SOngZ3W8tkY-88F6XnDFsY-QVJr-7xvarFGe9rNfNO1JySSX7Geb4k', 'https://lh3.googleusercontent.com/iK5NaWhum9fKqiO64j3fUJr-fVrCiFutkHHlRbR9cXpo3pH5VgfQRS559Hd4We7Rwuk', 'https://lh3.googleusercontent.com/-yfC37owWk6ig1v0RQ5wZNv5pQ0mOwDhkL5FbeGfseV2zlDMkjgRGnqbxvMpqNIDsbU'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Feb 22, 2017', 'updated': 1572677745, 'version': 'Varies with device', 'recentChanges': '**NEW** Arabic translation – Thanks to Splash!\r\n**NEW** Indonesian translation – Thanks to Almaftuchin and Sovana!\r\n- Fixed download crash\r\n- Removed deprecated endpoint for curated photos and collections\r\n- Added troubleshooting dialog for Auto Wallpaper\r\n- 12% better than last time', 'recentChangesHTML': '**NEW** Arabic translation – Thanks to Splash!<br>**NEW** Indonesian translation – Thanks to Almaftuchin and Sovana!<br>- Fixed download crash<br>- Removed deprecated endpoint for curated photos and collections<br>- Added troubleshooting dialog for Auto Wallpaper<br>- 12% better than last time', 'comments': ["So, I LOVE the website. I wanted to download it on my phone so it would be easier to look at, but I have an android. My roommate has the iphone version, and it is 10x better! It has categories, is easy to use and shows the pictures so well. My version doesn't have categories, and it shows the same pictures every single time I get on there. So if I want to look at something new, I have to search for it, which is difficult sometimes. PLEASE put in categories for android users. It's WAY better.", "The photos that I've downloaded off the app randomly keep disappearing from my gallery. I didn't delete any of those. It's happened twice now, and the resplash folder is the only one from where the photos disappear. I think I had 50 or so pictures the last time I checked, I'm only left with about half of that number now? Not sure if there's something wrong with the app, but it doesn't happen to any of the other media on my phone. Any help would be appreciated.", 'When I search for a collection sometime it has 2000 picture and every time I have to look same picture from starting, I would like to have some kind of sorting option like date sorting option. please can you do that it would be very helpful to many people.', 'Great app. One issue though, when I tapped the Floating Action Button, it asked me to choose between chrome and the app, and I chose the app and set it as default. Now Everytime I tap that button it opens chrome and reopens the app. Nothing else happens other than the app getting reloaded.', "I can just express how much I love this coz when it's comes in terms of pictures photograph wallpapers nice and quality pictures are in this app which me get my beloved wallpapers and desktop wallpapers all in one app like to this , it's amazing and wonderful. I love it and I even recommended it to my friend's . It's a great app and a good job . It also have user interface which is nice too.", 'A new bug in the new version of Resplash. The app crashed whenever I click on the download button. I tried a lot time on different images and it is the same. A serious bug need fixing immediately. Hope you see this reviews soon.', 'Amazing app. Love the quick tile for changing the wallpaper. A few suggestions. Please add an option where the user can add the collection or an artist as the source of the wallpapers. Also for the launchers like Pixel launchers, if there are more than 1 page on the home screen then, the wallpaper is not centered for the home page. For this, please add an option for horizontal wallpaper fix so that the wallpapers are always centered.', "Installed with wallpaper autochange enabled by default, plaguing me daily with a random succession of some very dreary images that I wouldn't have chosen for myself in a month of Sundays. No notification that the wallpaper had been changed, so tracking down the culprit took some time. So app did something I didn't want and didn't like, and nor could I stop it without some effort on my part. Hence 1 star.", "Great app! The quality of the Images is phenomenal, I still can't believe everything is for free! Great work done by the developers and especially all the photographers.", 'Application is not stable after last update. It disconnects from Internet very often, please fix the issue. Otherwise great application.', "Amazing and beautiful pictures...so many categories to choose from and it's all High quality and free..glad to come have come across such an amazing app..", "It's absolutely a good app but... Home page is okay but collection page is always show same order of collections if the one want to check all other collections every time one should scroll down and down. No refresh option to and no odere change option there. Please fix this", 'If u want to see the best photos by the best photographers in the world then download this app. These photos can be set as phone wallpaper too.', 'Auto Wallpaper is kind of useless. It should have the option to apply only those wallpapers who are in portrait mode. The landscape images hides the main object in mid screens while the main screen of launcher is on far left.', "Perfect for people that love photography and don't need everything else, excellent for searching for wallpapers.", 'Great design, amazing wallpapers with a lots of varieties and no annoying ads. Thumbs up👍', 'Great selection of wallpapers. Clean, simple and ad free interface.', 'Good. But I would like to specify multiple search terms for custom category in auto wallpaper settings.', "Fantastic app - best auto-changing wallpaper one I've used. Plus it showcases some quality photographic talent. Only suggestion would be to add the option to choose collections as an auto source. Keep up the great work!", 'The app itself is pretty nice. Unfortunately Unsplash is footed with content adds.', "I would give it 5 stars if not for one small bug/problem. The auto wallpaper. In my experience it does not work, no matter the conditions I turn on. But besides that little bug/problem, I do love the app. Has a nice UI (even has dark & black [amoled] themes), it's fast (depending on your network) and it's really well organized. Keep up the good work!", "I downloaded the app only for the daily wallpapers. The wallpapers have very sharp resolution and great quality. The daily wallpaper feature is great, except that the app starts the 24 (or 48, and other options) hour count from the time you enable the feature. In other words, you do not get to choose when during the day you want the wallpaper to be replaced. If you enabled the feature at three o'clock in the afternoon, it will automatically replace your wallpaper everyday at three o'clock.", 'For some reason unable to upload photos. Great app otherwise.', 'I love this app! It has a nice minimalistic design, with really beautiful high quality photos. Images menu is nicely hidden, viewable thru the pop up button. The menu also has a beautiful minimalistic design where you can chose to download, share, set as wallpaper, etc. the photo. The search bar makes it easy to quickly find images being searched. Overall, great app!', "This doesn't really work well as a mobile app. It isn't because it's bad, it's the fact that their library has a pretty small percentage of images suitable for mobile wallpapers They just aren't the correct resolutions. You'll easily spend many minutes scrolling just to find an image the proper size, or even orientation, then good luck if it's something you like. For desktop wallpapers though, amazing selection. But this isn't a desktop app.", 'Still unable to set wallpaper change interval below 15 mins.There should a an option for user.One other problem is that auto wallpaper history is just limited to 7 days.Otherwise app is working fine', "Great wallpapers, simple design. Works well other than the auto wallpaper changer. It doesn't change when its supposed to so I have to to click the button to do it manually. Edit: the Dev updated the app an hour after my review so thst there's a quick settings tile to change the wallpaper. Makes things way easier. Thanks!!", "Pretty good app. Only problem is I can't login. It asks me to authorise Resplash for using certain permissions, but when I tap Confirm nothing happens.", 'Please let us use Collections instead of Features in the custom part of Auto Wallpapers... Also add a feature so that you can just go to any available collections (even your own) as an auto wallpaper. Thanks for this great app.', "Great app but auto wallpaper feature is buggy. Seems to get stuck on wallpapers (I.e. you set it to change every 3 hours and it'll stay the same until you restart the phone or manually change wallpaper); viewing wallpaper history the app thinks it's set wallpapers that actually haven't been set. It's also slightly unintuitive to set wallpaper manually. Given most options for the picture are directly underneath it (favourite, etc), it's odd to then have the 'set wallpaper' hidden in arrow button", "Great app! One question though: Is there a way to set the auto wallpaper to only access specific collections? Edit: Wow, that was a lightning fast reply! Great news, thanks for the update! Now that that's answered let me just tell you that I looove your app. It's just beautifully designed, truly stands out among this bunch of other Android garbage. Never had any problems with it.", "Over a million RAW wallpapers, yet no ads to be seen. I've been trying to find an application to collect images with, but most of them are bombarded with ads. Well, what do you know. I ended with Unsplash. Frankly, my PS4 wallpapers came from the site itself, and having a mobile app to easily browse the amazing array of images from there to my phone is such a nice feature! Great job on Resplash! 😁👍🏻", 'My first experience with this app and I love the effect. The interface is smooth and beautiful. The scrolling wallpaper when I swipe my home screen is amazing.', "Great set of wallpapers. Although, there are some features like auto change wallpaper not functioning properly. That's why only 3 stars. Edit: Disabling battery optimization fixed the issue. A propmt response from the developer shows how much they care about the customer feedback. Great job guys.", "I got my wallpaper at first. Then I kept browsing wallpapers because it was unending and relaxing. The only problem is that, I think more people from a certain region like I'd say China or Japanese wallpapers are more like Tea, cities, people. I think it should be equally diverse. * For Nice Wallpapers ** For Fast Scrolling and Loading *** For Easy Downloading **** For Showing Info before downloading. Not ***** because it is not perfect. Doesn't have the option to change wallpapers automatically.", "It's amazing App I wish if they could develop the Auto wallpaper to allow us to choose which collection I could play the wallpapers that I want", "This app is fricking amazing. Free downloadable wallpapers that look awesome. Devs are also really cool. PS: This is NOT A SPONSORED review, I wrote a review previously (which was very positive and a little bit over the top) and, I'm assuming Google, removed it. I'm just really really genuinely impressed by what these devs offer for free and I really appreciate their efforts. pls give this app a try, I'm sure you'll love it.", "I have always been on the lookout for the coolest wallpapers. There are a bunch of apps in the market and I have tried many of them. But this app is totally amazing. The abundance and the variety is breathtaking. Even the ad placements are such that they are totally non intrusive and don't look wierd. Highly recommended. Great job dev.👍", 'I love the wallpapers listed here. My 2 problems are - 1. Automaticlly changing wallpaper not working for me. 2. Set wallpaper action is taking more than 30 seconds every time. Edit- Added 1* just for your reply. I tried the option you shared. No difference. I saw the wallpaper getting changed one time while unchecking all boxes. But nothing after that even though the interval i set is passed. Also,Do i get a crop option. Every tym i set a wallpaper for lock screen, its not the portion i want.', "Great app. My only recommendation is that there should be some kind of report functionality if there isn't one already. There are quite a few images of a transaction via square reader occurring. Either this is the greasiest ad campaign or ya'll know about it and are getting the bag."], 'appId': 'com.b_lam.resplash', 'url': 'https://play.google.com/store/apps/details?id=com.b_lam.resplash&hl=en&gl=us'}
