{'title': 'GPS Logger', 'description': "BasicAirData GPS Logger is a simple App for recording your position and your path.\r\nIt's a basic and lightweight GPS tracker focused on accuracy, with an eye to power saving.\r\nIt works offline (without internet connection), it has NO integrated maps.\r\nThis app is very accurate in determining your altitude: enable EGM96 automatic altitude correction on settings!\r\nYou can record all your trips, view them with any installed external viewer, directly from the in-app tracklist, and share them in KML, GPX, and TXT format in many ways.\r\n\r\nThe app is 100% Free and Open Source.\r\n\r\n\r\nGETTING STARTED GUIDE:\r\nhttp://www.basicairdata.eu/projects/android/android-gps-logger/getting-started-guide-for-gps-logger/\r\n\r\n\r\nIT FEATURES:\r\n- A modern UI, with a low consumption dark theme and a tabbed interface\r\n- Offline recording (the app has no integrated maps)\r\n- Foreground & Background Recording (On Android 6+ please turn off all battery monitoring and optimizations for this app!!)\r\n- Placemarks creation also meanwhile recording\r\n- Visualization of GPS information\r\n- Manual Altitude Correction (adding an overall offset)\r\n- Automatic Altitude Correction, based on NGA EGM96 Earth Geoid Model (Enable it on Settings!!!). On Android 4 this feature can only be enabled manually by following this simple tutorial: https://www.basicairdata.eu/projects/android/android-gps-logger/application-note-gpslogger/manual-setup-of-the-egm-altitude-correction-for-basic-air-data-gps-logger/\r\n- Real time track statistics\r\n- In-app tracklist showing the list of recorded tracks\r\n- Visualization of your tracks using any installed KML/GPX viewer, directly from the Tracklist\r\n- Track exportation, in the /GPSLogger folder of your device, in KML, GPX, and TXT\r\n- Track sharing, in KML, GPX, and TXT format, via E-mail, Dropbox, Google Drive, FTP, ...\r\n- Uses Metric, Imperial, or Nautical units\r\n\r\n\r\nUSE IT TO:\r\n☆ Keep track of your trips\r\n☆ Make accurate static and dynamic measurements\r\n☆ Add your placemarks\r\n☆ Remember the best places you've seen\r\n☆ GeoTag your photos\r\n☆ Share your tracks with your friends\r\n☆ Collaborate to OpenStreetMap map editing\r\n☆ ...\r\n\r\n\r\nLANGUAGES:\r\nThe translation of this app is based on users contribution. Everyone can freely help in translations using Crowdin (https://crowdin.com/project/gpslogger).\r\n\r\n\r\nF.A.Q:\r\nProblems with this app? Read the most frequently asked question! (https://github.com/BasicAirData/GPSLogger/blob/master/readme.md#frequently-asked-questions).\r\n\r\n\r\nADDITIONAL INFORMATION:\r\n- Copyright (C) 2016 BasicAirData - http://www.basicairdata.eu\r\n- For additional information please see http://www.basicairdata.eu/projects/android/android-gps-logger/\r\n- This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. See the GNU General Public License for more details: http://www.gnu.org/licenses.\r\n- You can view and download the source code of this app on GitHub: https://github.com/BasicAirData/GPSLogger\r\n- When The EGM96 Automatic Correction is enabled for the first time into the Setting Screen, the geoid Height file is downloaded from the NGA/NASA website. (File size: 2 MB).", 'descriptionHTML': 'BasicAirData GPS Logger is a simple App for recording your position and your path.<br>It&#39;s a basic and lightweight GPS tracker focused on accuracy, with an eye to power saving.<br>It works offline (without internet connection), it has NO integrated maps.<br>This app is very accurate in determining your altitude: enable EGM96 automatic altitude correction on settings!<br>You can record all your trips, view them with any installed external viewer, directly from the in-app tracklist, and share them in KML, GPX, and TXT format in many ways.<br><br>The app is 100% Free and Open Source.<br><br><br>GETTING STARTED GUIDE:<br>http://www.basicairdata.eu/projects/android/android-gps-logger/getting-started-guide-for-gps-logger/<br><br><br>IT FEATURES:<br>- A modern UI, with a low consumption dark theme and a tabbed interface<br>- Offline recording (the app has no integrated maps)<br>- Foreground &amp; Background Recording (On Android 6+ please turn off all battery monitoring and optimizations for this app!!)<br>- Placemarks creation also meanwhile recording<br>- Visualization of GPS information<br>- Manual Altitude Correction (adding an overall offset)<br>- Automatic Altitude Correction, based on NGA EGM96 Earth Geoid Model (Enable it on Settings!!!). On Android 4 this feature can only be enabled manually by following this simple tutorial: https://www.basicairdata.eu/projects/android/android-gps-logger/application-note-gpslogger/manual-setup-of-the-egm-altitude-correction-for-basic-air-data-gps-logger/<br>- Real time track statistics<br>- In-app tracklist showing the list of recorded tracks<br>- Visualization of your tracks using any installed KML/GPX viewer, directly from the Tracklist<br>- Track exportation, in the /GPSLogger folder of your device, in KML, GPX, and TXT<br>- Track sharing, in KML, GPX, and TXT format, via E-mail, Dropbox, Google Drive, FTP, ...<br>- Uses Metric, Imperial, or Nautical units<br><br><br>USE IT TO:<br>☆ Keep track of your trips<br>☆ Make accurate static and dynamic measurements<br>☆ Add your placemarks<br>☆ Remember the best places you&#39;ve seen<br>☆ GeoTag your photos<br>☆ Share your tracks with your friends<br>☆ Collaborate to OpenStreetMap map editing<br>☆ ...<br><br><br>LANGUAGES:<br>The translation of this app is based on users contribution. Everyone can freely help in translations using Crowdin (https://crowdin.com/project/gpslogger).<br><br><br>F.A.Q:<br>Problems with this app? Read the most frequently asked question! (https://github.com/BasicAirData/GPSLogger/blob/master/readme.md#frequently-asked-questions).<br><br><br>ADDITIONAL INFORMATION:<br>- Copyright (C) 2016 BasicAirData - http://www.basicairdata.eu<br>- For additional information please see http://www.basicairdata.eu/projects/android/android-gps-logger/<br>- This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. See the GNU General Public License for more details: http://www.gnu.org/licenses.<br>- You can view and download the source code of this app on GitHub: https://github.com/BasicAirData/GPSLogger<br>- When The EGM96 Automatic Correction is enabled for the first time into the Setting Screen, the geoid Height file is downloaded from the NGA/NASA website. (File size: 2 MB).', 'summary': 'A simple and lightweight app for recording your position and your path', 'summaryHTML': 'A simple and lightweight app for recording your position and your path', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.2314816, 'ratings': 1093, 'reviews': 582, 'histogram': [121, 30, 50, 161, 728], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'BasicAirData', 'developerId': 'BasicAirData', 'developerEmail': 'info@basicairdata.eu', 'developerWebsite': 'http://www.basicairdata.eu', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '7903282948427106279', 'genre': 'Travel & Local', 'genreId': 'TRAVEL_AND_LOCAL', 'icon': 'https://lh3.googleusercontent.com/fUUrplUOZ7bJDPL1kgeEDshgu0cIbL3er7Ge8WAT1Rr7pKUKFRYsP4hg9f9Tqpthuw', 'headerImage': 'https://lh3.googleusercontent.com/dsDIqsNv4cgEgpqs2VZpZOUoc5Z6KpPDIwKrRHAAV8qcFAPLMEvYwa2nBtZBNifwLFI', 'screenshots': ['https://lh3.googleusercontent.com/i27ljFrSKlOT3A3JMeMZDE5Fo1whmqqcaoFIUAkoqM4bAAnqZrgqZduJo0oCosJ_1PU', 'https://lh3.googleusercontent.com/Enf8ELsYy15oT97Tc57sNXnn4l8zXsjRkp3Dg0-xe-2KY9FajUGve7JsxzT9Q9v5hR72', 'https://lh3.googleusercontent.com/8WXEmQL-4-gM9klJDjxGZdGz2JTXBiqFLMoOXB-u5EHWXMs8ayZkhL9LYTZGDyTgmw', 'https://lh3.googleusercontent.com/Lbcs32_Cy7KPbIFFjw0Rau-3SkMTHGcQbUH2bsvzrtSg5EvkhfmllrZiqLlIdjfFpEst', 'https://lh3.googleusercontent.com/FYCoB4dOmcNv4Mu6ICq6HRK6NgrNQ7T-EobidxKibe-aIubAGj7OOmJmdXCKPSbdXw', 'https://lh3.googleusercontent.com/0xOmHiCx96VTpBnMtnAMi9Hije66mpK-I1qtWttK-fVJwaO5JCn43Zafm-7DBcqOew', 'https://lh3.googleusercontent.com/NXQ2UOWDDjIyNkVPLGtzPetSVUptodIgSzgQ1x7M6oBqtIiNcInNrFPHMDCuH3_JnUQ', 'https://lh3.googleusercontent.com/8Tt5nl4h1-_2JaxN6LHk9Ozhwum-c--6e80y8YKYSfjVIuDFsESynts_trd_PK_6xQ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Oct 19, 2014', 'updated': 1581872878, 'version': 'Varies with device', 'recentChanges': 'v2.2.5\r\n- Added a Light Theme for bright Environments\r\n- GPS Fix Tab now shows also GPS Time and Satellites (when possible)\r\n- Fixed a Bug that caused some Crashes on Motorola Android 9 Devices\r\n- Some Layout Refinements for Cards\r\nv2.2.3\r\n- High Frequency Recording (up to 20 Hz), thought for Bluetooth GPS Receivers\r\n- Possibility to Shutdown the App without finalize the active Track\r\n- You can resume the Recording of a Track after a Crash or a System Reboot', 'recentChangesHTML': 'v2.2.5<br>- Added a Light Theme for bright Environments<br>- GPS Fix Tab now shows also GPS Time and Satellites (when possible)<br>- Fixed a Bug that caused some Crashes on Motorola Android 9 Devices<br>- Some Layout Refinements for Cards<br>v2.2.3<br>- High Frequency Recording (up to 20 Hz), thought for Bluetooth GPS Receivers<br>- Possibility to Shutdown the App without finalize the active Track<br>- You can resume the Recording of a Track after a Crash or a System Reboot', 'comments': ['1) I installed yesterday. I have now tried 6 times to log on a trip, but after 46-47 seconds logging stops. I have tried to register on the homepage, but was prevented from doing so. 2) The response below is irrelevant. I had the settings on unlimited battery usage. Of course. And I tried to register to find a page with "HELP" or user forum. But I have tried from two computers and a tablet to register. I do not even get to entering a username, before I am blocked. (Sony Xperia, Android 10, latest update on April 1.) 3) I have tried in foreground once - no change. The rest was only in background. If you can call 46 seconds background. 4) I have allways had stamina to be activated at 25% or below. The battery level was 60-90% during my trials. 5) No, there is no message. By the way: why is it, you engage in this cumbersomme support. Instead of answering my mail or opening up your login registration. End of story from here.', 'Great at first but after 7 tracks it no longer gets a GPS signal even after 80 minutes. Tested today and it worked after rebooting phone. Also I must say I\'m using the free app and the developer responded within hours. Excellent service. Thanks guys this has helped a 50 yr old get fit again, who needs a "fitbit" thing.', "A simple and stable GPS logger. My phone reported high battery usage even when not recording, but on closer investigation this is not the case, it is my phone's battery management that groundlessly blames apps that are not managed by it. If not logging or being in the foreground, this app does not use power.", 'Works well. Easy to use and export the tracks. The only annoying bug is that it stops recording if I take a picture with my phone, so I have a lot of incomplete tracks.', "Does exactly what I needed it for - records my long distance tracks and I can mark POI's. Plain and simple interface, low battery consuming. So far no complaints.", "This is one of those rare delights in an app that does what it's supposed to do very well without being a nosy pest to phone or resources. Thank you!", 'My go to GPS recorder as it simple and reliable. Be nice to have automatic naming when marking a waypoint and add to the main screen new track run and moving time.', "I've used many GPS apps over the years and most fall short somewhere...well not this little gem. It does what it says on the box, is easy to use delivers exactly what a tracker should. Wonderful", "***Samsung Owner Warning: this app doesn't work unless your power save settings are set to 'High Performance'*** This app is easily the best lightweight gps logger I've used. Unfortunately, it seems that several distributions of android (looking at you, Samsung) ignore battery optimization settings and restrict its ability to work when the display is locked, rendering it nearly useless for screen-off tracking unless you max out your power settings and just use a battery bank.", "Simple and useful. It's like to have some auto sync to a cloud.", 'Is lightweight, user friendly and records tracks. It says Java error when downloading geod height file of 2028 kb. Does not download.', 'Seems to work well, but having to convert output to be seen on earth is real nuisance. Thank you will try that.', 'Does exactly what I need, no more and no less. Simple, fast, no accounts, no ads, easy to export data.', 'thanks! adfree and easy to use. perfect for hiking, biking ...', 'Great accuracy and super easy to use ... Just wish the export to google Earth worked.', 'Simple, easy to use. It just works. Great job!!!', 'This app provides me reliable trackings while running or cycling on trails mostly in forest areas.', 'Looking forward to test-driving the app. Reading through recent review comments, how/where on an Android 9 do I set Earth as the default viewer for KML?', 'Great app. Small and fast. Does everything it is supposed to do perfectly.', 'Easy to use app. Simple and useful.', 'Simple. Meets my needs without excess bloat.', 'The best free gps and tracker ever used.', 'This is just what I was looking for ... thanks ... fulfills the exact task in a simplistic way .. Wud have been fantastic, if there were an option to resume recording in a finished track (useful eg to compile placemarks in a locality without doing it in one go)', 'Works just as described. Depending on your phone, you could deplete the battery in five or so hours. For longer trips, carry a spare battery or an inexpensive power pack.', "Current version doesn't seem to like air travel very well. Old ver collected correctly (>3000 points) where curr ver <400 for same ~35min flight.", 'Edited: Overall experience has been excellent. Love the ability to pause the recording of a track and to add placemarks. I am presently using four different GPS apps simultaneously. File sizes are moderate compared to other apps. Good performance. - previously reported problem with track export was caused by the phone, not this application.', 'Very nice,very accurate works really good with maps.me... one thing that could be nice if the trackpoints have time stamps with the speed at that point for when i drive company car.', 'Superb "ultralight" GPX logger. If you want to have maps at the same time I recommend Oruxmaps. But if all you need is a logger this one is great!', "Excellent way to geotag photos. My DSLR doesn't have GPS, however running GPS logger and exporting the gpx file makes geotagging the photos simple using exiftool. Brilliant app!", 'where in the app can I find the names of the placemarks? when doing a basic test of adding a placemark and calling it "home" this bit of information is not visible anywhere. just a generic date/time entry. I\'d like more clarity in regards to the placemark names.', 'Love the app. Like the description says, its battery use is minimal. I tried 3 other apps and they all used more battery. My only request would be a way to pause recording the tracks. Would highly recommend it for a simple, effecient GPS track logger.', "Nice adaptation of open source, but it only records the track. A different app is needed to view the track, and I need to see it in real time. Seeing my photos on the map is fun, too. Can't do that with this app.", 'It is working on my Moto M. I would like to use it for quick placemark adding during my way to mark road holes or wrong streetlights... The placemark button is small and the dialog buton asking for placemark name is even smaller. I would  like an simple screen with one-touch buttons for marking interest placemarks.', "Good application that do exactly what it's supposed to do, in addition to lightweight code and the less invasive that you can imagine. In contact with developers they assure me future improvements in next update. So I'm on the wait. Thanks for the good job........", 'It\'s not clear how I set it running and then leave it running in the background. I\'m probably being dim but a great big button marked "start recording" would leave no doubt. And another marked "stop recording".', 'What an excellent app: easy to use, but powerful and effective. However, it really needs an option to add a more descriptive name to each track. Also if we could be prompted whether to save the track or not.', "very useful app.. however it's not giving the actual time, distance travelled and tracks after updating the app. it's giving straight line only. not showing bends. it used to show details before updates.", 'Excellent - I use GPS Logger all the time, and it always works perfectly. Plus, it\'s open source. A huge "thank you" to the developer. A+++', 'Great simple GPS logger. The settings are simple and functional without being complicated. You can download KML Viewer to instantly view saved KML tracks and points from within GPS Logger.', "I really wanted this app to work. I needed an on all the time tracker for myself for personal reasons, but it would never get a GPS fix. I left it on for an 30 min walk and it didn't record anything."], 'appId': 'eu.basicairdata.graziano.gpslogger', 'url': 'https://play.google.com/store/apps/details?id=eu.basicairdata.graziano.gpslogger&hl=en&gl=us'}
