{'title': 'Aegis Authenticator - Two Factor (2FA) app', 'description': 'Aegis Authenticator is a free, secure and open source app to manage your 2-step verification tokens for your online services.\r\n\r\n<b> - Encryption</b>\r\nAll of your one-time passwords are stored in a vault. If you choose to set a password, which is highly recommended, the vault will be encrypted using AES-256. If someone with malicious intent gets a hold of the vault file, it’s impossible for them to retrieve the contents without knowing the password.\r\n\r\n<b> - Biometric unlock</b>\r\nEntering your password each time you need access to a one-time password can be cumbersome. Fortunately, you can also enable biometric unlock if your device has a biometrics sensor (i.e. fingerprint or face unlock).\r\n\r\n<b> - Compatibility</b>\r\nAegis supports the HOTP and TOTP algorithms. These two algorithms are industry-standard and widely supported, making Aegis compatible with thousands of services.\r\n\r\n<b> - Groups</b>\r\nHave a lot of one-time passwords? Add them to custom groups for easier access. Personal, Work and Social can each get their own group.\r\n\r\n<b> - Backups</b>\r\nTo make sure you will never lose access to your online accounts Aegis Authenticator supports exporting your vault which you can import onto a new device. Aegis Authenticator also allows you to import from many other two factor authentication apps databases so switching to Aegis is made easier for you.', 'descriptionHTML': 'Aegis Authenticator is a free, secure and open source app to manage your 2-step verification tokens for your online services.<br><br><b> - Encryption</b><br>All of your one-time passwords are stored in a vault. If you choose to set a password, which is highly recommended, the vault will be encrypted using AES-256. If someone with malicious intent gets a hold of the vault file, it’s impossible for them to retrieve the contents without knowing the password.<br><br><b> - Biometric unlock</b><br>Entering your password each time you need access to a one-time password can be cumbersome. Fortunately, you can also enable biometric unlock if your device has a biometrics sensor (i.e. fingerprint or face unlock).<br><br><b> - Compatibility</b><br>Aegis supports the HOTP and TOTP algorithms. These two algorithms are industry-standard and widely supported, making Aegis compatible with thousands of services.<br><br><b> - Groups</b><br>Have a lot of one-time passwords? Add them to custom groups for easier access. Personal, Work and Social can each get their own group.<br><br><b> - Backups</b><br>To make sure you will never lose access to your online accounts Aegis Authenticator supports exporting your vault which you can import onto a new device. Aegis Authenticator also allows you to import from many other two factor authentication apps databases so switching to Aegis is made easier for you.', 'summary': 'A secure 2-step authenticator to manage your one-time passwords', 'summaryHTML': 'A secure 2-step authenticator to manage your one-time passwords', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.46, 'ratings': 461, 'reviews': 219, 'histogram': [36, 18, 4, 36, 364], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '5.1M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'Beem Development', 'developerId': 'Beem+Development', 'developerEmail': 'beemdevelopment+support@gmail.com', 'developerWebsite': 'https://getaegis.app/', 'developerAddress': None, 'privacyPolicy': 'https://getaegis.app/aegis/privacy.html', 'developerInternalID': '6089264894976084869', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/qDzsOmoRT9o6QTElCaRJElAtfYW-nnOadwIInb6bXSEKexB211SsEtSeZrF5xm_lKUY', 'headerImage': 'https://lh3.googleusercontent.com/w20ndekZr8rUmUPmP87-8FYEravN3-YAob4pZq7MZfv-M3wA3RU-gmbpcIRWmHvo_-4', 'screenshots': ['https://lh3.googleusercontent.com/VRhzCu4wz9GMUZiqFm4CgWDDVpP4yVFDqKkQ-chaYr8rv9RZKkg-x90j1ojMKWbN5L0', 'https://lh3.googleusercontent.com/zmsL52tvPsdDj72wat4tQiQdHU55FrVF-JjwOwGmixEqRGwpUEGpa3iPM8UdrXLf_O4m', 'https://lh3.googleusercontent.com/ERzTYjkZ2lLa_Hsk9c4jGomdTmXYq10zL_h2Fi_Ppdayy1CwW9sR0Kv9O1gvs7rPixM', 'https://lh3.googleusercontent.com/1ITLwIEdOWG5TQMP5WMYC5eG8rBJSRtUTwG-xo-w_6nEgns1qPxH72umNn9uOBjmgg', 'https://lh3.googleusercontent.com/S74cZeQaytSwidnOvYPW86HFrOKrIhNfYXvOrwCLKMmlhZR2MqPlUY79H0lUmqIgbSI', 'https://lh3.googleusercontent.com/jylWsX-GjcnU4uW46-hgI2rCeNxQSlKR8c5PG8Ipw60HWpwPgh1fGL_HVyQ0ZK-YXQ', 'https://lh3.googleusercontent.com/02De7mB7u6FxjRb7d5YgSMMPPm5SDLqv-m4Socl_2gAtqOPaC6hMjrapgdMSwb7D4ws'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Feb 9, 2019', 'updated': 1579727413, 'version': '1.1.4', 'recentChanges': 'This is a minor release.\r\n\r\nFixed bugs:\r\n- The export filename was missing the ".json" extension in some cases', 'recentChangesHTML': 'This is a minor release.<br><br>Fixed bugs:<br>- The export filename was missing the &quot;.json&quot; extension in some cases', 'comments': ["Not working. Install hangs on step #3 and does nothing. Also, installation is unclear. It says show password but if you choose that, you won't be able to confirm password. A hint would help! After you figured that out by yourself via trial and error, you need to scan fingerprint, again, to move on. that's fine, but why doesn't it scan it again? It did it before? Wasted too much time and with such an app mood, I lost trust in it. Sorry.", "Awesome app, I've used a lot of authenticators over the years, and Aegis of hands-down the best. The UI is fast, clean and practical. The import/ export feature makes switching to a new device easy. More importantly, it is open source with clear accessible code on GitHub, and there are zero trackers and very minimal permissions- meaning this app is great for privacy and security. It's fast, stable and appears to be mostly bug-free. This is now the only 2FA authenticator I recommend for Android", "Great app, I've been using it for over a year now. The biometric sensor comparability is a big plus over some other more limited apps, and UI is clean, and it's easy to make a local encrypted backup. Thank you to the developer for taking the time to make and maintain this app.", 'Simple, easy to set up with, great security options. I love that I can export my codes for backup purposes if I lose my device. I much prefer this to having to trust that my details are stored in the cloud (ie. Authy)', 'Probably the best 2-factor authentication app with bio-metric unlocking. Had some frustrations with reorganizing my list, however, I discovered how to do this properly. Hold the item you wish to re-order and then hold it by the icon. Took me a while to figure that out, after I figured that out - all was smooth sailing.', "Best Ive found so far. Please update so the encrypted database doesnt delete when app unistall without asking first like lockmypics or telegram does or an autobackup function. Had young son playing phone games & an ads sent him to the store. Storage space was low & google in the ineptitude decided to suggest removing apps based on size instead of lack of recent usage. He can't read so a few apps got removed including this one. Reinstalled but empty", 'Update: Reply Received. Thanking you for the support. Hope to see more awesome features in future versions especially Cross syncing, backup support . How to avoid a locked out situation when it is used in Gmail ( Phone reset, New device registration ) Urgently need cross platform/ backup code support. Without any active device 2FA codes cannot be accessible..?', "It does what it's supposed to do. I wish it looked a little nicer ie. icons for the sites like other apps and more layout options but that's just superficial stuff. Everything important works great!", 'Great app, does what it should do. + More important: One of the only apps that I trust, most of the 2factor verification apps need internet access, why? This one only has the necessary permissions, great job!', 'I don\'t like starting with "I am not technically inclined" but having done that I can tell you that (even) I can appreciate some of the features of this authenicator; for example the password/fingerprint protection. (Is it the only authenticator app with this attribute ?) (It would be nice if AEGIS would "automatically" pull in the icon for each site)', 'Switched from Authy to this as it was lacking organization, and some few features it was missing (dark mode for one to point out.) This app does it very well, looking forward for this app as it grows. Kudos to the developer. 👍🏼 🙂', 'Works great, but a function to display an item as QR-code to transfer it to another device would be useful.', "Best 2FA app I've found. I especially like the ability to add your own images and dark mode. I wish clicking back would just exit the app though, instead of taking you back to the login screen.", "I love the way it looks! Works great and it's customizable! The only thing I wish is a auto dark mode that switches from light to dark using the systems theme or a scheduler. Would pay for that feature.", "I'm migrating from andOTP to this app. It has a more appealing UX and has the ability to use a password and biometrics at the same time.", 'Would love to see an option to show certain groups and show other groups only after filtering instead of all of them at once. Other than that feature this app is simply brilliant!', "Hands down the best privacy authenticator I have used. I'm glad I made the switch from Google Authenticator to Aegis.", 'Open source, free, no ads, improving, amoled theme (ace), highlighting and darkens the rest when selected (very nice touch), backup possible (thx a lot) , can be used on multiple devices simultaneously (love it)... Euh what else? Maybe a different view than listing would be great because it gets tricky to find the right entry when we have a lot (I like the way authy present it). Automatic icon search (maybe). Remote deletion in case of phone lost/stolen would be very helpful.', "Overall really nice, I just wish it supported unlocking with my phones pattern unlock like several other similar apps allow. I'll keep this app in mind in case that option is ever added.", 'Really good authenticator app. Looks great and is easy to use.', 'Great app! Easy to use. You guys should take it to next level and make it more privacy focused. Also, the amoled feature is cool!', "Much better than most of the ones I tried. I think there is still room for improvement in all of these auth apps that have a growing number of accounts. At least this app allows for groups, but it's still two clicks away via the filter menu.", 'Clean, simple, but feature-complete. Always my go-to OTP app.', 'Just switched from Google Authenticator due to their screen capture issue. Should have done it long ago! This app rocks!', "Please add a cloud backup of my choice. Yes I can backup locally and upload that file to the cloud but it's not that convenient.", 'Pretty good, allows to export to other apps/devices and to put a password on the app itself.', 'Basically the best authenticator app and it has a dark mode.', 'Aegis is an authenticator app that offers the ability to lock and migrate your vault. It is a full featured app offering considerable enhancements when compared to the Google Authenticator app.... A must have!', "Seems like a decent app but it can't import all my tokens from Authy. Unfortunately I'm not willing to mess up my logged in accounts just to switch authenticator apps, so this is unusable for me.", 'Good app for 2FA. Takes more time to scroll through many codes at once. Though Filters are helpful, additional option of folders would be more helpful for easy scroll through.', 'Just started using Aegis, coming from a bunch of other Password vault apps, Aegis is easy to use, beautiful, flexible, functional and open source, just perfect for my needs. Kudos for a great app!', 'One of the best open source authenticator apps. If you want an alternative to Google Authenticator, this is the one.', 'Functional, easy to use, open source, and works on older devices. I really appreciate the import /export so I can have my codes on multiple devices.', 'Icons can be changed to anything you like nice export file feature incase you have to change phones or just to keep a backup Aegis covered all the bases', "Great but anoying thing is At first it flashes white even though I'm on dark mode when opening the app", "Works, but why don't any of my listings have an icon? Just a letter", 'Good TOTP/2FA application with fingerprint unlock and a good security standing.', 'A great app,happy to move from GA.I tested import file (encrypted) and work like a charm.', "Great app that's easy to use. I like the export feature as well. 👍🏾", "No I don't want to enter my password just because it's been a little while. Biometrics are fine for this safety device."], 'appId': 'com.beemdevelopment.aegis', 'url': 'https://play.google.com/store/apps/details?id=com.beemdevelopment.aegis&hl=en&gl=us'}
