{'title': 'EasyBudget', 'description': "Let’s face it: Most budget apps are too complicated and their design looks like it come straight from... 1994. If you are looking for a <b>clean and easy-to-use app</b> to manage your money then here's the good news: With EasyBudget you just found what you need!\r\n\r\nA list of what EasyBudget does <b>NOT</b> do:\r\n\r\n• Manage multiple accounts: 1 account is all you need (and probably all you got)\r\n• Classify expenses into categories: Ain't nobody got time for that!\r\n• Show charts and statistics: What for? Check your balance in 1 second and go on with your life!\r\n\r\nThis app is simple, seriously simple. Exactly what you expect your budget management to be. Oh and.. <b>It's free</b>!", 'descriptionHTML': 'Let’s face it: Most budget apps are too complicated and their design looks like it come straight from... 1994. If you are looking for a <b>clean and easy-to-use app</b> to manage your money then here&#39;s the good news: With EasyBudget you just found what you need!<br><br>A list of what EasyBudget does <b>NOT</b> do:<br><br>• Manage multiple accounts: 1 account is all you need (and probably all you got)<br>• Classify expenses into categories: Ain&#39;t nobody got time for that!<br>• Show charts and statistics: What for? Check your balance in 1 second and go on with your life!<br><br>This app is simple, seriously simple. Exactly what you expect your budget management to be. Oh and.. <b>It&#39;s free</b>!', 'summary': 'Budget planning made simple: Easy to use app to manage budget on a daily basis.', 'summaryHTML': 'Budget planning made simple: Easy to use app to manage budget on a daily basis.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.6266093, 'ratings': 4676, 'reviews': 2521, 'histogram': [20, 40, 120, 1304, 3190], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '3.0M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Benoit Letondor', 'developerId': 'Benoit+Letondor', 'developerEmail': 'easybudget@benoitletondor.com', 'developerWebsite': 'https://benoitletondor.com', 'developerAddress': 'Benoit Letondor\n53 Avenue Condorcet\n69100 Villeurbanne', 'privacyPolicy': 'https://sites.google.com/view/easybudget-privacypolicy/home', 'developerInternalID': '6007781904640335085', 'genre': 'Finance', 'genreId': 'FINANCE', 'icon': 'https://lh3.googleusercontent.com/tzaD7rQtrJ-p_maMqKxdWfqPN3B4pjyk2H8pniqTA8zm6OjiPE_I85jtFLMRKtBEGOs', 'headerImage': 'https://lh3.googleusercontent.com/2gCBCoBwobmVTWUlS-2Ei6QKH0VjxrV-g-uIlF_zubxbUliVyVfFHncGdqDQv1zfSA', 'screenshots': ['https://lh3.googleusercontent.com/12Iw6yKWaZlH3THurYd1idZHiOP101ttODKHB81BgCsgkhsaPse_XiP98sAHKlgCkjw', 'https://lh3.googleusercontent.com/vDS5YWHu7GfA2GNVbYugPqhVDvE-oFzqKdK5YKcSrGBOZKHBAhhtsUsLMdtfAbzrFs8', 'https://lh3.googleusercontent.com/vF-UzlSws0rPVP-jkn-o0rdoT6D2KAHZGhrKFX8d8KXcfw7WQUMWTJE5ttbNLq14X3I'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 2, 2015', 'updated': 1589403424, 'version': '2.2.0', 'recentChanges': '- New feature: edit recurring expenses/incomes\r\n- Minor bug fixes\r\n\r\nThank you for using EasyBudget!', 'recentChangesHTML': '- New feature: edit recurring expenses/incomes<br>- Minor bug fixes<br><br>Thank you for using EasyBudget!', 'comments': ["I don't usaally write reviews but for 'EasyBudget', an app I've been using for just over a year (I think two years now?) I just had to! It's an excellent budget tracking app. Simple, easy to use, does the job, no fluff and free! Honestly, since downloading it, I've pretty much stopped writing all my budgeting down and used the app purely for everything. I highly recommend it if you want to make that transition or even if you want to use it a supplement to existing budgeting methods.", 'I like the simplicity - I\'ve used overly complicated money apps before and I\'ve eventually gotten over the hype of them.. I think this app could use a few more features though: a simple search function would be great - that way if you did want to categorise your own expenses you could see a total result just by naming the expense "Grocery:" or something. Otherwise, great app.', "Brilliant app, easy to use and able to setup on going bills without any problems. When I take money from my bank account as cash in hand, I enter the amount taken and don't update the app when I spend the money. This works really well for me!", 'Basic and super easy! I just needed something simple to track my budget. It keeps a running tally, so you know if your expenses stay within your income. Just what I was looking for.', "I like the app so far. I would really like to have more options for the recurring transactions though. I have multiple things that occur on 6-7 week intervals and that isn't an option.", 'Pretty good app. Allows you to set recurring and fixed income and expense. Would be good if one could create a budget.', "Please add a section where you can see one by one all expenses as a list, so you can take a real quick look on what things you've spent your money. Thanks", 'Great app easy to use and keep track of money, spending and budgeting for future income/expense.', "Easy to know what money I have left after all my reoccurring bills are paid or the money needs to be sitting in my account to be taken out by auto pay for a bill due later in the month, and I don't want to accidentally spend it. While checking my online bank account is still necessary, to see if I have money to spend after bills are paid I check this app instead to see what I show as funds left to use. This prevents bill money being spent as well. No forgetting I still had bills to pay.", 'Very good and easy to use, would like to be able to use another account alongside such as credit card', 'Great for tracking how much money your spending, easy for beginners!', 'Simple and uncomplicated. Works Perfectly as long as you remember to enter the daily data.', 'Nicest, most inoffensive and logical simple budgeting device I have found. Free, no ads...Thanks.', 'Life is busy, helps our stress levels by knowing when, where and how much is due at certain days of the month. We rent to our son, utilities are seperate and to know instantly where the account level is is awesome. I screen shot balances easy peasy receipts, we dont argue in our marriage due to this... well... not about the rental :) THANK YOU!', 'Very good.user friendly. Be nice to be able to run two budgets simultaneously', 'I love this app, simple and easy to use understand. Is there a way my spouse can log in to my account so we can share the budget?', 'Love the app would be nice if it could manage two separate accounts such as personal and business', 'This is definitely the easiest budget app out there.', 'Nice app, needs an improvement to amrk items paid.', 'Pretty good but would be cool to have a monthly break', 'Great app. Super easy. I like knowing the exact balance in my account at all times, and knowing how much will be in my account at a future date. Just tap on a date to know your projected balance, income and expenses for that day and add in items as they occur. Nothing fancy. No unnessecary pie charts. Great for someone who understands their spending habits and just wants to keep track of the balance in their account to plan for future expenses or savings.', 'Simple and effective what I have been looking for', 'very easy to use and Good app.', 'This app is extremely easy to use and is exactly what I\'ve needed. I was surprised to find that there were no other apps with a similar set up to this one, most "budget apps" make you hook up your accounts and give away private information but this one just uses the numbers I plug in. It saves me about an hour a week if not more. Now I don\'t have to sit in bed worrying about where my budget spreadsheet went or any miscalculations that take hours to fix.', 'I find very helpful and easy to use.', 'Love this app, it is exactly what I have been looking for as it is separate from my bank and it helps me plan and predict money that is due in and out. Most budgeting apps breakdown spending and those are not useful to me tbh so this is the better method for controlling my finances. The monthly layout is beautiful and simple and the fact that I can put payments on a loop/repeat helps me to avoid nasty surprises (going into overdraft and then owing the bank £12 a day). Thank you developers!! ❤', "I enjoyed it enough that I went ahead bought the premium. However; since it's not linked to debit cards (which I like) and you still have to physically pay the bill, I'd like to see an option to be able to mark off your expenses as paid/unpaid (even if it's just a color change of the entry to signify an expense paid) to help clarify days that may have a lot of entries", "This app has been very helpful for me and my girlfriend to get our finances back on track. It is simple enough that the manual aspect is pretty easy to overlook. Honestly it's nice not haveing it that connected to my financial life. Allows me to really play with my finances and see how I can budget for success in the future. In all I would say if you need to just see everything laid out in front if you this app will get you right where you need to be. Great job to the developers of this app!", "I am loving this, it's so simple and I can see if I spend today if I will mess up in future easily, PLEASE make this available on iPhone, Amazon and other devices so my family and friends can start to benefit from this app 🌟🌟🌟🌟🌟 The only other suggestion I would make is to offer an edit all option. Also please consider for premium being able to have a second to switch between, that way I can keep my billing and spending accounts separate.", "I really love this app. I've been looking for a budget app for awhile and finally found this one. It's easy understandable and doesn't need any card information. Only thing I'd like better is if you could mark the bills as paid, scheduled, past due, ect. Have premium and it's worth it.", "I purchased premium, hoping more premium options will come in. First of all, great work on your app. It's a simple, easy to use platform for keeping track of finances, exactly what I was looking for. Please add an enable expense reminder notifications option to premium features, that would make your app a perfect 5*.", 'Best budgeting app out there!', 'Very easy and great way to start a budget. This app has so much potential. This is my very first rating of ANY app. This app is worth it. Although id say i see no real advantage to buy the pro verision( it really dont add anything that the free version dont already give you)', 'pretty simple and easy to use app.', 'I love this app. I used to track my budget in a spreadsheet, but I happily kissed it goodbye. I like being able to look ahead at my cash flow. The monthly budget report is really useful, too!', "This app is just what I needed to keep track of my bills when they're due and a daily running balance. It's simple and easy to use. Would be nicer if it had a bill due notification and a cleared options.", 'Easy to use.... Exactly what I need!', 'This App was exactly what I was looking for easy to use, simple and quick to enter information with no complications. If you just want to the keep track of basic incomes and expenses this is great.', 'Simple and unobtrusive. Exactly what I need for a pure budgeting app, not interested in data mining your life. Perfect. Only request would be a way to organize the monthly budget report.', 'As a new user of your EasyBudget app I was most impressed with all the positive reviews before and above all else. I love that you have incorporated the necessary elements like daily spending. I will get back too you once I have used it for a month or so. Thank you so much for sharing your knowledge and simplifying the financial aspects of tracking funds. Keeping the financial record straight and as clear as possible is very important to me. Great job!'], 'appId': 'com.benoitletondor.easybudgetapp', 'url': 'https://play.google.com/store/apps/details?id=com.benoitletondor.easybudgetapp&hl=en&gl=us'}
