{'title': 'WhereYouGo', 'description': 'It supports playing Wherigo cartridges, which is an interactive location based geocaching game. You can load, play and save the current state of your Wherigo game. Compass and online or offline maps can be used to navigate, alternatively Locus can be used to display maps.\r\nCartridges for usage with WhereYouGo can be downloaded from https://www.wherigo.com and other services.\r\n\r\nMain features:\r\n- Automatic download of cartridges from wherigo.com (can be triggered from your browser by opening a listing page on wherigo.com or from other geocaching apps like c:geo)\r\n- Use compass to navigate to the next game zone or location\r\n- View game zones and locations on a map\r\n- Uses online maps from various sources\r\n- Supports offline map files (only Mapsforge v0.3 format at this moment)  \r\n- Seamless interworking with Locus to display maps (alternatively to internal maps)\r\n- Several save game slots per cartridge\r\n- Automatic game saving when switching to another app\r\n- Integrated QR-code reader\r\n\r\nAbout:\r\nWhereYouGo is OpenSource and licensed under GNU General Public License v3.0.\r\n\r\nAfter the source code was unmaintained for several years, a new development team (the c:geo team) was - with agreement of the orignal author - finally able to take over the source code and continue app development.\r\nIf you are able and willing to help us, you can find information and source code in the link below. We need your help: https://github.com/cgeo/WhereYouGo\r\nThe core of the application is based on OpenWIG, it uses the Mapsforge library to display maps, alternatively Locus can be used.\r\n\r\nNotes:\r\n- When manually downloading cartridges from wherigo.com, make sure to use the version "Pocket PC Device". \r\n- Copy the cartridges into your Wherigo folder (Settings - Main - Wherigo folder). Make sure you granted the application permission to write to external storage and you have write permission in selected directory. Some newer devices don\'t allow writing to SD card. If you\'re not sure, set "Wherigo folder" automatically.\r\n- If you have problems installing or using WhereYouGo please contact us at whereyougo@cgeo.org \r\n- If you would like to know why WhereYouGo needs the permissions requested, please check https://github.com/cgeo/WhereYouGo/blob/master/PRIVACY.md for an explanation.', 'descriptionHTML': 'It supports playing Wherigo cartridges, which is an interactive location based geocaching game. You can load, play and save the current state of your Wherigo game. Compass and online or offline maps can be used to navigate, alternatively Locus can be used to display maps.<br>Cartridges for usage with WhereYouGo can be downloaded from https://www.wherigo.com and other services.<br><br>Main features:<br>- Automatic download of cartridges from wherigo.com (can be triggered from your browser by opening a listing page on wherigo.com or from other geocaching apps like c:geo)<br>- Use compass to navigate to the next game zone or location<br>- View game zones and locations on a map<br>- Uses online maps from various sources<br>- Supports offline map files (only Mapsforge v0.3 format at this moment)  <br>- Seamless interworking with Locus to display maps (alternatively to internal maps)<br>- Several save game slots per cartridge<br>- Automatic game saving when switching to another app<br>- Integrated QR-code reader<br><br>About:<br>WhereYouGo is OpenSource and licensed under GNU General Public License v3.0.<br><br>After the source code was unmaintained for several years, a new development team (the c:geo team) was - with agreement of the orignal author - finally able to take over the source code and continue app development.<br>If you are able and willing to help us, you can find information and source code in the link below. We need your help: https://github.com/cgeo/WhereYouGo<br>The core of the application is based on OpenWIG, it uses the Mapsforge library to display maps, alternatively Locus can be used.<br><br>Notes:<br>- When manually downloading cartridges from wherigo.com, make sure to use the version &quot;Pocket PC Device&quot;. <br>- Copy the cartridges into your Wherigo folder (Settings - Main - Wherigo folder). Make sure you granted the application permission to write to external storage and you have write permission in selected directory. Some newer devices don&#39;t allow writing to SD card. If you&#39;re not sure, set &quot;Wherigo folder&quot; automatically.<br>- If you have problems installing or using WhereYouGo please contact us at whereyougo@cgeo.org <br>- If you would like to know why WhereYouGo needs the permissions requested, please check https://github.com/cgeo/WhereYouGo/blob/master/PRIVACY.md for an explanation.', 'summary': 'WhereYouGo is an unofficial client for Wherigo Geoaching.', 'summaryHTML': 'WhereYouGo is an unofficial client for Wherigo Geoaching.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 2.528302, 'ratings': 2078, 'reviews': 954, 'histogram': [1006, 156, 209, 222, 483], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.5M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Independent developers', 'developerId': 'Independent+developers', 'developerEmail': 'whereyougo@cgeo.org', 'developerWebsite': 'https://github.com/cgeo/WhereYouGo', 'developerAddress': None, 'privacyPolicy': 'https://github.com/cgeo/WhereYouGo/blob/master/PRIVACY.md', 'developerInternalID': '5569046066808833563', 'genre': 'Travel & Local', 'genreId': 'TRAVEL_AND_LOCAL', 'icon': 'https://lh3.googleusercontent.com/mlrUU_gcpISpaDg4pB23pK0EEVaB41xhwE61mYvO1ELPN4LvjEvDhrmGer8GBrbqc7B6', 'headerImage': 'https://lh3.googleusercontent.com/w4RPz4qojerP8GpkJrvD8n5injZz2W-OtSF7TSaD-fXyEVbj16unAXC3Zi6B9UgrVkQ', 'screenshots': ['https://lh3.googleusercontent.com/bXFihaE-IJFHYoyYcuxCgDMPJ7mZCMPlzvWGouO4Gmo6idUbeKAyBkuaRAyIUC7XAMs', 'https://lh3.googleusercontent.com/itZwvI7kNwKbAs6BB0kO2N8T2YEzxx8905Stul7zzAfFLXwCFRwAR-bnui3aJgRMLgM', 'https://lh3.googleusercontent.com/jbXvgKrObY2q_ySbn2WjP1dHzeWiHQP8S9N8LZSBkSnDoAX9_3pMBNmo0vM66_lgmQ', 'https://lh3.googleusercontent.com/j-iQnOHW77omwoV6d_pNlHmdMNdP1rn-3bUZCKlMKfRUDD8EwNUXfOWqF42J8oUYqMo'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'May 3, 2010', 'updated': 1586965748, 'version': '2020.04.07', 'recentChanges': 'Version 2020.04.07:\r\n- Fix crash on starting cartridge on Android 8 devices\r\n- Update translations for several languages\r\n- Various small code improvements and fixes\r\n- Update contact information for user support\r\n- Set default map to OSM instead of an empty map\r\n- Allow the app to run if screen is off', 'recentChangesHTML': 'Version 2020.04.07:<br>- Fix crash on starting cartridge on Android 8 devices<br>- Update translations for several languages<br>- Various small code improvements and fixes<br>- Update contact information for user support<br>- Set default map to OSM instead of an empty map<br>- Allow the app to run if screen is off', 'comments': ["I have a Galaxy S10e and I can't even get this app to work. I keep getting download error everytime I try to download a wherigo. And the website keeps crashing everytime I try to download off that too. I would love to be able to find Wherigos, FIX THE PROBLEM.", "Map freezes and will not display wherigos outside my immediate area. Uninstalled and reinstalled, still doesn't work.", "Where is the submit button for you credentials?? Also, this app won't open cartriges despite them being in the right folder, renamed and with the .gwc file extension.", 'I love playing whereigo caches, but right now there is a problem with the app. When ever I try to get into all the options, like the map, locations etc. The app crashes. Every. Single. Time. Again, I love playing whereigos, but this problem makes it impossible. I have an XT1710-02 running Android 8.0. if any other information is requested (about my phone), I would be happy to provide. Plz fix', "I haven't been able to use where i-gos for months and pretty much gave up on my Android phone of trying to use one. I have uninstalled and reinstalled the app about three times on my Google pixel phone. I have downloaded the cartridge off the geocaching website from Chrome, Firefox, and directly from c:geo app. I still cannot get where i-gos to play", "Thank you so much guys for fixing this. Love doing wherigos but haven't been able to for several months due to the issues with downloading them to my android phone. Have uninstalled the old version and reinstalled the new one and everything is working fine again. Thank you :)", 'Trying to make this work with the whereigos from the geocaching app, but everytime I try to download the cartridge it says I need to login. So I enter my information and nothing happens, there is no button to submit my login credentials!', 'Thank you, thank you, thank you. I just did an update for the app and it appears to now be working. I loaded 3 WIG cartridges and they loaded seamlessly.', 'The recent faults are fixed, and the future looks good now the app is being maintained', "Big thanks to the c:geo team for taking over the development of this app. It was extremely disappointing that the only WIG app we had was unusable, so this update, that just came out is really welcome. My last experience before update was bad, I was trying to find a reverse cache and I couldn't get it to work. After update I haven't had any issues with it, even though I tested it only for a short time. Nonetheless, I'm super excited for the future of this app and wish developers the best of luck", 'I am having the same issue that others have had. This used to work very well on my Android moto x4, but now I am unable to upload new cartridges. Very disappointing. I recognize that this is not the fault of the WhereYouGo developers, but the bottom line is, the only way to get the rating up for this is to address the issues, beginning with a statement that you are aware of them and are working on a solution. UPDATE: Many thanks for the acknowledgement of the problems, and the desire of the new folks to try to fix thing! THis is VERY appreciated :-)', 'I used to give this 5 stars, but without recent updates, it is not working with the recent Android updates. Please make updates. It was the best app for geocaching. Will try adding via computer link until the download feature is fixed.', 'After installing and uninstalling several times I keep getting the same message that the app has stopped working.', "I can't get any of it to work. The app starts up and I can navigate through the different pages but it stops there. It barely loads a map and will not display any Where I go Caches.", "I took a chance on downloading the app. Nope. Not gonna keep it as it won't let me login. I really wanted to try it and see how it works. It's not worth my time to struggle with an app. I appreciate that someone responded. I'm not sure I'll try again or not. If the new group can get it up and steadily running it for a while then sure. I like the idea and would love to have fun with it. If it works well I'm willing to change rating.", "I have been trying to download a cache near my home. I can't get any to download as it wants my login credentials, I signed into geocache through my Facebook. I've tried both the geocache username and my Facebook login and I still get the fail to download error. I've looked online about how to remedy this and it's a lot of changing folders and manipulation that I truly dont understand. I've been excited to continue my cache campaign, but cannot.", "Very frustrating experience. It worked well for a friend on his Android phone, so I excitedly tried it. But I kept getting the downloading error message all the time even though I'd successfully logged in using my username. Wasted a lot of time on this.", "after many attempts to get this app to work, I finally cracked it! it's a bit of a pain to suss out downloading and loading the cartridges, but now I'm flying. if you're having issues, there's some good tutorials on the geocaching website.", "It works but you have to download the cartridges from your browser,(pocket PC format) and then put them in the apps cartridge folder.(I just changed my default cartridge folder to my downloads folder for simplicity) downloading cartridges from the app doesn't work but doing it the way I described, works perfectly!", "Random! Sometimes app works great, sometimes not at all. it's been working fine on my last phone but today I got a new phone and there's no menu. no menu button so i can't download cartridges. uninstalled. will try again.", "Flakey. Sometimes will download a cartridge but often won't. Once it's working it works well.", 'Loved this app and appreciate the work to get it up and running again any update when we will be able to download caches again', "Uses last year it work good now nothing even pops up can't even download the cartridge anymore. What a shame.", 'app crashes alot, saving is not working on android and might crash app. crashes happen: if screen rotates, if screen goes off, if you try to save. through some effort i was able to log and get through the stages however constant crashes and map error messages made very unpleasant experience.', "Details on map do not load. GPS coordinates are off, although that could be the cache creator's fault. Fact that map doesn't load and it's just flags on a blank, grey screen is a problem", 'App continuously crashes since the last update.', 'Very frustrating. As with other users, getting download error message. No help files available and looking at reviews, no response from developer.', "I can't get it to work. I've tried for hours. I've tried everything and suggestion I can find. It seems as if it often a flawed app. Many people report problems with the app.", "As so many others have stated, I cannot download a cartridge. I'm getting a log on error even though I have verified my username and password are correct. Please fix your app.", "disappointed android phone login error, the authentication process doesn't work, u need to look at your code, , app is now useless.", "Tried this app over a yr ago but quickly became frustrated with it and uninstalled it. Recently gave it another chance. It should not be so difficult. Am going to try it this weekend and if it doesn't work....", 'Unfortunately it is useless on my smartphone. I am unable to pan the map. The snap to gps position is not working either.', "Got a reply from developers, they're working in a better version, I truly hope they get there since I'm missing out on where I go caches. Good luck to all.", 'After being instructed by another geocacher in how to use this app, it seems to work OK. Clearer directions should be given to use the app', "Installed and ran cartridge without issue. Do need to download through chrome then move file from download directory to apple's file directory.", "it won't let me download anything. I know for fact my password and geocaching name are correct.", "Can't load cartridge. Not able to do anything with it.", 'Could not down load any credentials even after uninstalling and reinstalling the app a few times', 'Do you know when it will be functioning again? What is a good app to use in the mean time?', 'Works a treat!  No probs loading and using this one!'], 'appId': 'menion.android.whereyougo', 'url': 'https://play.google.com/store/apps/details?id=menion.android.whereyougo&hl=en&gl=us'}
