{'title': 'BlowTorch MUD Client', 'description': 'BlowTorch is a basic telnet client that supports the following features that people find helpful for playing MUDs. \r\n\r\nMCCP Compression\r\nANSI Color Codes\r\nAliases\r\nTriggers\r\nTimers\r\nAs many custom buttons you can make!\r\n\r\nBlowTorch now supports Portrait mode as well as Landscape mode!\r\nMUD/MUSH/MOO Servers are text based games that operate similar to terminal applications. A host name and port are used to connect a player to a game. Game servers can be found at http://www.topmudsites.com and http://www.mudconnect.com\r\n\r\nCustom buttons are made through long pressing the window where you want the button to be. Buttons can be grouped onto pages by using button sets accessible through the MENU button.\r\n\r\nTriggers can be extended by turning off "Literal" parsing. This will enable regular expression parsing for the entered pattern. Capture group text may be replaced in response actions by using $1,$2,$3, etc, where the number specified is the index of the captured group.\r\n\r\nProblems, Questions and Bug reports should be emailed to the developer email address for the quickest response.\r\n\r\nHappy mudding!', 'descriptionHTML': 'BlowTorch is a basic telnet client that supports the following features that people find helpful for playing MUDs. <br><br>MCCP Compression<br>ANSI Color Codes<br>Aliases<br>Triggers<br>Timers<br>As many custom buttons you can make!<br><br>BlowTorch now supports Portrait mode as well as Landscape mode!<br>MUD/MUSH/MOO Servers are text based games that operate similar to terminal applications. A host name and port are used to connect a player to a game. Game servers can be found at http://www.topmudsites.com and http://www.mudconnect.com<br><br>Custom buttons are made through long pressing the window where you want the button to be. Buttons can be grouped onto pages by using button sets accessible through the MENU button.<br><br>Triggers can be extended by turning off &quot;Literal&quot; parsing. This will enable regular expression parsing for the entered pattern. Capture group text may be replaced in response actions by using $1,$2,$3, etc, where the number specified is the index of the captured group.<br><br>Problems, Questions and Bug reports should be emailed to the developer email address for the quickest response.<br><br>Happy mudding!', 'summary': 'Mud with ease from your Android device! Check out BlowTorch today!', 'summaryHTML': 'Mud with ease from your Android device! Check out BlowTorch today!', 'installs': '50,000+', 'minInstalls': 50000, 'score': 3.6944444, 'ratings': 1456, 'reviews': 680, 'histogram': [229, 94, 229, 242, 660], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '5.2M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Happy Goat Studios', 'developerId': 'Happy+Goat+Studios', 'developerEmail': 'dan@happygoatstudios.com', 'developerWebsite': 'http://bt.happygoatstudios.com', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '7282325825131283763', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/_Sm_6bUy35uPhGEZYIhb7K2dIyuzGNNxqt6M8QK41ZTEBGwuzZPDqfN76f_oElg25A', 'headerImage': 'https://lh3.googleusercontent.com/rGosFOGWq9nsn48kBeUsl2Oj9JNqMyzPblY-i2iOvSr4dWkJE0xcQ038rTHqAkY6KRnD', 'screenshots': ['https://lh3.googleusercontent.com/tMz-N_Jabq2_K7T7u4G2O11XLHeUvMzP1C_bdeRJhJIS_7hDPmN1F5y1NBLo5kChZeA', 'https://lh3.googleusercontent.com/ieg0XvTurcgJrCSHwl2-n3MYYQdKH9-9XsJiX7oUiZRtXtYyxFsVVRGuP-tjAwAS70Iy', 'https://lh3.googleusercontent.com/F1FSZZoigXiN3RJqwJNKKPnjrByYZUXvP3p7h2Z3ue6wQWw9plTvrYT9UGvCpdcbfsU', 'https://lh3.googleusercontent.com/4yiSgSESkv7kVgF4owLep2OuH3bydr862-DX2dUXmRJ88DA0lolWjSieXHHny1lHyQ', 'https://lh3.googleusercontent.com/n8hhQy5QLh-CzB5-5qd6kymNYhENfAiCuDXpFEoibQRzfeF3oXKboMjoz6Qa18M48Q', 'https://lh3.googleusercontent.com/AuovoiYPvB1awbMKOdvB8fothAZUBuoD8467wxCw-uAq3q79wVCPaaBaxZ0oZzkkQDl1', 'https://lh3.googleusercontent.com/FKX6U8W9Qve7bP37WA45xgTdS5BSHru2bbAOeMPx4PJNucAufeyrnTVwGoVc_pg_uLg', 'https://lh3.googleusercontent.com/1Z6ZZZr8DoPPeQNopArCy78XFUAFWNJ8itISG3z_aTnKq4IvgepkbfZabrIUz2u_e9Y'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 12, 2010', 'updated': 1543707953, 'version': '2.1', 'recentChanges': 'SD Card Permissions are now asked for.\r\nSupport fixes for newer android versions.\r\nFixed crash when touching the top of the window.', 'recentChangesHTML': 'SD Card Permissions are now asked for.<br>Support fixes for newer android versions.<br>Fixed crash when touching the top of the window.', 'comments': ["Love this app. Tried several others for MUDs. This one is the best. Only issue for me is that the content of all my timers gets wiped out anytime the app is closed completely. Tried to visit the forums to see if they were of any help but the forums don't seem to exist anymore.", "It's handy when it comes to playing MUDs. Works well for the one I play. Unfortunately, it crashes periodically and often loses my saved info (game and port, triggers, button sets, etc.) It's frustrating because of that. It's easy to use, but I have to set up buttons and triggers and the game access information several times a week.", 'For the most part I would not suggest any other client than this one. The only thing that is a thumbs down is the app randomly "crashes" even though it really doesn\'t? After that happens if you do not completely close your connection window and open a new one the previously sent characters remain and it acts funny. Other than that it\'s great. Good job!', "Very good. Fluid, easy to use, highly customizable. Only problem is my world list keeps vanishing and I have to type in my worlds all over again, which is mildly annoying but isn't a big deal for me since I only play one or two MUDs frequently. Overall a very good client, better than all the others I've found on the Play Store.", 'Unstable and feature light. Barely any scripting and the features that do exist sometimes fail (e.g. timers rarely work when activated by script; triggers sometimes lose reactions, possibly not serialized/deserialized correctly and disappears after reload). Also, back up your configuration often! I lost mine twice in less than a month. That said, still super convenient way to enjoy your favorite MUD on the go.', 'Very useful app. I really like playing MUD games, and this app is just what I need.', 'Every time I start it up, my saved connections are gone, along with all the programs (triggers, aliases, etc)', "I cannot use this client at all. I use a tablet device with an added braille display and keyboard, and this app does not allow me to easily read the text on my display. To me it looks like there's no text. I really would like to give this a higher rating, but it needs serious improvement for those of us who have screenreaders or braille displays.", "I was short surprised by how easy to use this app was. It allows me to play my MUD with no issues. I've had it disconnect on me a couple of times but usually it is for a legitimate resin (Connection to a different wi-fi source, etc). Overall fantastic app!!", "I use this to play Materia Magica, and it's surprising how well it works on my basic phone. I really like the customizable action icons on the screen, and the ability to shift them around! Good job on the whole thing!", 'Until I can connect to my game this will get 2 stars, i can connect no problem via PC but for mobile it wont connect', 'I wish you had built in mxp and msp support, and much of the time when I close the app, the world info for every world has to be input again because it disappears seemingly at random. Other than that, I appreciate the xterm color support.', 'Pretty good mud client. Comfortable idea with buttons 5*. Alias dont work with russian language in KIO8-R(send only ???), work well with numbers and english.', "Great MU* client--fast, lightweight, and easy to use. Can't beat no ads and zero cost!", 'Just perfect for text RPG games. Tried others but this one is perfect for mobile phones anf very friendly yo user.', 'at first it worked nicely, but after an hour it just broke down and crashed every second.', "Incredibly simple client, and hasn't seen much love. Buttons on the front page are even missing text until clicked on.", "Good mid client for all your mudding needs. Has customized button overlay to just press to send you're created macros.", 'buttons were blank on first startup. Not sure what to press.', "Cannot create buttons, help files don't show how because the app behavior doesn't match what is happening.", 'Works as expected. Great work Devs, and Thank you!', 'No forced advertising thank you guy!!', 'No multiplay support? Unusable!', "Does anyone know why the aardwolf isn't on playstore anymore? I have to resort to this now.", 'No SSL, get with the times!', 'Clumsy and not easily configurable.', 'Great for mudding on the go.', 'For a phone mud app it is tops', 'usefule and amazing', 'Please do an update', 'Works great for me.', 'good good good best mud client ever', 'Good until my world breaks', 'Kept losing muds', "I would like to download an earlier version of this, because it workex better. Anyone know where I could DL the version of 2016? Too many crashes. Unable to select and copy text on screen. App needs work. What's bad is when I try to go to Forums for help, I just get an error message instead of the website :(", 'Dropped the stars because of the issue with the app losing all my triggers/buttons etc. Super annoying,', "Aliases and triggers don't work with cyrillic", 'good mud client, until all your buttons and aliases disappear for no reason.', 'Mostly a good client but sometimes wipes the profiles meaning they have to be re entered manually.', 'Painful'], 'appId': 'com.happygoatstudios.bt', 'url': 'https://play.google.com/store/apps/details?id=com.happygoatstudios.bt&hl=en&gl=us'}
