{'title': 'Book Dash: Free African Stories for Kids', 'description': "Download over 200 free storybooks for children in many different languages!\r\n\r\nBooks are available in the 11 official languages of South Africa:\r\nEnglish, isiZulu, Afrikaans, Sepedi, isiXhosa, Sesotho, isiNdebele, Setswana, Siswati, Tshivenda, Xitsonga\r\nThe books are sometimes translated into other languages too such as French!\r\n\r\nWith this app, you will be able to:\r\n- View a catalog of over 200 free children's storybooks\r\n- Select a language preference for the books \r\n- Download and Read your favourite stories on the go!\r\n- The books are uniquely African and tell great African stories\r\n- Two free watch faces for Android Wear!\r\n\r\nWhat is Book Dash?\r\n\r\nBook Dash gathers volunteer creative professionals to create new, African storybooks that anyone can freely translate and distribute.\r\n\r\nWhy Book Dash?\r\n\r\nChildren in South Africa need more books, but they cost too much purchased from publishers. The cheapest books have no publisher – then the only cost is printing. So our participants do the work of publishers in a single day. After that, anyone can get print runs sponsored and put finished books into the hands of children.\r\n\r\nWe believe every child should own a hundred books by the age of five. In South Africa, that means giving 600 million free books to children who could never afford to buy them. Every day we lose, more children grow up unable to read and write well, and to enjoy the worlds that books open up.\r\n\r\nYou can see more about our cause here:\r\nhttp://bookdash.org/\r\n\r\nContact us: app@bookdash.org", 'descriptionHTML': 'Download over 200 free storybooks for children in many different languages!<br><br>Books are available in the 11 official languages of South Africa:<br>English, isiZulu, Afrikaans, Sepedi, isiXhosa, Sesotho, isiNdebele, Setswana, Siswati, Tshivenda, Xitsonga<br>The books are sometimes translated into other languages too such as French!<br><br>With this app, you will be able to:<br>- View a catalog of over 200 free children&#39;s storybooks<br>- Select a language preference for the books <br>- Download and Read your favourite stories on the go!<br>- The books are uniquely African and tell great African stories<br>- Two free watch faces for Android Wear!<br><br>What is Book Dash?<br><br>Book Dash gathers volunteer creative professionals to create new, African storybooks that anyone can freely translate and distribute.<br><br>Why Book Dash?<br><br>Children in South Africa need more books, but they cost too much purchased from publishers. The cheapest books have no publisher – then the only cost is printing. So our participants do the work of publishers in a single day. After that, anyone can get print runs sponsored and put finished books into the hands of children.<br><br>We believe every child should own a hundred books by the age of five. In South Africa, that means giving 600 million free books to children who could never afford to buy them. Every day we lose, more children grow up unable to read and write well, and to enjoy the worlds that books open up.<br><br>You can see more about our cause here:<br>http://bookdash.org/<br><br>Contact us: app@bookdash.org', 'summary': "Book Dash creates beautiful, free African children's books for anyone to enjoy!", 'summaryHTML': 'Book Dash creates beautiful, free African children&#39;s books for anyone to enjoy!', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.09, 'ratings': 905, 'reviews': 498, 'histogram': [153, 36, 27, 45, 642], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '4.6M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Book Dash', 'developerId': 'Book+Dash', 'developerEmail': 'app@bookdash.org', 'developerWebsite': 'http://bookdash.org/', 'developerAddress': None, 'privacyPolicy': 'https://docs.google.com/document/d/1dhmeqw7nIOk2-kuiTul__qNUb2np5kkTUMAsovXW9s0/edit?usp=sharing', 'developerInternalID': '8004969610728167792', 'genre': 'Education', 'genreId': 'EDUCATION', 'icon': 'https://lh3.googleusercontent.com/G--hjdKTdMq_FUmtuTZLQm0Bhu1K7H2Ik97xeZ8gN_LPuHzloUaj4Sn5F4FSu-IxGr4', 'headerImage': 'https://lh3.googleusercontent.com/bwmY7caUcb4pSjZZ3lYNoYCwkVald1q2e3Lm6TcGBdpwR7ipfgXqOJ_VlG-JuB1GTrRz', 'screenshots': ['https://lh3.googleusercontent.com/fGHMJ9jm5fteIrRp0SReUQ8WTzzAWWQHrQZlgUO-pkaoRpoR0cVaMPGE05S2OheR3us', 'https://lh3.googleusercontent.com/PyGKzWG_GSMpj80uL0CEGW-iBgX6RwQnAOwzVQ8jir0WkPbjIGGKxC9_V1JmWrqrpY0', 'https://lh3.googleusercontent.com/5vO2f4V8riBJYyFLS7GF3a5j_ylLeo-3zAUdiqG5MHMA8Fkha4KSBR9GkRyYXuro2vw', 'https://lh3.googleusercontent.com/oDctRuomzu-y9bn9RY9QmRoUT4wKSWxh96LtsvjBWxVq5PdrHZtwK91BMYRzSpTv3hEv', 'https://lh3.googleusercontent.com/TxCiHv3ywWwZrIHiWI2qPF41eVCLvPkvoIZoB2H4vvfSoI7h6e62GVSKR2CZhcp5bw', 'https://lh3.googleusercontent.com/3NLAK-_dTT_A8gRs3RXatshk12c96YTlzj1eIk8NPw912-V3RojC6CwduEwIqzUcTPfe', 'https://lh3.googleusercontent.com/EKQDr-LLaQryp_WKm7COYBk2bMWGg07dGOIC7aPLuFmEXsuvYMI2rqX_dDs_Czop_-M', 'https://lh3.googleusercontent.com/FlMU5_7hk3tWOZYOzEzI1oVODcgzSsh-M1nCNrqRowJ-ZoHPnV9bvO-LFb_p5tdLfw', 'https://lh3.googleusercontent.com/uViCfyZwlyiVL6GQ-sPIMUKY4OlKN9IGdq1eNCUXIlCiUdDJ5kUcWWA4m-LXPyirNw', 'https://lh3.googleusercontent.com/q9az4vxOq10OrIUfYWzwdJlPa8GAPwOF6qK3kntOVG0XbBA18qR9zj4vuTphvPn7Wtc', 'https://lh3.googleusercontent.com/FE3xcE5QqvzBNDzX38tAwZhMyGcUJsNrKvwdCQkdn5MEP7QWPw_WhIs4YSEYRQxQbgTW', 'https://lh3.googleusercontent.com/YsbpDdYbE9nZW1jv0rmriywKgxyBpe-7_jD2WYhcMNmvpdbpSLle9XWA-OZZ6VtGR2w', 'https://lh3.googleusercontent.com/jCmkrFuXpvqTyv3gp1yIQVeJsb2tkQNBRQYX4ch74J2cmc6tFqwBdtqy_wC7RhLgLA', 'https://lh3.googleusercontent.com/Ew4_1Myj9HBi8fIB1rY9h7tEsRl0YdiJI-eCJ9IboUKl6i0eFkvFvLi_1v47HiJ08mXs', 'https://lh3.googleusercontent.com/tvka3j_qpv-_MPNqyK3BZiDStpAFyS_bcC5LZNizu0BWSB3apncgWihPR2l1VP5-sTs', 'https://lh3.googleusercontent.com/psw7llJ8F6-DGvnX1OZ8STDz7-8cWiTyyRCzlGDKZ1B0gjDkbE3peUk3SvQVdoCL-P8', 'https://lh3.googleusercontent.com/qrLyUUlpCkx7EqbqRR0imYQxvTn4AsNpbr_zWUr7n-9zYpxa56s2Eaz_WWLyV6GEBg', 'https://lh3.googleusercontent.com/0PovS-iXI8rq6sekqi06x0LWsI_PXWwbBmSzvlNPnfNQawLPEWkxaJq3VhCil2xMhUVZ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 1, 2015', 'updated': 1576934086, 'version': '2.8.0', 'recentChanges': None, 'recentChangesHTML': None, 'comments': ['I just installed this app as i have many other apps some what like this one, because i am looking for "FREE" online story books that "I CAN READ" to my children. And I have to say that I am so happy and excited to have come across this app! All the other apps i tried before this one either claimbed to be free but weren\'t, or doesn\'t allow me or my children to be able to read them on our own if we want. They are only audible. This one is what it claims to be! I love it so far!! Keep it up :)', 'My kid loves this app. It is free and easy to use. I always buy books and they are really expensive. This app saved me much money. Keep adding stories to it. Thank you all!', 'Love this app. So needed for black children to grow up feeling represented and helping expand their minds. Excited to see the other language selections grow as big as the English options.', 'Love the short stories. Thank you. My kids cant read but they are able to make up the story lines.', 'The Best!! Subjects, Pictures and vocab best book in every aspect.', 'Awesome, awesome, awesome! I have a beautiful melanated 4 year old girl and when I opened up this app it made my heart sing thank you so much!', 'Wonderful. I have read with my son and he likes the books very much. Highly recommended app 👍👍', 'A fantastic app from a fantastic organisation! I LOVE these books!', 'I love the fact that you can actually download the books you want to read and go back to read them later.', 'Very good and nice collection for kids', "They never categorised for primary what? I don't know where to start from. Still need to download before you read.", 'Very nice and very useful for my kids tny ,☺', 'It has probably around 50 books and they are only for little kids.', 'Brilliant E-Book App for Younger Children. I was using a highly rated subscription app for my toddler but this has been impressive enough for us to cancel our subscription. The books are enjoyable and the right length to keep the very young minds interested and I am recommending this to everyone. The creators and contributors behind Book Dash are incredible to give their time and skills to make free books available to all children, everywhere. Cannot rate this app enough!', 'So far its free one. Simple story and illustration is superb.', "I've been searching for this app!! I first saw this in Storyberries. I love their work! The stories are short and the illustrations are unique. My 1year8months old son loves their stories! All the books are available without in-app purchase. Thank you!", 'Simple design and useable interface. The content is amazing and such a helpful and necessary tool to improve literacy in kids around the world. Not to mention the awesome initiative behind making the books. My 4 year old sister also approves 😄', "It's a very good app because it has free books that can be downloaded I have seen other apps and we need to pay for the books where as here we need to only download it which is really nice but it is not on the appstore it is only on Google play store which is the only bad thing other than that I love this app", 'This is a wonderful app. The whole concept is fantastic. The illustrations are beautiful. What a wonderful way to spread literacy! Every child should have access to books and this app is making sure that happens. Thank you for your hard work and for improving the lives of children all over the world.', 'Good free reading for kids. A couple of changes could make it better. A filter so I can choose books that have not been read before. A reading age filter would be welcome, my school uses colours which would work equally well.', "this app is okay but there is know grown up books so I think it's dull 👎👎👎👎👎👎👎", 'This app have no problem but not having proper books for my son and no more books', 'This is a wonderful app. The stories are free and are enjoyable for children and adults alike. You can read them anywhere on the go and the art in the stories is great. Everybody should download this app.', 'Great books. I love reading them to my grandchildren, and they love reading to each other. Very easy reading comm', 'This is wonderful app that use to read books with my kids. A few people complaints about the app only offering African inspired books. That information is clearly stated in the description. If you want to read more diverse books then make an free app that offer uunlimted reading or shut up. Apparently, the apps that offer diverse books charge. You can also just pay the money if want some diverse books.', "My son loves to read from this free library more than the actual book. Few books are there & it's free. I wish if there were more books to read. But thank you for providing this experience & opportunity. Just want to know if & when more books will be added. Thanks, Tnaeem.", 'Everything was going well with the books we were enjoying every single one, until the app fail to open more books. Unfortunatelly I had to give it a 2 stars instead of 5.', 'downloaded 4 books sofar. Great initiative but lacking story lines in the books. Little more content needed to help expand vocabularies of our young minds. Thought reading more was the idea behind this creation.', 'I have a young 5 yo and we love the books and the illustrations! And thank you for having characters that he can relate to in looks and in personality!', 'Brilliant!!! We love it. Thanks for making storytime so accessible.. Kids love the books & cute illustrations.', "Beautiful stories of all sorts for children adventure, moral value, self confidence, dreamers. It's a perfect blend your child and you would never get tired. highly recommended app!!!", 'The books are like rivets books and so I think it would be better if it had newer books.', 'i LOVE that these books are inclusive of brown beauties who get to see characters that look like them and express what its like to explore or just talk about emotions.', 'nice and simple children stories. my 3 years old likes the pictures. hope you can add more stories', 'Very nice collection of different stories... more stories and more power to the developer... 🖒🖒🖒🖒', 'My 3 year old loves the books in this app. We love to read No!, his favorite one so far.', "good app but the stories are a little strange sometimes... only offers African inspired ones so there aren't any classic or well known books.", "very good app.. beautiful book's.. but fonts are too small for kids to read", 'Terrable once you select your age you cant change it for harder books the books for 13 year olds and up were realy babyish and way too easyits just not fair or older kids and adults unless you struggle with reading i suggest you dont install it im so annoyed', 'It has so many books my siblings love the fact that its excatly like a hard cover and they love that they can read on the go'], 'appId': 'org.bookdash.android', 'url': 'https://play.google.com/store/apps/details?id=org.bookdash.android&hl=en&gl=us'}
