{'title': 'Loyalty Card Keychain', 'description': "Are you tired of searching for your plastic reward card while checking out at the store? Are you looking for a free solution which will not take your information?\r\n\r\nLoyalty Card Keychain is a application which will store your barcode-based loyalty cards on your phone. The application is open source and tries to do one thing well: manage your cards!\r\n\r\nNew cards can be added in a snap. Either use your camera to capture the barcode, or type in the number. When the barcode is loaded at the store and displayed it can be scanned with a modern barcode scanner. (Some stores use older barcode scanners, such as flatbed scanners, instead of image scanners. These cannot read the smartphone's display. Instead, request the clerk to type in the number manually).\r\n\r\nThe application requires very few permissions, and never attempts to access the Internet. There is an option to backup your cards to local storage. From there you can send the backup somewhere safe.\r\n\r\nThis application is open source, and can be found at: \r\n   https://github.com/brarcher/loyalty-card-locker\r\nPlease direct any feature requests, bug reports, or other contributions there. If you are interested in translating the app for another language, you may find it listed on Transifex:\r\n    https://www.transifex.com/na-243/loyalty-card-locker", 'descriptionHTML': 'Are you tired of searching for your plastic reward card while checking out at the store? Are you looking for a free solution which will not take your information?<br><br>Loyalty Card Keychain is a application which will store your barcode-based loyalty cards on your phone. The application is open source and tries to do one thing well: manage your cards!<br><br>New cards can be added in a snap. Either use your camera to capture the barcode, or type in the number. When the barcode is loaded at the store and displayed it can be scanned with a modern barcode scanner. (Some stores use older barcode scanners, such as flatbed scanners, instead of image scanners. These cannot read the smartphone&#39;s display. Instead, request the clerk to type in the number manually).<br><br>The application requires very few permissions, and never attempts to access the Internet. There is an option to backup your cards to local storage. From there you can send the backup somewhere safe.<br><br>This application is open source, and can be found at: <br>   https://github.com/brarcher/loyalty-card-locker<br>Please direct any feature requests, bug reports, or other contributions there. If you are interested in translating the app for another language, you may find it listed on Transifex:<br>    https://www.transifex.com/na-243/loyalty-card-locker', 'summary': 'Manages barcode-based store/loyalty cards on your phone', 'summaryHTML': 'Manages barcode-based store/loyalty cards on your phone', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.64, 'ratings': 267, 'reviews': 176, 'histogram': [8, 8, 10, 18, 221], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Protect', 'developerId': 'Protect', 'developerEmail': 'protect.github@gmail.com', 'developerWebsite': 'https://github.com/brarcher/loyalty-card-locker', 'developerAddress': '2696 Michelle Park,\nLexington KY, 40511,\nUSA', 'privacyPolicy': 'https://github.com/brarcher/loyalty-card-locker/blob/master/privacy-policy.md', 'developerInternalID': '6174037171066863678', 'genre': 'Shopping', 'genreId': 'SHOPPING', 'icon': 'https://lh3.googleusercontent.com/k0ZBVwrL7258sHbRwq5AWi0aFPQ3PSdiq2FFnCVt0yZV6W8IMKtvuRTk0vV2q_QPkLBY', 'headerImage': 'https://lh3.googleusercontent.com/MUpCX-cA4WNsVKdly7yUke6_U69_BUWX3AjfrWJ9b-bVz3a6nq4l641TEovqyqtuoq8', 'screenshots': ['https://lh3.googleusercontent.com/81sdFJw5Nrcqcs7ngo6odQhZ4Jyj5K76kCLd44otHuFBzzekTMJkMPtXJ6Pe_Obsd5M', 'https://lh3.googleusercontent.com/4vudlP-5UOu5zoU7bCAyzRS7vI_HfhJSI_N6OqUqXiVJj64jBrNtNqCo_9hSnEEGUMY', 'https://lh3.googleusercontent.com/ZJ9ZMwPYM9iUlp2zMSaGcDCgwfhR1Eukaxc9XCEPYIGw7WW4Gln21ehF4aeBSSZOrws', 'https://lh3.googleusercontent.com/tew7XOCc5-Mi4E5-B_tXwO8A0L8eSJub87hx8DcsdSGxJ5zvkPqpLXEjFcUJv4bjOnUb', 'https://lh3.googleusercontent.com/5wJODx_-l61m-Nja1qPuc3swSKFNfsjIV1iLNcFqMkBK13xcmXkmANQnUXDHmM5az5U', 'https://lh3.googleusercontent.com/240y9cGpJsscOX5dT1Yjulgr6_cvK6ThamxFo6rEFfUxFhnV6jEruoPz-r-oL2bTELY'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 3, 2017', 'updated': 1584299821, 'version': 'Varies with device', 'recentChanges': 'Changes in v0.28:\r\n- Allow backup export location to be selected\r\n- Fix barcode centering issue when exiting full screen\r\n- Update translations', 'recentChangesHTML': 'Changes in v0.28:<br>- Allow backup export location to be selected<br>- Fix barcode centering issue when exiting full screen<br>- Update translations', 'comments': ['No BS app Like others loyalty apps. This is it for my cards. Add web page field and something like taking pictures of cards and cropping them for card logo. Barcode reader can successful scan all of my cards. Nice little add free app.', 'One of the most useful app I have on my phone. And although it seems quite a simple thing adding a database to a card scanner, there are only a couple of spammy apps offering the functionality.', "It looks like a good start but I don't get what's so awesome about it currently. Useless without front & back photo snapshots. Plus a way to export /backup would be excellent (though very few cards apps I've seen has this feature so I'm not knocking this project for lack of it).", 'This app is awesome and truly useful. Thank you dev for your work! The new dark mode is truly useful, however I would appreciate if you added a "true black mode" for AMOLED displays. Keep up the great work!', 'I like this app, especially the privacy. A better widget interface would be good.', "So far so good, thank you so much and keep up with the good work.👍👌👏🙂, I really love this app 😍. Please don't change this app please 🙏.", "The barcode scanner st CBS wouldn't recognize or was unable to scan the barcode displayed by this app. Therefore, it's useless.", 'I like the App but would love to have a QR code option too.', 'An app that deserves 5 stars! There are tons of apps which need Devs like you. There is no decent dedicated standalone "video player" in the app store that doesn\'t require "network viewing" or "access permission" (unnecessary permissions), similarly this app store is lacking permission free "office suite", "screen recorder" (which works), "book reader" (every type of text file and pdf reader) & more. We are living in a no privacy era & we all need Devs like you. Thank you for your contributions.', 'Barcode scanner is not working', "Card information is easy to enter. The user interface is simple, efficient and to the point. I like that the app uses minimal permissions (no network access needed) and doesn't bombard me with advertisements.", "This doesn't work at self serve checkouts. You need to fix this problem.", "I had to get a new app after my previous one wouldn't work after my phone upgrade. Downloaded three different apps of this type and this was the easy winner. Simple interface, easy to upload all my cards, and nothing fancy. A few cards added a number or letter at the end (easily edited), and it was weird having to select the style of scanning code (makes me nervous if I did it right), so we'll see how it works in practice.", "Installed and having a problem with a scanned card. I tried today to use my phone instead of the card and it wouldn't scan properly. We proceeded entering the numbers manually and realized that a one was added to the card number. Needs to be fixed. Update. It seems it was only the Air Miles card as all the other cards are okay. Manually corrected the Air Miles card with me bar code. Thanks DEVS for a good app with no ads and respect for privacy.", "I recently had to upgrade my trusty Note 4. Barclone, an app that I had used for loyalty cards is no longer maintained and its backup restore function no longer works. Loyalty Card Keychain is everything I was looking for in a replacement: ad-free, local backups, low footprint, scan and manual capture options, flexible UI ... with a card capture facility that is better than the app I had been using. And it thus far has performed flawlessly. I'm very pleased.", 'Exactly what I needed after Google Pay made it harder and harder to save loyalty cards for small businesses like my local gym. Thank you!', "I haven't had to carry a wallet since installing this excelent App, brilliant. Clean simple interface, tiny memory footprint (between only 12 & 30% that of the higher rated competition!), & free! Would have given 5 stars if it would facilitate customisation of list order (displays cards in alphabetical order only). I will contact the dev with this suggestion, & happily upgrade rating to 5 stars should they impliment it.", 'Plus: Lightweight, quick, open source, not sharing info with 3rd parties, and import and export of data to allow easy transfer. Small minus: Would be nice if images of front and back could be scanned and stored in the app / scanned logos used as IDs in user interface.', "Great app. You truly understood what a loyalty card apps should be: basic and easy to use, not invading user's privacy, no stupid coupon/offer/ads approach. Well done! It would be great to be able to add a picture to the card (allowing to browse visually your cards)", 'Numbers only. I have annual membership passes that have my picture on it. The barcode is not enough to get into the Zoo / Aquarium. Please consider adding the ability to add images, front and back. I would love to ditch the cards.', "It's SO nice to use one small app, with minimal permissions, to manage all my barcode- and qr-based cards.", 'Awesome app, love the simplicity and the fact that is not cloud oriented as I value my privacy _VERY_ much. One major improvement, IMHO, would be some sorting options, like "custom" or "frequency of use".', 'Simple and straightforward local storage, no unnecessary cloud account, no junk or ads and totally free. Five stars! Would appreciate the possibility to add a little (company) image/logo/icon to each card that would be visible in the card listing, for a more fancy look of the cards', "Never had any issues with this app.I don't use it much because I prefer the feel of real cards, but it's saved me a few times when I've forgotten my wallet. Update: I also use it to access websites/businesses that use QR codes.", "Fine performer. Just one problem ... There is no way to transfer the data to a new phone and it doesn't look like there's any way to get support. Otherwise, I would give this app five stars.", 'Awesome. Simple and to the point. I wish it could remember when i click on the block/unblock rotation button, instead of clicking everytime i open the card.', 'great app and no sharing of data. thanks for making this open source. i like the easy bar code scanning and was able to upload 10 of my loyalty and library cards easily.', "Nice simple app. It would be much more useful if it captured and store the front and back of the card. That's the main reason for 3 stars not 4 or 5", 'You sir are my new best friend. 😎 This is EXACTLY the app i needed since CardStar shut down. Just a basic app to store the loyalty cards that retailers force you into. 😂 Fantastic job! Love the local backup too. 🤘', "Good job! Just a tiny detail, card note font size doesn't seem to work and note looks half-hidden until you tap it, but it's irrelevant. Great app!", 'Does what it says well. No ads, small size. Developers react blazingly fast. You can share or backup your cards via files. Best I managed to find', 'Added my cards very quickly and easily. I like that the data is on my phone, not some server somewhere. Highly recommend for the security conscious person.', "Perfect. No ads, it's fast and doesn't have you standing in line waiting for the info to pull up to give to the cashier like Stocard did.... Nice job!!!", "Excellente application! Légère, sauvegarde facile, partage possible, très rapide, n'utilise pas les données. I miss possibility to add an image or a complete photo of the real card, but thank you anyway!", 'Very simple and works as expected. Supports 1-d barcodes and QR codes, per what I have tested.', "Simple, fast and reliable. Couldn't ask for more. Does what it needs to do with no nonsense getting into the way.", 'Perfect. Lightweight, no ads, open source. what else could you ask for?', "This app does what it says with no frills. It replaced similar app that took a long time to open and had features I didn't use.", 'Excellent app, works perfectly. A dark theme option would make it even better.', 'Great, lightweight, and open source.'], 'appId': 'protect.card_locker', 'url': 'https://play.google.com/store/apps/details?id=protect.card_locker&hl=en&gl=us'}
