{'title': 'BLW: Bitcoin and Lightning Wallet', 'description': "⚠ IMPORTANT: be sure to save a mnemonic phrase once a new wallet is created. Having a mnemonic phrase is the ONLY way to recover your balance in case of serious bugs or phone loss ⚠\r\n\r\nThis app contains a standalone Bitcoin and Lightning node in a single package. It allows to send and receive regular Bitcoin transactions as well as Lightning payments.\r\n\r\nWallet sources: https://github.com/btcontract/lnwallet\r\nF-Droid source build: https://f-droid.org/en/packages/com.lightning.walletapp/\r\nApp page at bitcoin.org: https://bitcoin.org/en/wallets/mobile/android/blw/?step=5&platform=android\r\n\r\nOff-chain data loss protection is present: in case of emergencies such as phone loss you will only need a mnemonic phrase to recover both on-chain Bitcoin balance and off-chain Lightning balance. Details on how this works can be found in wallet manual: http://lightning-wallet.com/\r\n\r\nWatchtower service is present, too: if you ever use this wallet to receive Lightning payments then you won't have to worry about getting an app online periodically, more info on this here: https://medium.com/@akumaigorodski/watchtower-support-is-coming-to-bitcoin-lightning-wallet-8f969ac206b2\r\n\r\nApp permissions:\r\n- Access to local file system (optional): to store an encrypted channel backup file.\r\n- Access to NFC (optional): to read payment requests.\r\n- Access to camera (optional): to scan QR codes.", 'descriptionHTML': '⚠ IMPORTANT: be sure to save a mnemonic phrase once a new wallet is created. Having a mnemonic phrase is the ONLY way to recover your balance in case of serious bugs or phone loss ⚠<br><br>This app contains a standalone Bitcoin and Lightning node in a single package. It allows to send and receive regular Bitcoin transactions as well as Lightning payments.<br><br>Wallet sources: https://github.com/btcontract/lnwallet<br>F-Droid source build: https://f-droid.org/en/packages/com.lightning.walletapp/<br>App page at bitcoin.org: https://bitcoin.org/en/wallets/mobile/android/blw/?step=5&amp;platform=android<br><br>Off-chain data loss protection is present: in case of emergencies such as phone loss you will only need a mnemonic phrase to recover both on-chain Bitcoin balance and off-chain Lightning balance. Details on how this works can be found in wallet manual: http://lightning-wallet.com/<br><br>Watchtower service is present, too: if you ever use this wallet to receive Lightning payments then you won&#39;t have to worry about getting an app online periodically, more info on this here: https://medium.com/@akumaigorodski/watchtower-support-is-coming-to-bitcoin-lightning-wallet-8f969ac206b2<br><br>App permissions:<br>- Access to local file system (optional): to store an encrypted channel backup file.<br>- Access to NFC (optional): to read payment requests.<br>- Access to camera (optional): to scan QR codes.', 'summary': 'Bitcoin wallet with Lightning Network support', 'summaryHTML': 'Bitcoin wallet with Lightning Network support', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.1, 'ratings': 300, 'reviews': 196, 'histogram': [30, 24, 12, 54, 180], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '4.9M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'anton kumaigorodski', 'developerId': 'anton+kumaigorodski', 'developerEmail': 'anton.kumaigorodskiy@outlook.com', 'developerWebsite': 'http://lightning-wallet.com', 'developerAddress': None, 'privacyPolicy': 'http://lightning-wallet.com', 'developerInternalID': '6928515717554423646', 'genre': 'Finance', 'genreId': 'FINANCE', 'icon': 'https://lh3.googleusercontent.com/GkMH88OHVBpRNUyUrsqzUTzwWL5dBOLrph9HqM6_TxknleqHKNuXYpdZgzuw05CzyJo', 'headerImage': 'https://lh3.googleusercontent.com/nbWmXTSstb61eGpdG2ym8zhXfKjDscKbGvZU7BGe1ac0YmdlpkOhEflUn52stTjcy5A', 'screenshots': ['https://lh3.googleusercontent.com/y5Ww1krjYKljyUuqTLIBzfAQMf7XxFQCPhkDlNabMuG_DMkTMzVR2QL1Q3EXrFfeFc0', 'https://lh3.googleusercontent.com/mmMCzn0mMmxKFXymjhpBMeOzj3M6CsDzMEfMOHjGimvvTZAAJO79MDU_lOFNg1EH3q0', 'https://lh3.googleusercontent.com/Vgm5-psi-3KVOAJdSExM-NotC1nfozrsZ6BBoavv4bUTq60cSilhPlsMlQXRyZXkaBPV'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'May 31, 2018', 'updated': 1589903134, 'version': '0.4.5', 'recentChanges': 'Fixed a bug which was sometimes preventing AIR payments and hosted channel draining.', 'recentChangesHTML': 'Fixed a bug which was sometimes preventing AIR payments and hosted channel draining.', 'comments': ['Great wallet! I think 2 feature would be really nice to have: custom on-chain fees and autopilot for managing LN channels. Keep up the great work!', 'Just missing custom fees. 5000+ sats for a bitcoin transaction :/ But great wallet for lightning.', "I tried so many mobile lightning wallets, you name it if you've heard of it I tried it. Through a lot of trial-and-error I finally figured out that BLW is the only one that worked and it worked flawlessly (without running my own node). The challenges that I've had using lightning even as a tech literate person, combined with my total and utter faith in bitcoin's future, have inspired me to learn to program so I can contribute to Bitcoin lightning too. We need lightning to work for the masses.", "I still don't see any response at all. It's a scam here. Don't download. Seems like the developer playing games. Even ruin my phone. The developer owes me a new phone. It was $500 without tax", "This is the best lightning wallet I've found so far. I like the ability to receive funds offline, do private anonymous channel backups in exchange for small lightning payments, and ease of opening channels. I wish I could specify the local channel backup directory if it's possible to add that in the settings.", 'Impossible to send funds, cannot input address, just says "bad address" when i hit the send button', "Wish I could customize fees; and it doesn't support Bitcoin Core 0.19.0.1 nodes on default settings yet. (Keeps retrying connection.) Otherwise a fantastic wallet.", "Great wallet. Needs custom fee management. I chose high fee option and am gonna be stuck for 144 blocks, because it wasn't enough", 'App is not very secure because it has no pin code or password...not all phones support finger print recognition', "Could not re recieve had plenty of incoming liquidity.. ended up sending all to another wallet.. since I couldn't recieve anyway.. 🙁 Yes wallet online. Not sure how too get logs from dropbit.", "I've used many LN wallets and this one is the best", 'Best experience for a Lightning wallet', "Best on boarding experience to lightning I've seen so far. The wallet runs a full lightning node on device so you need a minimal understanding of lightning to set up channels, but the wallet is really helpful in helping you through the process. The UX is very well thought out, the UI is polished and I didnt encounter any glitches.", "Please give it option to specify sat/byte fee... even if you need to toggle it on through some Advanced options. I get it that for most people you want to autocalc, but if I need to open channel fast I would prefer just being able to specify 50 sat/byte and just be done with it. I'll see to contribute to repo on Github if you dont have time to do it... let me know.", "Works just like a regular btc wallet. Cheaper and faster. Made lightning on boarding super easy.   Might need some security features for peace of mind of users (pin/fingerprint). Might also need a 'validate' button after scanning a QR code as a manael check to validate amount etc. Great work.", "Is this wallet on testnet by default because I cannot add funds to this wallet! Why doesn't my Mycelium nor Samourai wallet recognise the receiving address as valid? Either I'm blind or I'm missing something? I've spent countless hours reading on how to add funds to the wallet or how to change from testnet to mainnet, but there's nothing that solved my issue. HELP!!", "original review: fast and easy to use, but it tried to send 1000 satoshis I didn't authorize. luckily it failed. revised: I missed the part about Manage Olympus Servers in Settings. once I disabled backups from there, the developer assures me, there will be no more such charges.", 'Hi, I really love this application. Makes it very easy to create lightning transaction. It would be great if you could add the option to watch the balance in mBTC because satoshi is too small unit and BTC are too large especially for daily transactions which are the great advantage of lightning network', "Excellent wallet, simple navigation, easy to use along with links to explanations of different functions for a first time user. Anton's support is excellent as I had an issued with the receiving address and I received an email solution from him within 10 minutes.", "Bitcoin Lightning wallet has been working flawlessly for several weeks. I've made a number of online minor purchases and played both Lightning Roulette and Lightning Spin with funds as small as 1 Satoshi paid and received instantly! Well done great work!", "Functionality of this app is fantastic - probably the best and most feature-filled lightning wallet out on Android at the moment. Just needs some design work for the UI and some marketing and it's a winner.", "It's great but the app limits to certain channels you can open with, rather than giving the option to open a channel with anyone, like eclair allows...", 'This wallet is awesome. 5 stars for how flawless it works on a beta network!  I recommend using this Lightning wallet in conjunction with Samourai Wallet if you need support for legacy address formats.', 'a real non custodial lightning wallet that can accept payments!  "a fully functional built-in Lightning node" is it possible for someone to open a payment channel with my phone directly? where\'s my node qr code thingy? (not saying this makes any sense outside of just playing around)', 'this is great finally got it to work. now I can send and receive. low fees this is a must have if you are into bitcoin. Now they need to work on getting it on the apple store.', 'I think it works great. Straight forward UI. This wallet is good to use as an introduction to bitcoin/lighting wallet.', "Great implementation. It should however be possible to lock the wallet with a password. I don't see that feature", "Amazing wallet! im new to Lightning and this couldnt have made it easier! great responsive developed as well. couldn't be happier!", 'When opening the app the first time it asks to connect with my Google account. Why? Other wallets do not ask for this.', 'Great App! Like the simplistic design. Has all the functionality you need and support is great aswell!', 'Easy to use and transparent on what it is doing which is very important in the early stages of lightning.', 'Fast, lightweight, best feature set. Best support. Highly trustworthy.', 'outstanding app! takes a little bit of work to understand it all but loving the cheap sats to send', "the most simple Lightning Wallet on market. doesn't need 3rd party servers if you don't want them. can be used with your own Bitcoin node.", 'Great wallet for real Bitcoin lightning transactions. Send, Receive, on-chain, off-chain, everything works well.', 'One of the best Lightning Wallet for Bitcoin on Android, has the following features  - Watchtower feature - Connect to your Bitcoin node - Backing up channels to GDrive   and many more..', 'I cannot send bitcoins or lighting, I keep getting a "Bad URL Syntex" Why this keeps happening? Please get that fix', 'Great stuff. Please add biometric with authentication if possible, to keep app locked if needed', 'Good job considering that LN is still in an early stage. I would like to be able to set on-chain fees, though.', 'edit: works great! previously: no way to see my lightning node public address'], 'appId': 'com.lightning.walletapp', 'url': 'https://play.google.com/store/apps/details?id=com.lightning.walletapp&hl=en&gl=us'}
