{'title': 'Activity Launcher', 'description': 'This Android App launches hidden activities and creates home screen shortcuts for installed apps.\r\n\r\nThis project still lacks a few features and translation. You are welcome to contibute!\r\n\r\nTranslations are hosted under http://crowdin.net/project/activitylauncher/invite\r\nOpt-in for Beta release: https://play.google.com/apps/testing/de.szalkowski.activitylauncher', 'descriptionHTML': 'This Android App launches hidden activities and creates home screen shortcuts for installed apps.<br><br>This project still lacks a few features and translation. You are welcome to contibute!<br><br>Translations are hosted under http://crowdin.net/project/activitylauncher/invite<br>Opt-in for Beta release: https://play.google.com/apps/testing/de.szalkowski.activitylauncher', 'summary': 'Launches hidden activities and creates home screen shortcuts for installed apps', 'summaryHTML': 'Launches hidden activities and creates home screen shortcuts for installed apps', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 3.9348128, 'ratings': 7302, 'reviews': 2162, 'histogram': [1276, 253, 546, 820, 4405], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '283k', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Adam Szalkowski', 'developerId': 'Adam+Szalkowski', 'developerEmail': 'buyer-support653@szalkowski.de', 'developerWebsite': 'https://github.com/butzist/ActivityLauncher', 'developerAddress': 'Adam Szalkowski\nBlumenfeldstrasse 13\n8046 Zurich\n\nSwitzerland', 'privacyPolicy': None, 'developerInternalID': '5392047058627160135', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/Clt50XhoGNpZhw0uNixAI7YuJBWoZDpzztHMjj-90PiniBHCUVwYdwPEoGxXZI30S9ri', 'headerImage': 'https://lh3.googleusercontent.com/PtHOXtWpzXCekUd6iHhHGAtg1cXKh2EC_ohiEWqPkDmS5HZpwdQhFXx5Ta94o6UxtA', 'screenshots': ['https://lh3.googleusercontent.com/FnkN86ZOr37Hz57mOm3LhXWXZh-ofVo5hMGsV-E4DysW8GmPbrXw_1x6c3rJL5Soew', 'https://lh3.googleusercontent.com/m0AS0eHzXJzPaCKPQVKgWc6IpuQcQpfK__mgOCx2FKEKZWRST2Ko6JnNPLrW87hzX1Wx', 'https://lh3.googleusercontent.com/LJmdB1BBIHm6vwJDRPM6yuZHKOim8lWmS14yB8tThSEDA1_F1F1ENP2mEO-llQocv3E', 'https://lh3.googleusercontent.com/N6cNOOmFExyM0BHbV6crY9hjT6uhPSQS0F8sl4Gtz37Gpt1pFqgl6FyI8WLMaXU2B7I'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 20, 2013', 'updated': 1572759290, 'version': '1.9.1', 'recentChanges': '- add filtering/search\r\n- fix more crashes', 'recentChangesHTML': '- add filtering/search<br>- fix more crashes', 'comments': ['I expected something more advanced, such as run a selected process / event of another app. For example "play playlist A in music player in shuffle mode" or "open photo viewer, send selected photo to editor, send saved file to the PC shared folder". A programmable sequence for frequently repeated tasks that require opening various apps. The shortcut creator is good, but usually it does the same as starting the app by its icon.', "This app saved me after SEVERAL hours of searching for a way to copy my Google Drive backup data from my old phone to my new phone without having to factory reset it again. Wasn't able to restore my data at first because I didn't have access to WiFi but Google allows absolutely no way to do so after the fact. Not to mention the backup feature itself doesn't work unless you disable lock screen security/smart lock on your phone. But a random forum pointed me here and it worked beautifully. Thanks!", 'Best in this case! Open source and good working! Just one option i need maybe you can add to this. Making and sending shortcats as file to other people and import shortcat file options!', 'Please provide bookmarking option of favourite shortcuts. Also it rescans everytime, instead add refresh option, so that we can manually refresh whenever needed because most of times only system shortcuts are needed.', 'After opening the app if i switch to landscape mode it crashes. And from landscape to potrait mode it crashes.', 'Took help from a person online to fix my issue of Night Light mode. They suggested this to search a menu option. Fixed my issue. Thanks.', "Amazing ! Only 200 kb size, no ads, no internet access permission, no unnecessary permission required to run, only do its work which is to create home screen shortcut of app's activities. Working perfectly in android 9.", 'I am 100% clueless how this app is overshadowed by that other quick app. This one is the only one that should exist. In fact if you are a dev and read this, do not EVER make a short cut app. If you have already, then you can build some water and air next. throw in a few ads and nobody will ever know. Some things are just done. This makes perfect look bad. Thank you.', 'Finally an activity launcher app that lists attributes such as package and class. Time saver, useful for sending intents from Tasker/Macrodroid.', "Really good app. It gives me a control over apps that would otherwise be impossible... Good interface and easy to get the hang.. .... Google what this app can do, if you realise then that this app is something you want to try, you won't be dissapointed... Imho this is the best at what it does... ... ... I'm not just blowing smoke, I love this app (did you realise that yet?😉)", 'This app is great! One issue though, when you open an activity, whether it opens or not, when you go back, is scrolls back to the top.', "This is my favorite app across all categories, well this and setedit22 database editor by 4a. Not once have I experienced any bugs while using this app, keeping in mind that not all activities are launchable per device. If you have trouble than this type of app is above you. It has worked perfectly on several devices I have owned, but of course i have not owned them all. So if it doesn't meet your expectations, uninstall or get a new Android.", "Hi, Please help me how to revert back from merging my internal storage with SD card there's no option for this. I want to do this coz I cant update my MUI now.", "Does only what it was created for, listing and launching various activities of all the apps installed on your device. Nothing More... Nothing Less... If you don't know what activities or intents in an android app are, the this app isn't for you & me :P", "It does exactly what it says. A beautiful app. Only reason I don't give it 5 stars is it crashes when the orientation is changed. Please try address that", 'Was great for utilising the RCS content of Google messages, but with recent update to messages, no longer works for RCS on Google messages, any chance of update to resolve this, thanks', "Works as intended, however (and I'm not sure is this is just on the Galaxy S10+ or what) the scrollbar is MUCH wider than it appears. I've only used this once and I already can't count the number of times I've tried to select something only to leap far far away!", "Great for making home screen shortcut to sub-settings that can't access it from notification bar or default widgets. And no ads 👍", 'Amazing app you can lauch system apps and secret and hidden activites and with out root. One bad thing is not showing running services after uptdate.', 'Not happy at all, forget about launching the activity, it is not even showing the particular activity which i wish to launch. It is showing only 3 activities of the app Dictomate, whereas it has about 13 activities.', 'This app worked perfectly to link to some hidden settings in my Xiaomi phone settings app the manufacturer hid. Worked flawlessly and even allowed customisation of the icon and name.', "To be honest I have no idea what this could be used for other than following a YouTube tutorial that told me to download it and I'd be able to put RCS on my T-Mobile LG G6. It worked great! I am now RCS equipped! Thanks!", 'I wish I could rate it 10 stars.. The new Search activity has made everything so simple, that what took me around 20 minutes to find performance fuel guage mode from a list of 312 activities, took me only mere 20 seconds using the new search icon.', 'I Can\'t click on "Apply" button after selecting OTP Pattern on Google Messages - Set RCS Flag options. Apply Button is not visible on Screen. So new settings cant be saved. Mine is Honor 9 phone. Your help, Thanks.', 'Just as name suggests launchs an activity useful for finding hidden settings in mi device for activating performance mode', "The best app! It solved my main problem! Thank you for developing this app. I was actually having a problem regarding the password that I forgot and now it's solve. Very great app. Thank you so much! Lovelots!", 'very very useful and easy to use than others. thank u my author', "Instead of creating activity, flash message that doesn't have permission. This only appears the first time, so if miss the flash message can't know what is wrong and why doesn't work.", 'Works well, need to have some knowledge to do somethings, will be nice if you include custom lists with automatic setup for certain apps and description to how to enable and what it does, just to be a bit more user friendly', 'It seems that the app can no longer be used to modify RCS Flag on Google Message app in order to activate RCS feature.', 'The app keeps crashing. Crashes, and crash once more.', 'You made a remarkable app. My Miui 11 phone didnt had any update for adoptive storage. This app made my day!', 'I used it for Wireless display that was removed from miui11, very usefull thanks', 'RCs messaging no longer available in Activity Launcher for Android Q', "3 stars instead of the 5 I wanted to give because it won't allow me to create shortcuts.", 'I have not been able to use it because once I make a selection, it pushes the Apply button off the screen and does not support scrolling the screen. Pixel 1, Android 10', 'Excellent app. Helped me find apps that are hidden on my phone. It would be more awesome if we can run activities with the private enabled tag as well as apps that require the FACTORY and SERVICE permissions.', '1) No app icon (it shows android icon on home screen). 2) No bookmark activity option.', 'Need help.. I convert my SD card as a internal memory and I also did not found my internal memory option and now I want to go may internal memory and SD card as a extra memory.. Plz help me to go back my phone memory as internal memory', 'Nice application,it can make your device perform even those actions that are hidden but your phone can perform.'], 'appId': 'de.szalkowski.activitylauncher', 'url': 'https://play.google.com/store/apps/details?id=de.szalkowski.activitylauncher&hl=en&gl=us'}
