{'title': 'CPU Spy', 'description': 'This is a simple app to display the time the CPU spends in each frequency state. This can be a useful tool in diagnosing battery problems or tweaking your over-clock settings.\r\n\r\nIt also displays the current kernel information.\r\n\r\nSource: https://github.com/bvalosek/cpuspy\r\nXDA Developers thread: http://forum.xda-developers.com/showthread.php?t=1011497', 'descriptionHTML': 'This is a simple app to display the time the CPU spends in each frequency state. This can be a useful tool in diagnosing battery problems or tweaking your over-clock settings.<br><br>It also displays the current kernel information.<br><br>Source: https://github.com/bvalosek/cpuspy<br>XDA Developers thread: http://forum.xda-developers.com/showthread.php?t=1011497', 'summary': 'View the time the CPU spends in each frequency state', 'summaryHTML': 'View the time the CPU spends in each frequency state', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 4.3501744, 'ratings': 8871, 'reviews': 1978, 'histogram': [741, 231, 602, 896, 6398], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '31k', 'androidVersion': '2.1', 'androidVersionText': '2.1 and up', 'developer': 'Brandon Valosek', 'developerId': 'Brandon+Valosek', 'developerEmail': 'bvalosek@gmail.com', 'developerWebsite': 'https://github.com/bvalosek/cpuspy', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5017316854040131227', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/BxFTAkWoPnxiOS1j3kiGo385BxDmNnffTlywh9qEUvBkjmuLy1W3q8JztPSU_m0KLw', 'headerImage': 'https://lh3.googleusercontent.com/Vm2US58k88yJFFAlp4O7QCuOjudIP6MTe1HhPIBez7JDxsmY0dPbaXfctU_MkK_6reJL', 'screenshots': ['https://lh3.googleusercontent.com/54t5Go2zQggSN8S-t_Uq2P7aJdOok1Vi71iq8JNDJGd8gXHLKyzQf7e0Ox5lRq5pqH6n', 'https://lh3.googleusercontent.com/K8jh2ieeZFtvbGqVnA9FnuOsAIQjxw79gS61Z8dx9w4ApsRiseV7HfqvHmoaO_031D0l'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 27, 2011', 'updated': 1357100236, 'version': '0.4.0', 'recentChanges': '-Display total state time\r\n-Massive code cleanup\r\n-Fix duration overflow bug\r\n-Removed read-as-root attempt when unable to access states file due to instability\r\n-Better tablet support (still work to do, though)', 'recentChangesHTML': '-Display total state time<br>-Massive code cleanup<br>-Fix duration overflow bug<br>-Removed read-as-root attempt when unable to access states file due to instability<br>-Better tablet support (still work to do, though)', 'comments': ['Compact app. Useful and small. No extra features.', 'It only shows stats of little cluster cores, many SoCs use big.LITLLE architecture and big cores use different frequencies than little ones.', "Does what it's supposed to do and nothing else. Exactly what you'd expect from a 28kb app.", 'Just good to monitor your phone', 'I had a power problem with my transformer prim and with this I was able to track it down to a live wall paper. It was easy just refresh timers and change a few settings. And most importantly it lets me know if it was asleep or if there was something running. I would like it to show all 5 processors and usage on them but I think that would be out of the simple design that is here. For the apps simple interface and no nonsense I give it a 5.', "CPU Spy is a simple, small application that reads the processor state since the last reboot and displays them on your screen. It can identify at what clock speeds your system tends to run at. The application requires no special permissions so it isn't stalking your friends as you check your processor clock speeds.", "Although CPU Spy needs a rooted HTC phone, it also requires custom ROMs with non stock HTC kernel for it to read the CPU states.  Unfortunately stock HTC kernels don't supply this information for CPU Spy to read from, so unless you've flashed your phone or tablet with a custom kernel, don't blame the developer if doesn't work.  CPU Spy works fine with my previous HTC Incredible S and Flyer P510e with custom ROMs, but not with leaked or official ICS Android OS that use original HTC kernels.", "I was able to see that something was chewing through my battery and my phone wasn't deep sleeping the way it should. But since I am a newbie and someone who for medical reasons is unable to learn another facet of the computer/electronics field, I have a favor to ask. Is it possible for you to list the likely apps or phone functions that run at each frequency? I had my phone running in deep sleep quite well, but now either I have added a new one that runs a lot or I use one a lot more now. I want to find it.", "This app had always helped me to identify battery drain issues at first level. If your phone doesn't get to deep sleep mode,there's some issue for sure. I've identified a few such apps and uninstalled them and now the battery life is much better. Though there are lot of battery  saver apps, this app is something which an user will need at any point in time when he wants to debug battery drain issue.", "I generally don't rate apps, but this guy is amazing. Helped me checking CPU status, operating conditions and importantly deep sleep. you think your phone is not working properly? Check with it.", 'You know Google at some point you\'re going to lose all your \'friends\' when the market gets tired of your scam with Samsung.  Hopefully an enterprising ethical company will step in with a device that operates with a lot more integrity.  To coin a phrase "just sayin", enjoy it while you can cuz even OS challenged individuals like myself eventually figure out why they use 30 GB just playing Candy Crush.', "Simple and does what it says. Was having some battery drain issues and found out that my phone wasn't going into deep sleep through this.", 'As phones chew power its vital to monnitor the changes we make with custom kernels.  What I like about this is it shows how  long my phone spends in deep sleep. Some kernels stop this, so you need to see wtf is going on in there. Basic, well out together app. which doe\'s just what it says.  Good to use with "no thrills CPU control ". You can get a primo set up, with a bit of monnitering & adjusting! HowardBamber.', 'It was working until I get complaints about unable to read states file after update. Files are there but readable only by root. App should handle this and NOT ROM devs!', 'This app helped me get decent battery life out of my early version Vibrant and its bad GPS vs. Deep Sleep issues. Extremely helpful to know if my phone is sleeping peacefully or not.', "Let's you keep track on cpu usage and deep sleep. .. If you have issues with battery. .. This would be your first place to start. .. Keep track of what cpu is cycling at and figure out what's causing issues", "Great way to determine if your phone doesn't go to deep sleep. It always help me figure out the deep sleep issues and to test which kernel is better! Thanks dev. Is their any donate version?", "If you have battery problems, this app can help you diagnose it. If your phone is off for a few hours it should go into deep sleep for those hours you don't use it. If it does not, you have a problem.  This app will allow you to see that.", 'This did not work on my T-Mobile HTC Sensation. I am running ICS. Sorry for the 1 star, but not good if it does not work.', "-I think it needs a lollipop update. I'm finding it slow to open and scroll.                -Would love a total uptime state from unplugged, lollipop removed it from there new battery window.", 'I have absolutely NO idea how this app works!! I open it, I see a bunch of numbers in minutes and seconds. What do they mean? How do I interpret them? How does this help me figure out why my phone is overheating? Do I need a degree in phone app programming?', 'A must have for a power tweaker. This uses no resources and works great at monitoring how hard your CPU is working. Helped me pick a good governor and detect battery usage spikes.', "If you think battery is not lasting check processor state. If it's in a state for more time than deep sleep, then there is some app keeping cpu awake.", 'What good is it?  Did nothing for me other than waste my time installing it so i can waste even more of my time uninstalling it.', 'I have an 8 core note 3 with 1.9 Ghz clock, and the app says the phone uses only 650Mhz max clock speed...', 'Perfect for those of us that like to have full control over our phones. I keep an eye out on everything with this app and its a phone saver for sure.', 'Excellent little handy app for checking on your phone behavior. Can help you notice if you have some apps hanging in the memory and hogging the phone resources and battery power.', "I've been using it for quite some time now. It's works really well and does let me know, if they are any apps which might be interfering or preventing the phone from going into Deep sleep mode, when the device is not in use. ( Please note that this app does not pinpoint those particular stealthy apps). The information it provides is accurate enough. Works like a charm. Thank you so much Developer/team. :)", "S galaxy y not supported. Make it work with my galaxy y, i'll change my rating...", 'Great, yet simple software that enables one to see if the much desired deep sleep is being achieved, and what frequencies is the phone CPU frequenting. Very useful as a first step in detecting causes of excessice battery drain.', "My phones battery was crap lately and was unsure why, then I checked this app and saw it wasn't properly going to deep sleep. All working fine now after a restart and disabling gps", 'Along with Better battery stats this app helped my identify a wakelock that was draining my battery ever since the phone was new. Now solved snd the battery life is twice as good. Well worth the small price.', 'Did what I needed and what it said. Helped me diagnos my problem.', 'This app does not work pn my htc one s(jb updated)!!! Please fix it. It worked on every other device I have owned so far.', 'Would be far more helpful if it reset the timer automatically after unplugging and reported the level the battery was charged to. Please consider adding these options.', "Would be far more useful to me if it reset timers on unplug as my phone doesn't sleep while plugged in. I believe most phones work this way so I'm not sure why there isn't an option for it. Other than that, works perfectly. Guess ill keep manually resetting when I'm done charging.", 'Excellent easy first level troubleshooting for battery drain issues. Wonder why ppl gave less than 4 stars on a free app.', 'Only show CPU clocked speed for all 8 core up to 1.5Ghz. What about the 2.1Ghz?', 'This is truly the best app for checking cpu. No adds, stability, and low menory usage. Things to improve? -Could show multi core.', 'Why do we have to hit the refresh button every time we want to get data? How difficult is it to change the data acquisition in a real time process?'], 'appId': 'com.bvalosek.cpuspy', 'url': 'https://play.google.com/store/apps/details?id=com.bvalosek.cpuspy&hl=en&gl=us'}
