{'title': 'Poet Assistant (English)', 'description': 'A set of offline tools to help with writing poems (currently only English is supported):\r\n\r\n* a rhyming dictionary, using the Carnegie Mellon University pronunciation dictionary.\r\n* a thesaurus, using the WordNet thesaurus.\r\n* a dictionary, using the WordNet dictionary.\r\n* a screen where you can enter your poem text, have it read aloud back to you by the device\'s text-to-speech engine, and see the word/character count.\r\n\r\nThe dictionaries are built in the app.  No internet connection is required to use them.\r\n\r\nThis app is open source: https://github.com/caarmen/poet-assistant\r\n\r\nPermissions:\r\n* Since 1.5.0, the app has the "run at startup" permission for the "Word of the day" feature.  If you enable this feature in the settings, when the device reboots, the app makes sure the "word of the day" notification is still scheduled.\r\n\r\n\r\nLooking for other languages?\r\n\r\nThis app only contains dictionary data for English.  If you are looking for other languages, please contact the developer.\r\n\r\nNote: This is the original Poet Assistant app. It is completely free, truly offline (no internet permission), no ads, and no in-app purchases.', 'descriptionHTML': 'A set of offline tools to help with writing poems (currently only English is supported):<br><br>* a rhyming dictionary, using the Carnegie Mellon University pronunciation dictionary.<br>* a thesaurus, using the WordNet thesaurus.<br>* a dictionary, using the WordNet dictionary.<br>* a screen where you can enter your poem text, have it read aloud back to you by the device&#39;s text-to-speech engine, and see the word/character count.<br><br>The dictionaries are built in the app.  No internet connection is required to use them.<br><br>This app is open source: https://github.com/caarmen/poet-assistant<br><br>Permissions:<br>* Since 1.5.0, the app has the &quot;run at startup&quot; permission for the &quot;Word of the day&quot; feature.  If you enable this feature in the settings, when the device reboots, the app makes sure the &quot;word of the day&quot; notification is still scheduled.<br><br><br>Looking for other languages?<br><br>This app only contains dictionary data for English.  If you are looking for other languages, please contact the developer.<br><br>Note: This is the original Poet Assistant app. It is completely free, truly offline (no internet permission), no ads, and no in-app purchases.', 'summary': 'English rhyming dictionary, thesaurus, dictionary, simple editor with playback.', 'summaryHTML': 'English rhyming dictionary, thesaurus, dictionary, simple editor with playback.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.6868134, 'ratings': 1829, 'reviews': 825, 'histogram': [40, 40, 40, 211, 1497], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Carmen Alvarez', 'developerId': 'Carmen+Alvarez', 'developerEmail': 'ms.carmen.alvarez@gmail.com', 'developerWebsite': 'http://rmen.ca', 'developerAddress': None, 'privacyPolicy': 'https://github.com/caarmen/poet-assistant/blob/master/PRIVACY.md', 'developerInternalID': '8512922087441799405', 'genre': 'Books & Reference', 'genreId': 'BOOKS_AND_REFERENCE', 'icon': 'https://lh3.googleusercontent.com/q7bUlvlzsJI0A83gmxYK0muUjNsEjpe3eGxw1sGUkgpxzVfNCPqjgIlU3VfVbuTfCw', 'headerImage': 'https://lh3.googleusercontent.com/gDIfP9JESdL5AW1pHdzMgmUE56LAGgC6N0CriZbB_dzitsWAODNQcXuGeg6MpAlJjVNO', 'screenshots': ['https://lh3.googleusercontent.com/iuvQEFmZm3xHpCKA1n9Us1WKr_QYrYTn7U0rQVSxvVHfi4LdGUjCrspRaJj5EVbmeKmc', 'https://lh3.googleusercontent.com/9cADlLlcuXb4ldA7NosAoA30_NMEaTdz2UIP6YQy_-XHyPwM0vvsUKCl66iKBXqen1qb', 'https://lh3.googleusercontent.com/BtzQybhISz_zRF6FnuGLf3rAZ0zdLnLcKoomS-Tk6lmySd8-XZGWpINCxanblhkx04g', 'https://lh3.googleusercontent.com/NCNi1UpxpI-_oLgCiCr1_oYQAXfaeShMLWPMSIC1ZniNMA1rOhvU2GdO6dvHo_8b-Go', 'https://lh3.googleusercontent.com/KhSku35_K4VPfoDVfPtkgfH2t3VLQC9yBSZYK6OLHkLoElhHr45avivnJ2FJ1arsdwq8', 'https://lh3.googleusercontent.com/AFswxVAiJzmwsZIOn3FzqQdoXq5j9GFrVheEvfSOzNpKF33fpw60sMn09TWNXOZ7hEo', 'https://lh3.googleusercontent.com/1SWDtnwBL3gauVdi8isl-X90UvCCdoYLdbomsqTkJvzfqjBdlEv3mUmga0eM8og96g', 'https://lh3.googleusercontent.com/VP8PDncv1oXYuUfU90eeLMoFDkehAehV9x2PAh7dh6cXL7-FRf9l0mNlOidy6tBWPhM', 'https://lh3.googleusercontent.com/mX48TClVyL1bMFnET-7cJep8mDiogbgGxD7BSUoYU6QlKe-l2ObDnXvFQ28AFbnLnA', 'https://lh3.googleusercontent.com/sfAU11Z2jyA9feonuSmpNOe91B1UBaqFsj8wj1DP52FBjcCeye2K_m3mqg7O4e6TYbD5', 'https://lh3.googleusercontent.com/htVlMsxW4tJ-6KcdweggvpaUWxuiEoqAftf6cRnUG---VxkVXhHwBN4UqxUHsCZo17o', 'https://lh3.googleusercontent.com/bqiAxzO8PGXCjGkmhXMeyiuDJNbkb3TO-cbWtZ_sd5rrO-Kc7Y4a1En2ewKqmcw2Vrs2', 'https://lh3.googleusercontent.com/ayz2Bwe4FhJoKrUHmSKrBTxCSgWyaHdkkOUPzIyzSqfpfWrmtx66eYRq1u9Zt-q6FUE', 'https://lh3.googleusercontent.com/k_wn4vZ2fAw7alur7SP1Ge5t74ycpjxQJKEAcUL6nbxezyNnl-SwsNTMA2iS5UAbcA', 'https://lh3.googleusercontent.com/lptFL6UZ0CwB55tnIghvVzxWeswoq2R9YBU-DZugR4UEWIypr8s2_58fOJfF3_dum-k3', 'https://lh3.googleusercontent.com/-RshRROKweAqHZVhClgX_vIajfWTD4ZSCEpxSrdunVwCfJQCS4O9FxNpElj3votLEUY', 'https://lh3.googleusercontent.com/8E7b5CFelVpzpLY8nymR_fITE2TKGiC12q5B1ume6dZiIxTJFjPCbcuSYSPRzVrMlVQ', 'https://lh3.googleusercontent.com/ofpG49DiY2Yhx1ivNtvA0b1c52TxBqflP0fI0g0DidMo9QON2hf9GKfZk3OKjxhvkxk', 'https://lh3.googleusercontent.com/RLsWWg_8huC_sNqbaQvUFbJUJ6VIZCIaDqOdnDdt2dbsSUzgb5i8fwwaVkFRP29NyWiJ', 'https://lh3.googleusercontent.com/PxgSbKkQ1JrByR3GD78IJmokrX-qQz7T61I4lM7OWJ4SMMAA_WNYrm6VbkyR6Z9ZkQ', 'https://lh3.googleusercontent.com/bfd2Xz63sbq7tCrXmhdzEmjKrYjMOei9bs-U3_YJKLdmWaJ3OVG-2T3bSPrdb5wa4Zg', 'https://lh3.googleusercontent.com/qFjG9Il0U-L-lzGHEwtVgf_X9YrBQb6OO562tL6gm-Ttk3WADEBZKI3GqhjFyOMEjpI', 'https://lh3.googleusercontent.com/BWsTcajLY7hYOktfdpdNH_eJINmo_UFe_-S88IIu__Te8FG5Imrr8LmgzZq_NXmPDw', 'https://lh3.googleusercontent.com/Zlw0x9kHZ8DK-J4vQ7EP3Ua4AYhN_8C2AGS2m2LoZUJqjGLrgRR_RABJjbr1ssFWdImo'], 'video': None, 'videoImage': None, 'contentRating': 'Teen', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Feb 20, 2016', 'updated': 1571240174, 'version': 'Varies with device', 'recentChanges': '1.30.0: Maintenance release\r\n\r\n1.29.2: Improved stability\r\n\r\n1.29.1: Fix auto-backup: now settings, search history, and favorites are backed up.\r\n\r\n1.29.0: Improve audio export: directly show the share prompt (instead of the notification) if the app is still open, when the audio file is ready.\r\n\r\n1.28.0: Maintenance and bug fixes: Fixed issue with dark theme on certain devices.  Renamed the "reader" tab to "composer" (no change in functionality).\r\n\r\n1.27.1: Fixed spacing in the settings screen.', 'recentChangesHTML': '1.30.0: Maintenance release<br><br>1.29.2: Improved stability<br><br>1.29.1: Fix auto-backup: now settings, search history, and favorites are backed up.<br><br>1.29.0: Improve audio export: directly show the share prompt (instead of the notification) if the app is still open, when the audio file is ready.<br><br>1.28.0: Maintenance and bug fixes: Fixed issue with dark theme on certain devices.  Renamed the &quot;reader&quot; tab to &quot;composer&quot; (no change in functionality).<br><br>1.27.1: Fixed spacing in the settings screen.', 'comments': ["I use this a lot in my work as a writer. While it's not the most visually-appealing writing app of its kind, it more than makes up for that in accessibility and user-friendliness. I ESPECIALLY like that you can highlight a word on a a webpage or in a search, look it up in the app, save the word if you wish, etc. and return to your page without losing your spot. A must-have for anyone who wants to be a better writer or reader!", "I write music lyrics almost daily. I tried a couple of similar apps but this is my favorite by far. It's simple, but effective. On my device, i have 10 words on the display at once, and I can open rhymes, thesaurus or dictionary for each of them with one tap. I find that working with this app helps my brain come up with ideas, even if I don't find the exact word that I end up using. And did I mention there are NO ads? Top marks!", 'This is a very usuful app, i use it all the time. The biggest let down for me though is theres a 500 word limit for rhyming words and theyre listed in alphabetical order, and include some that dont actually rhyme, just end in the same letter. so for words that have many rhyming words you wont get passed the letter B', "This app is awesome. It helps with writing papers on your phone, it helps with looking up words when you're lost on something, and it helps with songs/poems. Highly recommend for any writers", "Super! This poet app. Is so very helpful! I wasn't even looking to write up poetry 😁 I find vocabulary interesting and this app has so much information about any word you search. I love it. Thanks Developer!", "Beautifully functional with a clean, intuitive interface. Great balance between being comprehensive and having to many functions. Whether you're a poet or not, this is an awesome choice for your wordy enquiries.", 'As a poet assistant it is very good. But as a dictionary or thesaurus it is American, not English, so lacks some of the detail we are used to in Britain.', 'This is very-very awesome app... This is cost-free, ad-free, offline, small in size, provides useful filters. You can easily analyze any text just by selecting without copying it. Only problem is when we analyze any word or text from somewhere else it does not show result in half screen but the whole scree. I hope it will be fixed soon. Overall... this is truly 5 star...', "Great. I really appreciate no ads. I would love to see a quicksave button. Also, for lyricists, it would be fantastic if the yellow play button played an uploaded MP3, and it had a slider underneath to navigate the song (I don't really understand the point of the reading feature). Finally, the 'filter by synonym' feature doesn't seem to work at all. I'd pay 5€ for an app which did all that.", "No sound at all. I did a preview of it. Changed the voice settings and I did a short demonstration of speech synthesis. Nothing works. It's true that the developer really did forget about the sound.", "It works great as a dictionary, thesaurus, and shows rhyming word. For what it's meant to do, extremely useful.", 'Simply helpful. No complications. Just type the word and its meaning as well as rhyme is available. Thus too useful for the readers as well as writers.😌', 'Amazing makes writing that much faster,love being able to switch back and forth between functions while writing,alot less gets lost when trying to get ideas out for myself', "Absolutely recommend this as a writer. It's small,sweet and convenient.", "Best app! It has dictionary, thesaurus, rhymer at one place! I'm glad I found it! Right now my phone has poet assistant and urban dictionary in my phone! But I really want poet assistant to have some of the stuff of urban dictionary too! Like modern words used by. Millennials! And short forms used on the internet! And really common short forms can be added right? It would make this app a one stop solution for everything one needs. I can just have this single app on my phone. Thank you so much!", 'This is a perfect multi-purpose and educational application. It can serve as a dictionary, thesaurus, and rhythm finder.', 'Great App for Aspiring Poets! I have found this to be very helpful in finding just the right words in composing my poems. It would be great, I think, if there was an easy option in the app to allow users to suggest words that are not currently included.', 'Hands down one of my favorite writing tools. I love the feature where you paste your text and it reads it to you! I have dyslexia so that helps catch those small mix ups when they happen. Deserves more than 5 stars.', 'This is extremely useful. It even works offline, and you can search for specific synonyms or definitions.', 'Absolutely PREFECT for artists of all sort. It even works in tandem with preexisting apps like, your dictionaries, browser apps etc.', 'Great app to write poem helped a lot to find word meaning as well as rhyming words. Helped me a lot to write poems..', "This is such an amazing app I have been using it since a long time and it's just perfect I dont have words to describe this app every feature is on point", 'I am a professional musician, for the longest time I thought to boycott anything to do with the internet but I found myself in the wrong. I use many tools from the internet to write and compose. This app is in my top 3 of MUST haves. Thank you developers for combining the 3 most Important areas of lyricism and making this app offline.', '📢Offline makes it a valuable tool. More convinced it is truly good.🙌', "Great app, but there are two issues with this app. When you tap into search bar, the latest searches hint is in alphabetical order instead of time order. Matches are limited to 500 words and are ordered alphabetically, so sometimes you don't even get past words that start with one of the earliest letters in the alphabet. A solution would be an option to order matches by certain condition like popularity, equal alphabetical representation, random, etc.", 'Mostly good, but has a two very annoying problems. One, the back button closes the app instead of going to the last word searched, and when closed it forgets your searches, so you\'ll have to type the word back in. Two, it makes the occasional odd assumption - for example, when I tried to search "touche" it thought I meant "touched" - and when it makes this mistake, there\'s no way to "force" it to search only exactly what you type in.', "This app is amazing- it gives as it advertises: definition(s), synonym(s)/antonym(s), and rhyming word(s). The ads aren't even too bad (granted, I mainly use PA offline, so maybe I'm just not able to look at the ads due to the lack of an Internet connection). I gave it 4/5 stars because some synonyms aren't listed, sometimes antonyms aren't listed at all, and sometimes a word doesn't show up with any results- even if it's a legitimate word. Otherwise, the app is fantastic.", "I love this app especially because I do not have to be connected to the internet when using it. I can use this when writing on the airplane. Oh and it has a dictionary! Yes you can write in this app. No, I do not see a highlighting option. Question: How can we find the other words that rhyme, past the 500 that's allowed to be displayed? Thanks in advance!", 'Superb app. It encourages me to write more poem. Everything is there. Thank you so much.', "So far, the rhyming assistant and word of the day features will keep me from deleting this. But the lack of a syllable counter is, IMO, its main weakness. I'm aware that for English in particular, such feature would require the use of an algorithm (unlike say, my native Brazilian Portugese, whose non-phonetic syllables are infinitely easier to guess, even for non-natives), but you might as well pair up with an existing online service rather than paying for one yourselves.", 'A reasonable resource, if somewhat clunky. The rhyming feature is first class, however the general logic needs some work. While the first selection of a word appears in all three sections, Rhymer (R), Thesaurus (T), & Dictionary (D), following selections do not carry over to these fields and must be looked up in each section manually. As a prolific poet, I know it is unlikely I will be content with the first rhyme I choose. Pressing back exits the app and clears your history!', "I love it! The fact that there is a notepad right at your fingertips in the app can't be overestimated. Grab that inspiration while you're at it and create something beautiful with the power of words. However, I feel like the thesaurus part could be enhanced and the dictionary part could be complete with examples of word use in a sentence. Other than that, great app!", 'its every thing u need to turn you simple ideas into awesome writting. its a relly great app, everyone should try it.', 'I just love it. It helps me with almost anything, writing poems, a thesaurus for words I domt understand from lecturers, and so much more !! Would give it TEN stars if I could.. Definately recommended 😁', "I'm in love with this app. As a writer, this is my go to for basically everything.", 'The BEST!! This app does exactly what it describes and more, not like other apps', 'Very useful, thank you. Feature Request: Clicking on a word in thesaurus could jump to definitions for that word? I have many dictionary and thesaurus apps and this is the best for rhyming. Thanks again, this a fantastic app for writers, also the dictionary is simple and nice for those learning English. The thesaurus is useful too for brain storming.', 'Would be awesome if you filter what kind of rhymes are shown (ig. Strict, exact, loose). Like bringing up any word that ends in something common such as "less" yeilds way more than 500 results but I can only see words beginning with A to words beginning with G and they were all pretty much words that have "less" on the end. Great app but a filter option for results would GREATLY benefit this app.', "It's almost good... But it will be better if you make it to connect with the Google account or an ID of the poet Assistant where we can register so that when I got it uninstall and later when I install it.. All the words which I have marked as favourites could come back when I log in to my id...", "This is one of my favorite apps ever! Being the word lover I am, I have fun just playing around with the app but it's also been very useful in my actual writing. One recommendation to the developer: Add a feature that allows the user to submit/suggest words to be added to the lexicon."], 'appId': 'ca.rmen.android.poetassistant', 'url': 'https://play.google.com/store/apps/details?id=ca.rmen.android.poetassistant&hl=en&gl=us'}
