{'title': 'Sensors', 'description': 'COMPLETELY FREE\r\nno ads or in-app purchases\r\n\r\nMATERIAL-INSPIRED DESIGN\r\nsimple, clean and colourful user interface\r\n\r\nOTHER FEATURES:\r\n- get extra information such as range and resolution\r\n- record sensor values to monitor changes over time\r\n\r\nSENSORS (availability depends on device):\r\n- Accelerometer\r\n- Geomagnetic Field\r\n- Gravity\r\n- Gyroscope\r\n- Humidity\r\n- Light\r\n- Linear Accelerometer\r\n- Pressure\r\n- Proximity\r\n- Rotation Vector\r\n- Temperature\r\n\r\nSPECIAL THANKS TO:\r\n- http://icons8.com/ for the launcher icon\r\n- http://romannurik.github.io/AndroidAssetStudio/\r\n- http://shreyasachar.github.io/AndroidAssetStudio/', 'descriptionHTML': 'COMPLETELY FREE<br>no ads or in-app purchases<br><br>MATERIAL-INSPIRED DESIGN<br>simple, clean and colourful user interface<br><br>OTHER FEATURES:<br>- get extra information such as range and resolution<br>- record sensor values to monitor changes over time<br><br>SENSORS (availability depends on device):<br>- Accelerometer<br>- Geomagnetic Field<br>- Gravity<br>- Gyroscope<br>- Humidity<br>- Light<br>- Linear Accelerometer<br>- Pressure<br>- Proximity<br>- Rotation Vector<br>- Temperature<br><br>SPECIAL THANKS TO:<br>- http://icons8.com/ for the launcher icon<br>- http://romannurik.github.io/AndroidAssetStudio/<br>- http://shreyasachar.github.io/AndroidAssetStudio/', 'summary': 'Sensor dashboard and logger for Android', 'summaryHTML': 'Sensor dashboard and logger for Android', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.33526, 'ratings': 1750, 'reviews': 257, 'histogram': [111, 40, 192, 212, 1193], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '2.6M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Calin Tataru', 'developerId': '5526451977947367946', 'developerEmail': 'calintat@gmail.com', 'developerWebsite': 'https://calintat.github.io/', 'developerAddress': 'Swindon SN2 2UH', 'privacyPolicy': None, 'developerInternalID': '5526451977947367946', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/E2OwRY__S_B-VRYJu4Dwtr9cUkFMkpxOaht1HstrJecyr0QzRtWdbVpZZQ1X3eomIng', 'headerImage': 'https://lh3.googleusercontent.com/55IRtWWDLlmFFIk7AZxdYXD7tpwTtVx4qpO7BoYT2W2vZfuPM73rZ3qZCBb3Pawyaic', 'screenshots': ['https://lh3.googleusercontent.com/wYtZUkNYFgGYBC8yrNLvYcDdtVWCu3bCvQomSHH14swWsB_-YpleQti6cOHQXkrG3_c', 'https://lh3.googleusercontent.com/tBgxATjAkuTiON8R7igmTPJ3tMvKBLqPc7dGKSzEFzH3fH_Rlw1YZI8k5knhlYwdYQ', 'https://lh3.googleusercontent.com/dxRzMj-Qk5dDcCdZk-8TiNY3JzB304iFs94zhdHedSNXbyt6fbZCU5iXEHDgKLAGLg', 'https://lh3.googleusercontent.com/diGZDHPt77szqB0FpQhm4rATUbuv47tNYYXowBCxoxvfxJqTjH4zttZNvBQD22hiMSb0'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 4, 2014', 'updated': 1502819864, 'version': '2.0.2', 'recentChanges': '* Support for in-app donations\r\n* Fixed scrolling glitch in settings\r\n* Revamped settings UI with Android O style', 'recentChangesHTML': '* Support for in-app donations<br>* Fixed scrolling glitch in settings<br>* Revamped settings UI with Android O style', 'comments': ['Great app! Beautiful minimalistic interface and works well. No ads and completely free (although you can always choose to support the dev). Thank you, Calin!', 'I love its design and user experience', "Useless time wasting app. Please don't install this. Instead use Google \nScience Journal instead it's the best!", 'Shows what and how it is working. Simple and efficient. No request for sneaky permissions.', 'Everything is perfect 😀', 'Android O update deleted all saved data from the previous version of the app with no warning.', 'Great app for testing what is working and what is not.', 'Okay, so what if the  temperature is in degrees Celsius, not Farenheit or Kelvin.   The cool part is remembering geeky science stuff I used to love in the seventh grade, and spontaneously coming up with rabbit-out-of-a-hat uses for this app, like showing my dinner guests how humidity increases when we make pasta.', "First of all, this is a good app that does what it says. Now about my title, if you've observed recently, many apps keep asking for absurd permissions for totally irrelevant functions that they perform. There are very few apps that don't ssh that this is one of them so I'll install this over a little more functionality with a ton of spying on my.", 'You are the dev I was looking for. Simple, efficient, every page is same. Colors are light, fonts are great. A lot of people should learn from you. Ome thing missing is that if you can add customizable wigdets with the same simplistic idea to allow us monitor sensors that would be great. Brilliamt job.', "Would have given it 5 stars, but it's missing a link to instructions/examples on how to use the data. I suppose if you have to ask you really don't need the app, but for the younger users it would have been the icing on the cake.", "And like another rater said, it does NOT ask for permission it doesn't need.  I like that very much!   But I need the decibel sensor, so sadly I need a different app.  If this one had audio,I would give it 5 stars, (and I don't usually give 5s)", 'but the sensor data are changing so fast. it is hard to focus on data and analysis it.  will you add a setting for change the sample rate of reading sensor data? or something like that! or even you can add an averaging mechanism. thanks', 'Does a good job. Beautiful, simple UI w/o unnecessary graphics and stuff as in many other similar apps. Easy on the eye. Just the plain data your interested in.', "Thank you sir for the app that is free from ADs and doesn't require stupid unnecessary permissions. Keep up this way of doing things, it's really good way. 5 stars.", "Great app! Shows all installed sensors data. Doesn't require any unnecessary permissions! So hard to find such an app these days!", "A bit too simple for my uses, but has a nice clean, simple interface. Fast. If you don't need logs, graphs etc then this is perfect for you. 3.5 stars", "5 star if it could show those values as a continuous graphical plot as well. It's easier to visualize changes on a graph. Otherwise good.", '5 stars for no permissions! Would love to see graphs and time based historical for the data collected.', 'I would to have the geomagnetic field so that I can use it for a compass app since I had no in build sensor in my phone', 'Clean UI, no advertisements, no premium features, and no suspicious permission requests. One thing though, maybe the Dev could include sounds sensor.', 'Needs a sound level meter and UV sensor reading (GNote 4). Otherwise perfect.', 'Nice gui and that is it.', 'Super simple to use, detected all the sensors on my galaxy S4...A dashboard to show all the readings at one place would be great... Instead of having to look at each of them individually', 'Thanks for providing this app without asking for a bunch of ridiculous permissions. This app is simple and does just what I want it to do.', 'It simply does it job, and it has a clean UI.', 'I think this app has my favourite UI (for the ones without graphical output).', 'Would be nice to see a summary page with all readings in one spot.', 'i didnt know that my android one has so much sensors, on a very low price. thanks !!', 'Can we please get a graph function and also choices of different units (eg. for pressure and temperature)                Thank you for this lovely app :)', 'nice use of material design. Got sensors to work without permissions!, but indeed the app still needs to learn a lot from competition in terms of features.', 'Very poor half of sensor options do not work', 'This app does its job without messing your phone. No permission is required, no ads. Thanks so much', "Does what it's supposed to do and nothing else. I like the UI,  it's way simpler and better than many other sensor apps", 'Good layout, I would like to be able to view multiple sensors at once though.', "Sadly, I don't have many sensors.", 'Pull down to refresh, some widgets and perhaps periodic readings and keeping history for fancy graphs and stuff and it would be great.', 'Does what it says, good for testing all sensors. UI smooth and functional', 'Good clean design, does what it promises and no extra permissions required, this is awesome', 'No special permissions needed!'], 'appId': 'com.calintat.sensors', 'url': 'https://play.google.com/store/apps/details?id=com.calintat.sensors&hl=en&gl=us'}
