{'title': 'APDE - Android Processing IDE', 'description': "APDE (Android Processing Development Environment) is an integrated development environment for creating Processing sketches on your phone/tablet. APDE supports the full edit, compile, and run cycle. You don't need a computer or an SDK to start coding on the go.\r\n\r\nAPDE is currently in alpha. Lots of things will change in the future and many more features will be added. The app is under active development and you may encounter bugs and issues. If you find a bug or have an issue with using the app, please make sure to report it.\r\n\r\nAPDE is open source. You can find the source code, an issue tracker, support, and a more detailed explanation of APDE's inner workings on GitHub:\r\n\r\nhttps://github.com/Calsign/APDE", 'descriptionHTML': 'APDE (Android Processing Development Environment) is an integrated development environment for creating Processing sketches on your phone/tablet. APDE supports the full edit, compile, and run cycle. You don&#39;t need a computer or an SDK to start coding on the go.<br><br>APDE is currently in alpha. Lots of things will change in the future and many more features will be added. The app is under active development and you may encounter bugs and issues. If you find a bug or have an issue with using the app, please make sure to report it.<br><br>APDE is open source. You can find the source code, an issue tracker, support, and a more detailed explanation of APDE&#39;s inner workings on GitHub:<br><br>https://github.com/Calsign/APDE', 'summary': 'APDE allows you to create Processing sketches on your phone or tablet.', 'summaryHTML': 'APDE allows you to create Processing sketches on your phone or tablet.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.426966, 'ratings': 1802, 'reviews': 683, 'histogram': [91, 80, 101, 222, 1305], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'CalsignLabs', 'developerId': 'CalsignLabs', 'developerEmail': 'calsignlabs@gmail.com', 'developerWebsite': 'http://github.com/Calsign/APDE', 'developerAddress': None, 'privacyPolicy': 'https://github.com/Calsign/APDE/wiki/Privacy-Policy', 'developerInternalID': '7650914886640945288', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/Sjtb-6kr_99DNEVf06jPpo2JjPSegei3q3w1bh3LApDNVItrueXypkcvI4QqDZm-6Q', 'headerImage': 'https://lh3.googleusercontent.com/MDLIzecGHo2CK0GZR213-m3ZPasmGvco5uaUJIq90Wpv6jbrG_RuE2VtIeA-s7ryfA', 'screenshots': ['https://lh3.googleusercontent.com/XdP0PvPYdPKpAunvSnHVRhhaBiSdi-esYR7kKgmfRPxTVwBOMOF5_ZHbzdLzoexdx5s', 'https://lh3.googleusercontent.com/aX8BthnV_xjITjWZRGyxqFytD8yCBJVTsEh-5jP54lxKg1ZSLAKPSZqw_c64YQC42AQ', 'https://lh3.googleusercontent.com/hCRhTMDvMQuuI3Xg33ZlR0ndlsxB1gbQ0Tbsj6hYi5_qw2_CeWnIdCds394N5_PEmQ', 'https://lh3.googleusercontent.com/y67QawWSXjZo9zjvLWkiGTSEj67XDJglnFGFn3pY6R6zSu9RCK-SjTxk0iCy9GChQbQ', 'https://lh3.googleusercontent.com/ucDdkJK2UkhCm6n0xKYfDLoHSaPDh-A7A69S3Zq7uHholT-uEPqMZMJcv0k6OxUs8AA', 'https://lh3.googleusercontent.com/0Z7qwvdOlYS5hwlOOI_ULjvHDjoGr4m_AYIRhYoxlSlsTTJamLoexxWhmW_k1k4Ahur3', 'https://lh3.googleusercontent.com/CIUJRPdytZxNaP2udu5LZMH0i6PWLvc5HDewEsWlo3APWKGDkTggMDxWwgLb0k54jdPy', 'https://lh3.googleusercontent.com/Yr7MGmCLnHLkaVv4QKJLIZlh-uMqh_y6niqGrwfyzkVt2gi0WQzmGcn0rAimuU2UeF_J', 'https://lh3.googleusercontent.com/1Wyiu2SCDzpsydPjRtrLPnleecY21JjfcHUgLD7dq0V0fUE10-68QxxpgIUbjXIOwcWo', 'https://lh3.googleusercontent.com/XMG2EfZ7ZuuFy5V_qIbtsRnEKwcxvBzqpaDpZhYXJQdEkdbiiH7e7C-Yo0zSW2LU7rY', 'https://lh3.googleusercontent.com/b4ldfgWrP2Vhmos-XskgpSeGsGC2GPYu_OaoOxW-R5FE_8pfhAlEwe604cY0QLn_ctPS', 'https://lh3.googleusercontent.com/Vvik2pPWjxalyjabqsuGQDmACsKF-kqq5UxsMZkSvP8YoR8FNkRWSW8g5APhWKayOQ0', 'https://lh3.googleusercontent.com/OxIp5Kq5E4Ive7KuFY6xqW-zhx9SEeW6Vag877f-yn39Xo_wp2eVp2SvBDMExkRLdKc', 'https://lh3.googleusercontent.com/9D22-U-NGm7fyJcTvqGREB5S1OO3NpHWmZ1cEe8Kp2Fo1Kaw3lIdJVaSj0tVmKzuVQ', 'https://lh3.googleusercontent.com/nngmvG8cBtHM8uWuz-MF9U7rxX8mMd_P2K9PFGma2-uSzaAIasVUwDVaUNGAI_fJCV8n', 'https://lh3.googleusercontent.com/3GFxsE5OaXQRXt7vPZCpyDT26difBK1knA7HI8cpKy23bUYJppqcbTR3I7ytRcYtAw', 'https://lh3.googleusercontent.com/Egld5REqtDz1yvPJt2XVbiSERfUS4MBCZ13537GTB0mfTwRY_AuKvjlCe2EfCwYwwEA', 'https://lh3.googleusercontent.com/_MnHPwyLW8Od7z8W3VYQG8_y8B6z-QRvyTw6Vqgl_eYEpx88ShmW8fJ8xCpXHhnqEADI', 'https://lh3.googleusercontent.com/zVjyp7U--IpPLeXyODL8XFiFTO6TQWEFZSgCnYgo_C4eGA89F0qDda0_wfGys3RoQtY', 'https://lh3.googleusercontent.com/L0UDlTQFNIHrWSLcAaQIFGULd3faHldJkZTYwIIBP9OaBpkLELPXb6UmXdqDo8rQzQ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 26, 2014', 'updated': 1547660922, 'version': 'Varies with device', 'recentChanges': "v0.5.1 Alpha\r\n - Preview mode runs sketches without installing them\r\n   - You must install the APDE Sketch Previewer once, but then you can run sketches without installation indefinitely\r\n   - Preview mode is available as another target, along with wallpapers, watch faces, and VR\r\n - Support for the new Processing sound library\r\n - Undo and redo are more accessible\r\n - Ability to bypass screen overlay warning\r\n - Lots of bug fixes\r\n\r\nThese changes are driven by GSoC '18.", 'recentChangesHTML': 'v0.5.1 Alpha<br> - Preview mode runs sketches without installing them<br>   - You must install the APDE Sketch Previewer once, but then you can run sketches without installation indefinitely<br>   - Preview mode is available as another target, along with wallpapers, watch faces, and VR<br> - Support for the new Processing sound library<br> - Undo and redo are more accessible<br> - Ability to bypass screen overlay warning<br> - Lots of bug fixes<br><br>These changes are driven by GSoC &#39;18.', 'comments': ["The app is great. You can make some sweet sketches, and if you hook up the device to a computer with the Android mode, you can even play them on there! Too bad I gotta pay an £18 fee just to upload games on the play store... As a non-budget developer, I can't make that money, so I might share my projects using another source like Drive.", "Excellent app, but some bugs on Galaxy Tab A 10.5: 1. Had to turn off syntax highlighting as often it was offset a bit from the black text underneath, making the code unreadable. 2. Runtime errors only show up when using my tablet in portrait orientation. Have tried scrolling the console in portrait after running but only messages from before running are there. 3. Can't find any way to enable line numbers in editor. If not possible then that's a big limitation in usefulness.", "My experience was this app WAS excellent, and I would give it a solid 5 stars except that it hasn't worked for a half year thanks to progressively bug-prone Samsung updates on Sprint. Is there a plan to fix it to work with the current revision of Android?", 'This app works fine but theres an issue with OTG mice and hardware keyboards on my OnePlus 6 (Android P) where if i hook up either of them while in app then exit with them still connected the app will crash constantly ans not stop crashing until i reinstall the app and thus lose all of my sketches. Otherwise a good app and everything works great!', "This is my first ever review. I never thought I would actually see my processing sketches run on my phone. But with this app, it's exactly the same as my PC Processing sketches. Good job to the team behind this. I really appreciate your hard efforts.", 'Galaxy Tab S6 on One UI 2.1 , Android 10 : APDE will not start, intantly crashes when I try to launch it', 'Great. Easy to use... I think the SketchViewer must be installed automatically.', "I loved this app very much and I use it a lot to make sketches in my free time.. it's cool how you can code your own apps right in your phone and run them in no time. There is however some problem I am facing with custom libraries. Whenever I install custom libraries, they don't show up in the manage libraries section.. however I get the library examples but when I try to run them, they always throw a build error. Please provide me a solution for this Also the fact that you can make your own live wallpapers 😁.. it's awesome overall..", "Very nice IDE, but I'm wondering if it's possible to show line numbers? Debugging is difficult because the console doesn't seem to update until setup() finishes or the program is stopped. Error messages show the line number, but I don't see any way to locate the bug other than counting lines from the top.", "Very Awesome App for Coding On the Go! I am new to processing, but find art coding very interesting and almost therapeutic. I've been using it for almost 5 months. The problem I have is the redraw() function is not working. Im trying to loop or redraw my code project to repeat once its finished. Sadly, the redraw() function stays black instead of blue. Overall, the app is a little different compared to working on the desktop, but definitely useful for coders who enjoy working on the go.", 'Love the app, just found a small bug. I installed Ketai properly, it works just fine in App mode. But if I switch a sketch over to Wallpaper mode it fails to load every time. I\'ve made other sketches without Ketai in wallpaper mode, and they work fine. I just find it extremely annoying that I can\'t use Ketai in a wallpaper, it just stays on the "Loading wallpaper" screen forever when I try to apply it.', "A really good app for programming quick things... But it is buggy. Sometimes it doesn't like dividing and gives wrong answers, and now it keeps crashing whenever I try to open it, so I have to reinstall it. It's good that programs aren't part of the app so they don't get deleted!", 'Works really great and I appreciate that I can now code with processing on my chromebook. However, it would be much appreciated if you could make a way to download other processing based progrmming languages into this like on the real version. I much prefer processing.py to processing.js but I am currently restricted from using it due to having to use a chromebook. Anyways, it is a really good app and I would definitely recommend this to anyone interested in learning to code really easily. Peace!', "The only problem I've encountered is that it crashes whenever I try to draw an image in preview and app. There's no problem creating a PImage variable, or loading an image to the variable, but when I try to draw it with image(img, 0, 0), it crashes.", 'This is amazing! Being able to make quick apps on my phone is great fun.', 'Beautiful, I am a developer myself and this isnjust simple and really well done', 'Great app to code on the go but there are some bugs and a few things missing: -The editor glitches out after 30 lines of code and the text does not align with the color markings. -A few functions such as push() and pop() dont work.', 'Processing on a phone. What could be more perfect? You have that cool idea on a train communte? You can have it sketched out in APDE by the time you arrive. Mobile is the ideal platform, truest to the spirit of the Processing project.', 'This is really easy to use. however IT CRASHES CONSTANTLY!!! please fix this', "This app is great its really good but I can't import the processing sound library for some reason when I try to install it, it says that the library is already installed but when I try to import it, it doesn't work", 'Very good to have processing on the phone.', 'Personally and also taking my skill level into account as a fairly new developer. It is great to actually have a working IDE on my phone without having to first obtain a doctorate to get it going. I can now practise whenever or wherever I go. Thank you.', "I think it's a great thing to be able to code locally right on my phone. Stability is improving. Please continue the great work; don't let up now!!", 'On chromebook. It works, but it is a pain. I had to put my chromebook into developer mode to download the things nessisary to view my sketches and I cannot export or share my sketches to my computer. Please fix.', 'love the app so far. already made my own game. but is there a way to delete sketches? every time i click delete, it deletes the current one but creates a new one at the same time', 'The preview mode is a great update. saves a lot of time. Thanks team CALSIGN LABS', "Great IDE. Not very easy to use. But it's worth for the learning curve. Even a APK converter is embedded.", "i really love it! but i can't run exit(); to end the program, and not the biggest fan of the auto save", 'As far as I see, you can code anything you can code at pc version. And, this is awesome.', 'Thank you! It really works as a charm. Love the wallpaper feature!', 'I have done a bit of coding but for some reason now it keeps scrolling to the top of the script for no apparent reason. please help', "Nice App,buts most of the sound libraries(Minim,Processing Sound) crash the app/don't work.Can you please work on this maybe make minim in-built in.", "By far the easiest way to learn to code. Check out Daniel Shiffman's companion YouTube tutorials.", 'sometimes (most of the times with null pointers) it doesnt display the error', 'easy to use, great processing, no ads!', 'Love this on the phone, but on ChromeOS I cannot use the previewer unless in Dev Mode. Any hope we may bet the apk listed on the Play Store so we don\'t to "install from unknown sources"?', 'Syntax highlighting is not working properly .', 'incredible app for Android game development with Processing.js.', 'am facing problem to adding serial library to APDE.but showing errors like badly formated library so i changed library and file manger but proboem us still there', 'I love the app but can you please add autocompletion to the ide in the next update'], 'appId': 'com.calsignlabs.apde', 'url': 'https://play.google.com/store/apps/details?id=com.calsignlabs.apde&hl=en&gl=us'}
