{'title': 'FOSDEM Companion', 'description': 'Advanced schedule browser for the FOSDEM conference in Brussels, Belgium. Download the most recent schedule and browse it offline.\r\n\r\nFeatures:\r\n- Browse sessions by day and by track\r\n- Instant search\r\n- Track schedule view optimized for phones and tablets\r\n- Full sessions details with related links, speakers info and room maps\r\n- Add sessions directly to your calendar\r\n- Share sessions with a link to their page on the FOSDEM website\r\n- Manage bookmarks and get notified when a bookmarked session is about to start\r\n- Export bookmarks to iCal file format\r\n- "Live" view: during FOSDEM, watch the realtime updated list of currently running and upcoming sessions\r\n- Room status: during FOSDEM, check if a room is currently open or full before moving there\r\n- Share bookmarks list and sessions between devices using Android Beam\r\n- Light and Dark themes\r\n- Includes a simple map of the site.\r\n\r\nNote: this app properly handles timezone changes and device reboots for notifications; you can download the schedule and add bookmarks on any timezone and you will get notified at the right time when the events start in Belgium.\r\n\r\nThe source code of this application is available at https://github.com/cbeyls/fosdem-companion-android\r\nThe name FOSDEM and the gear logo are registered trademarks of FOSDEM VZW.  Used with permission.', 'descriptionHTML': 'Advanced schedule browser for the FOSDEM conference in Brussels, Belgium. Download the most recent schedule and browse it offline.<br><br>Features:<br>- Browse sessions by day and by track<br>- Instant search<br>- Track schedule view optimized for phones and tablets<br>- Full sessions details with related links, speakers info and room maps<br>- Add sessions directly to your calendar<br>- Share sessions with a link to their page on the FOSDEM website<br>- Manage bookmarks and get notified when a bookmarked session is about to start<br>- Export bookmarks to iCal file format<br>- &quot;Live&quot; view: during FOSDEM, watch the realtime updated list of currently running and upcoming sessions<br>- Room status: during FOSDEM, check if a room is currently open or full before moving there<br>- Share bookmarks list and sessions between devices using Android Beam<br>- Light and Dark themes<br>- Includes a simple map of the site.<br><br>Note: this app properly handles timezone changes and device reboots for notifications; you can download the schedule and add bookmarks on any timezone and you will get notified at the right time when the events start in Belgium.<br><br>The source code of this application is available at https://github.com/cbeyls/fosdem-companion-android<br>The name FOSDEM and the gear logo are registered trademarks of FOSDEM VZW.  Used with permission.', 'summary': 'The best way to keep track of the largest free software meeting in Europe.', 'summaryHTML': 'The best way to keep track of the largest free software meeting in Europe.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.78, 'ratings': 240, 'reviews': 40, 'histogram': [2, 0, 2, 38, 196], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Dreamy Robots', 'developerId': 'Dreamy+Robots', 'developerEmail': 'software@digitalia.be', 'developerWebsite': 'https://www.digitalia.be/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '4951384980662055378', 'genre': 'Books & Reference', 'genreId': 'BOOKS_AND_REFERENCE', 'icon': 'https://lh3.googleusercontent.com/bYmO_OBe3veRfDP0ji6zsFI7dn5U4FflvsZaaxujFR6RiFK0Oa48tUtEloQb_HtOEBo', 'headerImage': 'https://lh3.googleusercontent.com/2y0ATso89Kv5F8bkzuD1AaFam3KSrFtc1EEc8yWFXDRUM7VPqhss00EarzmTfsTCcB8', 'screenshots': ['https://lh3.googleusercontent.com/00eUai5VCDV18h1bah-RJqHrZpWIrjAsncDfg3XPrRcjlm-7-Xob-mnBllnvNBfaKg', 'https://lh3.googleusercontent.com/u2-v7mPx1bjAisVAqZLnDhnRbKcVcEIcyD9KchE8nXEZzYgTlFDLZQlyNb0Wk0jnUw8', 'https://lh3.googleusercontent.com/cQVkVotA-XRCqsdHyVgliP32VPyBIrhGa-z-f_iMUKeTDDuIXsygduMD422XHFg-nth_', 'https://lh3.googleusercontent.com/agt9gdclwaR0-GDOJFGb3VYFEnCi4fYLXiGVpPlNVOig9HBsk17742hArnNK69oY9j0', 'https://lh3.googleusercontent.com/dadekkvaOxLEAdKgLSZ9Hlg1Cofg3qGWJi_ulZgStK7OAw0VCEjYALJBUaiHGlCPVLk', 'https://lh3.googleusercontent.com/vuouWy-qndRtJ1K4BE_VUFOG9s-9yOw1VepQkXZJecyNZwPkWgRHVwNpaW4ucRc4m8s', 'https://lh3.googleusercontent.com/sL46XKplLOQhZzYhB8qIzzy8W-dVbggrhMipG3hwRtt4PTzrhKu-llLFmnj6Ut66wg', 'https://lh3.googleusercontent.com/Yw-VWpy050fIXrihAFn1oJ248BsMXNM-2369XVeV20pPbaP4-N_ew1-K8wEq8Djx_tw', 'https://lh3.googleusercontent.com/cmzgstOT4pmsTYSVZ5olJ9AgVFtCETZch-zvexbvX8BTc3nEDkcDtZQ8B_VHdpbZRw8', 'https://lh3.googleusercontent.com/5TLwf8fnalSLbiDAboz98Qjz84JXpJMv-OvqK_ibv0oVH_o4ip88e-nNDFCpOtAPQj6O', 'https://lh3.googleusercontent.com/vaEDR1RhyxZtUqPFskYqSl7p7g_sY5V47qvJlCkDE-96CVj4jbXWDBqNWexzhKlxEUE'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 14, 2014', 'updated': 1580297659, 'version': 'Varies with device', 'recentChanges': '2.0.1\r\n- Rewrote the entire app in Kotlin.\r\n\r\n1.7.1 - 1.7.3\r\n- Fix external web browser toolbar color when switching between light and dark theme\r\n- Fix bookmarks export feature: file was corrupted\r\n- Minor bug fixes and libraries updates.\r\n\r\n1.7.0\r\n- Add dark theme, configurable in the settings screen\r\n- Polished material design\r\n- Remove schedule update prompt on app startup. Updates are now performed automatically.\r\n\r\nThe app now requires Android 4.2 or more recent.', 'recentChangesHTML': '2.0.1<br>- Rewrote the entire app in Kotlin.<br><br>1.7.1 - 1.7.3<br>- Fix external web browser toolbar color when switching between light and dark theme<br>- Fix bookmarks export feature: file was corrupted<br>- Minor bug fixes and libraries updates.<br><br>1.7.0<br>- Add dark theme, configurable in the settings screen<br>- Polished material design<br>- Remove schedule update prompt on app startup. Updates are now performed automatically.<br><br>The app now requires Android 4.2 or more recent.', 'comments': ["A view of the talks by room would be very useful, something to see what's coming up in the rooms nearby.", 'Allows bookmarking of talks into a personal schedule', 'The best app to follow the conference', 'Awesome app to organise your FOSDEM schedule!', 'Back button top left of the app should do the same as the phones back button. Going "back" to a menu you weren\'t on before doesn\'t make sense  (I came across numerous people that were confused by this behaviour!)', 'By far the best FOSDEM app!', 'Just awesome, a must for anyone attending!', 'yay :)', 'This app helps get the most of the FOSDEM experience.', 'Literally the vest conference app', 'Also available on F-Droid', 'Really useful for plannong you schedule', 'Very useful. Thank you', 'Veeeeery useful.', 'Very helpful', 'Awesome', 'Or the ability to dump my started content etc to xml/Google drive or whatever before the next schedule is released. I was using starred events to know what videos from the archive I wanted to watch. The app app is great, and really helps plan your route at the event. Thanks as ever, especially for responding to feedback.', "I had a little difficulty downloading the schedule at first but this fixes all of the problems I had with the other schedule app. You can now see what's coming up really easily and set how long before the event you want to be notified. Great work.", "This app is very easy to use; better than many conference apps I've tried. The notifications for upcoming sessions I've starred can be turned off or changed in the settings, and I appreciated the links to a map of the session location for each session so I can find my way there quickly.  The only improvement I can think of is to make it easier to find the next sessions as the  conference goes on; right now when I go to the list of sessions I starred, or a list of all the sessions in a specific track, it lists them chronologically and as the conference goes on, I have to check the current time and scroll to the appropriate place in the list.  I would love it if it jumped past or greyed out the sessions that are over so that I can more easily identify current & future sessions.  Thank you Christophe!", 'Was super useful for navigating the sea of talks at FOSDEM.', 'Great con!', 'Is there a way to generate a schedule from the stared events list? That would be awesome!', 'best fosdem schedule app so far', 'Awesome, only the settings icon feels odd. You might put it in the overflow menu.', 'Quite helpful, thanks!'], 'appId': 'be.digitalia.fosdem', 'url': 'https://play.google.com/store/apps/details?id=be.digitalia.fosdem&hl=en&gl=us'}
