{'title': 'Easy Token (RSA)', 'description': 'Easy Token is an RSA SecurID compatible authenticator with advanced usability features:\r\n\r\n - Convenient lock screen and home screen widgets provide instant tokencodes without navigating to an app.\r\n - Optionally save your PIN.\r\n - Supports SDTID files, importing http://127.0.0.1/... tokens from email, and QR tokens.\r\n - 100% open source; no ads: https://github.com/cernekee/EasyToken\r\n\r\nTo report a problem, contact cernekee+et@gmail.com or visit the XDA support thread.  Please do not leave problem reports in the Reviews section, as this does not provide a suitable forum for troubleshooting.\r\n\r\nXDA support thread: http://forum.xda-developers.com/android/apps-games/app-easy-token-source-securid-token-t2805507\r\n\r\nPlease use Easy Token responsibly and avoid taking unnecessary risks with sensitive data.  All software tokens are at risk of theft by malware; for high-security applications a hardware token is strongly preferred.', 'descriptionHTML': 'Easy Token is an RSA SecurID compatible authenticator with advanced usability features:<br><br> - Convenient lock screen and home screen widgets provide instant tokencodes without navigating to an app.<br> - Optionally save your PIN.<br> - Supports SDTID files, importing http://127.0.0.1/... tokens from email, and QR tokens.<br> - 100% open source; no ads: https://github.com/cernekee/EasyToken<br><br>To report a problem, contact cernekee+et@gmail.com or visit the XDA support thread.  Please do not leave problem reports in the Reviews section, as this does not provide a suitable forum for troubleshooting.<br><br>XDA support thread: http://forum.xda-developers.com/android/apps-games/app-easy-token-source-securid-token-t2805507<br><br>Please use Easy Token responsibly and avoid taking unnecessary risks with sensitive data.  All software tokens are at risk of theft by malware; for high-security applications a hardware token is strongly preferred.', 'summary': 'RSA SecurID compatible authenticator with advanced usability features.', 'summaryHTML': 'RSA SecurID compatible authenticator with advanced usability features.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.55, 'ratings': 144, 'reviews': 40, 'histogram': [5, 4, 4, 20, 109], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '993k', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Kevin Cernekee', 'developerId': 'Kevin+Cernekee', 'developerEmail': 'cernekee+et@gmail.com', 'developerWebsite': 'https://github.com/cernekee/EasyToken', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5915846818926976219', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/lqXFVWi_b5dYJgSjkoOG048v9x42hebD6VDgGr-h1QFs4VOg4mOdOlKrSaNvF5KF16Y1', 'headerImage': 'https://lh3.googleusercontent.com/VS6b85fVux_YCwOFmg5zQ4SEDiMMQaBkr6cuHyzb1B5qfKR3lai6FR3bTwuco9AATcI', 'screenshots': ['https://lh3.googleusercontent.com/2g7NdcgW0x0noQ0MAgWUt61hpeibz8pt1qkpDm3YHDag-kQZAUIlOruQ8iEVq-MZNbw', 'https://lh3.googleusercontent.com/DYpq6wcIxZ4ODK1eM5CMHxx5O3Afav8-oy87YVJlRi77jPi1qv1tOuVvcJtBWjWI4G4', 'https://lh3.googleusercontent.com/d76PxmRDWe_XMzt9JIIbzTs_Xvy0AJ1QZkrpzGoQ7lRgC6KBsaHCvXmeY0aQeyOPmsQ', 'https://lh3.googleusercontent.com/siNjXydZZNjjvK0IqHwXRtFwTZN5gFVICknZKx9scyw3RAPMfinMWChTJN-ZOLsVjq4', 'https://lh3.googleusercontent.com/MZ2AkW4tfs6vOJiPOQH2h8rRKU9KZuycnLwi6xqcIkhLVzp9_TtgdF9Tg-b_fziuJ5o'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 5, 2014', 'updated': 1419542204, 'version': '0.91', 'recentChanges': "- Use more specific MIME type matches so that Easy Token associations don't show up in Contacts.\r\n\r\n- Update libstoken to v0.81 and switch from tomcrypt to nettle.  Most of the changes in v0.8/v0.81 won't matter on Android, but it is now possible to import hard token seed files if desired.", 'recentChangesHTML': '- Use more specific MIME type matches so that Easy Token associations don&#39;t show up in Contacts.<br><br>- Update libstoken to v0.81 and switch from tomcrypt to nettle.  Most of the changes in v0.8/v0.81 won&#39;t matter on Android, but it is now possible to import hard token seed files if desired.', 'comments': ['Does not include QR Scanner. The QR scanner it wants to use requires many more permissions than needed.', 'tims not sync with local time here so i cant use the pass which generated form easy token', 'Love the app, though the launcher widget occasionally locks up and stops changing codes. A fix for that would be great, as would WearOS integration.', 'i lost my old phone. But i know the device id and the token. this app just saved me big time.', "Works perfectly without any invasive permissions, unlike RSA's app", 'Love this app but any chance Kevin if we can copy the upcoming token into clipboard?', "I tried to get the RSA native client working but it wouldn't import from either QR code or URL. I added this app and moved my RSA .SDTID file to my Samsung Galaxy S5 and was able to install and configure my device and was logged in with my software token in less than 30 seconds. Sure beats the heck out of downloading all the JAR files and nonsense that one has to do with the native RSA conversion application. GREAT JOB!!!", 'It\'s sad that the official RSA app doesn\'t work,this one works like a charm on all my Android devices. Save your stid file in Dropbox or your cloud storage and you\'ll be able to easily move from one device to another. As I said before, don\'t bother with the "official" RSA app. Thus app should be paid, but it\'s not.', 'Do not even bother with the official RSA app. This one is brilliant.   The only improvement I would want is to be able to get tokens to tasker (via intents) so that I can push the token to my Pebble... Please Kevin - any chance?', 'For people who use their RSA token frequently, this is a real time saver! This app comes with a widget for quick access to the token — the original RSA SecurID app has no such thing.', 'The official rsa secureid app started being flaky with the most recent update. My it department asked me to reinstall and sent me a qr code. I used that code to reactivate the rsa official app and this one. But I much prefer this one due to the widget.', 'Need transparent option for background and border.', '.sdtid file can be imported in this unlike the original rsa app for android. Thanks for this utility, it helps alot.', 'Been using it for years, here is a future update feature request: make it possible to import multiple tokens.. that will earn you five stars', 'Love this app and use it on my samsung galaxy s5.  It works great.  Really wish that it would be made compatible with my android wear 2.0 smartwatch though.  Would be so much more useful if I could get tokens from my watch instead of my phone.', 'No need for RSA token conversion. stdid file will be taken up. Plus u get a widget. Truly amazing.', 'works good. But I am wondering if is there any way to restore old device id.', 'Better than RSA app!', 'Like it so far would love it and 5 star if it gave android wear support!', 'Finally a replacement for the long non-working official RSA token app!', 'This is really cool app. It helped me transferring token from previous device without going through IT team.', 'This is truly one nice app. I only wish for multiple token import and transparent box and borders', 'Better than original RSA SecuID app. Able to import directly from folder. Thanks pal!', 'Works like a charm!!!!', 'Works way better than the proprietary ones', 'Simple to use....', 'It is awesome app', 'very good', 'خخخ', 'Perfect', "Works well, love that you can have your code as a widget, but I would really like support for multiple tokens, like the official RSA app. It's a free app, with no intrusive adverts, so I certainly don't feel entitled to anything, just putting it out there. Thanks again to the dev for all his hard work.", 'Works well. Shame it wants to download Barcode Scanner when I already have QR Reader installed.', '4stars for the moment because you cannot add more than one tokens at the same time. Unfortunately I had to change to another app due to this. If this is fixed it will well deserve the 5 stars.', 'Hard to understand', 'Future time and I see', 'Sweet app', 'Hhhhhh'], 'appId': 'app.easytoken', 'url': 'https://play.google.com/store/apps/details?id=app.easytoken&hl=en&gl=us'}
