{'title': 'miniTruco (Truco Bluetooth)', 'description': 'Jogo de Truco (Paulista e Mineiro) grátis. Você pode jogar sozinho (contra 3 adversários virtuais) ou em até quatro amigos (via Bluetooth). O código é livre e está disponível em http://github.com/chesterbr/minitruco-android', 'descriptionHTML': 'Jogo de Truco (Paulista e Mineiro) grátis. Você pode jogar sozinho (contra 3 adversários virtuais) ou em até quatro amigos (via Bluetooth). O código é livre e está disponível em http://github.com/chesterbr/minitruco-android', 'summary': 'miniTruco: Truco Game Paulista / Miner for Android with Bluetooth multiplayer', 'summaryHTML': 'miniTruco: Truco Game Paulista / Miner for Android with Bluetooth multiplayer', 'installs': '5,000,000+', 'minInstalls': 5000000, 'score': 4.3528376, 'ratings': 43559, 'reviews': 7169, 'histogram': [3522, 1159, 2767, 5086, 31022], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '262k', 'androidVersion': '2.2', 'androidVersionText': '2.2 and up', 'developer': 'Carlos Duarte do Nascimento (@chesterbr)', 'developerId': 'Carlos+Duarte+do+Nascimento+(@chesterbr)', 'developerEmail': 'chesterbr@gmail.com', 'developerWebsite': 'http://chester.me', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8704180823260473080', 'genre': 'Card', 'genreId': 'GAME_CARD', 'icon': 'https://lh3.googleusercontent.com/J5dYGmbFU6JQva_EKwI8EukpAXiJneLBAsn4_D8XhuvhAALkqm2egU0yJMsb5HWEtQ', 'headerImage': 'https://lh3.googleusercontent.com/nSFdhcOYqqQZL5D4w5XmAdaXXVrYuVsLlX1oVCyKi6j5opX7dTopH7R01BOEutYcBV7D', 'screenshots': ['https://lh3.googleusercontent.com/4pkj12mynj6mGXWEWO1UtIU9NyugwE9CuAkIPqK2A6pISsTA8gkaIkeRTHo0zd7mbA', 'https://lh3.googleusercontent.com/j-RahJhHCLXPdiKk389sDuV297MReLfI5YEkQ_eDdrMcwCZCGEWQtUO2shkXVnFDAA'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 2, 2010', 'updated': 1539832661, 'version': '2.1.1', 'recentChanges': 'Suporte a Android 9', 'recentChangesHTML': 'Suporte a Android 9', 'comments': ['Totalmente perfeito! Acompanho MiniTruco desde a versão inicial e agradeço ao Chester por disponibilizar esse app e manter sua atualização. 😁👍', 'Obrigado Chester! Mais pratico para quando joga casualmente com uma mão apenas, qualquer bug reporto. N1/2.3.4', 'Os adversários sempre saem com 2 e 3. E na maioria das vezes saímos com caras fracas.', 'Minimalista, simples e ótimo!', 'kkkk', 'Bacana', 'Não existe pedir "truco" na mão de dez no truco mineiro, geralmente quando pedem, a dupla neste caso perde a partida. O computador atrapalha as jogadas, muito falho. Ainda bem que tem a opção de jogar com o bluetooth. E, também vocês poderiam habilitar a opção de tento mineiro jogando com o bluetooth.', 'Mais de 2 anos que tenho esse app, mas isso sempre foi um problema... a customização da jogabilidade. Onde moro, por exemplo, costumamos jogar com manilhas velhas e baralho fechado, mas essas opções, conjuntamente, não são permitidas pelo app! Por quê?!', 'O pair do Bluetooth ficou muito mais rápido na nova versão. Parabéns, Rodolfo', 'Pena que não tem o opção de jogar o longa distância por exemplo pelo wifi ou pelo nome de jogadores', 'Da pra jogar, mas o bot é retardado', 'Bom, mas falta os nomes dos jogadores', 'Melhor truco que ja baixei', 'muito bom e leve', 'Very good', 'o jogo é mto bom, simples e direto! seria interessante poder passar sinal e contestar a decisão do parceiro (computador) em aceitar a chamada de truco, pois em algumas vezes ele não tem nada, voce tambem nao e ainda assim, ele aceita o truco! de resto, muito bom p/ passar o tempo!', 'Dá pra passar o tempo, mas a máquina ainda é muito falha: meu parceiro aceita truco com nenhuma carta boa, e dificilmente consigo que a máquina aceite meu truco quando tenho o zap na mão. Talvez uma mensagem se concorda ou não no aceite do truco do parceiro poderia ajudar no primeiro caso.', 'Parabéns! O jogo está mto bom! Poderia agora investir em animações como boneco dos jogadores, nome, colar o ZAP na testa ! Coisas desse tipo! Galaxy s5 🍭 5.0 .', 'Dos que vi de truco é o melhor. Parabéns. Porém tem um pessoal que não acha as opções no menu (de truco mineiro, tento, manilhas) e já dá nota negativa, achando que é culpa do jogo. Por que você não muda isso para ser botão na tela inicial?', "Parabéns pelo aplicativo! Tenho apenas uma sugestão: o 'popup' de aceitar ou nao o truco podia ser um pouco transparente ou não ficar acima das cartas, pra podermos ver o que está na mesa. Parabéns mais uma vez!", 'Excelente jogo. Como vi algumas sugestões, seria interessante alguma forma de evitar que o parceiro aceite truco quando só tem uma manilha.', 'Esse jogo eh muito bom, jogava desde a epoca da versao symbian, agora com suporte a bluetooth no android melhor ainda.', 'Very famous game in Brazil.  Simple and addictive. The AI engine could be improved. Free with no ads equal 5 star!', "excelente jogo, tenho um smartphone top mas o que acabo mais jogando e' o minitruco mesmo. Simples e divertido.", 'Ótimo jogo sem frescuras, a inteligência tá legal também. Parabéns. Não curti o da LG esse é bem melhor.', 'Pra aqueles que adoram, passar o tempo. Com jogos de carta! Este app, vale a pena!', 'Verificar a lógica desse programa porque tem muitas falhas.', 'Eu jogo a muito tempo minitruco, e nessa versão esta ainda melhor!', 'Muito bom eu não posso ficar sem este mais.', 'Não conseguir achar o jogo mineiro.', 'Muito divertido e pratico, parabéns aos desenvolvedores.', 'Trava pacaraio, alem dos controles doidos', 'o meu não aparece opções só "Jogar" como faz?', 'Faltou apenas o som!', 'Muito bom mesmo!', 'Recomendo muito', 'Fodastico!!! Muito bom.', 'Bacana demais', 'Bom pra carai', 'Muito bem bolado'], 'appId': 'me.chester.minitruco', 'url': 'https://play.google.com/store/apps/details?id=me.chester.minitruco&hl=en&gl=us'}
