{'title': 'DAAP Media Player', 'description': 'DAAP Media Player allows you to stream your music from a DAAP share such as mt-daapd (firefly), Rhythmbox, forked-daapd, tangerine, most NAS devices such as FreeNAS, QNAP servers, and older versions of iTunes.\r\n\r\nDAAP is a proprietary protocol similar to HTTP developed by Apple for use with iTunes music sharing. Still used by modern versions of iTunes, the computer community has reverse engineered an older version of this protocol for streaming their own music. This application provides this functionality on an Android device.\r\n\r\nDAAP Media Player is an open source application on github https://github.com/chrismiceli/daap-client\r\n\r\nFeatures include:\r\n * Stream music without downloading the whole song!\r\n * Search and voice search songs\r\n * Passwords\r\n * Handle multiple servers\r\n * Random/Shuffle and Repeat\r\n * Playlist and Queue support\r\n * Widget\r\n * Home screen shortcut\r\n   1. Long press home screen\r\n   2. Click Shortcuts\r\n   3. Click DAAP - Add Server\r\n   4. Enter server information\r\n * Last.fm scrobbler support\r\n   - If you have a scrobbler app installed on your phone you can scrobble (disabled by default). Tested scrobblers: Simple Last.fm Scrobbler, and Scrobble Droid.\r\n * Last.fm artist information\r\n * Handle intents of the form daap://server:port#password\r\n\r\nPermissions\r\nINTERNET - to connect to DAAP servers\r\nWRITE_EXTERNAL_STORAGE - to save songs to SD card\r\nREAD_PHONE_STATE - to pause on incoming phone call\r\nCHANGE_WIFI_MULTICAST_STATE - to listen for local servers\r\nACCESS_WIFI_STATE - to know whether to listen on local servers or not.', 'descriptionHTML': 'DAAP Media Player allows you to stream your music from a DAAP share such as mt-daapd (firefly), Rhythmbox, forked-daapd, tangerine, most NAS devices such as FreeNAS, QNAP servers, and older versions of iTunes.<br><br>DAAP is a proprietary protocol similar to HTTP developed by Apple for use with iTunes music sharing. Still used by modern versions of iTunes, the computer community has reverse engineered an older version of this protocol for streaming their own music. This application provides this functionality on an Android device.<br><br>DAAP Media Player is an open source application on github https://github.com/chrismiceli/daap-client<br><br>Features include:<br> * Stream music without downloading the whole song!<br> * Search and voice search songs<br> * Passwords<br> * Handle multiple servers<br> * Random/Shuffle and Repeat<br> * Playlist and Queue support<br> * Widget<br> * Home screen shortcut<br>   1. Long press home screen<br>   2. Click Shortcuts<br>   3. Click DAAP - Add Server<br>   4. Enter server information<br> * Last.fm scrobbler support<br>   - If you have a scrobbler app installed on your phone you can scrobble (disabled by default). Tested scrobblers: Simple Last.fm Scrobbler, and Scrobble Droid.<br> * Last.fm artist information<br> * Handle intents of the form daap://server:port#password<br><br>Permissions<br>INTERNET - to connect to DAAP servers<br>WRITE_EXTERNAL_STORAGE - to save songs to SD card<br>READ_PHONE_STATE - to pause on incoming phone call<br>CHANGE_WIFI_MULTICAST_STATE - to listen for local servers<br>ACCESS_WIFI_STATE - to know whether to listen on local servers or not.', 'summary': 'DAAP is a client that works with firefly, forked-daapd, and most NAS devices.', 'summaryHTML': 'DAAP is a client that works with firefly, forked-daapd, and most NAS devices.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.65, 'ratings': 711, 'reviews': 293, 'histogram': [99, 63, 120, 127, 298], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '259k', 'androidVersion': '1.5', 'androidVersionText': '1.5 and up', 'developer': 'Miceli Bros.', 'developerId': 'Miceli+Bros.', 'developerEmail': 'michael.miceli88@gmail.com', 'developerWebsite': 'http://code.google.com/p/daap-client/', 'developerAddress': '13 High St, Apt D\nAmherst, MA 01002', 'privacyPolicy': 'https://github.com/chrismiceli/daap-client/blob/master/Privacy%20Policy.md', 'developerInternalID': '4809635491789907758', 'genre': 'Video Players & Editors', 'genreId': 'VIDEO_PLAYERS', 'icon': 'https://lh3.googleusercontent.com/IbrspIK8TfNCkImuzpI6PQmE9dn5iZZyaCEBo7gEypMRyqnkw7LG02lCwCH5e-HF9PXj', 'headerImage': 'https://lh3.googleusercontent.com/qdhOwEDkLFQ-9nHtmoaUSFcZPz12p0bTvUFxJ4_AS_vzv1Pxzata__sWAG0TNOYTCBM', 'screenshots': ['https://lh3.googleusercontent.com/pUcaDPkPQWNhIdNIPgHrrGh_DcUKxz5ZL_9IOBHvnJEPAxxY64C8tHyaHIyTtJExCQ', 'https://lh3.googleusercontent.com/Pc3toWjNzoHkrXsiVGCnIiCp697QRtKIRdAeY58tpjqEQlAND9tegXUhJ5eGfuz1XoA', 'https://lh3.googleusercontent.com/Hkv5KHWDHj7cYsWP-SJ_SzMgcVwfyKikFFUsTUasEMt8W3s0KG5UeFU5qjG7pDcldIE', 'https://lh3.googleusercontent.com/LapiIWAKHFtGLdU7p6VNY6AExtfMEFAHR26E_B0vRxkZlqCauH9yUQYxzd1G4s_-sURW', 'https://lh3.googleusercontent.com/5yPOgPr266T4-sK2coX7HZbqUXRV1fevKjmveO7lUTkdStogWE_p-G1v_1PltzV_djae', 'https://lh3.googleusercontent.com/1Y5sH5y6K-x-3iMvT0k9Ddxndfzv1IXtC5PjJQlQ5oTNySTGWueYYJwBZbL9XT0enRY', 'https://lh3.googleusercontent.com/q2rZk9BKKOiOiu9F5LOHaEpbO_tNbfHMz5cIrjqRkqkSasOcowR6LRQBX6hZ4sVRvg', 'https://lh3.googleusercontent.com/DGyOxP_xXHuamfpJeQmMt0Rvvpgu4m1cDyd0AYcVm7EsxFOzCcm7jAwENYHgeGx4-8LL'], 'video': 'https://www.youtube.com/embed/dToMFuj_-yo?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/dToMFuj_-yo/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Apr 23, 2010', 'updated': 1373750662, 'version': '.9.7', 'recentChanges': '.9.7\r\n * Added Estonian\r\n\r\n.9.7\r\n * Should fix issue with constantly running in background\r\n * Fixed Issue 52 with headphones.  Thanks Rano.\r\n * Added Norwegian & Russian translations\r\n * Support for Google TV/Logitech Revue (Thanks Mike Z!)\r\n * Looking for translators.  If you can help send us an e-mail.\r\n\r\nOther recent fixes\r\n * Obtain artist info when playing a song\r\n   - Will add artist image soon!\r\n * Updated some images/icons\r\n * Fixed issue with newer forked-daapd servers (caused by android bug).', 'recentChangesHTML': '.9.7<br> * Added Estonian<br><br>.9.7<br> * Should fix issue with constantly running in background<br> * Fixed Issue 52 with headphones.  Thanks Rano.<br> * Added Norwegian &amp; Russian translations<br> * Support for Google TV/Logitech Revue (Thanks Mike Z!)<br> * Looking for translators.  If you can help send us an e-mail.<br><br>Other recent fixes<br> * Obtain artist info when playing a song<br>   - Will add artist image soon!<br> * Updated some images/icons<br> * Fixed issue with newer forked-daapd servers (caused by android bug).', 'comments': ['it does what it says. it could use a visual overhaul and some new features, but it does the basics. however, it needs to be updated to support the features and changes brought to Android since froyo...', "Worked well the first time I connected to my forked-daap server (on a Debian host), but then next time just claimed all my playlists were empty. Reinstalling & rebooting didn't improve things. Strange. The alternative daap-client app called SharePlay works fine though.", 'Totally not intuitive. It would be so difficult to learn I may as well learn to program and make my own music program. Not what a phone app is supposed to be.', 'Uses only the resources to stream the song nothing more. I was impressed very much with this app I used this app when I was cutting the grass and I have a big yard, I have wireless repeater about mid way. And it was switching between AP and this app did not shudder one bit. Even if my signal was quite weak. It uses only the amount of data of however big that single song is.', "Android 5 on Samsung 4 broke it. It connects to server and it will  download, but it doesn't  stream. Error : 'File Failed'.", "Good auto-discover of server. No NowPlaying, no album art. No genres. Playlists sorted by artist. Queuing of tracks only, can't queue an album.", 'Program at times crashes including once taking system down and rebooting. Running Lenovo 7.1.1 nougat.', "really great and it's free. It still really great in 2015. I can stream my music to my car radio while I'm driving using a bluetooth connection. The DAAP interface is a lot safer to use while you're driving than google music for example.", "This is the best DAAP player I've found for my phone. Unfortunately, all that means is that, unlike all the other players, it works once in a while, instead of never.", 'This app is one of only a few on the market that works with the DAAP proticall. Its allso nice and small. And runs in the background. Even when browsing the web.', 'I love this app and using daily to access my Daap server. Would like to request a feature to download the song along with id3 tags like album title,artist,,genre and other meta information.', "Running DAAP as a plugin on openmediavault for raspberry pi 3 model B. It's glorious to have your own network attached radio service for social events.", "Been using this app for over a year with mt-daap. Haven't found anything better. Nice app.", 'Simple interface, fast for large libraries,  just work like a charm', 'Impressed with this little app. Works very well with nas4free. Thanks to the Miceli brothers.', 'Just the ticket for playing MP3 media served by firefly from my W7 PC. Worked perfectly on my N5', 'Just what was looking for.', 'Works but UI is teeeeerrrible', 'Simple, lightweight, and works perfectly.', 'I think this app is stupid  💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩', None, "But that's about all I can say at the moment as this app refuses to play about half of my music with no reason given. It plays some music files just fine, even files that need transcoded, but, it loads that now playing info for a lot of files but then just sits there staring.", 'This app is simple to use and does the job.', 'Duplicate song entries', 'Installed Firefly on my Netgear ReadyNAS NV+, put it in the DMZ, installed DAAP on my Android, watched the video, and in 60 seconds I am listening to my home music collection over the ATT 3G network in excellent quality.    This is stupid-simple.  Awesome!!!', 'Technically it works but using large media collections (>40.000 items) is painfully slow. It takes forever to load them, it does not cache data so everything has to be reloaded next time, browsing lists is slow.', "This app combined with my DI.FM app means my android phone has now officially replaced my roku soundbridge.  I might actually buy a second hand HTC desire from ebay and just use that as my media bridge. I gave my soundbridge so much time and effort but the wireless technology they have used is so poor, I just can't handle the connection issues I have experienced over the past 5 years.  The android wireless on the HTC desire is flawless, and time will tell whether this client can maintain the connection to my router and firefly or not, but seems pretty good so far.  I'm a java developer and I'm always amazed that you guys have time to build stuff like this and offer it for free!  Well done and thanks.", "Nice app!  I've been using it with Rhythmbox and I've found a couple of oddities, but since Rhythmbox crashed a couple of times, I don't think is DAAP Media Player fault.", 'I installed Firefly (forked-daap) on my Ubuntu computer, edited the /etc/forked-daap.cfg, and opened port 3869 on my router and boom!  Free unlimited streaming music on my cell network!  Why bother paying for a streaming & storage service?  Would give higher marks for a more robust music player component (fancier playlist options, cache the database by default and only scan for changes on demand, etc) but 4 is still 80%!', 'Works well and fast. Just looks boring.', "Does what it's supposed to do, working great with my Tangerine DAAP server. Scrobbling is nice!   Feature requests: search box, cover art from file, better queue management (add album to queue, for example), better file names when saving files (its daap-number.mp3 now), preferences menu,...   Keep up the great work!", 'My DAAP Server is Rhythmbox running on ubuntu. MP3 format works very well, but when playing the song with OGG format, this player cannot play the entire song, only 90% of the song, and then it will suddenly jump to the next song.', 'I second the other reviews, WTF does this app need to "read phone state and identity" ????  Uninstalled until there\'s suggestion it has been fixed.   Otherwise good app, worked without error with Rhythmbox, would consider paying a dollars for it if permissions are sorted out.', 'Works perfectly with my goflex home. Beats the rubbish seagate access app.', "UI is a little clunky,  but talks to my forked-daap linux server perfectly. Plays flac too : suspect this depends on my device having flac support at the OS level. Try cyanogenmod if yours doesn't", "This seems to work fine on home network (LAN)  but doesn't seem to do 2G/3G. I get a message stating that wifi must be activated", "As another user said, it doesn't work with large collections (for me >70,000).", 'Upgraded to jellybean and now scrolling down my music is just about impossible and the app keeps freezing', 'Works well with mp3. Too bad about ogg format.', 'Files are listed, but not playable.'], 'appId': 'org.mult.daap', 'url': 'https://play.google.com/store/apps/details?id=org.mult.daap&hl=en&gl=us'}
