{'title': 'Screens - Multi Window Manager', 'description': "Screens allows you to quickly enter splitscreen mode with pre selected apps. It creates shortcuts that can be used from any launcher. This might be good for productivity or having SeriesGuide and Kore at the same time.\r\n\r\nThis app uses Accessibility services. Accessibility services are required to enable Multi window automatically, if you don't want to provide this open source app with the permission you will need to manually hold the recents button when prompted.", 'descriptionHTML': 'Screens allows you to quickly enter splitscreen mode with pre selected apps. It creates shortcuts that can be used from any launcher. This might be good for productivity or having SeriesGuide and Kore at the same time.<br><br>This app uses Accessibility services. Accessibility services are required to enable Multi window automatically, if you don&#39;t want to provide this open source app with the permission you will need to manually hold the recents button when prompted.', 'summary': 'Manage split screen sessions', 'summaryHTML': 'Manage split screen sessions', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.145631, 'ratings': 1038, 'reviews': 569, 'histogram': [453, 0, 30, 50, 503], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '36k', 'androidVersion': '7.0', 'androidVersionText': '7.0 and up', 'developer': 'Keep Away From Fire', 'developerId': 'Keep+Away+From+Fire', 'developerEmail': 'googleplay@keepawayfromfire.co.uk', 'developerWebsite': 'https://keepawayfromfire.co.uk', 'developerAddress': '36 Burngreave Street\nSheffield\nSouth Yorkshire\nS3 9DQ', 'privacyPolicy': None, 'developerInternalID': '5201181377964794578', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/bVMVrG6iRYv0ni02eYLQUM-ItRETAKfUqk-7UbHV8HfdsL5yXrJgTKgSmfI-gdAH6GE', 'headerImage': 'https://lh3.googleusercontent.com/nRDgtQ1bl6t09V0NTqp5OYAr_vwyXhqKP-4-97aqSCBwqIlKmKHqxhqdSxjqME28RA', 'screenshots': ['https://lh3.googleusercontent.com/_ZU8Qlcg_Sa2mqzDMtuFm9Y3RTJC6Ohsih-dvnXpuG9hD3Uj35H5_PcS9ItZhCMNtEw', 'https://lh3.googleusercontent.com/71OYOpVLrjIEojGz6Wmaq9jyyei7iohsVYhueAV6dRcG0AVomzRZTlkqLDzuTDL0NVk', 'https://lh3.googleusercontent.com/Lad7IeItfoTMmQGGkm-eiXykVTnRiWlU6-KonLi_ly2A1Cs6SizB_QqNRaR645DjKbk', 'https://lh3.googleusercontent.com/kod6KedH1qwn0RBDG1ZKviKOOcf2_NUt4rUrZnaFo_6sl8KEc20ZZ0aXT3uK8Ct59QY'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 24, 2016', 'updated': 1510605448, 'version': '6.0.1', 'recentChanges': 'Testing: Android 8 support\r\n\r\nAdded an adaptive Icon and now uses a dark theme', 'recentChangesHTML': 'Testing: Android 8 support<br><br>Added an adaptive Icon and now uses a dark theme', 'comments': ['Does not create a home screen shortcut, not even in the app list. Needs update. Android 8.0.0', "It didn't work as in I started it, choose two apps, pressed the button to create and it didn't show up on the home or anywhere else. Please work on it", "App shortcut is created in app menu, not on home screen. Luckily you can then drag to home screen. :) Was disappointed that the shortcut was not created, but apparently I was looking in the wrong place. It works perfectly, now. I can open Waze and Flitsmeister in one click for driving, it's great!", 'Well. it works but shortcuts are hard to find.', 'Look , I have a good, new, perfectly working phone and I really want to download this game. But sadly It is not optimized for my device WHEN on the pictures to show what it does it uses the same device I used i-', "I can only create the two apps I want to open with a dual screen which is step one. But then it fails to do step two and actually open the two apps and I have activated my accessibility settings to allow the service but still it won't proceed. It won't work for me.", 'Great app if you need to auto open two apps with tasker. Just wish there was a way to open one app using 1/3 of the screen and the other app 2/3. Some kind of ability to control how big each app is on load of screens would make this 6/5 stars for me.', 'Clicked create shortcut after adding 2 apps, no shortcut appears either in home screen and app screen.', "App wasn't able to create home screen shortcuts but it works great as a Tasker plugin.. Create a task under Tasker and then use a Tasker Widget to add a shortcut to your homescreen. Just something to keep in mind before giving it a bad review.", 'Shame that this stopped creating shortcuts when I updated on Android 8/Oreo. Worked well with Nougat and the paired apps made at that time are still working. Too bad I might need to hard reset, wiping all of them away as well.', 'I installed the app and it was saying "app doesn\'t support split screen" and that\'s after I enabled it in my services menu. What a waste of time.', 'These screens app is having a problem while opening 2 apps. Its like when I crop the size it still stick the way it did while using other apps', 'Used to work well but now cant create a split screen. Crashes', 'I\'m using Android 8.0 and i know its new for this update and i\'m going to say that i create a shortcut (Chrome & Youtube) and i named it "I" and it didn\'t create the shortcut that i wanted, even tho i already turned on my Screen accessibility.', 'Does not create the shortcut when i tap create shortcut.The app is meant to create the shortcut but its does not.Trash.', "This app is amazing. I can't praise it enough. No ads. Works perfectly. One of the best apps I've ever used.", 'Doesnt work on Android v9, Tab S4. Shortcuts cannot be found...', "The app doesn't do what it's supposed to. no shortcuts are added either to the home screen or anywhere else. disappointment.", 'It is what i want. Automatic split screen for 2 app', 'new Samsung update took it off. found this one and work perfect for what I used mine.', "waste of time. doesn't work. shortcuts are nowhere on homescreen", "Doesn't work. It's didn't add shortcut in my home screen :(", 'It doesnt work why it seems to not support vivo V5s', 'Not working on redmi note 8 pro', 'App not working in my Android phone, fake app', 'Not working with note 9 . Best wishes', "Doesn't Work on Pixel", "doesn't work at all. great idea.. too bad", 'its not working on my oppo A5', 'Not good. Fake this.', 'keep crashing.. hate it', 'Good but doesnt work for Vivo v7+', 'i try to stretch c ops but it wont open.', 'Never craete a shortcut. Waste of time', 'Not working in MI 5 pro', 'Screens multi is the Bast app', 'I created shortcuts but nothing happened', 'no shortcut added.bad app', "fake app , they does'nt work.", 'Do not add anything. Android 8'], 'appId': 'uk.co.keepawayfromfire.screens', 'url': 'https://play.google.com/store/apps/details?id=uk.co.keepawayfromfire.screens&hl=en&gl=us'}
