{'title': 'Clementine Remote', 'description': 'Clementine Remote lets you remotely control the music player "Clementine".\r\n\r\nIMPORTANT:\r\nYou need at least Clementine 1.3 to use this remote!\r\n\r\nWith this application you can control the music player "Clementine" while you are sitting on your couch eating potato chips.\r\nYou have access to your library, playlists, read the lyrics while listening to your favourite song, enjoy the cover art, ...\r\n\r\nIf you receive a call or want to make one, you don\'t have pause the current track, Clementine Remote lowers the volume for you!\r\n\r\nYou want to hear the current track or album while you are on the go? No problem, download them with one click to your phone! No need to plug in a USB cable, it works via wifi! You can even download whole playlists!\r\n\r\nAll Features:\r\n* Control player\r\n* Download songs from Clementine to your phone\r\n* Browse your library\r\n* Displays the cover art\r\n* Read the lyrics\r\n* Rate, Love and ban tracks\r\n* Change the volume\r\n* Volume lowers when you receive a call\r\n* Shuffle / Repeat playback\r\n* Playlist selection\r\n* Lockscreen Controls\r\n* Clementine Network Discovery: You don\'t have to enter the ip, Clementine Remote finds Clementine Players itself in the network!\r\n\r\nINSTALLATION DETAILS:\r\nDownload Clementine 1.3 from here: http://www.clementine-player.org/downloads\r\n* The remote control is disabled by default. You have to activate it in the settings. *\r\n* Downloads are disabled by default. You have to activate it in the setting, too *\r\n\r\n\r\nThis application is licensed under the GNU GPLv3.\r\n\r\nIf you have questions, suggestions etc. please write an e-mail.\r\n\r\nHelp: https://github.com/clementine-player/Android-Remote/wiki\r\n\r\nPERMISSIONS:\r\nandroid.permission.ACCESS_NETWORK_STATE: Check if you are connected to a wifi network.\r\nandroid.permission.ACCESS_WIFI_STATE: Get your current ip address.\r\nandroid.permission.CHANGE_WIFI_MULTICAST_STATE: Is needed for Clementine Network Discovery.\r\nandroid.permission.INTERNET: To connect to Clementine.\r\nandroid.permission.WAKE_LOCK: The device is in partial wake mode when connect to increase stability.\r\nandroid.permission.READ_PHONE_STATE: Is needed to detect calls and lower Clementine volume.\r\nandroid.permission.WRITE_EXTERNAL_STORAGE: For downloading songs.\r\ncom.android.vending.BILLING: Is needed for doing donations.', 'descriptionHTML': 'Clementine Remote lets you remotely control the music player &quot;Clementine&quot;.<br><br>IMPORTANT:<br>You need at least Clementine 1.3 to use this remote!<br><br>With this application you can control the music player &quot;Clementine&quot; while you are sitting on your couch eating potato chips.<br>You have access to your library, playlists, read the lyrics while listening to your favourite song, enjoy the cover art, ...<br><br>If you receive a call or want to make one, you don&#39;t have pause the current track, Clementine Remote lowers the volume for you!<br><br>You want to hear the current track or album while you are on the go? No problem, download them with one click to your phone! No need to plug in a USB cable, it works via wifi! You can even download whole playlists!<br><br>All Features:<br>* Control player<br>* Download songs from Clementine to your phone<br>* Browse your library<br>* Displays the cover art<br>* Read the lyrics<br>* Rate, Love and ban tracks<br>* Change the volume<br>* Volume lowers when you receive a call<br>* Shuffle / Repeat playback<br>* Playlist selection<br>* Lockscreen Controls<br>* Clementine Network Discovery: You don&#39;t have to enter the ip, Clementine Remote finds Clementine Players itself in the network!<br><br>INSTALLATION DETAILS:<br>Download Clementine 1.3 from here: http://www.clementine-player.org/downloads<br>* The remote control is disabled by default. You have to activate it in the settings. *<br>* Downloads are disabled by default. You have to activate it in the setting, too *<br><br><br>This application is licensed under the GNU GPLv3.<br><br>If you have questions, suggestions etc. please write an e-mail.<br><br>Help: https://github.com/clementine-player/Android-Remote/wiki<br><br>PERMISSIONS:<br>android.permission.ACCESS_NETWORK_STATE: Check if you are connected to a wifi network.<br>android.permission.ACCESS_WIFI_STATE: Get your current ip address.<br>android.permission.CHANGE_WIFI_MULTICAST_STATE: Is needed for Clementine Network Discovery.<br>android.permission.INTERNET: To connect to Clementine.<br>android.permission.WAKE_LOCK: The device is in partial wake mode when connect to increase stability.<br>android.permission.READ_PHONE_STATE: Is needed to detect calls and lower Clementine volume.<br>android.permission.WRITE_EXTERNAL_STORAGE: For downloading songs.<br>com.android.vending.BILLING: Is needed for doing donations.', 'summary': 'Control the music player Clementine remotely with Clementine Remote!', 'summaryHTML': 'Control the music player Clementine remotely with Clementine Remote!', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.0062895, 'ratings': 3230, 'reviews': 1111, 'histogram': [497, 121, 172, 507, 1929], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'AMU', 'developerId': 'AMU', 'developerEmail': 'andreas.muttscheller@gmail.com', 'developerWebsite': 'https://github.com/clementine-player/Android-Remote', 'developerAddress': 'Auf der Kümm 9\nRhens, 56321\nGermany', 'privacyPolicy': 'https://clementine-player.org/en/privacy', 'developerInternalID': '7759839622386144118', 'genre': 'Music & Audio', 'genreId': 'MUSIC_AND_AUDIO', 'icon': 'https://lh3.googleusercontent.com/8P0MAg8xeKY_JOIG_rBoQwb0QryDJGcg1u2bGaTlywJ9zOnfRD0uem8uRYF7Rh5upLE', 'headerImage': 'https://lh3.googleusercontent.com/3u004JWEzci4qcOO0BEmvxfQHDTvl9v-fhRZibpUhyrtqyHB8-SoFsocavJDaf-2ydI', 'screenshots': ['https://lh3.googleusercontent.com/MBuB7PL94gT9G2BjbyNzUPtcktKQtAJeM-jiXhoLXvlzYMH8GmXOvlOdAfmrg3ebBtvq', 'https://lh3.googleusercontent.com/lvutxBk9MJiYja6Gjk2EantyQzdFlwD1argU6Qh6Alf0PsgXWzyC5dJXOHaLDpp-Nys', 'https://lh3.googleusercontent.com/y__6MttH-E8upf82yaBoizkW2yoOiRFycOuE-KdRv6nHCRKAp8RcHCbHsLJHfbjxOg', 'https://lh3.googleusercontent.com/ximgRMmFwkQGeaWdPDw0G5D2PGh-K6aJdpSYSFJfhkT2bz4plzyH2RSt7FXEEBuSWuY1', 'https://lh3.googleusercontent.com/-lLY0qihSx7xh81Ig2ZyikDCEwD-yyUC8nPAAhVPaZScK1NonB3erxixf1p9jiuK6g', 'https://lh3.googleusercontent.com/m_LY_1ztDaxOtoWR-VNNSHH7V-L4opQ5pxCtgWPL7uKg0YFkwnoguSUnFtsl9ob4Iw', 'https://lh3.googleusercontent.com/COYLssdRB81mBkYj5J3GMzKe31Hb3csy5XkMF7pa4mrLTpC11ahsSEKQDLyt2pp2N1U', 'https://lh3.googleusercontent.com/IRznztn5NowPeirSk-TEbrYp1zAJix8ucO47Ke4RLTVzf4naMX5lbAMreaS0_iMkVGE'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 22, 2013', 'updated': 1577967783, 'version': 'Varies with device', 'recentChanges': 'V11.1 release:\r\n  Improvements:\r\n   - Adding the ability to use different colors of the notification (Thanks @SemperPeritus)\r\n  Bugfixes:\r\n   - Fix Android N connection problem\r\n   - Show auth code dialog when Clementine returns a Not_Authenticated disconnect message\r\n\r\nFeatures:\r\n- Complete design overhaul, using Material Design\r\n- Add global search\r\n- rtl language support\r\n\r\nComplete changelog: https://github.com/clementine-player/Android-Remote/blob/master/CHANGELOG', 'recentChangesHTML': 'V11.1 release:<br>  Improvements:<br>   - Adding the ability to use different colors of the notification (Thanks @SemperPeritus)<br>  Bugfixes:<br>   - Fix Android N connection problem<br>   - Show auth code dialog when Clementine returns a Not_Authenticated disconnect message<br><br>Features:<br>- Complete design overhaul, using Material Design<br>- Add global search<br>- rtl language support<br><br>Complete changelog: https://github.com/clementine-player/Android-Remote/blob/master/CHANGELOG', 'comments': ["I've used it for maybe 2 hours, and it's crashed 2 or 3 times. Don't you people test this thing at all?", 'Frequently connection errors', "Works great, does what it says. You won yourself a coffee. Will rate 5 stars when it can be used via phone with WiFi on computer connected with cable. It doesn't seem to work neither in Windows 10 or Ubuntu 18.04. It works only if both devices are on the same WiFi network. Edit: it works on Ubuntu 20.04 via cable and Android with WiFi.", 'My clementine host seems to only listen to ipv6, and the remote is trying to access ipv4. Not newbie friendly, had to "socat TCP4-LISTEN:5500 TCP6:localhost:5500"', 'Wow works like a charm!! Just no forget to enable Network Remote on Clementine Desktop application. And again very good work!!!', "Excellent This app is simple and to the point, lets me control my music without having to go to my computer. The one thing that would make it 5 stars is the ability to have more than 1 computer linked to it so I don't have to change the ip when I am using it in different locations - maybe with nickname capability like Office and Livingroom.", 'Amazing addition to an already great music player! Five stars because it just works. One minor issue that I do have is the time/audio slider visuals (The little clementine that indicates where it is at) has some visual glitches on a Galaxy J7 2017 EU running Android 7.0; not enough of an issue to stop me from using it ;)', "Great app. Works well with pc. It allows you download the music to your phone to play but won't let you play existing music on your phone. That's sad. Having that feature with the download feature would enable me to sync my LAN/NAS music with my phone so I'd have music anywhere, with or without internet.", 'This is a great app no doubt, I am enjoying it very much. The developers should be looking into adding the FILES functionality similar to the one on the desktop, that would sincerely make this app unmatched. Kudos developers, this is a great app.', "Great app. But i have question about sorting of tracks in playlist: is it possible to do it somehow using this app? I've seen it is possible on desktop player. Moreover, if i change sort of tracks, then android app doesn't update its view and doesn't show status of moved tracks (when desktop player plays it, android app doesn't show it :) ).", 'Not working. My Linux Clementine player version is 1.4.0rc1-172-gb007e54b3.', 'The app keeps crashing. I tried installing and reinstalling a few times but if anything my experience got worse. I managed to connect once but the app failed afterwards. I would like to see this work. However for now, i cannot get this to work. Hopefully some update fixes the issue of consistent crashing.', "Works well for what it's designed for. It's possible to control the volume, go forward & backward and shuffle in playlist, search for songs, etc.", 'Great app!!! Best choice for Linux users. Sugestions: Adjust song sort in library/playlist when track number does not exists and add grouping by Genre/Artist (All)/Album. Thx!!!', "No longer working with my Linux Debian machine which is using the latest stable version of Debian. I've tried connecting using my Nexus 5X and my Pixel 3 phones. This app needs an update.", 'it does what i need and is good. but it needs to be updated because it doesnt work with locked screen. A simple lockscreen player would be really appreciated.', "works really well. We've used it as laptop remote controll for our wedding party", 'please create matching or dark theme for both player and remote', 'The Linux client does not install on Ubuntu 18.04', 'Really useful . Poor instructions', 'Worked like once or twice and never did again.', 'thank you for your app, its nice but I should like to see black theme :(', 'crashes upon opening.', "It just doesn't connect.", "OMG Add multiple devices ... home and work and we'll both pretend this is a 6 rating 😛", "Useful EVEN for my Quirky Linux box, which is pretty rare in this proprio-owned-OS based society. Just for working with Quirky Linux I love it. I've not given it a full test but volume, playlist and library are good. My screen is off & I can control my musid & audiobooks. Happy me..", 'Nice but the library doesn\'t update... I add songs to the Clementine library but they are not visible in the remote. You should implement an "update library" function. Update: the library updates when swiping down in the library screen, not automatically... and there is no menu option to achieve the same... Not very user friendly!', "Alright, let me put it as follows. The app itself is perfect the \nfunctionality is neat and the download function is utterly perfect. \nHowever, there are a lot of glitches. And I can deal with glitches when \nthey're consistent but the worst part is that it seems to be a completely \ndifferent glitch every time I use it Besides that it's an absolutely killer \napp however", "Sometimes is a mess, and sometimes works flawlessly. But now is telling me what I need the 1.3 v on my system and I already have the latest version available. So I'm pretty angry now.", 'I recently tried to download over songs from my music library from my PC to my phone using this app. The copy process was very unreliable. Many songs did not copy and there was no alert or error. Several times the app crashed when pushed to the background so I had to keep the app awake while copying but even then many songs did not copy. Can the dev team fix this?', "It's just a remote so it doesn't do that much, but what it does it does well. Especially downloading your music effortlessly is a great bonus (EDIT: doesn't work on my new phone though). Now if only Clementine itself was available to play said music...", "Great potential if it would stop restarting my mobile. Yes, it reboots my \nmobie every random number of tracks, averaging about 10 tracks. I only \ninstalled this app this evening and the rebooting issue started within ten \nminutes. First the app freezes, then my mobile reboots. I would love to \ngive this app 5 stars as it is a great app and is very useful when it isn't \nrebooting. It's fast, doesn't drain the battery too bad, so I hope this \nissue can be fixed, as such, is there a built in error reporting method \nwith a built-in log? For ref I am using it on a Sony Z3 going via WiFi to \nrouter, that then goes via hardwired LAN to my laptop, I then listen to the \nmusic playing on laptop via Bluetooth headset which at 4am stops the \nneighbours complaining.", "Honestly, as a cross-platform remote to my favorite music/Playlist organizer, this app is 5/5 easy. If it downloads over Lan it's a bonus to me, but I mainly value the remote over wifi (or VPN technically).", 'Works as it should, only issue is it forgets downloaded songs, even the files exists, please fix.', "Absolutely brilliant idea therefore a brilliant app. Easy to use, just like the windows player. 5 stars would come from the widget working. Otherwise it's mint!", 'Nice. But please add offline mode where you can listen when app on pc not started (full sync with app when online mode: delete tracks which I deleted from pc and download which I download). Please add it, or make another one android app for this.', 'This remote does only one thing, and does it exceptionally well. I hope zeroconf address support could be added in the future.', "Works well with my Antergos box, but would like of I got a real music player instead of this remote. I love Clementine on my PC and would love to see it's great features be ported to Android.", 'Unable to connect fo who-knows-why. Think maybe you could allow both \napplications to talk to each other and set themselves up?', 'Really loved this app. One of the most useful apps for me.'], 'appId': 'de.qspool.clementineremote', 'url': 'https://play.google.com/store/apps/details?id=de.qspool.clementineremote&hl=en&gl=us'}
