{'title': 'Smite Team Generator', 'description': "Do you play Smite? Do you get bored playing the same god over and over again? Do you ever find it difficult to choose a new god\r\nto play? Do you want to have a lot more fun when playing in parties? If you answered 'yes' to any of these questions, this is\r\nthe app for you!\r\n\r\nFeatures:\r\n- Generates a random team of 1 to 5 players\r\n- Generates a random build for each teammate\r\n- Control the random generator with various options\r\n- Share the full team or an individual player\r\n- More features coming soon\r\n\r\nYou can follow me on Twitter for app development updates: @Baconator_NoVeg\r\n\r\nLike many people, I am against ads. I have no intention of ever putting third-party advertisements in any of my apps, so if you like this app and would like to support me with a donation, you can find a donation button on the main screen of the app. Any size donation is greatly appreciated, thank you.\r\n\r\nDisclaimer: I am not affiliated with Hi-Rez in any way.", 'descriptionHTML': 'Do you play Smite? Do you get bored playing the same god over and over again? Do you ever find it difficult to choose a new god<br>to play? Do you want to have a lot more fun when playing in parties? If you answered &#39;yes&#39; to any of these questions, this is<br>the app for you!<br><br>Features:<br>- Generates a random team of 1 to 5 players<br>- Generates a random build for each teammate<br>- Control the random generator with various options<br>- Share the full team or an individual player<br>- More features coming soon<br><br>You can follow me on Twitter for app development updates: @Baconator_NoVeg<br><br>Like many people, I am against ads. I have no intention of ever putting third-party advertisements in any of my apps, so if you like this app and would like to support me with a donation, you can find a donation button on the main screen of the app. Any size donation is greatly appreciated, thank you.<br><br>Disclaimer: I am not affiliated with Hi-Rez in any way.', 'summary': 'Generates a random team with random builds for Smite', 'summaryHTML': 'Generates a random team with random builds for Smite', 'installs': '1,000+', 'minInstalls': 1000, 'score': 4.352941, 'ratings': 17, 'reviews': 9, 'histogram': [2, 0, 1, 1, 13], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.1M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Joshua Luce', 'developerId': 'Joshua+Luce', 'developerEmail': 'joshuabluce@gmail.com', 'developerWebsite': 'https://github.com/Codazed/SmiteTeamGenerator', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5771971010275435490', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/hxDeLOC6skv5bpBh5t3Zlfpf0AAK7Bh1IICEr_EIbx2tOCpEtpuJCFa9tATO0Kn5ew', 'headerImage': 'https://lh3.googleusercontent.com/dyVfOVcuYAFMeHt-tk4SxhmErZTnWhbf_BBxidHh6zGSU9ZudZB7326gBeQOwjlKiw', 'screenshots': ['https://lh3.googleusercontent.com/NiiKbqR_zksJ7-JbSh68u9pfTy9AjDfs8LR0LcBbgymMsCP3MZ4n0nS1O1yfgMKBHQ', 'https://lh3.googleusercontent.com/wGCJI0y8kQ6i7RPFC5-lUdvd69G2A3Yb-_zTa52esQ5KyoFHwOHu4mEyu-ata_oXjjUU', 'https://lh3.googleusercontent.com/tMe5HpBi1fIcuz5EI33Ha1DxtwWbzZy3jtBuYAsvhzn98n1Y_-ML9tJ6dF-VQBpUJaw', 'https://lh3.googleusercontent.com/DBCMi1sfguLDMfG_D7O1liiIJiTPh7F7uafyR2yVtrr5z8H7myGVGvo7DrptZWe4c9gY'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'May 18, 2018', 'updated': 1576986118, 'version': '1.10.10', 'recentChanges': '- Updated STG-Lib to 1.7.0\r\n- Updated dependencies\r\n- Modified loading screen\r\n- Switched issue reporting link to GitLab\r\n- Other minor changes and fixes', 'recentChangesHTML': '- Updated STG-Lib to 1.7.0<br>- Updated dependencies<br>- Modified loading screen<br>- Switched issue reporting link to GitLab<br>- Other minor changes and fixes', 'comments': ["This is really cool man. Glad you added Joust and not just Conquest because that's all I play. My cousin and I are always trying to come up with new team comps to play joust ranked and this is just perfect. Ability combos between the random Gods would probably be difficult to get right but would be very cool. My only other suggestion would be to change the app icon to a Smite picture. I almost didnt install it for that reason. I had to read some reviews first. would make it look more legit imo.", "It was so much fun to get a group of my friends together and play random quirky comps that challenged our flexibility while giving us entertainment. As a guardian main I found myself playing supports with characters I'd never thought of before so thank-you. Keep up the good work 👌", "The app is nice and simple and several of the builds synergize well with me (I've tried them). It'd be nice if you could give it a dark (or light) theme and maybe add the base stats and the stats after the build is applied to the God. Pictures would also be nice. Also the item info would be nice as well as a manual team/item builder. I apologize for the inconvenience if this is too long to read, but I believe that you have a good idea started up. It has A LOT of potential.", 'Pretty decent app, except there are no masks or defense items that can be used across the board (Breastplate of Valor, Genjis Guard, etc.) If they can be put in the mix that would be sick. I want the possibility of having to a full tank hunter or something weird like that.', 'Flux from DevRant here! Good app, I would change UI design just so it looks better. Personally not Smite player but I get the point :D', 'Great simple app. Good if your having one of those days of "who the heck should I play"', "the app I didn't know I needed, good stuff", "Best app I've had in a while. Simple yet working. Stays updated."], 'appId': 'com.baconatornoveg.stg', 'url': 'https://play.google.com/store/apps/details?id=com.baconatornoveg.stg&hl=en&gl=us'}
