{'title': 'LabCoat for GitLab', 'description': 'With LabCoat, you can manage projects, create issues, and even accept merge requests all from your device. We <3 GitLab and wanted to create a fully featured app, native to Android. With LabCoat, you can:\r\n\r\n- View commits.\r\n- View, edit & close issues.\r\n- Comment on issues and merge requests.\r\n- Browse & view files.\r\n- Manage groups and project members.\r\n...and much more!\r\n\r\nLabCoat is open source!\r\nIf you want to contribute, head over to:\r\nhttps://gitlab.com/Commit451/LabCoat\r\n\r\nMerge requests are greatly welcome.\r\n\r\nPlease report issues and give us feedback here:\r\nhttps://gitlab.com/Commit451/LabCoat/issues', 'descriptionHTML': 'With LabCoat, you can manage projects, create issues, and even accept merge requests all from your device. We &lt;3 GitLab and wanted to create a fully featured app, native to Android. With LabCoat, you can:<br><br>- View commits.<br>- View, edit &amp; close issues.<br>- Comment on issues and merge requests.<br>- Browse &amp; view files.<br>- Manage groups and project members.<br>...and much more!<br><br>LabCoat is open source!<br>If you want to contribute, head over to:<br>https://gitlab.com/Commit451/LabCoat<br><br>Merge requests are greatly welcome.<br><br>Please report issues and give us feedback here:<br>https://gitlab.com/Commit451/LabCoat/issues', 'summary': 'Manage your GitLab projects on the go!', 'summaryHTML': 'Manage your GitLab projects on the go!', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.8347108, 'ratings': 1256, 'reviews': 535, 'histogram': [186, 62, 134, 259, 612], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '5.6M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Commit 451', 'developerId': '8992288925330781810', 'developerEmail': 'commit451@gmail.com', 'developerWebsite': None, 'developerAddress': '720 S Fairbanks Ave.\nDenison, TX, 75020', 'privacyPolicy': None, 'developerInternalID': '8992288925330781810', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/kI_H1o6q1ug7YcsD6B0BPkq0DUxdLYTOAEvny7wRE4fEPa130rFlzZS-6viGBumzhw', 'headerImage': 'https://lh3.googleusercontent.com/d54NhpRne7-D13mo9BACXT6sqenfS907WG41OqHc5CndnePF1Qg8yiH3_YOsN2kf4VU', 'screenshots': ['https://lh3.googleusercontent.com/LplgqkTIdlaX9k9PBuTsAWP56hJCwPtLbdWZyz4dpcwKyNJTr_TqtLDc7EA7-EO1Ed2I', 'https://lh3.googleusercontent.com/HOd0FcmriFvD18AqrSbt9s7hbCaILU1pyRwk2HODY3fAr95ZtmYPbdtna7Cyn1H5sqQ', 'https://lh3.googleusercontent.com/bGMFQyGG0xrEnJGU99jKGSTc3a7M3UzE7_KIhySADGmCTsIm7wWD0ezRBMpmyvsb0TY', 'https://lh3.googleusercontent.com/iAk153VqOkWfwJyXuWhqc0G2RWsOYKjuBo9evbSyX6eYXmrG4gUON1AC7SLb9fs6wQ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 14, 2015', 'updated': 1590739793, 'version': '2.7.4', 'recentChanges': 'Fix bug with adding a new user', 'recentChangesHTML': 'Fix bug with adding a new user', 'comments': ['The app does not work. I create a personal token in Gitlab, copy paste it in labcoat and the login fails though the URL is correct', 'Same token issue as everybody mentioned.', 'Lot of features, but buggy', "Works great, I have my own server we use for the company I work at and connected just fine I can see all my repos, todos what ever all works great. So if you're having an issue you probably did something wrong 😋", "Simply it doesn't work. I have a gitlab self-server and I've made an access token. But I can not login through LabCoat. The annoying part is that no error message appear on screen. \U0001f92f The project idea looks great but please solve the problems. Error message is a must for an application.", 'Great app. You should note that it handles multiple accounts in the app description too!', 'Not being able to log in. I have done the token protocol but keeps showing me an error...', 'I have just started with GitLab, but this app is really useful. I can browse the commits, files, comment on issues, even quick actions are working', 'Unfortunately no filtering of archived projects in general view.', 'Error login (android pie).', "This app is good at what it does-- providing a decent interface for catching up on updates with repos when on the go. It's not the most powerful work environment, but it's a mobile app-- what else could you expect?  A better and easier way of setting up authentication would be greatly appreciated, though. I wasn't expecting to have to set up a personal access token, but I understand why I have to, and it's not that big of a deal.", "A nice app, but it requires (does not ask, so you waste some time experimenting) an admin token when it seems to only expose read-only functionality to your account. A rather annoying limitation is that the files listing is capped and you can very easily find yourself unable to look at some files as they are unreachable in the UI (maybe the GitLab API for this uses paging and the app does not follow any 'next page' refeeences?).", 'keep getting failed to load', 'i think advanced features are optional for apps like these, this this get the job done', "Seeing all the completely unnecessary one star reviews for technical bugs, I just had to rate this app. It does what it's supposed to, namely providing me a convenient access to GitLab via phone, and it does so very well. I would recommend this app for anyone wanting to use GitLab while not being on the computer.", 'Forcing me to use personal access token? Utter garbage! What a tunnel vision way to do things. Long-time user here, but finally just totally fed up. Uninstalling, and downloading a much more flexible alternative. Good bye! Got a response from the dev, not acceptable, sorry. Hint: look up Glastnost. it does s better job in this case.', "Works good for me. My school uses GitLab for our projects and when I'm at work and need to do some small tweaks to my project settings this app so much better than trying to view GitLab on my phone.", "please add the ability to upload a zip file with my messages. also it doesn't appear to have the feature to filter the issues that I have raised personally. thank you for the application.", "Great interface, and really useful! Just a thing, when watching the logs a Pipeline job, I can't see the shell, I get an unrendered HTML of a Gitlab login (I think). Other than that, great app!", 'Logs and markdown dont print to screen in a coherent manner thats useful, and in fact logs are completely unreadable. Most management tasks regarding permissions or merge requests are impossible or too cumbersome to perform.', 'The app functionality is good. Feature: Added support for notifications on issues/milestone deadlines would be needed. Fix: The log of failed pipelines is not shown formatted.', "Excellent app, I have used it happily for years. Thank you dev! But can we please have a light theme? + Repo images haven't been showing for about a year or so.", "I just had to rate this. It's simple, does almost everything you might need of such an app.", '"failed to load" message on any issue I tried to open. Can\'t browse issues other than per project. Really really limited, I\'d rather just use gitlab\'s website on my phone and do everything there.', "it's fine. i think I'd use it a lot more if i could view the wikis for each repo and also filter issues a bit better, eg by due date.", 'Managing issues is my main case to use this app. I cant filter or sort em. Cant view board. This is the most app that i would like to use, so grow your power please', 'not able to see pipeline or job logs. it shows html code of login page of my server. Update: still not fixed', 'Very nice application however cannot see job logs unfortunately. Instead - html code, Could you please fix that?', 'The software broke recently and I can\'t view many files in a repository I own. I get "failed to load file" with no justification.', 'Cloning/pulling/syncing files into phone would be a nice feature. Also, this app needs offline support.', "Overall it's great just please improve the markdown rendering. None of my back-ticks are color rendered, e.g. `np.nan`", 'I could not even login. May be I did something wrong, but if it is true, then instruction should be written more clearly.', "Nice GitLab client, unfortunately Glasnost' lack of Markdown rendering/editing support and no soft wrap make it useless to me.", 'Great application! Small bug in pipeline jobs - the log does not works and return a html buffer', "When I try to login the app simply crashes. Please get this fixed and then I'll change my rating", 'really great user experience! ❤️ makes using gitlab and commenting on issues a breeze. big shout-out to the makers', 'it doesnt work there is erroe everytime i try to log in use jsonreader.setlenient(true) to accept malformed json at path $', 'beautiful app. perfect for checking my repo updates and reviewing code push on the fly', "Almost no markdown render except simplest things. Man, just open in mobile browser your gitlab project and don't bum your head", 'This is a great way to handle Gitlab repositories.'], 'appId': 'com.commit451.gitlab', 'url': 'https://play.google.com/store/apps/details?id=com.commit451.gitlab&hl=en&gl=us'}
