{'title': 'Google I/O 2019', 'description': "The official Google I/O 2019 conference app is your co-pilot to navigate the conference, whether you're attending in-person or remotely. With the app, you can:\r\n\r\n• Explore the conference schedule, with details on topics and speakers\r\n• Save events to Schedule, your personalized schedule\r\n• Get reminders before events you've saved in Schedule start\r\n• Sync your custom schedule between all of your devices and the I/O website\r\n• Guide yourself using the vector-based conference map\r\n• Opt-in to receive important notifications about the event, schedule, travel, after hours, session recordings and more\r\n\r\nExclusive for onsite attendees:\r\n• Take advantage of facilitated pre-event WiFi configuration\r\n• Reserve seats for events ahead of schedule\r\n\r\nSource code for the app will be available soon after I/O.", 'descriptionHTML': 'The official Google I/O 2019 conference app is your co-pilot to navigate the conference, whether you&#39;re attending in-person or remotely. With the app, you can:<br><br>• Explore the conference schedule, with details on topics and speakers<br>• Save events to Schedule, your personalized schedule<br>• Get reminders before events you&#39;ve saved in Schedule start<br>• Sync your custom schedule between all of your devices and the I/O website<br>• Guide yourself using the vector-based conference map<br>• Opt-in to receive important notifications about the event, schedule, travel, after hours, session recordings and more<br><br>Exclusive for onsite attendees:<br>• Take advantage of facilitated pre-event WiFi configuration<br>• Reserve seats for events ahead of schedule<br><br>Source code for the app will be available soon after I/O.', 'summary': 'Your co-pilot to navigate I/O, whether you’re attending in-person or remotely.', 'summaryHTML': 'Your co-pilot to navigate I/O, whether you’re attending in-person or remotely.', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 4.3546953, 'ratings': 22870, 'reviews': 1857, 'histogram': [1862, 651, 1404, 2544, 16406], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '4.8M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Google LLC', 'developerId': '5700313618786177705', 'developerEmail': 'io17@google.com', 'developerWebsite': 'http://www.google.com/io', 'developerAddress': '1600 Amphitheatre Parkway, Mountain View 94043', 'privacyPolicy': 'http://www.google.com/policies/privacy', 'developerInternalID': '5700313618786177705', 'genre': 'Books & Reference', 'genreId': 'BOOKS_AND_REFERENCE', 'icon': 'https://lh3.googleusercontent.com/JqxLmzV-ETe1HbrKHw970E16_r4PUMipwoEAXYIPIB3LAv0GF-Ynlx88q8ouRPo1rjc', 'headerImage': 'https://lh3.googleusercontent.com/Wk--Mz8MCYAo6vYrIw7g3H0mtKAokqDmWWCjcyDTGbmke7B7qX8EOpBq_64iSbchdFU', 'screenshots': ['https://lh3.googleusercontent.com/XTw0EP5xL2CF6rSnDPn5zcH9aTOzsmFX7_q7KT65RCsg8LBRSwN6wCRgamGP1FEP_r0', 'https://lh3.googleusercontent.com/Ogx-xVZKoQyzeFZxlrK1T0AtnG1vFnDt3W63A5X_NOo3vr_4HbwF7HOPaaHAkmdb1A', 'https://lh3.googleusercontent.com/NwzFrlEKQ4xXJHhAsFOEFGsC3xlGcGmt1L79Ck6eDM_iazuCmQyzFZ5SJzFRf12oCQ', 'https://lh3.googleusercontent.com/Jm9YxN2i0z6SFIS2tome2DPdtd0R0npUwa116J-M3dWQByAH-3RyF_Qs_hEtpvyaEfg', 'https://lh3.googleusercontent.com/TMGfQ_M3Ik3PR45XURpoutHRgfNQJJGOs0edhSzanzGVz4PPRALkdKaZymLfx2osZaA', 'https://lh3.googleusercontent.com/a_n1pwFDAvYZAexGGSeeUfmnSC1Zqb_7bxcOcW7LUVNhyKyx5-6yfgiH_4s3CU-rrSg', 'https://lh3.googleusercontent.com/Ku64xj9ITuIxguPMalkhkTUnWjvEQuoJG7q7XBYMuLXSsk0CZJS1KA0Oy1kAyV_gEXU', 'https://lh3.googleusercontent.com/2GBuiZfKhLdFE8IpO2nr9Uep0djJB44o9LLakkgMjNeyVgou2sBxJ98-5uBry8TpFw', 'https://lh3.googleusercontent.com/GTpWZaV33OlK7klHgBag4Ob09rDKR1Z6G6eOQQ7tYiH328xNWlf30wjlQ0fkcXQHUDA', 'https://lh3.googleusercontent.com/iC2OLzQvCzhtL3eb-hcKLnONWlimaIzlOrAbHLrs0O4bXMM715YHgfa0zrHb-7XgsrU'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 11, 2014', 'updated': 1557334139, 'version': '7.0.14', 'recentChanges': 'Updated for Google I/O 2019\r\n• Add events to your personal calendar\r\n• Explore I/O in Augmented Reality (onsite attendees only)\r\n• Use the home page to view upcoming sessions, announcements, and more\r\n• Search for sessions by topics and speakers', 'recentChangesHTML': 'Updated for Google I/O 2019<br>• Add events to your personal calendar<br>• Explore I/O in Augmented Reality (onsite attendees only)<br>• Use the home page to view upcoming sessions, announcements, and more<br>• Search for sessions by topics and speakers', 'comments': ["Design Flaw : Favourite An Event , Get Back To Main Screen Now there's no way to see all list of events.", 'Major issue:  Night mode setting on Galaxy S10 does not trigger automatic night mode.  "Always On" nor "Automatically" in developer settings does not turn on dark mode, but it does in all other Google apps that support the Android 9 night mode.  The only apps from Google to have issues with this is I/O 2019, the newest update to Google Contacts (it worked prior to latest update), and the new update to Google Calculator.  Google Play Games is the best version of dark mode implemented - it respects A) Battery Saver, B) Night mode (auto or manual), and C) colors the navigation bar the same color as the theme.', "I look forward to updating to five stars as soon as this bug is fixed. I had thought the problem was the sign-in, but that's not it. Upon opening it this morning, I was already signed in. Every time the app loads, I see the seconds counter change once and when it tries to change the second time, the old digit disappears but the slot just stays white as the app crashes. I think it's a coincidence and the app crashes 2-5 secs after the UI fully displays. Motorola X Pure, Build 25.211.1 Good luck!", "The schedule is terrible. Going to event details and back resets your scrolling position. There are way too many events for this simple list representation and filtering doesn't help much. Search is a joke when you try to find a session because there are many of them with the same name and you have to go to details to see the time, the list is not sorted by time either. Shuttle bus schedule is missing from the app so you have to go to the web version to see it.", "For being an app from Google, this is astonishingly bad. It's crashed several time, UI elements resize randomly, the data backing the list of sessions seems to be disconnected from the UI, session times appear to change from EST to PST and back again. Do better, Google!", 'crashes frequently. hard to get required information about talks. for some reason the option to reserve talks is not in my app build, which means i have to be standby for every talk, verified this bug with other attendees, who are actually able to reserve talks', 'Crashed every few hours in different ways (eg. click on a profile picture in a session -> crash) and displayed most (not all) the sessions. Most the time, I had a good experience.', "Stage 4 events are missing from the list of all events and from my schedule even though I reserved the seats. These are visible on the website, but not in the app. Now I'm in doubt if my seats are actually reserved.", 'Some events that visible on the web are unfortunately missing from the app sometimes, or mysteriously showing up in different time slots. Swiping to reload seems to resolve the issue.', 'The app keeps crashing on the home screen, over and over again. I wonder why google would release such a faulty app.', 'I like google apps because they are less amount of storage and easy to use', "Unresponsive, slow. Clearly not a native app. Keeps freezing and showing errors. Come on Google! It's embarrassing to use an app this bad for your premier conference. Sad.", "Today I have download this app but I didn't able to change the date. It showing same Month and date. I think they did much better for this app.", 'videos on detail screens are in wrong position. when i clicked kotlin presentation, i see keynote. i think indexing is messed up for all screens. please fix.', 'Great App, however, it keeps on crashing on my SGS6 + Android 7, maybe something you could look into if you are getting any crash reports', 'useful, but flawed..didnt work with my corp account, could not find speakers mentioned in keynote. bad data or bad search, is Google a search company or something?', 'Does not work at all!!! App crashes right after clicking "Get started"!!!', 'how come google released an app, that is crashing on its home page itself.', 'nice app, but it would be great if the links to the videos would actually work...', 'App keeps crashing except for the settings page.', 'Keeps crashing on the home screen.', 'Crashed at start. Not working at all. I want to put 0 star here.', 'app is crashing when is opened on galaxy a5 2016', 'Continuously Crashing App on Opening App on First Page', 'FAQ list goes behind navigation bar.', '1. Slow Animations 2. Old boaring UI', 'The application crashes on start.', 'App crashes when at the beginning', 'Bugs 🐞🐞🐞. Keeps crashing', 'Like other app from Google this app is also nice...Thank you Google for give us such as app', 'keeps crashing on launch', "Omg. Explore I/O mode is amazing! Can't believe how useful it is", 'Google i/0 app. a great app for locating with some extra benefit.', 'getting crash on home screen', 'This app is very well architected!', 'the events are suppresse supposed to be on 7, 8 and 9 May right? why is this showing 8, 9 and 10 to me?', 'Can you please provide CR Core for android 9,its not supporting plz help use learn some augmented reality.', 'Great and advance concept...', "why doesn't work AR core in my phone?", 'app crashes on galaxy s8'], 'appId': 'com.google.samples.apps.iosched', 'url': 'https://play.google.com/store/apps/details?id=com.google.samples.apps.iosched&hl=en&gl=us'}
