{'title': 'Hangar - Smart app shortcuts', 'description': "Hangar is an Android app that provides easy, relevant shortcuts in your notification drawer to your most used and relied upon apps.\r\n\r\nThis lightweight notification bar gives you convenient access to these apps from anywhere in Android while intelligently updating the priority and order of the shortcuts based on your daily use.\r\n\r\nWith the new pinned apps feature, favorite apps can be pinned alongside the ones Hangar has set.  Want a fresh look on those shortcuts?  Hangar now supports custom icons, letting you set a stylized theme by installing one of the many gorgeous icon packs available on the Play Store.\r\n\r\nHangar also keeps track of app usage statistics and includes 2 highly customizable widgets.\r\n\r\n\r\n<b>Features include:</b>\r\n\r\n• Auto-updating notification drawer shortcuts containing your most used and important apps\r\n• Sort and display apps based on user specified weight factors\r\n• Pin apps to always display\r\n• Launch shortcuts from lockscreen (Lollipop)\r\n• Support for icon packs and custom icons\r\n• Optional second row of icons\r\n• Blacklist unwanted apps\r\n• Fully customizable!  Change the number of shortcuts, icon color, icon size, background and more.\r\n• Additional re-sizeable widget to launch apps\r\n• Re-sizeable widget to view app use statistics with color coded bar graphs\r\n• Widgets intelligently scale according to size and device\r\n\r\n<b>Got questions?</b>  You're not alone!  \r\nI try to answer them in the FAQ here:\r\nhttps://github.com/corcoran/Hangar/blob/master/README.md#faq\r\n\r\nGoogle+ community for beta testing and discussion:\r\nhttp://goo.gl/ZD7e6n\r\n\r\nMilestones, planned features and issues:\r\nhttps://github.com/corcoran/Hangar/issues\r\n\r\nHangar is licensed under the GPLv3 from the Free Software Foundation.\r\nhttps://github.com/corcoran/Hangar\r\n\r\n\r\n<b>Note:</b> In-app Purchases permission is used for the donation page in settings. Hangar is free, fully featured and does not have ads.", 'descriptionHTML': 'Hangar is an Android app that provides easy, relevant shortcuts in your notification drawer to your most used and relied upon apps.<br><br>This lightweight notification bar gives you convenient access to these apps from anywhere in Android while intelligently updating the priority and order of the shortcuts based on your daily use.<br><br>With the new pinned apps feature, favorite apps can be pinned alongside the ones Hangar has set.  Want a fresh look on those shortcuts?  Hangar now supports custom icons, letting you set a stylized theme by installing one of the many gorgeous icon packs available on the Play Store.<br><br>Hangar also keeps track of app usage statistics and includes 2 highly customizable widgets.<br><br><br><b>Features include:</b><br><br>• Auto-updating notification drawer shortcuts containing your most used and important apps<br>• Sort and display apps based on user specified weight factors<br>• Pin apps to always display<br>• Launch shortcuts from lockscreen (Lollipop)<br>• Support for icon packs and custom icons<br>• Optional second row of icons<br>• Blacklist unwanted apps<br>• Fully customizable!  Change the number of shortcuts, icon color, icon size, background and more.<br>• Additional re-sizeable widget to launch apps<br>• Re-sizeable widget to view app use statistics with color coded bar graphs<br>• Widgets intelligently scale according to size and device<br><br><b>Got questions?</b>  You&#39;re not alone!  <br>I try to answer them in the FAQ here:<br>https://github.com/corcoran/Hangar/blob/master/README.md#faq<br><br>Google+ community for beta testing and discussion:<br>http://goo.gl/ZD7e6n<br><br>Milestones, planned features and issues:<br>https://github.com/corcoran/Hangar/issues<br><br>Hangar is licensed under the GPLv3 from the Free Software Foundation.<br>https://github.com/corcoran/Hangar<br><br><br><b>Note:</b> In-app Purchases permission is used for the donation page in settings. Hangar is free, fully featured and does not have ads.', 'summary': 'Notification shortcuts of your most used & pinned apps. Widgets, stats & more!', 'summaryHTML': 'Notification shortcuts of your most used &amp; pinned apps. Widgets, stats &amp; more!', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.056604, 'ratings': 2687, 'reviews': 519, 'histogram': [233, 152, 344, 456, 1500], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '1.7M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Mimic Mobile', 'developerId': 'Mimic+Mobile', 'developerEmail': 'hangar@mimic.ca', 'developerWebsite': 'http://hangar.mimic.ca', 'developerAddress': '637 Wellington St. W, Toronto, ON', 'privacyPolicy': None, 'developerInternalID': '8903244151170200933', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/nlohUUWIXvv86VS1TotReE9Dle0G_p4I030vmo6SWgeOOLpXnFr_CbiioNq2-8-1ryE', 'headerImage': 'https://lh3.googleusercontent.com/tUfQJOG22A6L92-CTW75htteN-NrtM2EWNxMQOd8EovEyx6lqBzDXG5qv2lwmhnY4gw', 'screenshots': ['https://lh3.googleusercontent.com/0bIeRy_BCxVRHaAFyaVvweiFhWFfH3vFjy3h7EcmeNn9msRcM4PREpn7h_nmbbKN-P_a', 'https://lh3.googleusercontent.com/YMrOECODq1ZDuSTd7O6XS3NmoESmY032Q9wbXiyRSxVWPoL54VgPayMMNZy5TRnCScM', 'https://lh3.googleusercontent.com/Zq5iJov6edNuBmSxEli50OoJIowUkZtN5lyUF0Nm4JcfCDCUui8oTnKfq_i33GFEoSvR', 'https://lh3.googleusercontent.com/eGDQEZPld2jBT_TNtu5P9IPb0nlnM_RiJZcihOlErCsPZajctWzr0jZPO2HvgwKugIc', 'https://lh3.googleusercontent.com/x7zdadAXC3-YygkDMPrTyKrlSRbETgv47zcVawV5Qd-gvdZ5u-RGpzwih6WYyIpykA', 'https://lh3.googleusercontent.com/WTbtVCkADi-MQGtG4ucw7bMv7moaYSpnfOS2pRB252orK-W1Mww89mIsub2yyvkh5g', 'https://lh3.googleusercontent.com/8ORpsdPHb1sAEbTV2Oyrznmw1dzPNCg83N_4-ozyak6XOPY1SgOfF2Cr7ugCIdgsphTF', 'https://lh3.googleusercontent.com/x_RAmnGP8sjgOQOA4hh9b-xBn0Q8-uHioBAucXHezL22TekJ87IhwJxofctfS5eNwqI', 'https://lh3.googleusercontent.com/hB5seAaqhfBHlxQkxwcTt11w3pUIPmk72cOUgy-pstRwBExkUcha2TAyxK16u7uzxDM', 'https://lh3.googleusercontent.com/yLaqMxsrUZSvWwUc3bKGZtCqdhdpIddT03LtKTXLduD6hPin8jp6h3mGrKkUnYROpw'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'May 16, 2014', 'updated': 1477427417, 'version': '2.7', 'recentChanges': '2.7 - (Oct 25, 2016)\r\n* [Fix!] Bring back position setting for MM/L users\r\n* [New!] Hangar Settings shortcut from Notification/App settings\r\n* Updated translations\r\n\r\nAlways reload Hangar after updating to a new version!', 'recentChangesHTML': '2.7 - (Oct 25, 2016)<br>* [Fix!] Bring back position setting for MM/L users<br>* [New!] Hangar Settings shortcut from Notification/App settings<br>* Updated translations<br><br>Always reload Hangar after updating to a new version!', 'comments': ["Great app. however looks to be abandoned. Hasn't been uodate in four years. Mostly works well, but often crashes. And despite being able to place multiple hangar widgets on the home screen. They can't display different things. I had hoped to have one displaying recent apps and another displaying most opened apps. But the moment I place the second widget the configuration of the first widget changes too.", "This app is a good idea a best. It doesn't perform correctly has alot of bugs such as icon packs keep reverting back to default icons. Widgets don't keep pinned apps in place. Overall I'm glad it's a free app cuz I'd be pissed if I payed for it. Revised 2/17/20 Now your widgets are gone. What is going on with your app? Please fix I like the widgets. I use them all the time. Thanks", '5 stars because for the few minutes I tried it there was no problem. But I uninstalled it because it does not solve my problem. I want to quick launch apps from my lock screen without having to also unlock my phone. This app does quick launch from the home screen but the unlock process is still required.', "Exceptional-No ads-ingeniously made. One must understand how to set it up - that's all and it works to perfection. Exactly what is missing from Android and all other OS systems around. Why can they not do what this app has achieved so well. An improvement would be to have additional widgets referring to other groups of apps or to the second and third etc. group of apps from the pinned ones.Another improvement would be to be able to add widgets-not just apps to ts icons. There is a way to not have the notice displaying at the top/lock screen.", "I had been using this app across devices for years, but it's been glitchy lately. It seems it's not been updated in more than two years. I guess it's been abandoned by the dev. I'm looking for a replacement.", "It would be nice to have the option to hide the notification icon so it's not always on my notification bar. :) Great app, works well.", "Still need to check how it works, but so far I've noticed that pinned apps are not excluded from the notification bar although Exclude pinned apps option is checked.", "Abandoned by developer 😔 needs updates. Widget icons don't fit correctly in widget area, amongst other little bugs.", 'need more than 35 apps ind dock. unlimited with scroll? also degrade usage required for r3cently popular apps, but not required anymore. usefull app, though to programm something like this, but found this solition', 'I have been using this app for more than four years. Every time I buy a new phone, I install this app first.', '𝕀𝕥 𝕨𝕠𝕣𝕜𝕤 𝕡𝕣𝕖𝕥𝕥𝕪 𝕨𝕖𝕝𝕝 𝕓𝕦𝕥 𝕚𝕥 𝕞𝕒𝕪 𝕟𝕠𝕥 𝕨𝕠𝕣𝕜 𝕠𝕟 𝕤𝕠𝕞𝕖 𝕒𝕟𝕕𝕣𝕠𝕚𝕕𝕤☹', 'Very good thank you very much, really useful...', "This was my favorite utility app for a few years, but now it doesn't work properly on a Samsung tablet upgraded from Android 6 to 7.1... both the switcher icon and the second app row have disappeared. It's gone from wonderful to only marginally useful.  Addendum: a few days later, I found a workaround to getting back the switcher icon... changed the apps-number to be lower than 10, then it re-appeared. It is still fixed when changing back to 10 too. Still no second row, but good enough for 4 stars.", "All I can say is this application does as it says. I've been testing and \ntesting; every tiny issue I had was fixed in the first update? Since that \npoint all has been perfect. I would like to see the ability to pin specific \napps. If it has been addedd to this release, I'm editing this post and \nrating 5 stars! Edit: 5 stars, I very rarely rate apps 5 stars. Thanks man", "Nice! (Running Android 5.1.) I love my newly customized notifications panel, all gussied up with colors I chose, just for starters. Then I discovered this bonus: the panel's not anchored to the center any more. Wherever along the top of the screen you pull down, that's where the panel will drop. Two requests: (1) It's now trickier to expand a list of new emails; the list doesn't remain displayed for very long. A user-set time adjustment would be good. Or maybe a click-to-stay-open effect. (2) I've found one option for replacing the default font in the panel. Could there be a dropdown list of font choices?", "Just me but I don't think Hangar itself should appear in the shortcut bar. Blacklisting it just doesn't feel right. Also think that the app stats need to be updated automatically and that there should be a toggle for this.", "EDIT: To make the notification icon disappear, go to behavior tab, click on notification position and set to bottom. This must of gotten reset after the update. Hope this helps others having problems.                           Really useful app, access my top apps from any screen. Only reason I didn't give 5 stars is that it used to work without a persistent notification. After October update it only works with notification icon. Still very useful but a bit annoying.", '@ Mimic team, can you please include an option to hide the persistent Hangar App icon from Top status bar? It is really annoying. Other than that the App is awesome. My daily used App. Thanks in advance... :)', 'Awesome! Exactly what i was looking for!  The only thing I could add, would be to either make it possible to use the widget before it is set, or explicitly inform the user in the instructions that they need to configure and save the widget settings to make it accessible. I spent 10 mins trying to figure out how to make the widget appear in my phone desktop', "I love this app but I'm giving it a low rating because the settings app crashes on open with the most recent update. I will update with 5 stars if this issue is fixed! Widget works fine but the settings cannot be changed. Please fix!", "would be perfect if there were an option to remove the persistent notification icon. also seems like notification position isn't correctly respected on 7.0, but this may just be a larger N issue.", "Considering as replacement to old Custom Notification, but doesn't support shortcuts/widgets in addition to apps.  For example, need to pin some frequently used custom setting shortcuts to bar (as in xShortcut or QuickShortcutMaker).  Also some apps inexplicably don't appear in list after use so can't pin ??? Otherwise first rate.", "I installed almost every notification bar shortcut App to test but I'm only keeping this one. No ads, no nags, loads of options, and it works perfectly on my Samsung S5. So impressed that I donated US$5.", "Great idea.. Only thing I'd want to see change is the ability to make the background transparent (so when on lockscreen all that's visible is the apps, and not a big bar blocking the pretty wallpapers 😁). Gd job over all", 'Really well done. Add a way to remove the status bar icon independent of layout (top/bottom/normal) and it would be 5 stars.', "This app is perfect however when I rester it doesn't seem to appear in the \nnotification box.I will have to go In the app for it to appear again .I \nhave enabled Start on Boot , I have excluded it from being cleaned and I \nhave also have access to it.Could you provide me with a solution?( This \nresponse was sent to email aswell). Android 6.0.1", "The only gripe I have is that icons in the widget don't always seem to use the custom icon theme, even when they are themed elsewhere.", 'Useful shortcuts in notifications, automatically chooses apps, customisable with icon packs. Would like to see some apps only appear when headphones are connected.', 'Cannot read properly names in pick an icon pack panel!', 'Repeatedly crashes when scrolling apps. Contacted developer. No response', "Using for some time great app.  After the last update I can't seem to rid my notification.!!!", 'Very useful app, I use both the notification pull-down and the widget for accessing apps quickly.', 'Another of my top 5 favorite apps. Having a widget with my most used apps on the home screen is so useful.', 'No app selection. First you have to make sure to run any app you want to add, or they won’t appear in the usage statistics.', 'Install now. Do it. You will thank me.', 'individually selected icons from icon packages keep randomly resetting to \nthe default icon within those packages', 'Creates a widget that puts your most used apps in it. Just what I want.', 'Buggy and unreliable on android 7+', 'Not completely accurate but love having notification shortcuts', 'Not all apps appear in the list to add to the notification bar.'], 'appId': 'ca.mimic.apphangar', 'url': 'https://play.google.com/store/apps/details?id=ca.mimic.apphangar&hl=en&gl=us'}
