{'title': 'Open Note Scanner', 'description': 'This little application provides a way on scanning handwritten notes and printed documents.\r\n\r\nIt automatically detect the edge of the paper over a contrastant surface.\r\n\r\nIf you have RocketBook Wave notebook or home printed pages it automatically detects the qrcode printed on the bottom right corner and scans the page immediately.\r\n\r\nAfter the page is detected, it compensates any perspective from the image adjusting it to a 90 degree top view and saves it on a folder on the device.\r\n\r\nIt is also possible to launch the application from any other application that asks for a picture, just make sure that there is no default application associated with this action.\r\n\r\nCan be also installed from F-Droid: https://goo.gl/WwB9gB\r\n\r\noriginal source code and binary builds are available at: https://github.com/ctodobom/OpenNoteScanner', 'descriptionHTML': 'This little application provides a way on scanning handwritten notes and printed documents.<br><br>It automatically detect the edge of the paper over a contrastant surface.<br><br>If you have RocketBook Wave notebook or home printed pages it automatically detects the qrcode printed on the bottom right corner and scans the page immediately.<br><br>After the page is detected, it compensates any perspective from the image adjusting it to a 90 degree top view and saves it on a folder on the device.<br><br>It is also possible to launch the application from any other application that asks for a picture, just make sure that there is no default application associated with this action.<br><br>Can be also installed from F-Droid: https://goo.gl/WwB9gB<br><br>original source code and binary builds are available at: https://github.com/ctodobom/OpenNoteScanner', 'summary': 'Capture and save handwritten notes and arts with your camera - Open Source', 'summaryHTML': 'Capture and save handwritten notes and arts with your camera - Open Source', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.16, 'ratings': 215, 'reviews': 94, 'histogram': [75, 12, 15, 25, 86], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.8M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Claudemir Todo Bom', 'developerId': 'Claudemir+Todo+Bom', 'developerEmail': 'claudemir@gmail.com', 'developerWebsite': 'http://todobom.com', 'developerAddress': None, 'privacyPolicy': 'https://github.com/ctodobom/OpenNoteScanner/blob/master/PrivacyPolicy.md', 'developerInternalID': '7396188860389225800', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/OW4U8aU5XEgz5dkCux69D363afAW9mD41O0Ni3oU3N8h2XaPRXLNsCfOFRvtoQ5M7Q', 'headerImage': 'https://lh3.googleusercontent.com/I-Nakxx-DRIHe1E8h2nmrxT2wLAEqj9vgryXmxOVCQtMdF64tWgxVjCiLcgtzpqUd8E', 'screenshots': ['https://lh3.googleusercontent.com/5o0k5SYtmqShY632fCJ2yEFet6hF7HQ-RBZJE_zNJPi8vxe0Rbga6X1BN_7XxjGN_V0', 'https://lh3.googleusercontent.com/B0pRmVI79HHlpcPhSZvJLm1mCwY2Jothm7HtsuQ_-i_ApRy6IiaQgeTNY_sJtzJvQQ', 'https://lh3.googleusercontent.com/AUnlWhGWh2lh13S4BsiyFxY6qe8P2wOKr76EX_GKeZh5e-hJVZTwVTn_cDCoEX6VBA', 'https://lh3.googleusercontent.com/KcLQ5VVav2tXFDzxSpscewn6s3tX8S1Se2Y5zMCXqv-MVFletGCCcJ9Vfe0IJ8IsqNc'], 'video': 'https://www.youtube.com/embed/XO7XvsAnkV0?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/XO7XvsAnkV0/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Feb 10, 2016', 'updated': 1564931244, 'version': '1.0.34-gplay', 'recentChanges': '* Fix bug on image viewer when running Android 9\r\n* Added support for PNG images (on settings screen)\r\n* Simplified Chinese translation, thanks to @yzqzss\r\n* Basque translation, thanks to @beriain', 'recentChangesHTML': '* Fix bug on image viewer when running Android 9<br>* Added support for PNG images (on settings screen)<br>* Simplified Chinese translation, thanks to @yzqzss<br>* Basque translation, thanks to @beriain', 'comments': ['I have no idea how you work it. I tried every thing that I can try. Sometimes it takes photographs. Some times not, and nothing else.', "I know that I can disable usage data in the settings, but what is being transmitted if I enable it?  UPDATE:  In my use the app was unable to detect the page, so needed to grab everything visible, and then would not show the image in the app's gallery, so I wasn't able to see how it did.  I have since uninstalled, so the answer to the usage data will not be relevant to me, but possibly someone else.", 'best for open source.. only one thing is missing sent combined all imge to pdf format.', "It is definitely a bad option if you have to install a scanner app. I thought it will work great because it is open source but it works like a camera. Another problem is the image size: the same as a regular shot. My conclusion is that it doesn't worth the purpose. I will still searching for a great open source scanner app.", "No idea why the rating is this low for this app. Probably from people who don't understand how to use it. This app does what stuff like Office Lens is supposed to do but really doesn't. It is also free and ad-free unlike the similar apps on Play Store.", "Scans are near flawless. It doesn't cut out corners or distort the scanned image like other scanning apps do.", 'Works on my Note9, but lacks a lot of features that would make it competitive (e.g. sharing to pdf, auto detection is not as good (I compared it to Notebloc, which auto-detected papers on my silver laptop surface))', 'Has potential. Ability to crop image manually would be nice.', "Doesn't work, crashes upon installation of that extra package thing", 'Gets the job done. Simple and fast.', 'I think it is broken on the LG V20. :(', 'When I search OpenCV Manager it says no items found.', "It doesn't save as PDF.", "Got it from survival manual yes it's perfect thank you does its job", 'Hated it....... It does not do any work', 'Great app! Thank you so much!', 'Great privacy oriented app, but crashes with my phone when sharing. But \nstill very useful as it saves docs locally and with small size.', 'App consistantly crashes when started. Using Samsung Galaxy Tab E, Android 6.0.1. Tried both version from Google Play Store and F-droid version. UPDATE- Tried app agsin sfter upgrading my Galaxy Tab E to Nougat, no change. App still crashes when opening. Very disappointed.', 'Finally an offline (and open source) scanner app that works reasonably well (at least when used from a straight angle). thx!', 'This app works great for every thing you might want to do with it', 'Awesome', 'First of all, thank you for writing an open source image scanner! The scan quality after auto-processing is not so good, though. It would be a great app if you could fine-tune the output quality!', 'Works great on lg g3. Managed to capture very old handwritten papers with clarity once i had got as much light as possible and a contrasting background.', 'Edge detection is not working at all!! Not even prospective transformation!!', "My dad wanted a scanner app that is easy to use. I'm a fastscanner fan but Dad found it too complicated. I tried this app and it's simple enough that even dad can use it. Turn off image processing for an actual photo.", "Includes setting for phoning home and was using background data. Uninstalled.  Update: To send usage data? That's spyware, period. Being open source doesn't magically make this incapable of that. I'll stick to my other scanning app, thanks.", "This seemed so promising. I downloaded openCV and everything, uninstalled the F-Droid version and installed this version, put black paper behind my note to help it find it, nothing. Otherwise, it's regular features are just fine like manual mode, but it needs a crop feature.", 'I don\'t want you to help with my CV, I just want to "scan" my notebook. I shouldn\'t need to immediately install a second app to use the core functionality of this one, what kind of developer programmed this joke? How has this spam got a 4.2 rating? Very worrying.', "Even installing openCV manager i can't use the app , i hope to rewrite a good review solving this issue.", 'Can we get it to link to Google Drive?', "Forces you to download an app called open note cv. No idea for what. Couldn't even use it. CS scanner is better including free batch scanning", 'Works great. I scan many documents every day. I will see how it continues to perform.', 'Awesome, WIll love to contribute.', 'Great Job!', 'Very promising. Open source.', 'Does what it should and its developer works hard to make it stable and bug-free. Deserved 5 stars.', 'Never lost my bookarts again! Nice one !', 'Good', 'Camscanner has more feature', "Open source soft which doesn't work without google play"], 'appId': 'com.todobom.opennotescanner', 'url': 'https://play.google.com/store/apps/details?id=com.todobom.opennotescanner&hl=en&gl=us'}
