{'title': 'Debatekeeper – debate timer', 'description': 'Debatekeeper is a timer for debates with automatic bells. It can sound a bell, vibrate and/or flash your screen to remind you to clap (for e.g. big rooms where a phone\'s not loud enough). Focus on the debate; let your phone do the timekeeping for you!\r\n\r\nDebatekeeper automatically switches to the appropriate speech time, displaying the current speech name (e.g. "Prime Minister") on the screen.  It supports most parliamentary styles of debating, including British Parliamentary (Worlds), Australs, World Schools, American Parliamentary, Canadian Parliamentary, Asian Parliamentary, Australian and New Zealand\'s Easters and Joynt Scroll styles.\r\n\r\nYou can also write your own debate format (style) in XML for the app to use—see the app wiki at https://github.com/czlee/debatekeeper/wiki for details.  Get in touch with me if there\'s one you\'d like added to the official release.\r\n\r\nFeatures:\r\n • Rings bells automatically at the correct times\r\n • Can vibrate and/or flash the screen at bell times\r\n • Configurable preparation timer\r\n • Configurable overtime bells\r\n • Points of information timer (15 seconds)\r\n • Supports most parliamentary styles\r\n • Supports user-defined debate styles\r\n • Browse through summaries of available styles\r\n • Includes two “test formats” with 15-20 second “speeches” for you to try it out\r\n • Counts up or down according to user preference\r\n • Screen stays on and dimmed while timer running (you can turn this off though)\r\n\r\nAdvice for adjudicators: It can pay to make sure your debaters (a) know what the bell sounds like, so they don\'t think you just got a text message and (b) can hear the bell.  I find it\'s loud enough in classroom-sized rooms, but not bigger rooms (say, lecture theatres); in those rooms you can use this app to remind you to clap.', 'descriptionHTML': 'Debatekeeper is a timer for debates with automatic bells. It can sound a bell, vibrate and/or flash your screen to remind you to clap (for e.g. big rooms where a phone&#39;s not loud enough). Focus on the debate; let your phone do the timekeeping for you!<br><br>Debatekeeper automatically switches to the appropriate speech time, displaying the current speech name (e.g. &quot;Prime Minister&quot;) on the screen.  It supports most parliamentary styles of debating, including British Parliamentary (Worlds), Australs, World Schools, American Parliamentary, Canadian Parliamentary, Asian Parliamentary, Australian and New Zealand&#39;s Easters and Joynt Scroll styles.<br><br>You can also write your own debate format (style) in XML for the app to use—see the app wiki at https://github.com/czlee/debatekeeper/wiki for details.  Get in touch with me if there&#39;s one you&#39;d like added to the official release.<br><br>Features:<br> • Rings bells automatically at the correct times<br> • Can vibrate and/or flash the screen at bell times<br> • Configurable preparation timer<br> • Configurable overtime bells<br> • Points of information timer (15 seconds)<br> • Supports most parliamentary styles<br> • Supports user-defined debate styles<br> • Browse through summaries of available styles<br> • Includes two “test formats” with 15-20 second “speeches” for you to try it out<br> • Counts up or down according to user preference<br> • Screen stays on and dimmed while timer running (you can turn this off though)<br><br>Advice for adjudicators: It can pay to make sure your debaters (a) know what the bell sounds like, so they don&#39;t think you just got a text message and (b) can hear the bell.  I find it&#39;s loud enough in classroom-sized rooms, but not bigger rooms (say, lecture theatres); in those rooms you can use this app to remind you to clap.', 'summary': 'Never miss a bell again! Timer for debates with automatic bells', 'summaryHTML': 'Never miss a bell again! Timer for debates with automatic bells', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.83, 'ratings': 576, 'reviews': 93, 'histogram': [5, 0, 11, 51, 506], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Chuan-Zheng Lee', 'developerId': 'Chuan-Zheng+Lee', 'developerEmail': 'cz.lee11@gmail.com', 'developerWebsite': 'https://github.com/czlee/debatekeeper/wiki', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5289376533593079798', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/bKGqi6EUd8bWFp9SSpghVU03phBu1MLXFtajZqbcfsGo7_oG-Qn4BotsSbzzTvpsSw', 'headerImage': 'https://lh3.googleusercontent.com/BLBATp2WY1c0iQhevhfRnK8KHVxhK3gBw62YLpk11ZF11FbqKefd3lXPGK2EUGnqpQ', 'screenshots': ['https://lh3.googleusercontent.com/uMrOA7SauMezYfX58NmuPDEqF_qGqGBpi03YnzSl2ZWcLMK-uZGdtM7zCtMAzhLdf4I', 'https://lh3.googleusercontent.com/BwY7lLQmnzoz4pF3c1WVV4Ul17R14ULRkkHgeCHPUQ0kQP276-jgqHT3nghI65B_bLg', 'https://lh3.googleusercontent.com/sl_MOCAvnkMCIQXU0EqeviIYggGsKOiaJcy6MM9S-D5qjbUyYNnDIyRfhRBXkVPW2g', 'https://lh3.googleusercontent.com/o8UVC2Dg6vxkYxPPnJ7G5n_p8Jw_-ufnRhvAG7CRvMl0VZJNG7WLkB-MgE62EKMMT74', 'https://lh3.googleusercontent.com/4DnQTWy_EUNKWvBDXsNWwsgEtb2LyXwospzNpOMaKL2raFB1o-hHduBoEFMXs_Xa1Jw', 'https://lh3.googleusercontent.com/qo0zXA7UxKBsxHjQtuHPzdgPDIhhm30i8d3doSIaVdmlIIuz02Ja_qcTrTRvVkumRow'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 30, 2012', 'updated': 1480024292, 'version': 'Varies with device', 'recentChanges': 'Version 1.2:\r\n • New icon (thanks to Zandi Speedy-Willis) and updated theme\r\n • Share custom debate formats, including via Android Beam (for Android 4.1 and above)\r\n • Quick access to turning bells on or off\r\n • Added MSPDP and Paris V styles\r\n • Other user interface improvements\r\n\r\nVersion 1.1:\r\n • Fixed "keep screen on" function\r\n • Fixed custom XML file format handling (required new Android permission)', 'recentChangesHTML': 'Version 1.2:<br> • New icon (thanks to Zandi Speedy-Willis) and updated theme<br> • Share custom debate formats, including via Android Beam (for Android 4.1 and above)<br> • Quick access to turning bells on or off<br> • Added MSPDP and Paris V styles<br> • Other user interface improvements<br><br>Version 1.1:<br> • Fixed &quot;keep screen on&quot; function<br> • Fixed custom XML file format handling (required new Android permission)', 'comments': ['Great app!!!! This is exactly what I was looking for and used it with great success in class today. Made a custom debate style for my format, it was easy, straight forward and quick. The github site was an excellent reference point for building the custom style.  Thanks for developing this.', 'The biggest problem is the lack of inclusion of all debate forms. I know it has a custom form, but for all you from the US NSDA this does not have the forms that are used: no PF, Policy, LD etc. The UI is overall too complicated and a bit dated. Overall this may be a fine app, but if you are from the NSDA then it is not useful.', 'Perfect for University debaters and judges, allows you to focus on the speech and not set a manual stopwatche', 'Saved a lot of hassle when adjudicating.', "Very Helpful. Really put me on track and I'm definitely anxious without this", 'great app for debaters', 'It helps me so much...', 'wasy to use!!!', "As an exec of my own Canadian debate society, this app is incredible! It contains every style and variation I'd ever need! It's a must have for any serious debater /judge!", 'Very nice I like it', 'Simple, Awesome, Effective.', 'Could you make the bell louder, pls?:)', 'works', 'helpful app', 'Great app', 'Nice', 'Helpful', 'good', 'Love it', 'This is used everywhere. Just awesome.', 'Wonderful', 'It fulfilled its job, nothing more than that. If I can give suggestion, I hope there will be more setting for preparation time (like continuous overtime bell). Also for POI button, can you make it bigger or simply make the  screen become POI button? I often practice without any person become the time keeper and looking over POI button after someone accepting POI is kind of time wasting. Make it MUCH easier to tap will be a huge help. A little BEEP when POI time is over will be a HUUGEEE help.', 'A real useful one. If we could customise unique profiles for our own needs, setting when the bell rings would be a good addition!', 'Could it be adjusted to have an option of 7 min Speeches please. In South Africa we have Junior Debate Tournaments for speakers from 7th - 9th Grade who speak for 7 mins.', "I use this for my debate class and it's perfect. I never miss any warnings now. Used to miss them all the time as I was taking notes.", 'I seem to be having a problem since the POI button is always inactive I hope its just a bug or something since I have already changed the settings for the POI and it still is jnactive please address this issue', 'This is a brilliant tool but if only we could edit the debate formats within the app itself, that would be perfect! Thanks though!', 'Perfect for debaters.  Request: can you add an option for creating custom format(s)? It would be very helpful.', 'This app and its creator inspired me to create. Thank you =)', 'The Apps really help, i will give 5 star if there is a custom options in the time to ring the bell', 'the most brilliant debate timer app. i never thought someone would make such a tool. wow', 'Its a very useful app for chairing or adjudicating, but the feature to make a custom debate style would be very useful', 'Works well for what options it has, but can you add in Public Forum and Lincoln Douglas?', 'Focused on NZ debate styles but otherwise the perfect app. I must have for any debate judge.', "It's absolutely a big help for debaters. It has all kind of debate styles and reminder of the time .", 'We use it every debate !', 'Awesome app, altho a louder bell would definitely help', 'Many formats to choose from and accurate. Helpful', 'Cool lovely just what I needed.', 'Good aplication for debaters and adjudicators. Thanks.'], 'appId': 'net.czlee.debatekeeper', 'url': 'https://play.google.com/store/apps/details?id=net.czlee.debatekeeper&hl=en&gl=us'}
