{'title': 'Wake Lock - PowerManager', 'description': 'Wake Lock gives you control over the Android Power- and WifiManager.\r\nFor example, you can force the PowerManager to keep the screen on or have the CPU still running in standby mode or make sure the Wifi connection keeps running at full performance.\r\n\r\nYou can use it on any android phone or tablet.\r\nUse it to keep the screen on in full brightness or dimmed mode during movies or slideshows.\r\nTo make sure the CPU is still running in the background doing your tasks when you press the standby button.\r\n\r\nThere is a "Donate Version" available if you wish to support my work.\r\n\r\nWhat are the permissions used for:\r\n* WAKE_LOCK, to obviously be allowed to aquire wakelocks.\r\n* RECEIVE_BOOT_COMPLETED, to start the app after device reboot.\r\n* READ_PHONE_STATE, to be able to act on start/ending calls, allowing the app to aquire a lock just for the duration of the call.', 'descriptionHTML': 'Wake Lock gives you control over the Android Power- and WifiManager.<br>For example, you can force the PowerManager to keep the screen on or have the CPU still running in standby mode or make sure the Wifi connection keeps running at full performance.<br><br>You can use it on any android phone or tablet.<br>Use it to keep the screen on in full brightness or dimmed mode during movies or slideshows.<br>To make sure the CPU is still running in the background doing your tasks when you press the standby button.<br><br>There is a &quot;Donate Version&quot; available if you wish to support my work.<br><br>What are the permissions used for:<br>* WAKE_LOCK, to obviously be allowed to aquire wakelocks.<br>* RECEIVE_BOOT_COMPLETED, to start the app after device reboot.<br>* READ_PHONE_STATE, to be able to act on start/ending calls, allowing the app to aquire a lock just for the duration of the call.', 'summary': 'Easy control over the Android PowerManager.', 'summaryHTML': 'Easy control over the Android PowerManager.', 'installs': '500,000+', 'minInstalls': 500000, 'score': 4.5903616, 'ratings': 3563, 'reviews': 1723, 'histogram': [171, 85, 118, 279, 2908], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '38k', 'androidVersion': '2.1', 'androidVersionText': '2.1 and up', 'developer': 'darken', 'developerId': 'darken', 'developerEmail': 'support@darken.eu', 'developerWebsite': 'http://darken.eu', 'developerAddress': 'Roermonder Straße 364\nAachen\nGermany', 'privacyPolicy': 'https://raw.githubusercontent.com/d4rken/wakelock/master/privacy_policy_gplay.md', 'developerInternalID': '8200033670069343191', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/FUXH_u-qRJKj9jd3L0MlEBAy7TJayl9tngLhZh70Z5O2lw2mcLjRe9Q0aPzLQok5Wkg', 'headerImage': 'https://lh3.googleusercontent.com/rEwTmU2YyL5NliYWvI0VgX7Ignn4OGkwUAjjjFsWqIsMaXP56Yu-hh9dB0JrzHXVF5Q', 'screenshots': ['https://lh3.googleusercontent.com/aUTD0oRpvuCHYp_9LBZ-ReqlYsU6h4xRc7ku9LuLud4J9Y-tV2ry1GA07KCE3rHOt2M', 'https://lh3.googleusercontent.com/7UIgP3vw4iE5YZ8mkYi2p6fVVikSxfQU1SDhn2qc8Y7rNVWiw_sp6wf6FqCr08mHsiWY', 'https://lh3.googleusercontent.com/nEiMDrCiRVbWKgnrvPC4st8kXte-PJn1MXMpncCTQ9Mnt7abC8Jai2PjsO5V6o-dCWk', 'https://lh3.googleusercontent.com/VIXwzRlMhcgIAPUA_pETZzjNVrneEhPUZGSk9UNntm4_oFkR-6N-eq9YLDJHzqyRtQk', 'https://lh3.googleusercontent.com/6zCn-wJsMyV0GdHgzsQsbHrPzI_hf8-pNC_kBtCK5gP-4aZTn4YNqUcm2nEvvlTZ8fU'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 18, 2011', 'updated': 1535367890, 'version': '2.5-f', 'recentChanges': "v2.5-f\r\nIf you'd like this app, just a bit more modern, then I've got just that, checkout:\r\nhttps://play.google.com/store/apps/details?id=eu.thedarken.wldonate\r\n\r\n* Added link to Wakelock v3 (which replaces the donation version).\r\n* Removed donation nag", 'recentChangesHTML': 'v2.5-f<br>If you&#39;d like this app, just a bit more modern, then I&#39;ve got just that, checkout:<br>https://play.google.com/store/apps/details?id=eu.thedarken.wldonate<br><br>* Added link to Wakelock v3 (which replaces the donation version).<br>* Removed donation nag', 'comments': ['I downloaded this app about a year ago after buying a new galaxy note 4. My previous one mysteriously started acting up after an update and then bricked itself. Before I installed I was getting the same problems on the brand new phone: fresszing, black screens, random restarts etc. But since I downloaded this app NOT A SINGLE PROBLEM! this app is truly a lifesaver. Thank you developers', "Works well. It's currently the only thing making my galaxy note4 usable. It uses some battery but it stops it from crashing every time I unlock the phone by not letting it hibernate in the first place. Thanks for fixing an issue that Samsung couldn't be bothered with.", 'Why does a power manager app upload approximately 69 MB of data to who knows where? The power management features work well, though. It stopped my S5 from random reboots and freezes, for a while.', "I have no idea what this app is doing but it works. It prevents my Galaxy Note 4 phone from freezing and from the “could not do normal boot, mmc_read failed” error.   That being said, most Note 4 users probably have a spare battery, and the process of switching battery still have some freezing issues. However, I found a get around solution by removing the battery, wait 5 minutes, put the recharged battery in, and wait another 5 minutes before power the phone on. Thanks for saving my Note 4. Oh, and don't just thank the app developer, send him/her a well deserved donation.", 'My phone was acting weird. It was freezing all the time and restarting itself often. I tried to factory restart, I tried to delete the cache partition and I tried bunch of tricks to solve the problem. None of them worked. Then I saw someone recomending this app. At first, I was skeptical and as far as my understanding goes this app should even make it worse by using some of the cpu all the time. However, somehow this app makes it work and solved my freezing and rebooting problems. Thank you :)', 'Literally just download it, of course it crashed 3 times while trying to download, so i plugged the charger in even, tho the batt was at 50%, crashed one more time on the charger then finally stayed on long enough to download. I selected "partial" and now im off charger at 41% charge and NO CRASHING! It was literally crashing every 2 minutes before i googled this fix! i was actually shopping for a new phone yesterday! Love the removable batt on Note 4!', "Basically I tried everything in my power to fix my note 4 for about a year...but in vain. Freezes, gets into an endless 'could not do normal boot, mmc_read failed' error mode, fires up again, giving me false hope and crashes again, etc. Total madness. I even bought a brand new spare battery thinking that would save my phone, but nada! It's a shame that Samsung is getting away with this. My phone was absolutely healthy until they pushed the security updates of Sep. 2017. Now thanks to this app and it's developper, been two months already my note 4 is back up and running. I don't even know whatever this app is doing to the system board but it's holding it alive and shining again. Huge thanks!", 'I was highly skeptical, but my Samsung Galaxy Note4 went from being close to totally unusable to seem almost like it should behave. It seems this program takes over the role of power manager for the phone, as the behaviour indicate it prevents apps from locking resources causing glitches and crashes. No idea why this happens with the original software which worked fine up to a month ago. Changing to new original samsung battery only had a 10% improvement on stability. This app fixed the other 99', 'Samsung Note 4 owners! Read on for a permanent fix. Wakelock is a good app and will provide some relief from the dreaded Emmc chip problems, but it\'s not a permanent fix. Bad things will return. Supposedly, the only fix is a new motherboard but just recently (Oct. 2018) a new video describing a physical fix that requires some delicate disassembly (but not too much, and using only a screwdriver and a plastic card) and a piece of aluminum foil. Search YouTube for "100% fix galaxy note 4" for a video posted by ARNOOKIE VR. If you decide to give it a try, study the video and read all the comments. I tried it last night on a Note 4 I had abandoned six months ago and it went from dead to kicking right away. Can even shutoff Wakelock and turn on fast charge again. Sounds unbelievable, but... well read what others comment there too. Good luck!', "Greatly helped my Galaxy Note Edge & thank you so much Darken for your efforts, however, I realised that I must not turn off my mob for recharging because when I turn it back on it will have the same issues, it either restarts or turns off then I need to remove the battery & put it back on so I can reactivate the Wakelock again, otherwise it's fantastic! Thank you again Darken. pls let me know of any tricks that I could use regarding my problem. Thanks", "Yes! Best app ever! Now I never have to worry about my VPN connection dropping when I hit the power button to turn off my screen. I've been looking EVERYWHERE for this app. Thank you so much to the developer! 10 stars!!!!!", 'Just when I thought my Note4 reached the end of its life, this app which I came across on youtube saved it from ending up in the trash. Saved me from having to spend hundreds on a new phone. I was having lag, random reboots etc out of nowhere, not anymore. Thanks!!!', 'This may really saves my life,I frustated about my phone.Its restarting by itself,when first i thought it was a battrey issue,but not.So,i think very very far,maybe coz im playin games so the phone gets really hot.But,when im not playing games (Normal use.Instagram,facebook,etc.) Its restarting too.So,idk what to do.Hope this will works well on my device.Samsung Galaxy Note 4 SM-N910G', 'This app saved my galaxy note 4. The phone was barely a month old and started having problems with automatic restarts ( 10 -15 times everyday). I searched for solutions on YouTube and almost everyone recommended this app. it works great. I have not had any issue since i downloaded this app', "Wow! It works for my Samsung Galaxy Note 4, instantly when i installed the App, It's real amazing App, but also it works to my wife phone which is I phone 6 , she had the same problem of Stucking and freezing, but now things are on air Thank you Darken for this wonderful App, small size about only 30kb", 'Well-made app. A massive thank you to the developers for not making this app a slow-ad overloaded app and one that works and works well. Cannot thank you enough for your work, saved my Note 4.', 'So far so good,my phone used to freeze in an hour it could freeze about 10 times or so,but now all that is gone, thanks to the developers of this app', 'It is must required app for galaxy note 4. Reboot, slow, touch unresponsive all issue gone. It uses 10% battery in 24 hours but saved my note 4. Thank you.', 'As others have said, this app saved my Galaxy Note 4!  Thank you SO much for this, pizza sent!  :)  One request - would it be possible to have an option to prevent the Wakelock notification showing up on the homescreen and notifications? Just having the icon in the task bar would be great.  Anyway, thanks again!', 'After an android update, my samsung note 4 is unable to wake up after sleep mode. This app fixed the problem. Saved me from buying new phone', 'very useful on samsung note 4 with restarting and freezing issue.I recommend this app to all note 4 users. Thanks Developer for making my phone function as a phone again.', 'this app is a life saver. and samsung are real ass holes for bring out a system updare which would render all note 4 to have this problem. in not giving up my note 4 that easy', 'this app can save note 4 and note edge but if some how your phone turn off just remove the battery and put the phone in freezer for almost 5minute then put battery back on and turn on your phone very easily', "My NOTE 4 was falling into a deep slumber from which it wouldn't wake. Wake Lock helped stop that. Thanks!", 'Think it helps to stabilise my note4. (Not sure yet). Before that it keeps freezing and restart.', 'Seems to work. Not sure which option to check off though. Going to try out the revamped version (v3) instead now.', 'brilliant solved the problem of my note 4 re-booting all the time. got the problem solved . found a guy on Uribe who suggested it.. thinks if wax the last system update by samsung', 'Yo it has definitely reduced the number of times my phone restarts but somehow at 25-18% when I open Snapchat it goes off then starts restarting by itself maybe an update', 'My Note 4 would shut down, reboot or just freeze daily. Wake Lock has been Great. No more reboots', 'Note 4, freezing, crashing, as soon as I installed this and did partial option, phone fast and back to normal.', "It fixed my Note 4's random reboot problem with 1 click! Thank you.", 'Using note 4 v6.01 helps with phone freezing and target download error. Search you tube. great app', "fixed my note 4's lagging freezing and being stuck in a rebooting loop 90 percent of the time great app highly recommend", 'works!!!! revived my almost unresponsive galaxy note 4, a miracle. Thanks!', 'I have been using this app before. now I ve changed the mother board with sprint & am unable to download this app for my Note 4.', 'so far so good on my 5 year old Note 4 that I refuse to retire ☺ no random reboots in the past 36 hrs! fingers crossed!', 'Solved my note 4 freezing problem instantly. Work really well, definitely recommend 👍', 'Works well on my note 4 att stops it from crashing and rebooting all the time', 'Fixed my Note4 from constant freezes and reboots, seemingly 100% so far.', 'My note 4 problem is restarting and freezing but after installation this great app everything is fine'], 'appId': 'eu.thedarken.wl', 'url': 'https://play.google.com/store/apps/details?id=eu.thedarken.wl&hl=en&gl=us'}
