{'title': 'ML Manager: APK Extractor', 'description': 'ML Manager is a customizable APK manager for Android: extract any installed app, mark them as favorite, share .apk files easily and much more.\r\n\r\n<b>Meet the easiest app manager and extractor with Material Design on Android.</b>\r\n\r\n<b>Features:</b>\r\n• Extract any installed & system apps and save them as APK.\r\n• Batch mode to extract multiple APKs at the same time.\r\n• Share any APK using other apps: Telegram, Dropbox, email, etc.\r\n• Organize your apps by marking them as favorite and access them easier.\r\n• Upload your latest APKs to APKMirror.\r\n• Uninstall any installed app.\r\n• Customizations available in Settings, including a dark mode, customizing main colors and more.\r\n• No Root access required.\r\n\r\n<b>Need more features? Have a look to the Pro version with Root access:</b>\r\n• Uninstall system apps. <i>- Requires Root -</i>\r\n• Hide apps from the device launcher so only you can see them. <i>- Requires Root -</i>\r\n• Delete cache & data for each app. <i>- Requires Root -</i>\r\n• Enable the new and elegant compact mode.\r\n• Always extract APKs in the background while you continue extracting other apps.\r\n\r\n<b>What do the media say about ML Manager?</b>\r\n• AndroidPolice (EN): "ML Manager makes extracting APKs from your device easy."\r\n• PhoneArena (EN): "With a combination of basic, essential features and a Material-inspired user interface, the app is definitely something to look out for."\r\n• Xataka Android (ES): "ML Manager is the easiest way to extract and share APKs."\r\n• HDBlog (IT): "If you need a simple, beautiful and optimized application, without losing basic and essential features, ML Manager is a good choice."', 'descriptionHTML': 'ML Manager is a customizable APK manager for Android: extract any installed app, mark them as favorite, share .apk files easily and much more.<br><br><b>Meet the easiest app manager and extractor with Material Design on Android.</b><br><br><b>Features:</b><br>• Extract any installed &amp; system apps and save them as APK.<br>• Batch mode to extract multiple APKs at the same time.<br>• Share any APK using other apps: Telegram, Dropbox, email, etc.<br>• Organize your apps by marking them as favorite and access them easier.<br>• Upload your latest APKs to APKMirror.<br>• Uninstall any installed app.<br>• Customizations available in Settings, including a dark mode, customizing main colors and more.<br>• No Root access required.<br><br><b>Need more features? Have a look to the Pro version with Root access:</b><br>• Uninstall system apps. <i>- Requires Root -</i><br>• Hide apps from the device launcher so only you can see them. <i>- Requires Root -</i><br>• Delete cache &amp; data for each app. <i>- Requires Root -</i><br>• Enable the new and elegant compact mode.<br>• Always extract APKs in the background while you continue extracting other apps.<br><br><b>What do the media say about ML Manager?</b><br>• AndroidPolice (EN): &quot;ML Manager makes extracting APKs from your device easy.&quot;<br>• PhoneArena (EN): &quot;With a combination of basic, essential features and a Material-inspired user interface, the app is definitely something to look out for.&quot;<br>• Xataka Android (ES): &quot;ML Manager is the easiest way to extract and share APKs.&quot;<br>• HDBlog (IT): &quot;If you need a simple, beautiful and optimized application, without losing basic and essential features, ML Manager is a good choice.&quot;', 'summary': 'A modern, easy to use and customizable app manager. Extract APKs and more!', 'summaryHTML': 'A modern, easy to use and customizable app manager. Extract APKs and more!', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.234146, 'ratings': 2079, 'reviews': 718, 'histogram': [233, 30, 101, 365, 1348], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '5.0M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Javier Santos V.', 'developerId': '9205902632927830308', 'developerEmail': 'me@javiersantos.me', 'developerWebsite': 'https://about.javiersantos.me/mlmanager/', 'developerAddress': 'Javier Santos\nC/ Aracena 5, 8D\nSevilla, Sevilla 41010\nSpain', 'privacyPolicy': 'https://about.javiersantos.me/mlmanager/privacy-policy', 'developerInternalID': '9205902632927830308', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/MUA3J3xdCuVrErQaaZw9IrtJLh2ncvTIgqs07nbp5z10N8-CWx3klBXEj4f8Pibgqg', 'headerImage': 'https://lh3.googleusercontent.com/i9jHsi2FuNanTP-_iCN5dK5-TnkYiHskp4YINydtP5xbrgU9TAGfGqmRJ1HG1tiJvQ', 'screenshots': ['https://lh3.googleusercontent.com/kkMU9whc9XXZliUcKcHZYI3_QvyxXKjPPg1lV1WKfotrIHxXHl6w1ve8MF-MfShw7vQ', 'https://lh3.googleusercontent.com/Xw_aEQ2etxZLSBOK-UBT27rKoIIdE8VHu9F7x8adwIaNOcrGwo64gjjwX13i0BoSEO0', 'https://lh3.googleusercontent.com/4Tbyx9g7wPIgLLNroT7db7iQLhYvlEpn5PY60esFqd4B68N0iYhQdLh0flhL7YkPdQg', 'https://lh3.googleusercontent.com/CXPLDVMECyUZLNOKQhYJ9z1Bj667GYtL4TKL1rzLDvl7CLlQ-UVObmKE7nQ6kH75HA', 'https://lh3.googleusercontent.com/1vH38iUCA9hFYQOBI1Z5RVk5ANQ5nr3dCQ7uxIlDU0GckUKGQPNgxHaRsefNtb9IEnQ', 'https://lh3.googleusercontent.com/B8y3iBUsYsbfMJLI7CgzPFS7RFzNwj7pna9g9RBZCVDpRIk6wcyJDkDQrjg8pjNadc7u', 'https://lh3.googleusercontent.com/UOofCUZ3xSQe5d7ym3Z0pFBhvs8QFxyl2FIkxGdTgXxf1iE3h76UjYvqzK1XYYcHgyM', 'https://lh3.googleusercontent.com/R0jBk3LcDdbZDrTqpM9x0C0X3xX6eBn0yNEOQLEOf_Snyf8HmgI4mJrzhg7-Bz_XgE0'], 'video': 'https://www.youtube.com/embed/aMqBy-FfRnM?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/aMqBy-FfRnM/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'May 26, 2015', 'updated': 1588151538, 'version': '3.5.1', 'recentChanges': 'Thank you for your suggestions! Some of them are included in this version and bugs affecting certain versions of Android have been fixed.\r\n• Added a new button to select all apps.\r\n• Uploads to APKMirror does now support split APKs.\r\n• UI improvements.\r\n• Squashed some bugs.', 'recentChangesHTML': 'Thank you for your suggestions! Some of them are included in this version and bugs affecting certain versions of Android have been fixed.<br>• Added a new button to select all apps.<br>• Uploads to APKMirror does now support split APKs.<br>• UI improvements.<br>• Squashed some bugs.', 'comments': ['Does exactly what it says it will do; allows me to make back-ups of all apk files', "Doesn't seem as if you can select all at once. I see several months old comments about this but it still hasn't been implemented. There's a feature to export a list of apps but since you'd have to manually select all your apps it's not really viable here. I'll look for a replacement right away.", 'This rocks! I used it to retrieve a no-longer-available app (Theta S) from my old phone - there was nowhere else to get it. Easy, easy, easy. Thank you, Mr Santos!', 'Very useful app you can get apk from any app you have installed and also share anyone very nice application made', "Awesome app, would give 5 stars if there was an option to select all, apart from that it's great.", 'hopefully on sd card save apk back up', 'rated 5 stars because nearly perfect except one 1 huge thing. in your screenshot it shows a easy quick way to delete cache and data from your app but i dont see that in app. there are no options to delete app data and cache before uninstallation, not even a link to take me to the app info settings for manual deleting the data and thats a huge deal for me. when i delete my apks, i want every associated junk deleted!!! 😢', 'The idea that there is no "select all" feature bewilders me and makes this app unusable for my needs. A shame too, since it\'s otherwise very well designed. Very disappointed too since this would be my app manager of choice hands down if I could actually use it for stuff. The idea that an otherwise great app for backups can\'t be properly used for app backups just because a developer left out a standard feature for apps like this is sort of absurd.', 'Android TV support is the only thing missing right now (Google Play for Android TV). :)', "I'm so glad I found this app! I like to save my favorite apps to my google drive so I don't have to look for them all over again... Such a hassle if you forgot the name or etc. I've been thru SO many apks apps & nothing compares to ML! I absolutely love it & it's awesome layout!", 'Love it! Fast and very easy to use. No root required. It worked flawlessly for apps I had installed in my phone, but were no longer in the app store. Also, no ads! Thanks dev!', "first, there is no select all option so you have to manually take off every single app if you want a full backup. second it doesn't recognize my SD card so I had to point it back to main storage at which point it died halfway through the back up. extremely disappointed", 'Great app thank you javier', 'Batch extraction is possible, but no batch selection, so each app must be individually selected one at a time! Needs a "Select All" option. A serious omission.', "Good app, unintuitive name. I don't need to use it very often, so every time I want to, I have to try to remember what it's called so that I can find it in my app list.", 'Superb extractor. Easy to use and looks and works great. Great job by the dev.', 'Great👌🏻 Just if add an app startup logo (Like Google Apps) would be more than great! 👍🏻', 'Superb!! Especially if you need to extract a bad apk....', 'Nice app; no flaws!', 'Massive marketplace and free app site', 'Best one other are just junkies', 'Thank you for making this .', 'It does what its says it does. Well done team', 'Very useful app, thanks', 'You deserve 5', 'thank you so much for this application.', 'I was gonna give 4 stars lol, then i found the beautiful dark theme 😍', 'Just go for it.', 'Please inform me of new apps', "I'm so happy I found this app", 'I dont now becuose i baru duonlod i dont now .................................................. ....................', 'how to use???? :-) :-) :-) :-)', 'Quick extraction and no distractions, just straight to the point. ;) Whether you want to extract to local storage, cloud or anywhere else, this got you covered. Very convenient.', 'Excelente.', 'Wow! Super good and fast reaction of the developer! Back to 5 🌟 for an app that really deserves it ♥️', 'Very easy to use!', 'Parfait. Merci beaucoup.', 'Super.no need to say anything', 'best app .', 'When you review an app there are are a few prerequisite questions, you have to answer before leaving your written review. One of these is, "does the app meet your expectations?"... NO it does NOT! The app does not allow the user to disable system apps. It also forces the user to perform extractions, one at a time. I have over 300 apps on my phone! Batch extraction is the natural progression. I wouldn\'t have cared if these were abilities I had to pay for by purchasing the pro version. The fact that the app doesn\'t have it, just makes it a very good SECOND rate app. I have lowered my rating due to the enormous size of this app. A lot of games are smaller than this. It amazes me something can be so large while still missing important components. Has it been over eating?'], 'appId': 'com.javiersantos.mlmanager', 'url': 'https://play.google.com/store/apps/details?id=com.javiersantos.mlmanager&hl=en&gl=us'}
