{'title': 'Simple Music Player - Play audio files easily', 'description': "A simple music player easily controllable from the status bar, home screen widget or by hardware buttons on your headset. It provides all expected functions like sorting in various ways as well as changing the Equalizer. Listen to your favorite mp3, other songs or podcasts with this free beautiful music player.\r\n\r\nIt offers exclusive extras like Search and showing Album Art, a sleep timer and many other settings. This elegant music player allows you creating and managing handy playlists as you desire.\r\n\r\nPlaylists are fully supported. You can add either individual files, or whole folders. If you won't like a file, you can either just remove it from a playlist, or delete the actual file altogether.\r\n\r\nComes with a handy sleep timer so that you can reliably delay the time of the app shutting down.\r\n\r\nSupports both shuffle and repeating a particular song, as well as skipping and fast forwarding.\r\n\r\nAvailable in many different languages, offers multiple different equalizers.\r\n\r\nEasily check a file properties like the size, duration, last modified etc.\r\n\r\nModify file EXIF data like the song title and artist.\r\n\r\nQuickly share files with your friends on social networks, emails, or anywhere you would like.\r\n\r\nThis stylish music player contains a widget with customizable text color, alpha and the color of the background for easy access and control.\r\n\r\nIt properly handles third party intents too for playing individual audio files so it can help at setting ringtones too.\r\n\r\nIt comes with material design and dark theme by default, provides great user experience for easy usage. The lack of internet access gives you more privacy, security and stability than other apps.\r\n\r\nContains no ads or unnecessary permissions. It is fully opensource, provides customizable colors.\r\n\r\n<b>Check out the full suite of Simple Tools here:</b>\r\nhttps://www.simplemobiletools.com\r\n\r\n<b>Facebook:</b>\r\nhttps://www.facebook.com/simplemobiletools\r\n\r\n<b>Reddit:</b>\r\nhttps://www.reddit.com/r/SimpleMobileTools", 'descriptionHTML': 'A simple music player easily controllable from the status bar, home screen widget or by hardware buttons on your headset. It provides all expected functions like sorting in various ways as well as changing the Equalizer. Listen to your favorite mp3, other songs or podcasts with this free beautiful music player.<br><br>It offers exclusive extras like Search and showing Album Art, a sleep timer and many other settings. This elegant music player allows you creating and managing handy playlists as you desire.<br><br>Playlists are fully supported. You can add either individual files, or whole folders. If you won&#39;t like a file, you can either just remove it from a playlist, or delete the actual file altogether.<br><br>Comes with a handy sleep timer so that you can reliably delay the time of the app shutting down.<br><br>Supports both shuffle and repeating a particular song, as well as skipping and fast forwarding.<br><br>Available in many different languages, offers multiple different equalizers.<br><br>Easily check a file properties like the size, duration, last modified etc.<br><br>Modify file EXIF data like the song title and artist.<br><br>Quickly share files with your friends on social networks, emails, or anywhere you would like.<br><br>This stylish music player contains a widget with customizable text color, alpha and the color of the background for easy access and control.<br><br>It properly handles third party intents too for playing individual audio files so it can help at setting ringtones too.<br><br>It comes with material design and dark theme by default, provides great user experience for easy usage. The lack of internet access gives you more privacy, security and stability than other apps.<br><br>Contains no ads or unnecessary permissions. It is fully opensource, provides customizable colors.<br><br><b>Check out the full suite of Simple Tools here:</b><br>https://www.simplemobiletools.com<br><br><b>Facebook:</b><br>https://www.facebook.com/simplemobiletools<br><br><b>Reddit:</b><br>https://www.reddit.com/r/SimpleMobileTools', 'summary': 'A clean music player with a customizable widget, stylish interface and no ads.', 'summaryHTML': 'A clean music player with a customizable widget, stylish interface and no ads.', 'installs': '500,000+', 'minInstalls': 500000, 'score': 4.240113, 'ratings': 3579, 'reviews': 1811, 'histogram': [363, 151, 212, 384, 2466], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.4M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Simple Mobile Tools', 'developerId': '9070296388022589266', 'developerEmail': 'hello@simplemobiletools.com', 'developerWebsite': 'https://simplemobiletools.com', 'developerAddress': 'Hviezdoslavova 7, Košice 04001, Slovakia', 'privacyPolicy': 'https://simplemobiletools.com/privacy/musicplayer.txt', 'developerInternalID': '9070296388022589266', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/kR9e3fT1RUZojDeRuoQuJHCVFX_wpDGmobavYdSf2VRUu8LiuTqkSBi3MJ6ISlf_XvY', 'headerImage': 'https://lh3.googleusercontent.com/Y-baxpMHs4bRxxCCJDGT3DAgQA8vfHB5Wsxh-750rdiP12H6vUoXV32hMSwiLOaTOEbO', 'screenshots': ['https://lh3.googleusercontent.com/Cdaft1dn_jyKJLP1FWTHPrbzJ1c98b8HT-v_fqLyLkaNX61V5mR2awlAFSq1L074ew', 'https://lh3.googleusercontent.com/NgTf-bA3c5fe24zLEKJFdbAyK5_Tt6iWWmzwLDhEn7A-L-b_SN596WQvMwb9RUyQRUs', 'https://lh3.googleusercontent.com/9EBtlfSUyLuTtxREYJRUW5i5PlwHOH43wTsubPeVJMHhMZ9x3mDo3k6aZXJLe7VbLg', 'https://lh3.googleusercontent.com/VNOiqN6YsQMpLtwHiH8rGxmK3Sdt2R-FXmGlBczfYYJUo2r0Pvir-aF_IiNt5vVHjA', 'https://lh3.googleusercontent.com/dNYmb4w1tZ3pBgwibYV3PU-eUkf61v9klxgeGQbyyhTbtpTiQAkNJnT66l56IRX9tyeb'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 5, 2016', 'updated': 1590848197, 'version': '5.3.3', 'recentChanges': 'Use a nicer app icon on older devices\r\nAdding some stability and translation improvements', 'recentChangesHTML': 'Use a nicer app icon on older devices<br>Adding some stability and translation improvements', 'comments': ['Playing a track directly from File Manager, triggers the black screen of creating a playlist, instead of the Player interface.| While playing a list of tracks, happens that after the 4th track ends, it starts the 1st track instead of 5th one.|Moving "create new playlist" command at the top (+) would be nice; narrower space between playlist items to economize the screen; inserting songs into playlist by manual order avoiding automatic sorting of titles. Thank you!', "Really is simple. Other music apps have a ton of unwanted features. I just wanna shuffle the mp3 on my phone and this does just that. Bonus is it doesn't assign random cover art to songs like other apps I tried does. Only down side would be no forward or back button on android watch.", 'Just discovered you made more apps and a simple mp3 player is definately one i was hoping for from you. I always wanted just a basic mp3 player for my phone. No bells or whistles. Very happy you e made this as well as the SMS Messenger app. Keep up the good work!', 'I have this ap on 2 different phones one with android 9 and one with android 8 the android 8 phone does not show the album cover. Not sure if it is a bug or just not supported. I liked it enough I have it on both phones', 'This is an excellent app without much fuss. I dnt think, a calander, contact, messaging and calling app is required from third party. Whether wanted or not google app stays there.', 'All I wanted is a simple app, that would play music. I wanted to select songs manually. First off, and most importantly, quality of music is clearly worse, than other mobile music players. And second off, Im unable to progress through a single song. For example, when I want to get to the middle of a song, it plays from the start. I know, its likely a bug, but come on, its one of the main functions.', "The way I use this is mostly for streaming files from Dropbox, or playing 1 off files on my phone storage. It almost never loads any data or gives me any controls for the song, and I can never select the same file twice in a row as it won't play more than once. I love how it plays in the background though, so I can select my file and look at other things.", 'This is very good App, but the UI should be improved and all white like others.', 'Best player in the store. Simple. On point. No ads. Thank you.', "Perfect before update. Now the app has NO controls once a file is played from any file manager. You have to select the app from the system tray notification just to pause or stop it. If you pause the track and let the app run in the background, surprise surprise, the app will NOT play anything until it's restarted. App is now useless.", 'This app is simple and to the point. Very easy to use and does everything that a player should do. I just wish I could set up to play songs in a specific folder. If you have an older phone that you want to use as a MP3 player or have issues with other apps then give this one a try.', 'No extra bells and whistles. Hooray! Exactly what I wanted. Whatever music I load onto my phone or record with my phone ends up here and plays no problem. No glitches no worries. Just wonderful and effective simplicity. Thankyou. 😊', 'Great , Simple & Very Imperesive No Ad, very very useable. Thanks alot to creator', "There is a problem, i cannot play some songs, i don't see any noticable differences and they are all the same format and i can play them using other apps but can't choose them in this player", "awesome simple no frills application with almost everything I expect from a basic player. Even the 'delete current song' function is easily accessible. The only thing I'm really missing is a simple crossfader - that's all :-)", "Had this app for 4 months and it's evolved into a piece of unusable garbage. I wanted a simple player with a slide control, now it won't even do that !! So delete and and good bye !", 'Simple is best, worth paying to get rid of Ads. If you like the simple things in life, then this app is perfect 😁😁', 'Finally! An easy to use music player that actually works. Intuitive setup and controls.', "Decent for what it is, but I'm surprised there's no way to view songs by artist and/or albums like most music players.", 'I love this app. Uses very little battery life. Can easily point it to any folder for music. Great for multiple playlists.', 'sort by adding time not available.. please add this option.', 'Simple and smooth music player without any ad.easy to search and manipulate songs and making playlist.', 'Practical, user friendly and helpful. Nice creative options for that personal touch 😊', "Really good music player but the only thing is I can't disable the album art on my lockscreen :(", 'Would like to give more stars but it is missing important feature for sorting by date added /modified', 'A good start, needs work on the UI.', "I'll have to say that this APP is the coolest compared to play music from google but with folders it would be more great.. hope you consider that", 'Easy to use and super wonderful. Please keep it that way.', 'Music player its great but please add option to able to view folders', "It's good music player and simple .", "Reasonable player but loses my spot when it isn't playing and spends more than about 5 seconds as a background app ie., pause, go to other app for a few seconds use running app list to switch back, not paused, not queued to any song let alone the one I was playing.", "It's got most features that I was looking for. It's got a few glitches though - sometimes it doesn't replay in autoplay/repeat mode. Also, don't think it has the audio normalization feature to maintain constant volume when playing different tracks from a playlist.", '2020MAR25 no option to create a new list other than by selecting a folder. 2020MAR20 the track/list repeat indicator must be unlit when allowing repeat/looping, but lit when playing track/list without repest/looping (i.e., the ststus of the indicator is reversed in comparison to all other players I have used).', "Simple. I haven't found a way to pause or skip songs with the screen off as far as I know so you have to find a different app for that, but it's simple & works.", 'Not bloated and intuitive', 'Just one of the most easy and simple app, all my MP3 and MP4 audio music is playing unlike the other expensive apps which gave me a hassle, Thanks you guys and the are no irritating ads', 'Giving it 5 stars only for being open source. Other wise, Musicolet and Pulsar are way better than this. I can not find option to remove WhatsApp folder from the main playlist.', "More capable than the Samsung stock player but easier to use and more reliable than others I've tired. Best choice for local audio files.", 'Nice and simple for generic play, BUT why include an equalizer that is only for appearances. It obviously does not affect the sound in any shape, form or fashion.', "Easy to use. Just a player with no bulk. It's great, and it has an inbuilt sleep timer."], 'appId': 'com.simplemobiletools.musicplayer', 'url': 'https://play.google.com/store/apps/details?id=com.simplemobiletools.musicplayer&hl=en&gl=us'}
