{'title': 'Event Sync for Facebook', 'description': "Event Sync for Facebook is a free open-source app that will sync your Facebook events to your Android calendar. It will create five new calendars:\r\n * Events I'm Attending - for events that you marked yourself that you are 'Going' on Facebook\r\n * Events I May Be Attending - for events that you marked yourself as 'Maybe' on Facebook\r\n * Events I Have Not Responded To - for events that you were invited to but did not respond yet\r\n * Events I Declined - for events that you marked yourself as 'Not Going' on Facebook\r\n * Friends' Birthdays - sync birthdays of user's Facebook friends\r\n\r\nYou can configure reminders for events in each of those calendars independently. You can also configure how often the events should be synced.\r\n\r\nReport problems: https://github.com/danvratil/FBEventSync/issues\r\nPrivacy policy: https://github.com/danvratil/FBEventSync/wiki/Privacy-Policy\r\nSource code: https://github.com/danvratil/FBEventSync/", 'descriptionHTML': 'Event Sync for Facebook is a free open-source app that will sync your Facebook events to your Android calendar. It will create five new calendars:<br> * Events I&#39;m Attending - for events that you marked yourself that you are &#39;Going&#39; on Facebook<br> * Events I May Be Attending - for events that you marked yourself as &#39;Maybe&#39; on Facebook<br> * Events I Have Not Responded To - for events that you were invited to but did not respond yet<br> * Events I Declined - for events that you marked yourself as &#39;Not Going&#39; on Facebook<br> * Friends&#39; Birthdays - sync birthdays of user&#39;s Facebook friends<br><br>You can configure reminders for events in each of those calendars independently. You can also configure how often the events should be synced.<br><br>Report problems: https://github.com/danvratil/FBEventSync/issues<br>Privacy policy: https://github.com/danvratil/FBEventSync/wiki/Privacy-Policy<br>Source code: https://github.com/danvratil/FBEventSync/', 'summary': 'Sync Facebook Events into your Android calendar', 'summaryHTML': 'Sync Facebook Events into your Android calendar', 'installs': '50,000+', 'minInstalls': 50000, 'score': 2.1293104, 'ratings': 1169, 'reviews': 780, 'histogram': [725, 100, 50, 50, 241], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.3M', 'androidVersion': '4.2', 'androidVersionText': '4.2 and up', 'developer': 'Daniel Vrátil', 'developerId': 'Daniel+Vr%C3%A1til', 'developerEmail': 'me@dvratil.cz', 'developerWebsite': 'https://www.dvratil.cz', 'developerAddress': None, 'privacyPolicy': 'https://github.com/danvratil/FBEventSync/wiki/Privacy-Policy', 'developerInternalID': '5477440553793900637', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/UJjkEAuw69disLgWMeMQdzWOhElAjNLU-ZWJcpmrfsGAbwN511Qo7FPz683jkE4mgg', 'headerImage': 'https://lh3.googleusercontent.com/qTPx7dBSwW3nYezaDNrtGvXiZgeFsCcTKtWDyz9UUPInkc2SIhehInZ-Or-xiRdu_xc', 'screenshots': ['https://lh3.googleusercontent.com/wYIG9fDfTIkoweLBdb6wWd-N0JRbK7AzJxgdD4R7L2egbl2sQmr4FtiT8bP_-FPXE2Q', 'https://lh3.googleusercontent.com/VYJEb9a5UTeCPYu_iYyp6kgJx4S840pHKv98eN2KibW5aSwV9NKqnjDIcVKwUUPoViw', 'https://lh3.googleusercontent.com/poTd0vQSFt1rfDkOMA3HotCGyhFQbmfzRg5C8wH_Us-zpx_edlwYwKvBohhFcUQQkxw'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Oct 26, 2017', 'updated': 1591374169, 'version': '0.45', 'recentChanges': '* Fix login and sync for most cases\r\n* Updated translations', 'recentChangesHTML': '* Fix login and sync for most cases<br>* Updated translations', 'comments': ["Had been GREAT thus far but now it keeps popping up a notification asking me to login every 15 minutes or so - really annoying, going on many days now. I gave it the correct information but it's still pops up the notification for me to login. Fix this and It'll be back to 5 stars! Don't fix it... And I'll have to uninstall :(", "Used to be great application but not working since many days... Now I've to quit the application. Sad to tell that I've left being beta tester too.", 'Sorry, but, it won\'t even let me try to sync. I get this message when trying to log in.... "Login Failed: You can\'t use Facebook to log into this app or website because there\'s an issue with its implementation of Facebook Login"', 'Loved this app for many years, but now it stopped working completely. Keeps giving me an error saying "Login Failed: You can\'t use Facebook to log into this app or website because there\'s an issue with its implementation of Facebook Login."', "Well. It was 5 out of 5 last year, however i don'tknow what went wrong as it didn't sync anything at all in my new mobile, that is set up with android 9.0. Signing in fb wasnt any problem. That's why 1 out of 5. I also saw people reported the similar issue in the forum of the designer, but i didn't see any corresponding answer.", "Looks very interesting, but I unfortunately won't use it in its current state.   Why don't you use native Facebook authentication ?  I'm certainly not sharing and saving my Facebook credentials within some random app. This isn't secure at all...  Even if the dev is honest, that's definitely the way someone would hack your password.", "I love this app! It helps sync nearly all of my calendars into one place. For a while it didn't work due to FB updating something on their end, but it's now working again after me manually syncing. I don't use birthdays from FB so not sure if that had been fixed, but the events and their customizable colors are back up and running. When this app had issues, it really made scheduling and planning such an added chore. I tried downloading FB Local to resolve but had limited calendar view ability", "An update to my review on the 24th June 2019. Due to FB birthdays etc not appearing on users calenders the app was updated (a rollback) on the 14th July to try and fix the problems but unfortunately FB birthdays are still not appearing on my calendar but events do show now. Please have another look at the FB birthday issues because it's hardly worth having the app if FB birthdays do not show on my calendar. I have uninstalled and reinstalled the app but still no birthdays showing.", "I'm trying the app for the first time since facebook ics with Google Calendar sync has some trouble lately. First Sync seems to work. I'll see if automatic sync is working. Would it be possible to to sync the events into any webcal ? Even a read-only calendar would be a huge improvement to visualize calendars from any computer !", 'Worked great for a while. Now it wont even sync. Not worth the download.', "nice app. sync is done seamlessly and works well. the only drawback is that it creates separate calendars (in seperate account), therefore events are not visible in google calendar environment in web. this app doesn't sync back to google.", '"Login Failed: You can\'t use Facebook to log into this app or website because there\'s an issue with its implementation of Facebook Login." displays when I try to Login, is this a bug? Because I tried several times (wrote right both my mail and password). Great UI btw.', 'The best Facebook sync app by far, I particularly like the way I can choose to only show "going" + "maybe/interested" events but exclude "not responded" + "not attending" + "birthdays" plus configure colours. Friendly developer too. Highly recommended!', "Something is making it so events and birthdays don't show. Please fix this.", 'Hi Developer Previously the app works however this time cannot sync my facebook events/birthday though i log in my account. There is a prompt message that i need to re-authenticate or re log in but it doesbt work. Hope you can help me. Thank you and regards', "Fantastic! I've used HaxSync before devs discontinued that service, but then I was lost in my events and had to check Facebook app on mobile. This is great service, very easy to use, recommending it. Thank you, dev! 🙂", 'Birthdays from Facebook all disappeared from calendars awhile ago. With latest update lost all events syncing as well. App force closes when sync is started every time. So latest update makes the app non functional completely.', "it was a wonderful app but now it doesn't work... i think it's because of an update from Facebook... the birthday sync has stopped working for everyone.. hope there is an update soon to fix this issue", 'Exactly what I needed. Easy one button click. And all my events are on my calendar 😍', "It has stopped working. The Facebook account gets added but doesn't add to calender.", "This doesn't seem to work anymore. I logged into my facebook account through the app and synced the calendar. But the sync log shows zero entries added in all the sections.", "Not working anymore. But being used it for years, I'm quite certain that the developer will come up with a solution pretty soon;so still keeping the app. Cheers.", "Just doesn't work. It is not syncing to Facebook", 'I am using this app since longtime and something recently has broke and Birthdays no longer sync into my Google Calendar. Please fix ASAP! This was a Friendship Saviour app for long time now.. :)', "This app is not working. It just shows that it has synchronized facebook with the calender, but doesn't, in reality. It used to work earlier, before the update.", 'It works...FYI...If sync stops, uninstalled, power off/on, reinstall.', "used to work until yesterday, now it's stopped syncing birthdays. happened earlier too, a fix was issued on 14th July but the issue has recurred.", 'Since recent update App, keeps crashing. Prior to this, it had stopped working. When it was working, it was excellent. G', "Hi, can a developer help me. I changed my phone to Oneplus7t and this app isn't syncing birthdays and events from facebook. Have checked all settings and options.", "This will not sync my friend's birthdays anymore. I use a yahoo email to log into Facebook and it used to sync the Birthdays, it is now no longer doing that.", "Can't login to FB, error message : Login Failed: You can't use Facebook to log into this app or website because there's an issue with its implementation of Facebook Login.", 'Wonderful! Worked perfectly. Sync everything and i can make rules to only sync events and exclude birthdays. I really needed this and works perfectly. Thanks', 'Facebook took away the sync with calendar and i have a ton of events that I need to know about. This app fixed my problem. So thank you.', 'This was a perfect app until recently. It now does not sync at all. I have no more FB events in my calendar.', "The app used to work perfectly, but now the events won't be synced to the phone's calender anymore.", "Doesn't work no matter what I've tried... no more fb synced events or birthdays. Good job with the update !!!!!!", 'works for me with latest update, but shows only current month events. others are blank. in log it looks "scrapped events"', 'Used to work well . Now no longer syncs with Facebook. Had to uninstall. Please fix.', "This app is honestly extremely usefull!... When it was working. Currently doesn't work for my Samsung Galaxy A50. Anticipating an update. :)", "Right now I'm giving it 1 star. If I could go lower I would. It worked great on my Note 8. But my new Note 10+ it's not Syncing at all. If they can fix the problem I Will rate it again. But for now it's a (1)."], 'appId': 'cz.dvratil.fbeventsync', 'url': 'https://play.google.com/store/apps/details?id=cz.dvratil.fbeventsync&hl=en&gl=us'}
