{'title': 'Nextcloud Passwords', 'description': 'An app to manage your Nextcloud passwords', 'descriptionHTML': 'An app to manage your Nextcloud passwords', 'summary': 'An app to manage your Nextcloud passwords', 'summaryHTML': 'An app to manage your Nextcloud passwords', 'installs': '5,000+', 'minInstalls': 5000, 'score': 3.09, 'ratings': 159, 'reviews': 128, 'histogram': [58, 9, 14, 11, 65], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '9.7M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'daper', 'developerId': 'daper', 'developerEmail': 'david@daper.email', 'developerWebsite': 'https://github.com/daper/nextcloud-passwords-app', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5535893396871604107', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/YDNw1JmjFU6v7IVcbbNr05CTPEz4H3TKUZC7cDsl9aZgDCW_KZ-GtlHdGnVIWK-LNnY', 'headerImage': 'https://lh3.googleusercontent.com/2_eOIYpVRaqXblB5ceT05eiz8_OWDulrdcQzO6wLTEhj60HLOtYaYNLyX0PU81VXENk', 'screenshots': ['https://lh3.googleusercontent.com/Lwbc7gHs42rf8s80FERJRT5Q8fsDVJW5r8Ur4J79DI13MtUI-SfqNeCmXKf_PSMIZODi', 'https://lh3.googleusercontent.com/INF3spnRCR1z-GwSVndoUPJfJIHM---vGg5lCNh7ZqpyqwLUwQODaIIwcuFL64uo8As', 'https://lh3.googleusercontent.com/Kuu4FhDDE3UrIob3T2Gg5p_Yn2OSv9-UevysT1fOx1m7-U9Y_qZjwgCybiB5uKWcNg', 'https://lh3.googleusercontent.com/uR4Kf_jti3fuA22RW60gXmbUs0rovITS98yWodwHnLUc_i9YnOF7__4EiFaVM_VzUC3b', 'https://lh3.googleusercontent.com/3EFlRr7ImN0z6sBh-I6NlJ04wbLAqmYsCZmZxBIgIPYDDlGDU_tQBxGhW09UcyS-7Nw', 'https://lh3.googleusercontent.com/t_flsZuDcsxx1d5kfDzq02NDrgc-UDapdblY1W0atc00spToxz6dsOKJYh8H_t02fIcP', 'https://lh3.googleusercontent.com/Z5PvZCM1E9lsBUpk_M4O12ZGS7ce9TAIu1Y7F9289-ecRU4gBdyMyc3dZQPrmVkLopLp', 'https://lh3.googleusercontent.com/KPYONv3sVPB5UWRC2vSqD_UeKEU6C_gc9rwBmxAORZ66kYk9Ckqls-65i1gkLduw5OA'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 6, 2018', 'updated': 1583916088, 'version': '1.14', 'recentChanges': 'Release v1.14\r\n\r\n- #62: initialize custom fields when creating a password.', 'recentChangesHTML': 'Release v1.14<br><br>- #62: initialize custom fields when creating a password.', 'comments': ['Works fine, but no auto fill, so have to copy and paste usernames and passwords. Inconvenient to use. That said finger print authentication looks nice and this looks like, one day, it could be quite impressive.', 'I am unable to connect to my nextcloud instance with this app. Self signed SSL configured and am able to use the password manager on any of my other devices in my LAN. Ive tried other variations of the URL but nothing works. Also am able to connect to nextcloud with their official app on my phone but it has no password feature.', "I'm unable to connect to my Nextcloud server recently. Is it because of a recent update? Thank you for the awesome app. I'm using it very day. That's why the fact it is not connecting now really affects me. Thank you!", 'Update on 01/04/2020: The new version works flawlessly on my tablet. I wish that I could find the same quality app for my iPhone too. Well done :)', 'Latest version(March 8th 2020) fixes the issue I was having with connecting. Thank you. So far looking great. Had to clear app data.', "Not compatible is you use two factor authentication. (Aka: TOTP) No clue if it is a great app because it is stuck at 'pulling sites'. This is related to using two factor authentication on your Nextcloud account. Without two factor, it may work just fine.", 'Great app. Would now be lost without it. Would be useful to be able to manage my passwords into groups or folders.', 'Very good now I have all working following certificate issue with Nextcloud. I would give 5 stars if you could have an automated prompt on Android appear to fill passwords as, unless I am doing wrong, you have to manually copy and paste. I currently use Lastpass but am close to migrating. Great app and hope to see further work to make it better. Thanks team.', 'Excellent app with offline accessibility. My two comments to improve usability: I prefer sorted by name rather than date added, and please provide auto/easy close of search results (say when the app is exited). Usually I close the app after getting my password for one website, and the next time I am most likely looking for password to another website. Currently, I have to open the keyboard and backspace the last query.', "Cannot connect to Passwords 2020.1 on NC 17.0.2. no error message, just sits spinning... I only get a network error if I don't remove the auto capitol from from server address.", "App don't work you can input usernames and password when you save it never shows up and wont pull from the sever. Password generator dont work too", "I've just installed it to test it and I keep getting network error, when I used my public or private IP for my server inside my home network. I know my nextcloud is functioning as I've just installed the Nextcloud Password app. I don't see any request from the app in my server logs... Pity", 'This app works great for password management and seems very modern in regards to features and capability. If you have a Nextcloud server I recommend installing the password manager and using this app and associated browser plugins.', 'Somehow cannot c d site view, itnjust blank screen press back n close apps, android 7, nextcloud 16', "I keep getting network error outside my network and inside my network. can view the passwords via web browser. the normal nextcloud app works so not sure why this one won't", 'i like the app but whenever I tap on a password, it takes me to a white screen.', 'just stopped working, only get network error now. Useless', 'keeps showing a rotating circle, but nothing happens. and back button does not work.', 'easy to use app with password generator. only request i would have fornthis is to have an auto fill function like LastPass', 'Great app. Please finish the main activity when the back button is pressed.', 'Cannot connect to my nextcloud 17 with nextwork error message.', "It doesn't work. Really frustrated. Please, fix it asap. Mood = rollercoaster fall = 🤓😌😮😑😑😒😡", 'I used Keepass but the integration wirh Nextcloud is great so I switched to this app.', "needs auto fill support and you're perfect!", "Password generator doesn't work", 'Impressive app very useful and working perfectly...', 'App keeps loading and nothing happens', 'Just shows network error.', 'works like a charm!', 'Devs like this make Nextcloud awesome. Buy him a pint!', 'thanks devs for making this app. works great', "Make4 IOS Please! I'd buy", 'gud thx, still network errorr,,', 'Great app', 'smooth', 'great app'], 'appId': 'com.nextcloudpasswords', 'url': 'https://play.google.com/store/apps/details?id=com.nextcloudpasswords&hl=en&gl=us'}
