{'title': 'BatteryBot Pro', 'description': 'BatteryBot Battery Indicator is the original battery indicator app for Android™, released in 2009 as simply "Battery Indicator."  Both the free and the Pro versions have maintained a 4.5+ star rating in Google Play from the beginning. It offers two modes: the original status bar indicator and now also a desktop widget.  You can use either or both, as you please.\r\n\r\nBatteryBot monitors and shows your battery charge level (percent) as an icon in your status bar, with how much time you have left, temperature, health, voltage, and time since plugged / unplugged in the notification area.  It now also has a 1x1 app widget. The Pro version also has user-configurable alarms, logs, mA current information, and a large (4x1) widget.\r\n\r\nGive it a try -- it\'s an excellent and complete solution to your battery needs.\r\n\r\nFeatures:\r\n\r\n• No ads (why would you want a battery app with ads?)\r\n• Exact battery level in the task bar\r\n• Or hide the task bar icon, keeping notification in tray — or turn notification off completely and just use widgets\r\n• Multiple icon set options\r\n• Automatic time-remaining estimates based on recent usage\r\n• Small (1x1) circle desktop widget\r\n• Very lightweight (please email me if you think otherwise, and I\'ll help you figure out what\'s wrong — I promise this app will not drain your battery!)\r\n• Well-tested and supported on all major versions of Android (4.1 through 8.0; Jelly Bean through Oreo) and form factors (small phones, medium phones, large phones, 7-inch tablets, 10-inch tablets).\r\n• Open source\r\n\r\nFor those who want more than is offered in the free version, or for those who just like to support small, independent developers like me, the Pro version remains lightweight while packing in many useful features:\r\n\r\nPro-only Features:\r\n\r\n• Alarms (fully charged, charge above X, charge below X, temperature above X, or health failure)\r\n• (On devices that allow it — Note that most devices on Lollipop and up, 5.0+, do not, so this is mostly only for old devices) Icon colors (including fully configurable green, amber, red, and black icons)\r\n• (On most devices) Electric current (mA / milliamp /milliampere) reading to/from battery on supported devices\r\n• Large (4x1) desktop widget\r\n• Battery logging. You can log the battery state (charge, status, voltage, temperature) and browse the logs on the phone or export to CSV.\r\n• Control the notification priority on Android 4.1+ (For example, you can set to "minimum" to hide the icon but keep the notification in the tray.)\r\n• Lots of configurability of behavior and appearance.\r\n• The charging indicator (the bolt under the number that indicates when the device is being charged) for the sets that have it is optional in the Pro version.\r\n\r\n~~~~\r\n\r\nFollow the Google Plus group for announcements and occasional polls about the app:\r\n\r\nhttps://www.google.com/+BatterybotInfoAndroid\r\n\r\n~~~~\r\n\r\nA one-time purchase now gets you free updates for life on all your Android devices.\r\n\r\n~~~~\r\n\r\nAll requested app permissions are explained on the project website.  On devices running Android 6.0 or newer, permissions are requested as needed and not used otherwise.\r\n\r\n~~~~\r\n\r\nPlease email me if you have any questions or comments.\r\n\r\n~~~~\r\n\r\nHere\'s the BatteryBot business model / philosophy:\r\n\r\n1) Ads are annoying. For some apps, ads might make sense, but a system utility should not have ads.\r\n\r\n2) The free version should be simple but useful; it shouldn\'t feel crippled.\r\n\r\n3) Some people choose to purchase the Pro version because they want extra features, some because they want more customization, and many because they just want to say "thanks" for the free version and support small, independent developers like myself.', 'descriptionHTML': 'BatteryBot Battery Indicator is the original battery indicator app for Android™, released in 2009 as simply &quot;Battery Indicator.&quot;  Both the free and the Pro versions have maintained a 4.5+ star rating in Google Play from the beginning. It offers two modes: the original status bar indicator and now also a desktop widget.  You can use either or both, as you please.<br><br>BatteryBot monitors and shows your battery charge level (percent) as an icon in your status bar, with how much time you have left, temperature, health, voltage, and time since plugged / unplugged in the notification area.  It now also has a 1x1 app widget. The Pro version also has user-configurable alarms, logs, mA current information, and a large (4x1) widget.<br><br>Give it a try -- it&#39;s an excellent and complete solution to your battery needs.<br><br>Features:<br><br>• No ads (why would you want a battery app with ads?)<br>• Exact battery level in the task bar<br>• Or hide the task bar icon, keeping notification in tray — or turn notification off completely and just use widgets<br>• Multiple icon set options<br>• Automatic time-remaining estimates based on recent usage<br>• Small (1x1) circle desktop widget<br>• Very lightweight (please email me if you think otherwise, and I&#39;ll help you figure out what&#39;s wrong — I promise this app will not drain your battery!)<br>• Well-tested and supported on all major versions of Android (4.1 through 8.0; Jelly Bean through Oreo) and form factors (small phones, medium phones, large phones, 7-inch tablets, 10-inch tablets).<br>• Open source<br><br>For those who want more than is offered in the free version, or for those who just like to support small, independent developers like me, the Pro version remains lightweight while packing in many useful features:<br><br>Pro-only Features:<br><br>• Alarms (fully charged, charge above X, charge below X, temperature above X, or health failure)<br>• (On devices that allow it — Note that most devices on Lollipop and up, 5.0+, do not, so this is mostly only for old devices) Icon colors (including fully configurable green, amber, red, and black icons)<br>• (On most devices) Electric current (mA / milliamp /milliampere) reading to/from battery on supported devices<br>• Large (4x1) desktop widget<br>• Battery logging. You can log the battery state (charge, status, voltage, temperature) and browse the logs on the phone or export to CSV.<br>• Control the notification priority on Android 4.1+ (For example, you can set to &quot;minimum&quot; to hide the icon but keep the notification in the tray.)<br>• Lots of configurability of behavior and appearance.<br>• The charging indicator (the bolt under the number that indicates when the device is being charged) for the sets that have it is optional in the Pro version.<br><br>~~~~<br><br>Follow the Google Plus group for announcements and occasional polls about the app:<br><br>https://www.google.com/+BatterybotInfoAndroid<br><br>~~~~<br><br>A one-time purchase now gets you free updates for life on all your Android devices.<br><br>~~~~<br><br>All requested app permissions are explained on the project website.  On devices running Android 6.0 or newer, permissions are requested as needed and not used otherwise.<br><br>~~~~<br><br>Please email me if you have any questions or comments.<br><br>~~~~<br><br>Here&#39;s the BatteryBot business model / philosophy:<br><br>1) Ads are annoying. For some apps, ads might make sense, but a system utility should not have ads.<br><br>2) The free version should be simple but useful; it shouldn&#39;t feel crippled.<br><br>3) Some people choose to purchase the Pro version because they want extra features, some because they want more customization, and many because they just want to say &quot;thanks&quot; for the free version and support small, independent developers like myself.', 'summary': 'The open source, ad-free Battery Indicator you can trust.', 'summaryHTML': 'The open source, ad-free Battery Indicator you can trust.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.4060607, 'ratings': 6391, 'reviews': 2380, 'histogram': [348, 77, 464, 1239, 4260], 'price': 2.99, 'free': False, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Darshan Computing, LLC', 'developerId': '7867486008629611223', 'developerEmail': 'support@batterybot.info', 'developerWebsite': 'https://www.batterybot.info', 'developerAddress': '5838 NE Wygant St.\nPortland, OR 97218', 'privacyPolicy': 'https://www.batterybot.info/privacy', 'developerInternalID': '7867486008629611223', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/FvpbqO7YMQacMy7Nl-uoGmxyros74evS3IyTzYmP3TaVuSMn2ThL8Ny6akUvd_XkRRY', 'headerImage': 'https://lh3.googleusercontent.com/OZiWg3Aq0dijuV7z9-Jr7EritS8cT8B0U8b5m5Qp9417fuH7IaRoYZQguG_v-6kw8Cbg', 'screenshots': ['https://lh3.googleusercontent.com/XnJtGnA9jAHFrqECVJkFaiLDOTcGtIu6cNKJPRSa6-GHly8g5Z50BMJchvtPKVu5rMQ', 'https://lh3.googleusercontent.com/6O9PoNP7LOvSMGShjNzgH-91cY3jS3szxbJ7yvVYsiP-2b0ld4DMzqRj94SJIes0uZLe', 'https://lh3.googleusercontent.com/5ct1PPzmyN4s1Ll7QTbhvTaQVKka8AxVvg-ejVsnC7WLFh-mPOiztvczSPcOzvkrcw', 'https://lh3.googleusercontent.com/oJZ4lcJM8KOpWuTs50C086IZw7ktYTss5DHoalaecoCnIVwo1qRnLGI4kxZDnUk0QHXS', 'https://lh3.googleusercontent.com/GoEknHEpmqnWTRKaCaGzBX27l0u4LCtBBYJCsuTKWef5jplrrIQCcKZl27vM-7vWt_k', 'https://lh3.googleusercontent.com/sA1SYNwwxOlPvfy1MuvBXRStiDtq_91vm8auFEzyz-JK5mCDQKYvi7TPGmEAh5I5fcc', 'https://lh3.googleusercontent.com/0yB1tTDERmdOx5CtN0WrB1jKKf7MlxXpXRNl4-rD4To7wCb9Liy1qzyvaysOXIOC3Q', 'https://lh3.googleusercontent.com/qDZOs8ITmgsdCegC4brmgM-kpxp97_A6IkXi4qEiB5tV3bB9-7fv3jiLezypjAUy6GYw', 'https://lh3.googleusercontent.com/cIqNcIBeCAqTpGpxYF8R0WnQTLpTnhJ112QgAa4P0Ybn929IRhc7VhhuHmE4zSgDew', 'https://lh3.googleusercontent.com/UG2bH16O1VugcZyw6Q5GohBWmkuS2b1wc0xo0cp66s-04vvcGggpyNz_QEI1NqzR9XY', 'https://lh3.googleusercontent.com/wbszri1pNkcqltdJX94qTeQ761cBz8DHjSwmDOyaNkUbIiUnQXWIWiL4OuDcpe1zDg', 'https://lh3.googleusercontent.com/RICCKi92SZ-1d9wnSe9zf6NCJMtpPz8fWKKjUo_tOlcKDiPcNq8H4bYkukqBmomg2KQ', 'https://lh3.googleusercontent.com/2HBi3aeVR9HYSjl6hgGc_eFS1zDjQoSIRV0nFEFNr3LEqi9qkTxlPKvDKMfAaERkyA', 'https://lh3.googleusercontent.com/8PzT4NMF7S3Bqn9bcAYZzgE1c3gOjWqS-2KAMg8iB6KULQR3JQZm-Q1u_NeWWn8PYuo', 'https://lh3.googleusercontent.com/K1ZIxh50ass5hc0JS6k8GpYOcgKTGVc2T1lufRvCV7P7VETvW-12hRG5uW3wlt8nBP0', 'https://lh3.googleusercontent.com/6Eyaa095HnWg1aRHx7_vgbXrjcveZkjJpiF8pluWeMSTZH4LjQVdGtjVj7MHs5LKgItq', 'https://lh3.googleusercontent.com/ILb9Dgga5wM6MR7YNm-B_lNjjtH2_kqPmmSYcQJvqO2QBopaoqhA3Yb5bU66Pr_t'], 'video': 'https://www.youtube.com/embed/mBBAkgdRjFw?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/mBBAkgdRjFw/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': None, 'updated': 1566082098, 'version': 'Varies with device', 'recentChanges': '• Disabled notification badge by default for main channel.\r\n• Updated build tools.\r\n• Updated target audience.', 'recentChangesHTML': '• Disabled notification badge by default for main channel.<br>• Updated build tools.<br>• Updated target audience.', 'comments': ["The alarms were working on my LG G6 (Android 8.0) but now on this new device (One Plus 6t w/ Android 10) the alarm doesn't go off at all. I already set up the notifications but it's not working. Is this some Android 10 bug?", 'Disappointing. Cannot remove all battery icons from notification bar (if Batterybot icon is removed, app forces you to reinstate system icon). Reported battery life remaining is different depending on whether main app is viewed or the graph is viewed. Alarm useless - no sound, only silent notification bar message. Developer does not respond to queries. Cannot recommend.', 'Excellent app. However can you make this app remain at the extreme left end of the status bar? Otherwise it keeps dissappearing with more messages.', 'This app does does not show the battery capacity and also does not show the amount of charge it has used in mah. I think it would be good if the app could provide a detailed information about the power usage which are the mah,wh,etc. After paying for this app the developer should provide such information.', 'Nice but really wish there was an option for status change since full charge. Hate it when I plug phone in for 2 minutes just to copy and paste something that battery bot then starts the time unplugged all over again... Frustrating. Needs a time since full charge option.', "I had this app before and really liked it. I've always depended on it. I love the fact that it lets you know the temperature and health of the battery and that there's an alarm you can set if it goes too high. We were on a trip recently and I didn't realize when my phone was in my pouch that it was trying to take videos several times and it got very hot. This app should prevent this from happening again.", "I'm using galaxy S10+. I have set the alarm for full charge. In my old phone, I had the option to select long alarm tunes from the list as notification. The app on this phone allows me to select only notification tunes (not long alarm tunes). So it's hard to tell if I've received a message or a full charge alarm. When the purpose of setting the full charge alarm is to know from far away if the battery has charged fully and disconnect he charger, the current limitation ruins the whole idea.", 'Latest update has brpken the app. No percentage icon showing in top left hand side of phone. However, when the notification area is expanded battery bot shows up with just the percentage figure. To see the two lines of content you have to click on the down arrow.System default colour seems to think that it is white whereas it used to be black!! I have an htc 10 with android 8.0.0. Please fix.', "even if you dont want the extra features buy! this Pro Version instead of using BatteryBot - Free Version. Developer is 1'of Minority/Rare People who do for others! - Read his website. works on ASUS ZenPad 10 which for the most part really hates most utilities apps! ** edit 2: found out completely by accident you actually can shrink the 3x1 widget to 2x1 size! ** love your app.", 'After trying almost every battery widget and app on the play store and being bombarded with ads, I found this app! By far the best battery monitoring app and widget out there. It also includes multiple alarm types like an alert to let you know when the battery drops below _____% or an alery to let you know when the battery is fully charged. I do wish you could run multiple alerts at once though. Bonus that it is FOSS. Great app! Additional developer donation coming your way 😁', 'Used it for years. Paid for the pro version. But recently the battery icon does not show on the notification bar. Tried updating to the latest version of batterybot but still no joy. I need to open the app EVERY TIME for the icon to show up, after which it will disappear again. What is the point in that?', "I've had the paid version for a few years. it's been very reliable. I've monitored it with various battery usage apps and it never pops up as a consumer. its simple and effective. The dev is considerate and there are no permissions needed. i really like it", 'My opinion this is a great app. With this app you will never over charge your phone theory you can set a alarm the automatically let you know when your phone is George. I have used it on several of my phones.', "So far so good haven't used it for long. You really need to keep an eye on it until you fully understand how it works because it seems to use unnecessary apps and run your battery lean a lot.", 'Bought the pro version of this app years ago gives me the percentage no more no less I and huge on nattery life I got the Motorola Play 2 with the biggest mAh battery mod and in addition to the battery mod I got 3 external charging devices I can conservatively go about 2 weeks', 'Does what it says. Shows useful battery info. Good selection of widgets. No ads, no network access, no unnecessary privileges.', "I'd give it 5 stars but I can't allow notifications to my smart watch as it goes off on ‰ updates - every few seconds! Maybe it's a setting I haven't found yet.", "Paid for the pro version. Don't bother. Latest update removed the percentage from the top bar. I have to keep restarting the app. No support response either. Total waste of time!", "Was working fine until last update now I can't get my battery percentage in my notification bar. I have a galaxy s8+ on 8.0.0. Loved that feature please bring it back", 'Brilliant! Brought back coloured notification on my S9 Plus! A lot better to differentiate as with the other way I would have to look twice', 'really good app .. it does its job well.. so i paid and brought the pro version to help the developers for their hard work..', "I have to re-launch the app a couple times a day now just to see the battery percentage in my notification bar. Something's not right.", "Good to have battery status snd drain available. Wish could remove status bar icon though as it's too small to read and the widget is on the home screen anyway.", 'clean, straight forward, easy interface which uses laymans terms/ choices for tuning the battery use', "Doesn't work with Android 10, emailed the developer but no reply! Extremely poor support, given that I supported by actually buying the paid version!!", 'Very reliable app. Keeps me well informed on battery performance.', "Why haven't you refunded my money yet? I asked for my full refund purchase amount immediately after buying this dysfunctional app (within the 48 hour requirement), so why hasn't the transaction been reversed already? This has caused my account to be overdrawn, and now my bank has charged me $30.00 in overdraft fees for NSF!! AS YOU CAN EXPECT, I'M BEYOND PISSED ABOUT THIS, SO FIX THIS BLUNDER EXPEDITIOUSLY!!😠😠😠😠😠😠😠😠😠😠😠😠😠 UPDATE: THE DEVELOPER CORRECTED THE ERROR IMMEDIATELY!! TYSM...", 'Good app, using it from 2014. Please fix Unknown charging status while using fast charger', "Not working good in Android 10. Doesn't read same as system percentage. I have a oneplus 7 pro.", "The apps is owesome. I don't need no see my phone from time to timr if is already fully. I can charge my phone even I am sleeping.", 'Easy to use. Small file size. useful information.', "I paid for this app and some of the things on here don't work. Then I email the developer a few times and he still hasn't answered! Dont waste your money", "Since update. Widget won't keep info just shows XXXX", 'Paid for the pro app to show my support to open source app development. Great work!', 'I program. LG V2O on ATT. Battery percentage is already in status bar! Not sure I need ur app.', 'How do I change the alarm sound on Android 9? Is it even possible without changing my notification sound?', 'EXCELLENT BATTERY CHARGER INFO WITH IMPORTANT INFORMATION', 'just downloaded pro battery app, well done great job dev', "Great app I've been using forever!", 'The widget is back.... Excellent'], 'appId': 'com.darshancomputing.BatteryIndicatorPro', 'url': 'https://play.google.com/store/apps/details?id=com.darshancomputing.BatteryIndicatorPro&hl=en&gl=us'}
