{'title': 'BatteryBot Battery Indicator', 'description': 'BatteryBot Battery Indicator is the original battery indicator app for Android™, released in 2009 as simply "Battery Indicator."  Both the free and the Pro versions have maintained a 4.5+ star rating in Google Play from the beginning. It offers two modes: the original status bar indicator and now also a desktop widget.  You can use either or both, as you please.\r\n\r\nBatteryBot monitors and shows your battery charge level (percent) as an icon in your status bar, with how much time you have left, temperature, health, voltage, and time since plugged / unplugged in the notification area.  It now also has a 1x1 app widget. The Pro version also has user-configurable alarms, logs, mA current information, and a large (4x1) widget.\r\n\r\nGive it a try -- it\'s free and open source!  BatteryBot Battery Indicator requires NO special permissions whatsoever.  It\'s an excellent and complete solution to your battery needs.\r\n\r\nFeatures:\r\n\r\n• No ads (why would you want a battery app with ads?)\r\n• Exact battery level in the task bar\r\n• Or hide the task bar icon, keeping notification in tray — or turn notification off completely and just use widgets\r\n• Multiple icon set options\r\n• Automatic time-remaining estimates based on recent usage\r\n• Small (1x1) circle desktop widget\r\n• Notification (with status bar icon) is now optional -- can be used as just a desktop widget\r\n• Very lightweight (please email me if you think otherwise, and I\'ll help you figure out what\'s wrong — I promise this app will not drain your battery!)\r\n• Shows 1% increments even on most Motorola devices\r\n• Well-tested and supported on all major versions of Android (2.1 through 7.0; Eclair through Nougat) and form factors (small phones, medium phones, large phones, 7-inch tablets, 10-inch tablets).\r\n• Open source\r\n\r\nFor those who want more than is offered in the free version, or for those who just like to support small, independent developers like me, the Pro version remains lightweight while packing in many useful features:\r\n\r\nPro-only Features:\r\n\r\n• Alarms (fully charged, charge above X, charge below X, temperature above X, or health failure)\r\n• (On devices that allow it) Icon colors (including fully configurable green, amber, red, and black icons)\r\n• (On most devices) Electric current (mA / milliamp /milliampere) reading to/from battery on supported devices\r\n• Large (4x1) desktop widgets\r\n• Battery logging. You can log the battery state (charge, status, voltage, temperature) and browse the logs on the phone or export to CSV.\r\n• Control the notification priority on Android 4.1+ (For example, you can set to "minimum" to hide the icon but keep the notification in the tray.)\r\n• Lots of configurability of behavior and appearance.\r\n• The charging indicator (the bolt under the number that indicates when the device is being charged) for the sets that have it is optional in the Pro version.\r\n\r\n~~~~\r\n\r\nFollow the Google Plus group for announcements and occasional polls about the app:\r\n\r\nhttps://www.google.com/+BatterybotInfoAndroid\r\n\r\n~~~~\r\n\r\nRequires no special app permissions!\r\n\r\n~~~~\r\n\r\nPlease email me if you have any questions or comments.\r\n\r\n~~~~\r\n\r\nHere\'s the BatteryBot business model / philosophy:\r\n\r\n1) Ads are annoying. For some apps, ads might make sense, but a system utility should not have ads.\r\n\r\n2) The free version should be simple but useful; it shouldn\'t feel crippled.\r\n\r\n3) Some people choose to purchase the Pro version because they want extra features, some because they want more customization, and many because they just want to say "thanks" for the free version and support small, independent developers like me.', 'descriptionHTML': 'BatteryBot Battery Indicator is the original battery indicator app for Android™, released in 2009 as simply &quot;Battery Indicator.&quot;  Both the free and the Pro versions have maintained a 4.5+ star rating in Google Play from the beginning. It offers two modes: the original status bar indicator and now also a desktop widget.  You can use either or both, as you please.<br><br>BatteryBot monitors and shows your battery charge level (percent) as an icon in your status bar, with how much time you have left, temperature, health, voltage, and time since plugged / unplugged in the notification area.  It now also has a 1x1 app widget. The Pro version also has user-configurable alarms, logs, mA current information, and a large (4x1) widget.<br><br>Give it a try -- it&#39;s free and open source!  BatteryBot Battery Indicator requires NO special permissions whatsoever.  It&#39;s an excellent and complete solution to your battery needs.<br><br>Features:<br><br>• No ads (why would you want a battery app with ads?)<br>• Exact battery level in the task bar<br>• Or hide the task bar icon, keeping notification in tray — or turn notification off completely and just use widgets<br>• Multiple icon set options<br>• Automatic time-remaining estimates based on recent usage<br>• Small (1x1) circle desktop widget<br>• Notification (with status bar icon) is now optional -- can be used as just a desktop widget<br>• Very lightweight (please email me if you think otherwise, and I&#39;ll help you figure out what&#39;s wrong — I promise this app will not drain your battery!)<br>• Shows 1% increments even on most Motorola devices<br>• Well-tested and supported on all major versions of Android (2.1 through 7.0; Eclair through Nougat) and form factors (small phones, medium phones, large phones, 7-inch tablets, 10-inch tablets).<br>• Open source<br><br>For those who want more than is offered in the free version, or for those who just like to support small, independent developers like me, the Pro version remains lightweight while packing in many useful features:<br><br>Pro-only Features:<br><br>• Alarms (fully charged, charge above X, charge below X, temperature above X, or health failure)<br>• (On devices that allow it) Icon colors (including fully configurable green, amber, red, and black icons)<br>• (On most devices) Electric current (mA / milliamp /milliampere) reading to/from battery on supported devices<br>• Large (4x1) desktop widgets<br>• Battery logging. You can log the battery state (charge, status, voltage, temperature) and browse the logs on the phone or export to CSV.<br>• Control the notification priority on Android 4.1+ (For example, you can set to &quot;minimum&quot; to hide the icon but keep the notification in the tray.)<br>• Lots of configurability of behavior and appearance.<br>• The charging indicator (the bolt under the number that indicates when the device is being charged) for the sets that have it is optional in the Pro version.<br><br>~~~~<br><br>Follow the Google Plus group for announcements and occasional polls about the app:<br><br>https://www.google.com/+BatterybotInfoAndroid<br><br>~~~~<br><br>Requires no special app permissions!<br><br>~~~~<br><br>Please email me if you have any questions or comments.<br><br>~~~~<br><br>Here&#39;s the BatteryBot business model / philosophy:<br><br>1) Ads are annoying. For some apps, ads might make sense, but a system utility should not have ads.<br><br>2) The free version should be simple but useful; it shouldn&#39;t feel crippled.<br><br>3) Some people choose to purchase the Pro version because they want extra features, some because they want more customization, and many because they just want to say &quot;thanks&quot; for the free version and support small, independent developers like me.', 'summary': 'The open source, ad-free Battery Indicator you can trust.', 'summaryHTML': 'The open source, ad-free Battery Indicator you can trust.', 'installs': '5,000,000+', 'minInstalls': 5000000, 'score': 4.338627, 'ratings': 58207, 'reviews': 15522, 'histogram': [3995, 1490, 4860, 8319, 39540], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.4M', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Darshan Computing, LLC', 'developerId': '7867486008629611223', 'developerEmail': 'support@batterybot.info', 'developerWebsite': 'https://www.batterybot.info', 'developerAddress': '5838 NE Wygant St.\nPortland, OR 97218', 'privacyPolicy': 'https://www.batterybot.info/privacy', 'developerInternalID': '7867486008629611223', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/ef9Nuoq6MUIC0Uzmo-wJ8Yfbv6Pn9pXcDLR50IXh8lHSDHCPJQrBsSAxH0jXS4t4Noib', 'headerImage': 'https://lh3.googleusercontent.com/2BVO93ppxq-uIFOHM5jWGoEcJP4ahiOufU1wcjK6iVKTvbyzOQwmtYp-NS83mgOloAc', 'screenshots': ['https://lh3.googleusercontent.com/gXiyVCDM2Bm-Hko3WBg1KL5y0l7hjQ2boAfxXJDtD_lJpRg923D34SsmVTvIxNIVelU', 'https://lh3.googleusercontent.com/LtnQaZGBSuUpFgxCQVg8q-KpAHx0137R6NzKVfHeRt2upKhhQDsK5NrkOhjyZlqtL9k', 'https://lh3.googleusercontent.com/KuupCVGl-C3xdo581AILq8H0m43jxOW0uL40_TR1bqQMihBVC_2oRCpvDKDOir3gaSmn', 'https://lh3.googleusercontent.com/w9LBAlM9cSESo37_ZDsCF_-47MldDs8zUeYjwDLgIxiwjPV9hPYCYV25COMGxc3ml_4', 'https://lh3.googleusercontent.com/u9r_sZo3GtdMIM6V4SV0njXs08Kji5gCn3NuxIR1KrqEGI2nTn-qWhGV1wXrsm2NHg', 'https://lh3.googleusercontent.com/CUZl9h_zFmwkHxdJ8LihEHUkFvZwlPLmuwtj_51qOrINcdsjbZcA6_Fve-jg8VrnhLQ', 'https://lh3.googleusercontent.com/6nUyQZQxU7PndXLhGA646hwgGcxiWeeCzP-PuDR9zfjj0CkJ7OhaV28hqsO_c26dilk', 'https://lh3.googleusercontent.com/DDfS23RwwxfrVl34r3OOB-gBMri1jkMI90XLJRXRDi5P0qBfhaDWAUcNACHmlWKUzwo', 'https://lh3.googleusercontent.com/V0wvgZkhAkawIFJzQHunvcBv1-g3y0-n4HekRo8sDrxcvuiSlhBO4tgj0K6ffBzmqcvO', 'https://lh3.googleusercontent.com/c3z3FJPOzS9Ibav-gYzykJj0gt4bgsQa7Y3c3OzsJqZMg9AdXXxIgJOoxZST9Bm-GQ', 'https://lh3.googleusercontent.com/RlKyulsZB03WGfxweA6Nm7nTfoIgAxsHg97gfmiqbPVRDmf2ZRKjIp7eackQJd7HWSo', 'https://lh3.googleusercontent.com/chxedCM0EQXhGo7uBZ8dzsCxyM-qch7vTRYNbHVvCUTuc-UlZ9kq0dylPF15wNpMGww'], 'video': 'https://www.youtube.com/embed/xJrSj30A7vo?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/xJrSj30A7vo/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': None, 'updated': 1566082517, 'version': 'Varies with device', 'recentChanges': '• Disabled notification badge by default for main channel.\r\n• Updated build tools.\r\n• Updated target audience.', 'recentChangesHTML': '• Disabled notification badge by default for main channel.<br>• Updated build tools.<br>• Updated target audience.', 'comments': ["Has been immensely useful to me when Power Shade wasn't working perfectly, despite showing some information I don't care about (probably estimates of health, temperature and voltage and an estimate of use time left)", "I like it except for the fact it doesn't update unless I click on the icon. Maybe it does if I paid for pro but not much use as it is now.", 'Ok. I really like the app,. Easy to use and to understand. Even for me. I can barely remember how to get my email.', 'Please allow the option to disable the battery meter at the top of the screen because some phones already have this option. And it is redundant to have this notification twice. Also, the older version allowed you the option to disable this feature. Please bring it back. You can turn off the main notification Channel but then you not only turn off the battery indicator in the notification bar, but you no longer get information in the notification panel about battery temp and remaining power.', 'Very useful. Works well. Tested on my Samsung J5pro.', 'Once used a long years ago. Not bad if you make widget more customizable. For instance choice of removing pertencate sign %, even the circle. Changing color according to battery levels and charging or charged statu.', 'Absolutely the best battery indicator. NO ADS,and it shows clearly the application that drain your battery.', "Lite no on-screen display why can't I see the battery level on the screen that's the whole purpose of this thing", "Nice that it shows how long until battery is fully charged. I like the look. No ads is the plus I wanted. This kind of app/widget shouldn't have ads. Simple, clean, uncluttered, and has more stuff if you want it for a reasonable price. Excellent work.", "The notification can be denied by Android settings but it still shows app is running in background. Not for previous version though. I was able to disable in bot's settings itself. Rest is ok, I am conscious weather it uses lot of power and processing running in background even after closing.", "Ad Free. Easy to read display. Never crashes. Well designed. Very useful! Hidden when needed, easy to go full screen quickly. Small % indicator on Lock Screen so battery remaining won't require unlock to ascertain. Wish all apps designed like this. Using Samsung 8+.", 'Excellent replacement for my phone (Umidigi) which has no on screen battery check, (ie) you have to pull down from top to see anything, but this app enables a widgit which I can see at a glance, also all the info I need to see like charging indicator & how long to full charge by pressing widgit, well done developers 10 stars.', "It's a nice application, indicating the battery percentage. It indicates the charging, the timing at present taking for the charge and the time to be taken for the remaining charge. A very very useful application. Thanks to the developer as well as Google for this beautiful app.", "The app does everything I needed to do. tells me battery usage how long it'll last the battery love it. And home screen widget looks GREAT!", 'Not accurate when it comes to showing the time . My phone is 90% the time indicator is 10hours and when it is 70% the time is 15hours.🤔🤔🤔...but still usefull', "I like it it useful but it has a somewhat annoying bug which continously make my phone think it's a notification. When the sound is on for notification it just plays the notification sound constantly. Could you guys fix it?", 'Excellent. Works exactly as advertised. No surprises at all. Highly recommended.', 'extremely good free battery utility app! ** I advise anyone however to buy Pro Version of this app even if you can do without the extra features as Developer deserves a £2.79 purchase of his app! ** works on my hostile tablet.', "great handy and simple to use app. I like the simple widget design, better than using phone's default battery meter in the notification section.", "Widget has stopped working with recent updates... Keep seeing XX% in the widget. Could you fix, I rely heavily on this and will need to find something else if this isn't fixed soon.", "I've been using this app for years and I've always found it to be reliable. Best of all it's open source and ad-free which is a GOOD THING. Plus it supports Android Pie which is great.", 'Nice widget, but not very accurate for time left to full change.', "It's ok. It used to show apps battery usage, but now just defaults to what your phone says (in pixels case this is useless). Other than that it's just for the battery percentage.", 'Working well on my Note 8 showing battery percentage, temperature etc. Although I was looking for an app measuring BT device. Anyway it is a good app but not what I was looking for.', "Updated to the latest but now unable to turn off the notification bar where there used to be an option to turn it off. Noted the developer's response to other user but still can't find how to minimise or turn it off in the latest version", "Latest version is not good. You have to manually close the app in order to make the notification icon disappear. Dev's instructions don't work. Please fix it.", "This doesn't work with bluetooth speakers.", 'Handy app to keep the battery use in check, and the battery status on top, is usefull for a quick check.', 'love this, it does charge quick. and I love how it shows you how much time it has left to charge..', 'A great app excellent information volts/battery/charge time to full. Very accurate. Also battery temperature. 🤗😍🤔', 'Phone says 2h 18m till full charged with old charger where BatteryBot says 1h 3 mins. When i use my fast charger the phone says 58 mins but batterybot says 1h 3m. I only use the app as it shows percentage remaining as a widget.', "Very tiny and useful. I couldn't find any other app that shows time since last charge. But this shows that info and the widget looks cool", "BatteryBot: Simple, clean, functional. Been using it for years, it's always rock solid.", "The app is so great and have everything I want but when I installed android 9 it stopped showing the battery usage and it can't even show it it just shows %XX", 'Just what I needed, works like a charm and takes minimum amount of RAM.', 'It does not update its info in notifications in regular intervals. Pls add the option to update its info in regular intervals. Tnx', "Works very well and let's you see in an instant the battery status and it's usage.", "BatteryBot does all that it's required to do no problem, excellent app.", 'before i instal this app, 1% of battery for 30mim standby... but after i instal this app, 2% only for 25min... this app drained my battery... after i uninstal its normal again 1% can power up my phone until 30min...', "Fixed now, thank you, it's the best battery widget! :-)"], 'appId': 'com.darshancomputing.BatteryIndicator', 'url': 'https://play.google.com/store/apps/details?id=com.darshancomputing.BatteryIndicator&hl=en&gl=us'}
