{'title': 'Convert Units', 'description': "Utility for converting over 100 various units of measurement (distance, area, volume, mass, temperature, and many others). Whether it's the simplest conversions, or some of the most obscure, this tiny yet powerful app has you covered.  For your most often-used conversions, the app supports placing a Widget on your home screen!", 'descriptionHTML': 'Utility for converting over 100 various units of measurement (distance, area, volume, mass, temperature, and many others). Whether it&#39;s the simplest conversions, or some of the most obscure, this tiny yet powerful app has you covered.  For your most often-used conversions, the app supports placing a Widget on your home screen!', 'summary': 'Unit conversion tool, with optional home screen widget.', 'summaryHTML': 'Unit conversion tool, with optional home screen widget.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.51, 'ratings': 1213, 'reviews': 255, 'histogram': [72, 24, 60, 109, 946], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.9M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Defiant Technologies, LLC', 'developerId': 'Defiant+Technologies,+LLC', 'developerEmail': 'info@defianttech.com', 'developerWebsite': 'http://defianttech.com', 'developerAddress': 'P.O. Box 550066\nNorth Waltham, MA 02455', 'privacyPolicy': None, 'developerInternalID': '6499607374293460775', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/hAmLUfJn14sTPZudcoaLZOeJiT-HyTsHtxd-DCc9WRXTvojzO7G7hfxbknQMv7hQ19w', 'headerImage': 'https://lh3.googleusercontent.com/SmRMuhYSBZGTzyeIyY5vkaGn63Hsp3XuRlD28di5JXvqdLxhaxoQBmqx0kaFpAldYXL1', 'screenshots': ['https://lh3.googleusercontent.com/Z9pChc4Ko-gaHBsYBPBsU2QEEiocdIMTHRuyNmesKYrbW2vBq_clEoLBehpVu64IC18', 'https://lh3.googleusercontent.com/i4rPCWdDX8_wH3bdFO5i9NdMXDd7pJMADnbsjIcgQVQdvZzIEmqhcFDKbo_mVSzDtw', 'https://lh3.googleusercontent.com/oInicyx4K-2Sotxn7M9iRVmOKTsGGKMvK0PBitV7QOr5LQ7IiT8gFJFZhJAfK3mFZws', 'https://lh3.googleusercontent.com/-K0RuzcEkHLdcF3xOM0kfAV2zgjKePU5KM1yMOr2lN09nSXPSpZY74kY3s-yCUL67AA', 'https://lh3.googleusercontent.com/8RlA_WBxJvs1CgagLuMAg10J0kAUrNJy-AKvo0i6JK6V-g0g3SRCacej6YqnumiLvF4', 'https://lh3.googleusercontent.com/uaflsiwLTTlxVLatSJGxZ3-kA0EePOLXvq1BuNJaCHbX9_fGEQseGFy-t-3NAEg75g', 'https://lh3.googleusercontent.com/IrpyKlBHwLI2e8hieyCxAjE7jWtIUppDl7K2_Y0eFsPPosajsrdTwCColuPz4p-FAg', 'https://lh3.googleusercontent.com/IOpHRYViSasvMlvddjQeOoZHSk4g3o8MgRo1sbKHgYtIFg57h5pOpbmJRNUSvbFUS2Qj', 'https://lh3.googleusercontent.com/l4d8Mzzi7KqTuawoXFj2Dno0lN92U2dgVDeErkgyNUm3__xRxRfQ9EP9XcDfxZx-JA'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 31, 2010', 'updated': 1581284526, 'version': '1.0-2020-02-09', 'recentChanges': '- Minor enhancements, support for Android 10.', 'recentChangesHTML': '- Minor enhancements, support for Android 10.', 'comments': ["Been using this app for quite a while now and love it. Works very well and covers so many criteria!! What got me to write a review is the recent discovery of the sense of humor that the developer has....don't know how long that particular unit of measurement in the mass and weight categories has been there but I almost spit out my Coffee....love it!!", 'Brilliant, logical and intuative user interface. I love it and have discarded all other converters, even those awkward ones I paid for. Highly recommended app.', 'Is there any way to give it 6 stars? Always been fast and no ads or nags. They made an interface change a bit ago that made it more familiar, but also slower for some people and then they fixed that. What a powerful app.', 'It has most measures that I know. However it is missing some construction measures. ie. A square as mesured for roofing material.', 'Easy to use and comprehensive', 'Very useful. Clouding all units', 'Does what I need', 'not just perfectly executed, but it has hard to find units, too. (Would be fun to have one colloquial unit at the bottom of Every list... )', 'bout', 'Extent', 'Freaking awesome app. A life saver more than once.', 'Great app. Only one thing needs to be corrected and that is the spelling of \nthe metric volume unit. It is spelt "Litre" and not "liter"', 'I use this often at work to do conversions.  It does what I need it to do and it has for years.', 'Clean and functional!!!  No BS permissions.  No ads.  Thank you.', "I absolutely love this app! Through the four phones I've gone through in the past years, I've installed this conversion app on every one.  It has no problems that I've found, and it's extremely handy to convert just about anything.  It's even got measurements people use as an exaggeration (****-tons, etc.), which is both hilarious and awesome.  The only thing I'd suggest is currencies, which I've heard that other apps have.   If you guys could add that, I'd give you a virtual ten stars :) !", 'This is one of the more handy tools that I have on my phone. I also wanted to congratulate the developers on making me burst out laughing out loud in the middle of a restaurant when I discovered one of the weight measurements it could convert.', "This has been such a handy app over the years. It's especially great when using recipes with Imperial units but living where groceries are all labeled in metric.", "Edit: I hadn't noticed that this calculator is also useful in the kitchen as well as at work. UI is a little clunky, but otherwise efficient.", 'Very convenient unit converter & mainly has widget. But widget needs a tool/small keyboard of numbers & with decimal point to enter big values & fractional numbers, say 145.35', 'Laughed out loud with​ the addition of the new "units" in weight! One suggestion, add a decimal to fraction conversion​', "Best conversion app out there. Had it for a while now. I've always been curious what the conversion of a** load to pounds was. Now I know. Awesome. Never ditch that.  A must download.", 'Excellent, no ads, no permissions required!', 'Super amazing! Just what I want!', 'Comes in handy for the physics classes. Thanks!', 'Works great. No troubles.', 'Fantastic job! So useful. Thank you!', "I'm particularly fond of the fact my daughter now believes the last two mass measurement categories are genuinely legitimate because they're on the convertor.   Cheers", "A great free no ads app, customizable!!! - no need to see units I don't use.", 'Simple and best one.', 'This is the best converter in the Playstore. Beats all the others in simplicity of use and minimum number of steps. No permissions, no ads, small footprint. Developer very responsive - thanks for the Imp volumes.', 'I like the option of hiding unrequired units and the inclusion of flow rates. Also conversions for all units are displayed on one screen,  which is most useful.', 'Just what I was looking for', "Missing search. If I know the unit name, but don't want to look for the correct category, there's no way to search for it.", 'V nice app... They should have option to define custom unit conversion...  and there must be a search option too. ...', 'App does its job perfectly, does not need or ask for any suspicious permissions and has no ads! Definitely recommended', '10 stars. . Excellent app ever.', 'After the update this is the best app available for conversions!', "Where's imperial gallons?", 'Ok', 'very useful!'], 'appId': 'com.defianttech.convertme', 'url': 'https://play.google.com/store/apps/details?id=com.defianttech.convertme&hl=en&gl=us'}
