{'title': 'MQTT Client', 'description': "Connect to any MQTT v3.1 broker and subscribe to topics. Perform Tasker actions on message publish or publish messages on tasker events. The app still might be rough around the edges. Would be releasing the code soon on github so that the development could continue over there.\r\n\r\n\r\nTasker Integration works as follows:\r\n\r\n-To publish messages from tasker simply create a action in tasker. The configuration is pretty simple. You may use tasker variables in topic and message.\r\n-To perform action whenever a message is received. Create a event in tasker from the plugin. In the tasker configuration screen, there'll be a topics drop-down and topic variable name field and message variable name field. The drop-down will have topics subscribed. In the topic variable name field, you can add any string in lowercase characters. Same for message variable name field. Now, whenever a message is pulblished on selected topic, two tasker local variable will be created with the names as entered in the textbox for the published topic and published message.\r\n\r\n-Multiple Brokers\r\n-Websockets Support!\r\n-Add/Remove topics easily!\r\n-Messages are automatically saved!\r\n-SSL support\r\n-Publish Messages\r\n-Support any app that supports locale SDK\r\n\r\nGithub URL : https://github.com/dc297/mqttclpro\r\n\r\nPlease report issues on github\r\n\r\nFeedback is highly appreciated!", 'descriptionHTML': 'Connect to any MQTT v3.1 broker and subscribe to topics. Perform Tasker actions on message publish or publish messages on tasker events. The app still might be rough around the edges. Would be releasing the code soon on github so that the development could continue over there.<br><br><br>Tasker Integration works as follows:<br><br>-To publish messages from tasker simply create a action in tasker. The configuration is pretty simple. You may use tasker variables in topic and message.<br>-To perform action whenever a message is received. Create a event in tasker from the plugin. In the tasker configuration screen, there&#39;ll be a topics drop-down and topic variable name field and message variable name field. The drop-down will have topics subscribed. In the topic variable name field, you can add any string in lowercase characters. Same for message variable name field. Now, whenever a message is pulblished on selected topic, two tasker local variable will be created with the names as entered in the textbox for the published topic and published message.<br><br>-Multiple Brokers<br>-Websockets Support!<br>-Add/Remove topics easily!<br>-Messages are automatically saved!<br>-SSL support<br>-Publish Messages<br>-Support any app that supports locale SDK<br><br>Github URL : https://github.com/dc297/mqttclpro<br><br>Please report issues on github<br><br>Feedback is highly appreciated!', 'summary': 'With This app you can monitor your MQTT network and perform actions with tasker.', 'summaryHTML': 'With This app you can monitor your MQTT network and perform actions with tasker.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.77, 'ratings': 160, 'reviews': 101, 'histogram': [22, 8, 32, 19, 78], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '4.8M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Webneurons', 'developerId': 'Webneurons', 'developerEmail': 'deepeshch2k9@gmail.com', 'developerWebsite': None, 'developerAddress': 'H. No 19-A/4, New Colony\nPalwal\nHaryana - 121102\nIndia', 'privacyPolicy': None, 'developerInternalID': '4901326461086317274', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/3581mHcvVT3ZRznj-f6y2gdFwvy4PSaWmRSufPo8e0VSi5X2wno7PC8z6O4F3g_8eQ', 'headerImage': 'https://lh3.googleusercontent.com/yYeYvnBuQc5_23xDSRxkkMAvSTIs7zY6f4KDUWOlMVcVI8o_-qEnM2gGZZIW6jGdGg', 'screenshots': ['https://lh3.googleusercontent.com/nx4cM_ob9Qp1Ij7oaBI9b3GMGTbLf780Hl06WksASIKIP8SZ6-necPJMMmH442FbMVOs', 'https://lh3.googleusercontent.com/CuAnFZEVzZcdCmgMOzD0ApCN9EaH8G7k9eO2_FEwY1LNIBzpNNhh-lRNzjnP_tiWDA', 'https://lh3.googleusercontent.com/vYwpKBBbXQdoglVmaBS7CQVpIg6L3cjwDjXJ9MSWs_s85nq1fkdAV0BEyFvSIKIo2Q', 'https://lh3.googleusercontent.com/N4dVUCbZ2RjGqInryC0--WA7Oi8Axv7N9VhbdBCOdh1b3-C9t_jzAfTD8dOcrCtnVrI', 'https://lh3.googleusercontent.com/nGv7X6r0TgzBfWKuecT10YcD-SqppwUwB0dd20ydg_8ESjw5zswZ9Jrq2bRJHWk1mS0', 'https://lh3.googleusercontent.com/TvpZPYNzMm-q90tZIKuJuQRfXDDLMvIyEp9e2GMOChSD3fZmqCWmsh1bwCodt-TPHnk', 'https://lh3.googleusercontent.com/u4vpvraA4sy_vHDSk9itGdkmntu19gArRZuaBCuXqTV1g9MoUokuYO-0uJcFU4o89nk', 'https://lh3.googleusercontent.com/0tsahlUltwQiHfSPvJ19MhdD3jDRLlV5R90NTx2a_QUyx_tWEAuVZ7CUooIFPuxWI5Zv'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': True, 'containsAds': True, 'released': 'Nov 23, 2016', 'updated': 1547677003, 'version': '4.5.1', 'recentChanges': 'Fix a bug with Android Pie', 'recentChangesHTML': 'Fix a bug with Android Pie', 'comments': ['For those struggling after a few hours of troubleshooting I finally found that when I create tasks on my phone with tjis mqtt then import it back to my tablet. You need to go all the way in to the configuration then save with the floppy icon to resync it with this client eventhough all settings are correct it needs double confirmation?', 'Most days I keep getting "failed to connect to ssl://..." "next connect scheduled at ". It\'s a shame because this makes it unusable because by the time the messages get to the broker a few hours or a day later the messages are out of date. Any ideas how to resolve appreciated. I really want to use this to it\'s full potential with Tasker and Home Assistant.', "I'm only using this for simple topic subscription mesages - it works very well for that. It's not clear to me what the 'Enable' switch on the broker screen is doing - the subscription topic keeps receiving messages regardless of the Enable switch state. Also, I don't see a way to disconnect from the broker, apart from killing the App.", 'While this app is great and does exactly as I need (using Tasker to communicate with both ways with an MQTT server), it sure does hog the battery. This is the main battery drain on my phone. It can easily use 20%+ in a 24 hour period', 'Great app, i think the old interface was better, i uninstalled this because THE APP IS BATTERY CONSUMING, Before installing it my battery would last a full day, after installing i had to charge three times a day, after uninstalling the battery lasts again full day', 'Simple app to receive and store all mqtt messages. Thank you.', "it does what is promised, but it absolutely kills my battery life. i tried increasing the keep alive time, but then it doesn't send messages. i wish it would only connect when j send a tasker command", "Client refuses to remain connected for any real length of time. Reconnect function in Tasker doesn't even attempt to reconnect; I have to launch this app, pull up the broker settings and click save before it will reconnect.", 'Thanks a lot for such a usefull application. You saved my day ! It is also very much helpful that you shared git repo. Thanks again. Will surely recommend my dev team to use this tool. Also i have my finger tip on that donate option. Keep it up ! PS : plz write some blog on this, targetting beginners. If already, then share with us.', "When I enable mqtt3.1, the protocol didn't switch to mqtt. It continue trying to use tcp to connect to the broker.", 'Works great! Would be nice if there was an option to get rid of the ads, I hate ads.', 'Not stable connection to local network broker. I use rpi and mosquito to receive messages in automate. Not recommended', 'I would like to see topic/broker sync across multiple devices.', "Great app, but i can't quit it? The client keeps running, is there a way to really quit it?", 'Unable to add host', 'Best app for testing mqtt client connections', 'Lets me send variables, which i think the other plug in can not. Thanks!', 'Does what It says, simple and effective', 'pretty helpful in development', 'works, basic. Try mqtt dash', 'Does what it is supposed.', 'How to publish?', "4.4.6 Fixed the issue with the app randomly closing. Now it works perfectly \nlike it used to. Not a fan of donating to remove ads (prefer paid version \nor paid license), but happy there's an option to remove ads either way.", 'Is it possible remove ads?', "This seems to do fine for a few days (posting once per hour via tasker) but then seems to stop. I have to manually open the MQTT Client app up and then everything kicks in again. It's a bit annoying. Am I missing a setting or something?", "Like others have said. This app is great when it works but after a few days it disconnects and stops working. If you switch to the app when this happens it has a status of reconnecting. Sometimes it will then reconnect and start working again but sometimes it get's stuck on reconnecting and the only way to fix it is to kill the app and open it again. It's such a shame because it has the perfect mix of functionality and the tasker integration is great.", 'Great app but is easy to clog up with all the messages that mqtt sensors \nsend and after a while begins freezing. Removing user data was my only \noption I had so many messages. @Webneurons / dev please consider setting \nmaximum messages to 10000 or so by default rather than starting on \nunlimited. I will set mine low now and I reckon that will sort out the \nfreezing issues.', 'Earlier versions of the program had some problems, but the newer version has been working perfectly for me. The Tasker integration is wonderful.', "Tried all the combinations but it just says invalid host or port or nick name I don't know what to do !!!!", '"Something is wrong with host or nickname or password or client id" why \ndont just i dont know what have I created. Not working with adafruit io \nwith android nougat', "The app keeps getting stuck in a lost connection / reconnected loop. Not sure I'll be able to use it, doesn't seem stable enough.", 'Perfect one !!- I guess this is the only plugin at this point in time (may be my ignorance which does subscribe functionality also!Meets most of the protocol aspects(be it authentication or encyption ) Well done', "I am unable to add certificate's. When I browse folder in the mobile, it \nshows me empty folder.. please help", 'Stupid thing cant even detect CA files', 'I am very thankful for this app. It makes the integration of tasker into my \nsystem so much easier. Many thanks', "Doesn't work", 'Nice', "Giving 5 stars as it's the only Tasker implementation and fairly well designed.  Problem below has been fixed, excellent work, very responsive developer.  ***Fixed***Unfortunately client seems to disconnect quite a bit and will only reconnect when changing a setting of the connection, changing it back, and then trying again.", 'Love this app, cant wait for notifications!', 'Maybe working with Tasker, needs more tests'], 'appId': 'in.dc297.mqttclpro', 'url': 'https://play.google.com/store/apps/details?id=in.dc297.mqttclpro&hl=en&gl=us'}
