{'title': 'Daily Money', 'description': '*↓↓↓Please read this note↓↓↓*\r\n*Because of a policy issue, this app is going to be deprecated, the new one is at \r\nhttps://play.google.com/store/apps/details?id=com.colaorange.dailymoney\r\nor search Daily Money+ *\r\n\r\nA simple & easy financial application\r\n\r\nFeatures:\r\n * Record your daily expense, income, asset and liability.\r\n * Multiple books for different currency or whatever.\r\n * Hierarchical and Customizable Account\r\n * Calculate balance of money.\r\n * Data backup and restore.\r\n * Export/Import to CSV.\r\n * Balance pie chart & time chart.\r\n * Password protection.\r\n==\r\nKW : daily, money, expense, tracker', 'descriptionHTML': '*↓↓↓Please read this note↓↓↓*<br>*Because of a policy issue, this app is going to be deprecated, the new one is at <br>https://play.google.com/store/apps/details?id=com.colaorange.dailymoney<br>or search Daily Money+ *<br><br>A simple &amp; easy financial application<br><br>Features:<br> * Record your daily expense, income, asset and liability.<br> * Multiple books for different currency or whatever.<br> * Hierarchical and Customizable Account<br> * Calculate balance of money.<br> * Data backup and restore.<br> * Export/Import to CSV.<br> * Balance pie chart &amp; time chart.<br> * Password protection.<br>==<br>KW : daily, money, expense, tracker', 'summary': 'Daily Money, free and open source, daily expense tracker', 'summaryHTML': 'Daily Money, free and open source, daily expense tracker', 'installs': '500,000+', 'minInstalls': 500000, 'score': 4.5887446, 'ratings': 6447, 'reviews': 2547, 'histogram': [167, 27, 307, 1283, 4660], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.6M', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'Cola Orange Studio', 'developerId': 'Cola+Orange+Studio', 'developerEmail': 'cola.orange@gmail.com', 'developerWebsite': 'https://www.facebook.com/co.daily.money', 'developerAddress': '5F., No.5, Aly. 2, Ln. 33, Dingyong St., Sanmin Dist., Kaohsiung City 807, Taiwan', 'privacyPolicy': None, 'developerInternalID': '5526742223735269382', 'genre': 'Finance', 'genreId': 'FINANCE', 'icon': 'https://lh3.googleusercontent.com/cHjPMCf9PNiuB7hV7FyiLsuWnF2Zk7t__4pS7OuwdnvpLAzhkbl12iLhl-19GKeekA', 'headerImage': 'https://lh3.googleusercontent.com/Ni0R3-jLky8PasxFc6oNbR2imu-j0zQhmuktpbyNy06uUeADP8e9CXG24pJW0d2t4Zs', 'screenshots': ['https://lh3.googleusercontent.com/5b7V6c7yrm8RiPxEWTeEpuinmobtTCpLVaXGA4JvulHewWMTKU2_WKVCsxTIL89SbSKD', 'https://lh3.googleusercontent.com/rWH3f6ULz2rZZH1BJRKJRTtbV7GQmMoAU7GlNUxy1gE-s6Lxi-ushvL3LkWsAo1Ahg', 'https://lh3.googleusercontent.com/j84Ii5s07PhcPm0N_wgpb91hP8bpsMZhQN_DoxhA1KQMhepH3O0LBlA1yRP1i2s5UnQ', 'https://lh3.googleusercontent.com/9WcaMdIV4c-ZGvURzVNnflidmIQ58Mksj-KaV4KgdKFCExLJrj7Vo-mDYABvjCAgXps', 'https://lh3.googleusercontent.com/VRNcwsiuwj1n_NCvRfERPj01ZgDOPx8BMxF6JsrPIdh22-sIOBxgGXqhNapY4kfsc8M', 'https://lh3.googleusercontent.com/RculIzbggPK07GetURMV_tDzDL50d2_IfTjpt7KnMR9btR56_CRnYA7bF6b1gztFcfM'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 10, 2011', 'updated': 1525603123, 'version': '0.9.8-dep', 'recentChanges': 'Install new Daily Money+ at:\r\nhttps://play.google.com/store/apps/details?id=com.colaorange.dailymoney\r\nIf you have old DM, remember to *backup your data *, and restore them in Daily Money+\r\n*Backup in the old app, Restore in the new app carefully*', 'recentChangesHTML': 'Install new Daily Money+ at:<br>https://play.google.com/store/apps/details?id=com.colaorange.dailymoney<br>If you have old DM, remember to *backup your data *, and restore them in Daily Money+<br>*Backup in the old app, Restore in the new app carefully*', 'comments': ['Easy to use & very useful app. Keep up the good work!', 'Best daily account keeping app ever!', 'sir from is empty ani chupistundhi enni sarlu try chesina ravadam ledhu plss any help you', 'I am interested from this app', "This app is amazing!!! I've been using it for about 8 years now. It's very user friendly. Especially if you're new to financial organization or if you're a veteran and want something a little simpler. It's pretty self explanatory. Easy to use, but if your not sure how to use it, or don't know where to start. It has a great help section you can use. Thank you very much for creating this app. It has helped me so much. Very much appreciated. I Love it. ⭐⭐⭐⭐⭐", 'goot apk', 'Yes nice.', 'Good Apps', "I've tried many, kept going back yo this. Simply the best. 3-yr user", 'Great apps. Easy to use. Been using it for many years.', 'Very useful n simple', 'Very usefull,thankyou', "Very good app. Now calculator is good. No data backup on cloud. My mobile got damaged. Can't recover data. All lost. Can you add feature of scanning receipt? Otherwise 5 star.", 'Please try to provide a Document Upload function for each entry. It will be very useful.', 'I am using this app from 2013. I really love this app, its awesome. Very simple and effective', 'Iam using it from 5 years but please set data bakup automatic and send to mail options.', 'Amazing daily pocket money', 'Usefull..app', "I tested around a 100 apps before finalising this one. If you wish to have a home income expense chart or if you want a easy entry app for small businesses or professionals this is your right choice. However the app lacks online backup which is essential as per me in today's world. I Hope the dev takes care also custom ranged reporting could be added as FY is different in different countries or at least a start FY month just like start week day.", 'There\'s no way to calculate cents, only dollars, also no way to calculate monthly interest with compounding, when I attempt to add an income source of interest from my bank to the same account (checking to checking, monthly) it says "Same account" and won\'t let me do it. This is called compound interest, it would be better if it could do this.   I guess it\'s an ok app if you don\'t mind the lack of automation and like to enter things manually, but not quite what I am looking for.', 'I tried many apps of this kind and concluded that this is the best one. Its approach is the most similar to Accounting, what gives you absolut control over what goes where. The weakness of this app is its poor visuals.. it lacks a neat interface. If developers improve that, no other app could stand against this one! Over that, the app functionalities are really EXCELLENT!', "You might be reading all the 5 star  reviews saying how easy it is, but I don't get it. I know that I only checked this app for 2 minutes but I can't spend so much time trying figure out where to categorise someone giving me money to buy some bread. The icons are badly designed. It's frustrating.", "I have literally tried every money tracking app in the book and this is the only one I'll use. Easy and efficient. Allows me to do every thing I want. Doesn't force you the do anything like add bank account information. Only thing is I hate the look/appearance but its the only app that will let me do what I want in a simple mannor", 'This is the one I was looking for. Previously I was using DEM which I have un-installed after coming across your software. UI is really good as also the Reporting Scheme. One small addition of getting a report for a user specified date range would complete this otherwise good app. Thanks', 'No doubt it seems like the app is full of all sorts of needed details to keep track n manage finances. But I have to be leery wen 3 straight days has recent posts all saying "simple to use". Again, probably filled with details but one thing the app does not appear to be "immediately after installing" is "easy/simple to use.. gotta question that feedback but I\'ll try to enjoy one more time', "Fantastic app  But now Multiple book button is not appearing on Nokia 3 therefore I can't add other books. Please Fix this problem. Easy to use & can manage different account books in one app I like it very much Please update it with new interface", "One used to be able to add a new expense whilst viewing your summary of expenses and income. For example, in the weekly list, there used to be an icon on the bottom right of the screen to add a new entry but that's disappeared and one has to exit back to the main menu again to click on add new entry! Really inconvenient...", 'I have it set up now. I like everything so far & I could add what I wanted too. I could list monthly bills separately from everything else that has to be paid.  I do wish the explanations were easier to understand though. I got it set up how I wanted it cause I "played" with it till I figured out what i wanted.            I hope its easier to use than it was to set up. It took me awhile.  I hope it works after all my 2 hours work to get it set up. Im physically handicapped so things are hard for me alot too', 'I use it to efficiently manage my accounts. The best among all the applications I have tried. Similar experience like gnucash on PC. One improvement could be to add support for transfer of money from expense accounts to other accounts. This is useful when we get a refund for some expense like flight cancellation.', "This app is great and fully-featured. Can you disable the dollar sign ($) please? I think it's quite annoying for a person that live at non-dollar currency country like me. Thanks", "It doesn't work completely on android 5.  It won't accumulate the balance on all screens.  What ever you put in as base amount, stays that way regardless how much you add (cash, bank accounts, etc)", "This is the only money app I've used where I can actually understand how to use it within the first five minutes and be able to add different types of incomes. Plus manage my money in many categories and be able to keep track of my money on hand. Best of all it's free Whoo", 'Liability and assets should be carry forward to next month automatically. And initial balance also should be shown in every month assets, liabilities balances. and category of expense and must be given group. Like default exps-food I.e. party nd personal.', "Spent twenty minutes just trying to put in how much money I have NOW. I gave up. I want something simple, not something that always wants me to put in what I am spending, not recieving. The point, an app to nake things simple shouldn't make my brain hurt.", 'Great app. Please include "from-to" and "Dr-Cr" both option in add details tab. One more improvement - decimal is not entered in opening balance. And what if I purchase cloth and next day cloth return to shop keeper.', "If only I'd knew this app existed earlier, I would've bought if sold. Only minor thing about this app that bothers me is the icons,  they seem to me like  prehistoric  symbols, other than that, it's just awesome how easy it is.", 'Been using now for a year. I cannot add income or expenses since the galaxy s3 options button has changed now to window swap button. Also, a setting for recurring income and expenses would be nice. On my s3 it would have got 5*', "Can't seam to edit the the details ie add more bank accounts change there name etc. Since my wife and I have 2 joint accounts and 2 peronal accounts this makes the app pretty useless.", "I always come back to this app when I need to get it together. It's simple and comprehensive, and gets the job done! There are other more modern apps, but having it installed inspires me to be financially responsible.", 'The app falsely detect that my phone (Alcartel Flash 2) has a physical hardware menu button. Please enable software button by default even if the phone has a hardware menu button'], 'appId': 'com.bottleworks.dailymoney', 'url': 'https://play.google.com/store/apps/details?id=com.bottleworks.dailymoney&hl=en&gl=us'}
