{'title': "Client for Pretend You're Xyzzy (open source)", 'description': "This app let's you play Pretend You're Xyzzy, an online card game, on your device wherever you are. \r\n\r\n----- ATTENTION! -----\r\nThis app content may disappoint some people. If you don't agree with the content of this app, don't complain with me. I'm not the creator of this game, just a player who is also a developer.\r\n--------------------------------\r\n\r\nThe game is simple. Each round, a black card is randomly chosen from the deck, everyone answers with their funniest white card. The judge the decies which player wins.\r\n\r\nThis project is open source at https://github.com/devgianlu/PretendYoureXyzzyAndroid\r\n------------------------------\r\nWords definition is powered by Urban Dictionary (https://www.urbandictionary.com/).\r\nCardcast is powered by https://www.cardcastgame.com", 'descriptionHTML': 'This app let&#39;s you play Pretend You&#39;re Xyzzy, an online card game, on your device wherever you are. <br><br>----- ATTENTION! -----<br>This app content may disappoint some people. If you don&#39;t agree with the content of this app, don&#39;t complain with me. I&#39;m not the creator of this game, just a player who is also a developer.<br>--------------------------------<br><br>The game is simple. Each round, a black card is randomly chosen from the deck, everyone answers with their funniest white card. The judge the decies which player wins.<br><br>This project is open source at https://github.com/devgianlu/PretendYoureXyzzyAndroid<br>------------------------------<br>Words definition is powered by Urban Dictionary (https://www.urbandictionary.com/).<br>Cardcast is powered by https://www.cardcastgame.com', 'summary': "Pretend You're Xyzzy is an online card game", 'summaryHTML': 'Pretend You&#39;re Xyzzy is an online card game', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.21, 'ratings': 575, 'reviews': 238, 'histogram': [46, 34, 40, 86, 368], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '5.5M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'devgianlu', 'developerId': '8675761046824387020', 'developerEmail': 'altomanigianluca@gmail.com', 'developerWebsite': 'https://gianlu.xyz', 'developerAddress': 'Via Viazzolo Lungo 42/1\nGuastalla (RE)\n42016\nItaly', 'privacyPolicy': 'https://github.com/devgianlu/PretendYoureXyzzyAndroid/wiki/Privacy-Policy', 'developerInternalID': '8675761046824387020', 'genre': 'Card', 'genreId': 'GAME_CARD', 'icon': 'https://lh3.googleusercontent.com/J9H6EJKzvw4D3lTEz9oI8mYjb4Fd-fOBdRjTnxrsHIDCliPgHM2cXOnVjx0oG2j0U98', 'headerImage': 'https://lh3.googleusercontent.com/Y515SKKZNwHbrULYvsAJTkqQzREM25XMe-qJkKmz_pL-IHAmktU58pKMDf0OCPx75w', 'screenshots': ['https://lh3.googleusercontent.com/qQFZioFIDUmzqAvabpsoEtrzQoVIfGdmsWTCLfWQnVvNH4nuW20VnBPZHBqD3snFnc46', 'https://lh3.googleusercontent.com/5fpvbgSOWfKeke1XWWc5K3ykSnO0zftAnADIKhEH0tYFLksXPZ30jWJ3o76BiL5yllk', 'https://lh3.googleusercontent.com/6_wCMkWtmMU9p0erdO3TkywEMCkT56sHo1xIIWdT4lqOx-0M2ouBbmli9unWZjRSWJAq', 'https://lh3.googleusercontent.com/MYW2m3IcKoO-AO3DtnQ3ATpzLb2cC7nmBe9g_D3EckEQzfOiS1_LinmHHYb2UpdCcw', 'https://lh3.googleusercontent.com/ShmeMIL4tYicBCCxCkMA6lWLC58wlRHHUo41KLyDPIb82Gm0UqRVp-SVonwjp5hVxKk', 'https://lh3.googleusercontent.com/So2tzAtTkgwjcKnNg-1Kc1Emw-9n47nQXhkY9JJ4R0efvmYSClswCHJHMNv5pF_5ZLk', 'https://lh3.googleusercontent.com/lA_LA7MymZVjzQJE1httwiCJTYwSQgLJkpgf4ipJXAfICWR4fLNFl-X86eA3D4QpqA'], 'video': None, 'videoImage': None, 'contentRating': 'Mature 17+', 'contentRatingDescription': 'Violence, Blood, Suggestive Themes, Strong Language', 'adSupported': None, 'containsAds': None, 'released': 'Aug 30, 2017', 'updated': 1589894496, 'version': '3.1.4', 'recentChanges': '### Removed\r\n- Cardcast has been shutdown, a replacement will be available soon', 'recentChangesHTML': '### Removed<br>- Cardcast has been shutdown, a replacement will be available soon', 'comments': ['Such fun! Note: Chat and blank cards are disabled due to a legal issue related to a user making credible threats in game. The issue is currently under investigation by the feds in America, with the site owner being subpoenaed by the FBI.', "I absolutely love this game and the funny cards that are on here , I would just like to know when blank cards will be implemented again because they were amazing. If your reading this and looking for a cards against humanity type game , this game is definitely the best on the play store! Also I don't think this is on iOS? If not it would be great if that was a thing as multiple of my friends want to play this game with me but don't have an android. Overall this game is a great laugh!", "Really good! It's free, you can play it with your friends who are maybe on pc and it's ad-free. Navigating the cardcast in here is also much more easier than pc. Overall, It's an amazing app!", "I used to play this on my phone browser and it was hell even though it was fun so to see it as an app is good and it's free with no ads so who can really complain?", 'Cards Against Humanity is possibly the best cardgame ever. No ads. Genuinely free. Brilliant.', "It was fun trying to pick the best cards that could make other people smile if not laugh at least. I enjoyed the first game that I had. This app has a lot of future to go, I just want to suggest to add at least an idle background song so that players are still entertained while waiting for the the others. If that will be included in the next following updates, I'll make this review a 5 star. 🌟", 'This app is awesome, good job developer! Just wondering if there are any plans in place or if you would consider planning to add chat into the app? I used to play this on desktop and the one thing this is missing is being able to joke around with other players. Regardless of chat or not, much love for this app!', 'Very enjoyable and fun to play', 'Crashes on the enter username screen every single time. Unable to email from the app as it crashes before I can do anything - not even enter a username', 'I love this game! It has all the packs as well as Cardcast support for custom packs, a nice UI, and you can play with people on a computer or a phone. And, on top of all that, no ads or in-app purchases!', "Pretty Solid! But I noticed that there's almost 0 support for the cah.andrewpetersen.me server. Perhaps you could see about adding it into the built-in server list or maybe make the app compatible with it?", 'The game is great, would be nice if we had a chat to interact with the other players.', "It's fun but you can get custom cards", 'Not that attractive for the user. It feels very serious w no avatars l, chat options, attractive graphics etc. Good game but becomes boring over time.', "I've been playing Pretend You're Xyzzy on the web since last year, and I'm very delighted that the game is now available on Android! As a totally blind user, I'm very pleased to discover that the app is accessible with the TalkBack screenreader, as is the original game. I will definitely recommend this to my friends and relatives! One minor issue: I'm not sure whether this is a bug or something that TalkBack doesn't read properly, but I've noticed it is not possible to create a new game.", 'Great Android client for Xyzzy, not much else to be said. Works pretty flawlessly.', "F I N A L L Y! Trying to play in a mobile browser with no mobile site version or interface is a nightmare! It's not working perfectly for me right now but I'm pretty positive that's only because I'm on vacation in an area where my internet connection is extremely unreliable. Do you have any plans to make an iPhone version? I know people with iPhones that would definitely use it.", "Works great but you can't play with iPhone users so that's not great.", "I am surprised! I was skeptical that this would not hold up to the actual website client which I've played on for eons, but it does! Tutorial at the beginning is nice, layout is simple & clear, and most importantly it works very well. Super fun, getting my CAH fix on the go. Thanks!", "The notification for when the main servers are down or back up, covers the buttons for server selecting and launching the game, if it could be moved slightly down so that's not an issue it would make this app even better, other than that it's great", "Game used to work fine before. Now it's buggy af. 9/10 times when I'm card czar I can't even pick a winner, it just says not your turn. Also some cards are unplayable even though I see them in my deck. Really don't wanna give this game 2 stars but the bugs make it unplayable. Fix this.", 'It was difficult to get into games at times. Def not like playing with friends.', 'This app is just fine up until it starts telling me that "It\'s not my turn" whenever I want to choose a card as Czar or even if I\'m just trying to play some card. I hope this gets fixed soon.', 'The Cards against humanity is literally on Mobile! Noice....I ever played since when i watched Youtubers (Mini Ladd,Smit7y & others.) Played this game!', 'It is basically playing from your computer browser but on your phone. Very impressed it has its own GUIs and feels better played on Mobile than the site. Good.', 'Thank you for making this Client for the game! Love this app makes playing this game so much easier! Please add an option to access the chat in a future update! EDIT: Nvm I see there is a chat!', 'Amazing! Thanks for making this app, its a lot easier to nagivate and play the game on my phone compared to the browser version.', 'Good client. It can randomly crash and not work, but rarely. All in all, recommended.', 'works great. you can even play with friends on the normal website', "Great app, sometimes says its not your turn and won't let you pick a card. Plz fix", 'I honestly enjoy using this version compared to the Computer version, now i can basically be offensive anywhere i go!!! Love it', 'Best thing ever, just play with random people yeah.', 'Easy to play, adjustable game options, fun way to pass the time👍good app overall', "couldn't even play. just freezes once I joined the server. doesn't matter if I hard close and restart the app.", '10/10. No ads, full on Cards Against Humanity experience.', 'Better than nothing, but full of bugs and glitches.', 'Thank you dev for your response! updated the review here. Otherwise it really is a nice app!', 'loved it on the browser, and now its mobile. 12/10, well done lads.', 'I love the main idea of this client, was waiting for something like this for a long time.', 'At least 5 thousand times better than Evil Apples where you need to pay real money to get cards unlocked'], 'appId': 'com.gianlu.pretendyourexyzzy', 'url': 'https://play.google.com/store/apps/details?id=com.gianlu.pretendyourexyzzy&hl=en&gl=us'}
