{'title': 'Pathfinder Open Reference', 'description': "This reference gives you rapid access to every feat, spell, class, skill, monster and rule in the full Pathfinder Roleplaying Game Reference Document.  With intuitive indexing and powerful search capability, the reference gets you the information you need quickly so you can get back to the game.  Includes rules material from the Pathfinder Roleplaying Game Core Rulebook, Advanced Player’s Guide, Advanced Class Guide, Ultimate Magic, Ultimate Combat, Ultimate Equipment, Game Mastery Guide, NPC Codex, Monster Codex, Bestiary 1-4 and the Technology Guide.\r\n\r\nFor other developers: this app has an api that lets you pull up articles from your app.  Contact me if you are interested in using it.\r\n\r\nThe application has tens of thousands of rule snippets allowing you to access feats, spells, monsters, npcs, classes and more. The application allows you to hone in the passages that matter for what’s going on in game now. Every title in every article is a link that lets you just see/bookmark that section.  It has a powerful and fast search lets you find the rule you need, quickly.\r\n\r\nIt also allows you to create bookmark collections. You can bookmark passages that you want quick access to as a GM, while creating other collections for your characters, giving you quick access to the rules that applicable to that character.\r\n\r\nThis application is Open Source and free.  If you have a problem with the application, rather then giving it a low rating, or in addition to it, consider filing an issue, and I will try to fix the issue as soon as possible.  You can find the issue tracker on the website by looking to the right, under Pathfinder Open Reference with the link 'issues'.\r\n\r\nThis application uses trademarks and/or copyrights owned by Paizo Publishing, LLC, which are used under Paizo’s Community Use Policy. We are expressly prohibited from charging you to use or access this content. This application is not published, endorsed, or specifically approved by Paizo Publishing. For more information about Paizo’s Community Use Policy, please visit paizo.com/communityuse. For more information about Paizo Publishing and Paizo products, please visit paizo.com.\r\n\r\nPermissions Note:\r\nThe internet permission is *only* used for error reports and content problem reporting.  This app requires 20 megs of SD card space for the rules DB.\r\n\r\nChangelog: http://www.legolas.org/\r\n\r\nI've had many people contact me about updates for the app.  The vast majority of the app's code parses Paizo's Pathfinder Reference Document: http://paizo.com/pathfinderRPG/prd/\r\n\r\nUnfortunately, the last update to that document was in 2016.  Paizo used to update it frequently.  I've been waiting to see if after they are complete with the starfinder launch if they will go back and start updating that document again.  If they do, great.  If not, I'm going to have to rewrite that code, which is a substantial undertaking, to parse another system reference document site.\r\n\r\nThere's way way too much content for a single person to enter in this data by hand, and as the only person working on the project, I've dedicated the time to making sure the parser is solid so that code does the data entry for me.\r\n\r\nThe starfinder srd is supposed to be coming soon: http://paizo.com/sfrd/ so I plan on giving it a month or two to see if they start updating the prd before I start the rewrite.", 'descriptionHTML': 'This reference gives you rapid access to every feat, spell, class, skill, monster and rule in the full Pathfinder Roleplaying Game Reference Document.  With intuitive indexing and powerful search capability, the reference gets you the information you need quickly so you can get back to the game.  Includes rules material from the Pathfinder Roleplaying Game Core Rulebook, Advanced Player’s Guide, Advanced Class Guide, Ultimate Magic, Ultimate Combat, Ultimate Equipment, Game Mastery Guide, NPC Codex, Monster Codex, Bestiary 1-4 and the Technology Guide.<br><br>For other developers: this app has an api that lets you pull up articles from your app.  Contact me if you are interested in using it.<br><br>The application has tens of thousands of rule snippets allowing you to access feats, spells, monsters, npcs, classes and more. The application allows you to hone in the passages that matter for what’s going on in game now. Every title in every article is a link that lets you just see/bookmark that section.  It has a powerful and fast search lets you find the rule you need, quickly.<br><br>It also allows you to create bookmark collections. You can bookmark passages that you want quick access to as a GM, while creating other collections for your characters, giving you quick access to the rules that applicable to that character.<br><br>This application is Open Source and free.  If you have a problem with the application, rather then giving it a low rating, or in addition to it, consider filing an issue, and I will try to fix the issue as soon as possible.  You can find the issue tracker on the website by looking to the right, under Pathfinder Open Reference with the link &#39;issues&#39;.<br><br>This application uses trademarks and/or copyrights owned by Paizo Publishing, LLC, which are used under Paizo’s Community Use Policy. We are expressly prohibited from charging you to use or access this content. This application is not published, endorsed, or specifically approved by Paizo Publishing. For more information about Paizo’s Community Use Policy, please visit paizo.com/communityuse. For more information about Paizo Publishing and Paizo products, please visit paizo.com.<br><br>Permissions Note:<br>The internet permission is *only* used for error reports and content problem reporting.  This app requires 20 megs of SD card space for the rules DB.<br><br>Changelog: http://www.legolas.org/<br><br>I&#39;ve had many people contact me about updates for the app.  The vast majority of the app&#39;s code parses Paizo&#39;s Pathfinder Reference Document: http://paizo.com/pathfinderRPG/prd/<br><br>Unfortunately, the last update to that document was in 2016.  Paizo used to update it frequently.  I&#39;ve been waiting to see if after they are complete with the starfinder launch if they will go back and start updating that document again.  If they do, great.  If not, I&#39;m going to have to rewrite that code, which is a substantial undertaking, to parse another system reference document site.<br><br>There&#39;s way way too much content for a single person to enter in this data by hand, and as the only person working on the project, I&#39;ve dedicated the time to making sure the parser is solid so that code does the data entry for me.<br><br>The starfinder srd is supposed to be coming soon: http://paizo.com/sfrd/ so I plan on giving it a month or two to see if they start updating the prd before I start the rewrite.', 'summary': 'POR gives you instant, easy access to everything you need to play Pathfinder.', 'summaryHTML': 'POR gives you instant, easy access to everything you need to play Pathfinder.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.7629256, 'ratings': 8456, 'reviews': 2280, 'histogram': [53, 95, 213, 1076, 7016], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Masterwork Tools', 'developerId': 'Masterwork+Tools', 'developerEmail': 'devon.jones@gmail.com', 'developerWebsite': 'http://masterwork-tools.com/masterwork-tools/pfrpg_open_reference', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8212831060696731977', 'genre': 'Books & Reference', 'genreId': 'BOOKS_AND_REFERENCE', 'icon': 'https://lh3.googleusercontent.com/LlSkt0U5WsyXoTK-_adGv3j2wmfX6CaSCwUSrPYsU-my1Q7Rd7397FxJ6RDpbI19gg', 'headerImage': 'https://lh3.googleusercontent.com/HdbbrwMKO80kJR8wG-JPoQtVx-1QaEqU0YGvpBMNEL1BsPdIClicPY1adk7-VuvLAHg', 'screenshots': ['https://lh3.googleusercontent.com/lh8J-lO_BSlafL0O7chcn_ANB-wA9ZqUS5Rywbf5sInYxI25HG7Vt33XSwGy4mETmM9u', 'https://lh3.googleusercontent.com/zjf6fkkUg62SLpYNYTFosEVSrqIaXNa-Goo1pNDqUXvup8bU4DHMwiHQs8F5YYo7w5A', 'https://lh3.googleusercontent.com/cYdxoFW8d2Y8Ke0_VbZ2n3lzVx8PJeX-2CBevWg9gOOATOlx3XkgdReWyYgN9_QJGg', 'https://lh3.googleusercontent.com/cNMOOFgQIN507xJ_tIXbkmCXpYRYgu52HOmJHxS_gBIrq6HUZJCETDDWemUtwk8PUp8', 'https://lh3.googleusercontent.com/jzWBL9eax2Ge8omsGvBdG00F0OZLm_Z2YniEJJ8X7LbQ3WSU9r6MTeBZJaf660hcFA8', 'https://lh3.googleusercontent.com/_NCta6D3EbNyx-r9g6eB6nTgqHAxka8eq-mMcJhKRNMOCHOnlbC2Y3NTIp7dfUc8dne-'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone 10+', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'May 16, 2012', 'updated': 1458580850, 'version': 'Varies with device', 'recentChanges': None, 'recentChangesHTML': None, 'comments': ["We use this app every time we run our Pathfinder campaigns. If you know what you're looking for (even if you don't know exactly how to phrase the search), it gets you there SO much quicker than trying to find it in the physical books (even compared to using PDFs in most cases). Also, the organization of spells per class is very useful.", 'Insanely useful app for quick reference before and even during sessions. Overall, an invaluable tool for any GM or player looking to make their life a little easier.', "This app is a good supplement for your group. Yes you can find everything you NEED to play here but if you want the full range of Pathfinder material this app is still missing alot. That said when I want to check a class feature or feat this is my go-to place as long as I'm not looking up anything obscure.", 'Really good app. Great for quick reference in or outside of the game. Helped me allot with my alchemist, now I have a mad bomber.', "I've used this app for years as my go to when I didn't have my books on me. And sometimes even when I did. Aside from the proprietary stuff, it' all there ans ready for you.", "This app is a must. Been a vet for 8 yrs, I'd have crippling back pain and paper diced fingers if I had to reference so many books manually. This app has every main book up to occult adventures. Wish it'd round out the set and pull in the companion books, but hey 5stars means I love the app not that it's perfect.", 'The go-to app for Pathfinder 1e. Gives the standard +2 for a masterwork tool to the "Rules Lawyer", "Power Gamer", and "Forever DM" skills. 10/10, would use again', 'By far the best app for Pathfinder - contains literally every rule and monster across all the books.', 'Mostly Great, I have to say this is a very resourcefull app to use especially when starting out but the issue is that this app is 2 years out of date and it is missing a lot of stuff. I hope they update it soon.', 'Soooo useful! They have every single thing from almost every book published. A MUST have for pathfinder players. Has everything from the bestiary to the advanced rules.', 'Super easy to use very helpful in the middle of gameplay instead of having 50 pounds of books out', "This is my go-to for really quick reference of the most basic aspects of PF. Unfortunately, it is quite fairly outdated. A lot of new classes, archetypes, items, and even races aren't listed and this has stopped being updated. The monster manual being so violently stunted (as well as no easy find of any of the occult class archetypes within the Class Customization tab, though they are listed in the Rules: Occult Adventures tab), and redundant search terms make this only good for quick checks.", 'Got the premium edition, did not look back. Absolutely amazing, have all the rules at my fingertips at all times.', 'V good super helpful only missing a few obscure things. Photos would be a cool addition.', 'Good but missing some. Hope is updated to include other books.', 'I love this app. Its a fantastic quick reference for just about everything you could ever think of when it comes to Pathfinder.', "I love this app and use it nearly everything i have a question, or when I'm preparing things for a session. Easy to use, easy to look at, and free. That's perfect for me. It does suffer from the same thing as the PFSRD where it'll cut off charts sometimes but that rare and not too big of a deal.", "Excellent as a basic reference, the only problem is with the intro of other classes it's not up to date", 'Very useful in making new cheracters or even checking info on Pathfinder.', 'This is an awesome app! I use it constantly and it has replaced my physical library when im gaming on the go. I love the search function and the ability to "favorite" pages. I *especially* appreciate how it does not advertise in my face all the time!', 'Really great to be able to search all those hard to remember rules and abilities quickly.', 'The thing for a simple pathfinder with monster from besteriay 1 and monster from the other books', 'I really appreciate the ease of use and the utility of being able to look stuff up when i am away from my books. Inspiration can hit any time, having a rules reference in my pocket which allows me to flesh those ideas out with the relevant rukes in the first draft is wonderous.', "The usefulness of this rules database for Pathfinder players can't be overstated. It's a free searchable version of the pfsrd. No, it's not perfect, but it is amazing work for the price and we should all give a giant thank you to the creator of this app.", 'Great app I use it as reference all the time, especially handy to look up magic weapons and armor.', "This app did almost everything I wanted it to. It doesn't have every possible expansion but it does have everything you need to play the game and it is easy to navigate. The Left-swipe feature and searchable text field are especially useful.", 'Very useful I can easily pull up info on classes or spells much faster and easier than flipping through a book', "This was the premiere Pathfinder app. Unfortunately it hasn't been updated in quite a long time and while still very helpful I'm only giving 3 stars because it's missing several books worth of races and classes and rules. I'll adjust to 5 stars when they hopefully update it.", 'Interface was a pain to lean but now it is second nature. Good buy.', 'This app is probably the most useful app for a Pathfinder DM, I use it constantly, it has EVERYTHING.', 'Good app in theory, but as pointed out by others, it is unfortunately quite out of date.', 'Very handy when playing as a quick and easy to use reference', "This is a great, super comprehensive reference for Pathfinder's first edition. It has basically everything you could need as a player. I dont know about the GM side of things myself.", "great app, needs to be expanded but otherwise a great referance for pathfinder. it covers from what I've seen all of the general rules and has most of the information you could need.", 'Very helpful for a player in a rush. There are some minor typos, and issues with the search (such as pulling up mythic versions of spells instead of going directly to the spell in question), but otherwise very solid.', 'Good app but very out of date. Also better viewed using a tablet.', 'I really like this app. use it in every pathfinder session I play. Just wish there was an update to involve some of the new material.', 'its great for beginners and really useful. the only things that could be better are changing the bookmarks section so you can move them around and include more beastiarys', 'love all the information right at my fingertips. i just really wish they would update the information to include all of the official races and classes available', 'a must have if you play pathfinder 1st edition. an update is long overdue, but what it does have is still a very valuable resource.'], 'appId': 'org.evilsoft.pathfinder.reference', 'url': 'https://play.google.com/store/apps/details?id=org.evilsoft.pathfinder.reference&hl=en&gl=us'}
