{'title': 'CleanboardCleaner', 'description': "Check and clean your clipboard using service, widget, shortcut, and quick setting tile.\r\n\r\nSource Code: https://github.com/DeweyReed/ClipboardCleaner\r\n\r\n<b> Possible reasons for the app failure</b>\r\n1. From Android 10(Q), Non-input-method apps <b>can't get, modify, and listen to the clipboard in the background</b>. Your phone is safer and doesn't need this app anymore.\r\n2. If you're seeing multiple clips or the clip history, it means something like <b>a soft keyboard app stores them</b>. In this case, this app fails.", 'descriptionHTML': 'Check and clean your clipboard using service, widget, shortcut, and quick setting tile.<br><br>Source Code: https://github.com/DeweyReed/ClipboardCleaner<br><br><b> Possible reasons for the app failure</b><br>1. From Android 10(Q), Non-input-method apps <b>can&#39;t get, modify, and listen to the clipboard in the background</b>. Your phone is safer and doesn&#39;t need this app anymore.<br>2. If you&#39;re seeing multiple clips or the clip history, it means something like <b>a soft keyboard app stores them</b>. In this case, this app fails.', 'summary': 'Check and Clean Your Clipboard', 'summaryHTML': 'Check and Clean Your Clipboard', 'installs': '1,000+', 'minInstalls': 1000, 'score': 4.1538463, 'ratings': 78, 'reviews': 48, 'histogram': [12, 3, 3, 3, 57], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.3M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'DeweyReed', 'developerId': '7518578900930550082', 'developerEmail': 'ligrsidfd@gmail.com', 'developerWebsite': None, 'developerAddress': 'Xinjiangongmen Rd, Haidian Qu, Beijing, China, 100000', 'privacyPolicy': None, 'developerInternalID': '7518578900930550082', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/q7WrZqKSwhFP5A5DuDgfuxw1D9lxELP8wlOV_UxkulbCSIMgQMADaItzq-uz4-9aB6I', 'headerImage': 'https://lh3.googleusercontent.com/MjHLyP1qLQFA6Kx21x1tEfxCd_G5H4jrUiG6HFheOnr_OnFyHTIz2uHru5FfnP3KgkI', 'screenshots': ['https://lh3.googleusercontent.com/P_cxqXUNT8rQJrI7B9ajGIqFMP-udXTUx8gg87HAPnOJLjX3aBiNF2dqq1-D__TCwVE', 'https://lh3.googleusercontent.com/tKmVO6TR_tLvdtlXrTHBD5umA4RJajjZlWlwRIa7gyhLEnEXsB4BwWI-MxRl8l-R7dg', 'https://lh3.googleusercontent.com/RuePUSfpm0APBG2mR4wzjn45fHcV1iqrKcAK1hdhq99JdX0Q2FjFnxM-giCX4hBHsg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 12, 2018', 'updated': 1571117048, 'version': '1.4.2', 'recentChanges': 'The clean timer will be reset after a new text is copied.', 'recentChangesHTML': 'The clean timer will be reset after a new text is copied.', 'comments': ["Did a good job until Android 10, (I read the description and I know why it doesn't work anymore), just want to say thanks to the developer!", 'I agree with the word "incompetent" in the app\'s own description. Don\'t be thinking that this app actually works unless you have the know-how to thoroughly check its effectiveness. The app may say your clipboard is clean but, as the dev says, it may actually not be. In my tests other apps can read the clipboard EVEN WHEN this app tells me it\'s clean. When the app says that it has cleaned the clipboard, it probably hasn\'t. Along with the developer I understand why not. Hopefully you do also.', 'If you truly want to clean your clipboard history, restart your phone. This app does not really clean your clipboard lol.', '9 months on Pixel 3. Excellently simple and effective utility on Android 9 [Pie]. However, its operation appears not to have survived the upgrade to Android 10: No longer cleans the Clipboard and no longer provides the corresponding message, "Clipboard has been emptied\'. Only notifies that that \'Clipboard is empty\', which manifestly is NOT the case. Here\'s hoping compatibility with A10 can be be accomplished and a return to 5 Stars!', 'Very shallow, only does very recent text clipboard copies, not sure its really doing what I hoped', "Does not work in Oreo on Duraforce Pro 2. The app SAYS it deleted content from clipboard, but I have a long list of stuff still in there and I have to manually delete..... I'd PAY for on app that actually worked!", 'Excellent for clearing the Android clipboard. Quick and efficient. The 2 shortcuts are very handy. Highly recommended. I share the .apk with friends and associates. Thank you, DeweyReed!!!', 'It does exactly what it says. No permissions and no ads. Simple interface and easy shortcut access. Thank you for this app.', "I like it, I like it a lot! And that's not because Dewey & I share a name, but I feel that my phone is actually running faster. This opinion is subject to change without notice (no offence intended Dewey!)", 'Hey, I have found smarter apps fixing this maybe by filling clipboards with NULL objects, blank texts, empty pics etc! // former rate: this app can not clean any clipboard not even simple text (Android boolshit Pie 9.0)', 'just what i wanted, small size, just does what it saids clears the clipboard, will not explode into 100+ megs of other junk you dont want, thanks Developer good app.', 'Very functional, put a shortcut for Content and Clean on home screen. Handy when you need each quick.', "Samsung Galaxy Note 10+, Android 9, app says it's cleared the clipboard but it hasn't, copied data can still be pasted. Uninstalling.", 'does its job exceptionally well. high regards to the devs! care about security? you need this well functioning, usefull, no-fail app!', 'Works perfectly, great job on the app, no ads makes it even nicer!', 'great app does its job, no permissions needed. no ads. Thanks', "It doesn't work at all on a Samsung S8 running Android 7", "doesn't do a damn thing, yet another fake clipboard cleaner and waste of time", 'awesome and light app.', 'Always Worked Nice App', "doesn't work on s9 (pie)", 'You served your purpose well old friend. :(', 'Way cool. Protects.', 'Good, usefull', 'Best App', 'Small footprint, no permissions, offers a shortcut, no ads, free and most importantly, it cleared the clipboard albeit with a blank file. Nice.', 'Doesn\'t clear my clipboard... Everything was still in my ClipTray after "clearing" my clipboard with the app.', "Wow. My first time. Faster than light. But no where does it say the cost? \nWhat's the catch??", "Clean simple and bloat free. Does exactly what it's meant for. Highly \nrecommended", 'Best simple, one-touch clipboard cleaner ever!', 'Easy to operate. Just to tap once and ... Viola clipboard is clean. 😁'], 'appId': 'io.github.deweyreed.clipboardcleaner', 'url': 'https://play.google.com/store/apps/details?id=io.github.deweyreed.clipboardcleaner&hl=en&gl=us'}
