{'title': 'SOPA', 'description': 'SOPA is an Android puzzle game.\r\n\r\nThe goal is to connect the green and the red gate with the blue tubes.\r\n\r\nGet better while solving the games level and enjoy playing.\r\n\r\nThis app was developed by Raphael and David Schilling.', 'descriptionHTML': 'SOPA is an Android puzzle game.<br><br>The goal is to connect the green and the red gate with the blue tubes.<br><br>Get better while solving the games level and enjoy playing.<br><br>This app was developed by Raphael and David Schilling.', 'summary': 'SOPA is an Android-puzzle-game.', 'summaryHTML': 'SOPA is an Android-puzzle-game.', 'installs': '1,000+', 'minInstalls': 1000, 'score': 4.733333, 'ratings': 75, 'reviews': 46, 'histogram': [2, 2, 0, 6, 65], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.6M', 'androidVersion': '2.3', 'androidVersionText': '2.3 and up', 'developer': 'David Schilling', 'developerId': 'David+Schilling', 'developerEmail': 'davejs92@gmail.com', 'developerWebsite': 'https://twitter.com/sopagame', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '7270417917505114188', 'genre': 'Puzzle', 'genreId': 'GAME_PUZZLE', 'icon': 'https://lh3.googleusercontent.com/N8-ZvlBRoEu1klOVroOtOL8_BsKV5cS9CilYnewCKA_xcJEQ8ncGnF8FsNLlL9ZSNnM', 'headerImage': 'https://lh3.googleusercontent.com/W5afDKggoS5EiEIa7oGEyJTVfT1j3DLy37r2_0HSQOx62jca9OIZbIXPNw88RoRiQ_A', 'screenshots': ['https://lh3.googleusercontent.com/-IopYl3sIRQOo3Tp00xdqLTKx8NiPZXA2lANJ37KNnpkUOlea7BcOYFvIUSzhHqJbCQ', 'https://lh3.googleusercontent.com/VO1xdaa_TfHSgPaALTuZF-Ko-YTgdLKviQMULlBAPXw__tEVXbFdxjI8-gTed7Xixw'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 14, 2015', 'updated': 1441999035, 'version': '2.2.1', 'recentChanges': 'Add new Modus: Just Play\r\nLots of ui enhancements.', 'recentChangesHTML': 'Add new Modus: Just Play<br>Lots of ui enhancements.', 'comments': ['Nice Very nice puzzle game you have to complete the levels as fast as you can! Really challenging game I love to play when I have some free time. and the app doesnt ask any permission , definitely a plus !', 'I gotta say that I love this puzzle game, very interesting and relaxing. I like playing those kinds of easy games rather than complicated ones so this one suits me well. Plus, I have recommended this game to some of my friends, they all like it. Nice job developers.', "Lot of fun, very addictive, sometimes hard as hell and very complex. With this time flies fast. I really recommend this great game. try it out its free after all. The game is really challenging, you deal with the time too. It's great when you have some free time.", "As I am one of those people who are always looking for new interesting games, this one is now my favourite.  The game is easy to learn but hard to master, some levels took me very long to solve, but it's a very rewarding feeling when I finally finish the level, awesome :)", 'Lot of fun, very addictive, sometimes hard as hell and very complex. With this time flies fast. I really recommend this great game. try it out its free after all.', 'I like this game a lot, it is so addictive. The best is there are many levels, so you never stop playing. I definitely recommend it to everyone who is looking for puzzle games.', 'I find it is an addictive strategic game, good for both children and adults to pratice ability of thought. Good design and nice animations make it more attractive. Keep playing and wait for new game data.', 'Small game space. Or oh is good, fast loading yet you .. playing some very good help brainstorm. This game falls under the category wisdom. Review this game 5 stars. Thank the developers.', 'A great game to kill time. I really like it. Nice job, devs!', 'One of the best puzzle games that I ever played! It is really fun to play and design is great. Developers did pretty good job.', "I wish it had a better menu and instructions. Once you get past that, it's really fun!", 'Captivating puzzle game that keeps you playing. Its a great game with detailed graphics and simple gameplay. Thanks for the free game', "He's so good at whatever he does. Such an amazing game from an amazing creator.", 'As open source project people can learn from it. Keep up guys!', "This is one of the best puzzle game I've ever seen. I love it. Highly recommend to everyone!", 'This puzzle game so very nice to playing i played this game many time i very like it...', 'This game is simple but very challenging. I like it. Recommend it!', 'This is a nice puzzle game. I really like it. Nice game!', 'Bestes Spiel'], 'appId': 'de.sopa', 'url': 'https://play.google.com/store/apps/details?id=de.sopa&hl=en&gl=us'}
