{'title': 'Infinity for Reddit', 'description': 'Infinity is a beautiful, feature-rich app that offers a smooth Reddit browsing experience. It is completely free and ad-less; you can browse Reddit without interruptions or distractions. Built by a passionate university student, Infinity is open source. Please check out, support or contribute to the project at https://github.com/Docile-Alligator/Infinity-For-Reddit!\r\n\r\nA subreddit for this app is available: https://www.reddit.com/r/Infinity_For_Reddit/\r\n\r\n<h2>Highlighted features:</h2>\r\n<h3>Lazy mode:</h3> Automatic scrolling of posts enables you to enjoy amazing content without moving your thumb. \r\n\r\n<h3>Multi-account support:</h3> Switch to different accounts instantaneously.\r\n\r\n<h3>Night theme:</h3> Beautifully designed night theme', 'descriptionHTML': 'Infinity is a beautiful, feature-rich app that offers a smooth Reddit browsing experience. It is completely free and ad-less; you can browse Reddit without interruptions or distractions. Built by a passionate university student, Infinity is open source. Please check out, support or contribute to the project at https://github.com/Docile-Alligator/Infinity-For-Reddit!<br><br>A subreddit for this app is available: https://www.reddit.com/r/Infinity_For_Reddit/<br><br><h2>Highlighted features:</h2><br><h3>Lazy mode:</h3> Automatic scrolling of posts enables you to enjoy amazing content without moving your thumb. <br><br><h3>Multi-account support:</h3> Switch to different accounts instantaneously.<br><br><h3>Night theme:</h3> Beautifully designed night theme', 'summary': 'Infinity, the infinitely better Reddit browsing experience', 'summaryHTML': 'Infinity, the infinitely better Reddit browsing experience', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.4496646, 'ratings': 1506, 'reviews': 798, 'histogram': [20, 50, 131, 333, 970], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '6.4M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Docile Alligator', 'developerId': 'Docile+Alligator', 'developerEmail': 'docilealligator.app@gmail.com', 'developerWebsite': None, 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '7267515842479267228', 'genre': 'News & Magazines', 'genreId': 'NEWS_AND_MAGAZINES', 'icon': 'https://lh3.googleusercontent.com/m6jSo9ki-Vga40SDj0bJrZHW7ma0h56EtNPfoNqYjzW_ehlrXodWpBsK8f_IH1p3VA', 'headerImage': 'https://lh3.googleusercontent.com/jfjcRyjNgDi4yujbGjbSoyLAwSYOvtgnhqw7FEUoCv7xqtijDj2EQ64a4d7HhT_7w-8', 'screenshots': ['https://lh3.googleusercontent.com/yLqWxhrh29rKeAWC1ru2-ebUvl7FFTSqn6kzresFvQoTxmnhrEoCWFO0J1nLtsffSQc', 'https://lh3.googleusercontent.com/20JsJjlvt5VovmTUD7qkce-z0WtdBqyY4i8EZtbvnXMe2L8BdSAMX1tOu6HRoEWMgts', 'https://lh3.googleusercontent.com/Q8wKSX-4J58E9cymi2vt72bnAgrfFWoX0uDa3oYg6Ka__T7E9UjWjYbiTlbpwSkE5i0', 'https://lh3.googleusercontent.com/69Sq83x2cOS_Z5ajgQO-B_NnHR3E2HTSfqeNvCA8EiJyH9V4Dz8_dgQEZeI6rJ7n8A', 'https://lh3.googleusercontent.com/O76tThIMoPN7YxIOFvEMZtjgUGHkvhke95YOVz05pnwCmlPn8YlK9Z17Wk6o5op4rOQ', 'https://lh3.googleusercontent.com/nF_1_It2t3qDcvfBYombWFUz8yuXiLQBHfXdyFx7sEoJdP4KFONZgHV-_reFnymrNQ', 'https://lh3.googleusercontent.com/LCq5ose5dg2zfUcUxkO8ovuJLYV8RPwAE6Mb5LkDCqt2UJLleQoqFx2vikj3XSe6smc7', 'https://lh3.googleusercontent.com/7kogl7tXjIqz2n0uBMOhhhjwRgj6YxoSgm-1QBkY4_6XJDbt4C78NBxDwVdGArptBw'], 'video': None, 'videoImage': None, 'contentRating': 'Mature 17+', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 4, 2019', 'updated': 1589425173, 'version': '3.1.0', 'recentChanges': 'Video autoplay.\r\nCustomize 3 tabs in the main page.\r\nSpecial thanks to OHermesJunior (https://github.com/OHermesJunior), single tap to collapse comment and a fix for low resolution image problem are available. Also, link handler is improved and links such as /r/news+worldnews/ can be opened in app.\r\nReport posts and comments.\r\n\r\nMinor bugs fixed.', 'recentChangesHTML': 'Video autoplay.<br>Customize 3 tabs in the main page.<br>Special thanks to OHermesJunior (https://github.com/OHermesJunior), single tap to collapse comment and a fix for low resolution image problem are available. Also, link handler is improved and links such as /r/news+worldnews/ can be opened in app.<br>Report posts and comments.<br><br>Minor bugs fixed.', 'comments': ['Good client with a beautiful interface. Thanks to the responsive and active dev, video autoplay has been added. Now, infinity is miles ahead of boost, with a more modern design, and lack of network issues. The only thing that sticks out to me in the slightest is maybe that the horizontal padding can be increased to further demonstrate replies to comments. Otherwise, it is now my favorite client.', "Cool app, works as it should, nice and clean ui coming from a ui snob. One suggestion though, optional auto feed refresh option to enable/disable. It will automatically refresh the feed it you hit the home button and re-enter the app. Not sure if that's something that can be changed it not though looking at it now because Android.", "This is a great app, the closest Android has to Apollo on iOS. It runs smooth and looks good while being responsive. The design is consistent with a lot of other Android apps, particularly with Google's apps. Definitely the best out there right now and a marked improvement over the official app.", "I really appreciate this app, it's so much nicer than the reddit app. I would reccomend that the notifications have an option to show exactly when something happens. For example, if I got a response to a comment, the notification comes up when it happens. I would also reccomend the trending feature that the official reddit app has, showing you popular posts in certain subs. I would love to see those features in your app. Other than that, amazing app.", 'Great app, idk why people aren\'t talking about this. Everything works fine. The video autoplay function is what made me stick to it. But there should be an option to long press and open videos/link on external app too. Btw how do I make the size of "link award nsfw" tags smaller. They seem too big. Also how do I crosspost ;-; Also the autoplayed videos are muted. Turning mute videos option off doesn\'t fix it', 'Fixed the issue with duplicate posts in the last version but now there\'s an error code that pops up occasionally. Can recreate it right now but I think it says "Error 512" or something like that. Kinda annoying but not a huge deal. Great app though.', 'Really love this app but there is something that keep me going back to the official reddit app. There is a slight delay to the image or video to load on the screen when scrolling. I have to wait 2-3 second to see what in the post. This may not be the biggest problem, but it important to me in order to use this app.', "I'm happy with the experience so far. I just want to request more view options (like gallery), the option for the bottom tab bar to not disappear when I start scrolling and video and picture quality settings. Thank you.", 'Love it! This is up there with Boost in my opinion. It has the same customisation as Boost just with a different interface. Definitely would recommend. I wonder why the reviews are 4.3 I swear it was higher before.', 'Love this app, but sadly it is missing one big feature for me which is a read/hide button. In order to hide/read sonething you have to click on the thread then click hide. I would use this over Boost if that feature was here.', 'The app is quick, responsive, and easy to use. Only things that could make it better would be a home button on the bottom menu navigation or a gesture to send me back to the top.', 'Wonderful interface with loads of customization. Lacks proper moderator controls and gilding. Also there does not appear to be a way to get audio from gifycat, and presumably Imgur as well.', "Great experience, I have one improvement to suggest: If lazy mode enabled and the user interacts with the app, the lazy mode should be stopped and not just restart it's clock.", "I've tried other reddit clients but Infinity is by far the best. It would be a perfect 5 stars if videos auto-played in lazy mode and if there was an edge screen section like Boost has. Other than that if you're looking for a clean customizable reddit client this is it.", "Best reddit app hands down. Clean. Simple. Fast. It's great, I love it. The developer did great job, if you need a good Reddit app, this is it! (And so much better than the official app, please don't use that)", "Best reddit app I've tried so far and I feel like I've tried them all!. Someone else mentioned the delay in video or gif loading and that is very real and a slight annoyance, but ui and overall feel is great!", "It's free, smooth and easy on the eyes. Thank you for this infinitely (pun intended) better Reddit experience than their own app.", "It could be awesome if when u press play button on video it should play right there on the homepage instead playing video in fullscreen mode like how instagram plays its video. & Another bug I found that NSFW subreddits don't load any posts.", 'Love the UI. Minimalist yet pleasing to the eye. What I cant stand is the lack of background pausing. The app refreshes everytime I multitask. Its annoying. Please fix.', "I like this viewer but you can't add subreddits or bookmark things without a reddit account. Which I think is important to people who don't want an account. I will update my review if this feature is ever implemented for non account users.", "Love the look and feel of this app. Only complaint is that I can't play audio on gifs.", "Awesome! No ads and free! I've noticed that spoiler tags don't actually work, though.", 'Coming from Sync as well as the native Reddit app, this app has the most polished interface of all. A very premium look that is much better than Sync. Totally worth it.', 'The app is pretty good. Only flaw I find is that the downloaded videos have no sound.', 'Great lightweight FOSS readder. Supports dark theme. Rotation. Loads very fast. Great for casual or anon users, probably lacking for powerusers.', "The biggest problem is that there isn't enough spacing between paragraphs. Please increase the spacing between paragraphs.", "First off, this is the best looking reddit client I've seen. But there are a few things that are keeping me from switching from Boost. Biggest thing is that there's no text markup tools when writing a comment. Overall customization is limited (can't change timestamp format, not many feed/toolbar/thread options). Right now it seems like it's in its early stages. Still very good, but relatively limited. But it'll probably be improved the future, and will be amazing when it is. Thank you dev!", 'Have been using Sync for quite a while, but decided to try something new because my phone liked to kill Sync whenever I left the app for more than a minute. After looking at various open source alternatives, I ended up choosing Inifinity. It might not have as many options as other apps, but the app just feels so much more polished. Really nice app, with an intuitive interface, and best of all, no ads.', 'It is light weight and no ads, reddit have some really annoying non relevant ads. Thank you for this awesome app.', "This app is almost perfect. There are just two issues for me: 1. Approximately 80% of the videos I click have no audio. Please fix that. 2. I'm not sure how the default comment sorting was intended to work, but I often don't see all or most comments on a post and they appear to be in a random sorting of karma. If this is intentional, please make it configurable. Thank you for the amazing app.", 'Infinitely better (pun not intended) than the official client. Clean and polished UI. Totally satisfied.', "It looks absolutely fantastic, but like another user said in their review, it really needs formatting options in the editor, and at the bare minimum, a preview mode! Also, I know it's not official Reddit API, but the ability to give awards. Both Boost and Apollo reverse engineered it, so it can be done. :) Until then, I'll stick with Boost, but this has potential, and I'll be keeping my eye on it. I also really love the fact that it's open source. Keep up the great work!", 'Really great reader, although it needs some features implemented. New content on homepage when refreshed (best sorting/random), a "skip to next comment chain" button, default to comment chains needing to be collapsed via user input after 3-4 replies (less scrolling needed & less confusion for next comment chain) and a lighter colour to indicate new comment chain Edit: removed suggestion that is intended feature. If other suggestions were implemented then it would be 5/5 :)', 'Best looking Reddit client on Android for sure. Though it lacks some features which keep me from switching from boost. Hope it gets better through future updates.', 'Good UI, but sometimes the post loop themselves, causing me to see the same post over and over again', "Pretty decent. The app provides an okay browsing experience, but selected favourite subs don't appear as shortcuts anywhere in the interface, so what's the point of this feature? Surely fave subs ought to appear at the top, alongside Popular and All? Ideally, I'd also be able to remove those two default pages should I want to (I do) and have only my favourite be subs visible instead. Additionally, I would have titles have an even smaller font than the smallest option. Everything else seems good.", "I'm giving this 5 stars even though I just downloaded it like 10 minutes ago. Quickly using it the positives are great: the UI is nice, it has lots of customization options, it's very smooth. I don't know if ads will be added or not, but if I could give it another 5 stars I would because of that. I get that devs have to make money as I'm good with that but to see an app this solid with no ads is absolutely amazing. Will be using this and Reddit is Fun. Awesome work.", 'One of the best if not the best looking reddit client clean and fast! One complain is that the side bar looks a little outdated compared to an example some Google apps in which I mean the header should be improved .Edit found out you can do the not show absolute numbers I think it should also be done on the comments! Edit almost all of my complaints were not needed after using the app for a good amount of time everything I asked for was already in the app forget all previous reviews', "5 stars cause i love this app but i've this problem of whenever i try to download a video the sound isn't working, can u fix that please.", 'Why there is no sound in any video other client apps of Reddit does provide the sound in videos and Kudos to the UI best one as compared to other client apps.Bring audio as well then I will review it to 5.'], 'appId': 'ml.docilealligator.infinityforreddit', 'url': 'https://play.google.com/store/apps/details?id=ml.docilealligator.infinityforreddit&hl=en&gl=us'}
