{'title': 'BART Runner', 'description': '**FREE, OPEN SOURCE, NO ADS**\r\nThis app is centered around the basic question "[expletive of choice], am I gonna miss the BART?". Enter your most traveled routes and receive a real-time listing of upcoming departures in one click. Unlike most apps, the estimated time until departure actually counts down second-by-second, so you\'ll know just how fast you need to run to the station!  Note that estimated departure times are, in fact, estimates, though the general accuracy of an estimate is shown beneath the countdown. After a minute or so, the accuracy of the estimates should automatically increase.\r\n\r\nUnique features of this app:\r\n* Streamlined for experienced BART commuters\r\n* Real-time departure info refreshes automatically, and the accuracy of the departure estimates increases over time\r\n* Estimated arrival times\r\n* Pick which train you want to board, and information about that departure will be available in your notification tray.\r\n* Set a departure alarm to go off a few minutes before your train leaves (you pick how much advance warning you want)\r\n* Routes are entered with both the origin station and the destination station, so the real-time departures listing only lists trains that will actually get you to your destination\r\n* Phone will not sleep while viewing departure times (the screen will only dim), so you only need a quick glance at the phone to see how long you have left to catch the train\r\n* Zoomable offline system map\r\n* Fares and next departure time are shown in the saved route listing\r\n* No ads and open source; Built purely for the love of programming, and because I didn\'t like any of the other BART apps out there\r\n\r\nIf you have any bugs to report or suggestions for the app, please email them to bartrunner@dougkeen.com.  I can\'t guarantee that I\'ll have a chance to respond to every email, but I\'ll do my best!\r\n\r\nNOTE TO GALAXY S USERS:\r\nI\'m aware of an issue with that specific phone model that causes the app to crash consistently.  I\'m working hard on a fix, so keep your eyes out for an update!  Meanwhile, please contact me at bartrunner@dougkeen.com if you can volunteer some time to help me track down the problem.', 'descriptionHTML': '**FREE, OPEN SOURCE, NO ADS**<br>This app is centered around the basic question &quot;[expletive of choice], am I gonna miss the BART?&quot;. Enter your most traveled routes and receive a real-time listing of upcoming departures in one click. Unlike most apps, the estimated time until departure actually counts down second-by-second, so you&#39;ll know just how fast you need to run to the station!  Note that estimated departure times are, in fact, estimates, though the general accuracy of an estimate is shown beneath the countdown. After a minute or so, the accuracy of the estimates should automatically increase.<br><br>Unique features of this app:<br>* Streamlined for experienced BART commuters<br>* Real-time departure info refreshes automatically, and the accuracy of the departure estimates increases over time<br>* Estimated arrival times<br>* Pick which train you want to board, and information about that departure will be available in your notification tray.<br>* Set a departure alarm to go off a few minutes before your train leaves (you pick how much advance warning you want)<br>* Routes are entered with both the origin station and the destination station, so the real-time departures listing only lists trains that will actually get you to your destination<br>* Phone will not sleep while viewing departure times (the screen will only dim), so you only need a quick glance at the phone to see how long you have left to catch the train<br>* Zoomable offline system map<br>* Fares and next departure time are shown in the saved route listing<br>* No ads and open source; Built purely for the love of programming, and because I didn&#39;t like any of the other BART apps out there<br><br>If you have any bugs to report or suggestions for the app, please email them to bartrunner@dougkeen.com.  I can&#39;t guarantee that I&#39;ll have a chance to respond to every email, but I&#39;ll do my best!<br><br>NOTE TO GALAXY S USERS:<br>I&#39;m aware of an issue with that specific phone model that causes the app to crash consistently.  I&#39;m working hard on a fix, so keep your eyes out for an update!  Meanwhile, please contact me at bartrunner@dougkeen.com if you can volunteer some time to help me track down the problem.', 'summary': 'Free, no ads, open source. Built by a BART commuter, for BART commuters :)', 'summaryHTML': 'Free, no ads, open source. Built by a BART commuter, for BART commuters :)', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.387097, 'ratings': 1350, 'reviews': 481, 'histogram': [108, 21, 87, 152, 979], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.5M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Doug Keen', 'developerId': 'Doug+Keen', 'developerEmail': 'bartrunner@dougkeen.com', 'developerWebsite': 'http://dougkeen.github.com/BartRunnerAndroid/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '7370351184845364793', 'genre': 'Maps & Navigation', 'genreId': 'MAPS_AND_NAVIGATION', 'icon': 'https://lh3.googleusercontent.com/KK0TYHOeODlcTbHT33j7cJokvw8HyynWGPP2vDIw1AtBbebmEjSxBNvFPfANPJHnNEuu', 'headerImage': 'https://lh3.googleusercontent.com/h9SEsewduviqOwyymUW6DjVRkadTMTTyAwT8lWVDUiGYsCNBAKHQ7kICc5ai1RPQjQ', 'screenshots': ['https://lh3.googleusercontent.com/pTtgBbkMXlGKB8oiE9lqL_c9wFfTuxLOBVo5NUiS1B3P8HteWBEqTFxJyl6Zq5ofA6k', 'https://lh3.googleusercontent.com/xgGJgp4PPbcZ1kbPCbzErb30CnME3j0nm731zGj1fCWun21blSgtLfOq1_iurm-OiDE', 'https://lh3.googleusercontent.com/6SdnkPkQ-GPDBnNnY6EMiKUn14odnYlbjPbbwi4IhOdRaE-M7n5PZm9G0Jt24bYfag', 'https://lh3.googleusercontent.com/1VybcU0Eh5oyKwMYzv-Aq-5FFSJVdYJiqyEV8rWIcACrHlWvj6wQFQ2UWJs5ApTSKAs', 'https://lh3.googleusercontent.com/lU7OJW7-hF-M6tU8D7cxcIMOkpIzITtdLZ6VXYLa6Nqv6FJ77Kr6LTQzE7xrzhnuEmc', 'https://lh3.googleusercontent.com/Kcs4D9GTJnNW7TE7IPWp4h2E5MOIpIrVKcB_y49H2L_90tUT0YatExMtOTvDoXr3DCc', 'https://lh3.googleusercontent.com/eZ-BJ6MIvci8bvAhEhCnwUFlgrYl5tRaRPy0jFGYWqKGKBqIb2cJL2yxcA2PySl8PUA'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 11, 2011', 'updated': 1553518358, 'version': '2.2.18', 'recentChanges': '* Various bug fixes, including that one that prevented arrival time estimates from working\r\n\r\nThere have been a good amount of changes around routing logic, since BART has been shuffling their schedules and changing their data services quite a bit. Keep an eye out for weird routes showing up (or not showing up) and report them to bartrunner@dougkeen.com\r\n\r\nThanks!', 'recentChangesHTML': '* Various bug fixes, including that one that prevented arrival time estimates from working<br><br>There have been a good amount of changes around routing logic, since BART has been shuffling their schedules and changing their data services quite a bit. Keep an eye out for weird routes showing up (or not showing up) and report them to bartrunner@dougkeen.com<br><br>Thanks!', 'comments': ["This app is very useful, but it has a number of issues. As others have mentioned, it doesn't deal well with transfers. It often inaccurately reports the amount of time a route will take if it includes a transfer. Also, in the last few months I have noticed that BART arrival times have been reported as later than they actually are. It will say that a train is arriving in 2 to 3 minutes, but the train arrives before then, potentially causing people to miss trains.", "Difficult with end-of-line stations. It always works well in the middle of a line, but when my departure point is at the end/beginning, the info is near useless. I'm guessing that's due to the info the BART provides, and not because of anything the developer is doing wrong.", "This app works as described without any frills. I depend on it every single day, and offers me peace of mind I otherwise cannot get from BART. I wish there were an indicator to let me know if a train was a 3-door or 2-door car, however. Because I'd gladly wait an extra 15 minutes to ride on the Fleet of the Future cars. Great work! Don't stop working on this thing please! It's almost perfect!", "Easy-to-use, simple interface that gets the job done. Allows you to monitor departure times for your saved lines all in one place. I really like that you can set an alarm for a particular train, so you don't miss it. Other similar apps lack this feature for some reason. In my experience, departure & arrival times have always been correct.", "Near perfect. Lacking in clarity with train transfers. Would like more info such as which station for transfer and time until the connecting train arrives. Been using app for years and it's very accurate unless you're at a station at the end of the line. Noticed this with Fremont but since Warm springs opened, inaccuracy is a minimal issue. I've missed the train a few times as the train arrived earlier than the app reported but very infrequent when bart arrives ahead of schedule. Appreciate.", 'Easy to use, and fantastic for finding the right trains at the right time! I especially appreciate the ability to save my favorite routes, the option to pull up the system map right from the main screen, and real-time updates. BART Runner has been more helpful and reliable than BART itself.', 'Best Bart Commuter application! Straight forward answers to questions I always ask about my bart commute. Questions like "what\'s my fare going to cost" or like "when is the next train coming" and has quick access to the map just in case I forget what stop I was supposed to get off.', 'App keeps running, not able to close it like every and all other apps. Have to force it or uninstall to make it stop draining battery Otherwise, it is fine- simple and pretty accurate', 'keeping it simple and awesome! love it! thank you for making something that gives more accurate arrival/departure times so i know if i can smash a beer before i hop on bart!', 'Great app Doug. It would be amazing if you could update your application to include information on trains starting at specific stations. First trains', "I have this app years ago, It is really works, I'm taking public transportation every day. Very useful for me. Thank you!", 'Love this app, but it keeps beeping every few seconds after I have selected a ride, even with alarm for 1minutes before Huawei P20 lite', 'This app is awesome. Just what I needed and nothing more. All killer, no Filler. 5 stars, would recommend.', "works great on my first gen pixel. only improvement would be a widget to sit on my home screen so i don't have to open every time", 'Simple, free, does exactly what I need it to do, without extra junk or ads.', "This app is a life saver. By far the best BART timing app out there. All my iPhone fanboi friends are very jealous that they can't have it...", 'best Bart app ever! unfortunately, I no longer live in the bay area, but I considered keeping this app on my phone just for when I visit! there is seriously no better app for Bart transit!', 'Amazing simple app. "less is better" can\'t believe I lived without this app before!', "It was grat for a while but is no longer accurate. It reported trains that weren't there and has been off by enough minutes that I almost missed my trains. Sorry", 'BART should name a station after Doug Keen. Many thanks to the other contributors as well - this is a truly useful app.', 'Appears to be largely incompatible with the latest release of Android OS on Samsung Galaxy S9+ (G965USQU3CSAB)', 'This is how a mobile app should be. Fast, functional, and no ads. It does what promised.', 'This app makes my daily life simpler. I appreciate the time spent making this app available to the public. Thanks.', 'new update has bug shows 2nd car as having 2 cars only. it changes to 10 cars once 1st car is dismissed.', "Inaccurate as hell!!! Don't bother. Won't tell you real time or even give you the proper train! Unreliable to the max.", 'much more intuitive than Bart official app. great app!', 'Best BART app out there. Extremely reliable and accurate', 'this app is great but can you add push notifications for the alerts? thanks much!', 'Simple, reliable, well designed', 'Crashes on launch on Android 10 on OnePlus 7T', 'Minimal app covering all my needs. Excellent!', 'Appreciate the undo but would appreciate even more if i could just lock my favorites so i dont accidentally swipe/delete them.', 'Simple & practical', 'Way better than the official Bart app', 'Simple and functions', 'Always showing incorrect timing, From Fremont to 19th street Oakland.', 'I love Bart, it is the people I cannot stand. Two Asians blocked the door to enter the Bart train, thinking they were entitled. They were not, please find the link to their story here.', "can't tell you arrival times of routes that have already departed. i think", "py kvsdl day p.o. limit l. i ey o..yeo. I'm laptop l thanks oo. o.l ok", 'New user , but happy so far.'], 'appId': 'com.dougkeen.bart', 'url': 'https://play.google.com/store/apps/details?id=com.dougkeen.bart&hl=en&gl=us'}
