{'title': 'Vector Pinball', 'description': "A free and open source pinball game, with simple vector graphics, a physics library for accurate simulation, seven table layouts, and no ads. \r\n\r\nSee the GitHub project page at https://github.com/dozingcat/Vector-Pinball if you'd like to help with coding or designing tables.", 'descriptionHTML': 'A free and open source pinball game, with simple vector graphics, a physics library for accurate simulation, seven table layouts, and no ads. <br><br>See the GitHub project page at https://github.com/dozingcat/Vector-Pinball if you&#39;d like to help with coding or designing tables.', 'summary': 'Free and open source pinball game with vector graphics and accurate physics.', 'summaryHTML': 'Free and open source pinball game with vector graphics and accurate physics.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.42, 'ratings': 1649, 'reviews': 567, 'histogram': [98, 49, 115, 181, 1203], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.8M', 'androidVersion': '1.6', 'androidVersionText': '1.6 and up', 'developer': 'Dozing Cat Software', 'developerId': 'Dozing+Cat+Software', 'developerEmail': 'bnenning@gmail.com', 'developerWebsite': 'http://www.vectorpinball.com', 'developerAddress': None, 'privacyPolicy': 'https://dozingcatsoftware.com/VectorPinball/privacy.html', 'developerInternalID': '4731315219912606343', 'genre': 'Arcade', 'genreId': 'GAME_ARCADE', 'icon': 'https://lh3.googleusercontent.com/D7Be6VMObQegAZRJy2MmhF3fv4BW8kGHoq88Nq3U3_t6aEzSdSzHfeLJpuG5ugsgKw', 'headerImage': 'https://lh3.googleusercontent.com/-jdD7fNq8AiS8odhRAnTyqVgR0CXUgB6Ep2kBRh9hBuaG8Adiu7NqmP1RT5ypuL4d-T4', 'screenshots': ['https://lh3.googleusercontent.com/uBOPweKms2uo21hI1hQBEmE4XNIyvvhOF-L7PDYyOpDeBPwnAOSwNot4iPhawEbSU-Zl', 'https://lh3.googleusercontent.com/fuHT37SJkQBBgQUmEuuQWcscko0Nl1lVDrW9rw1jhoUMRBEphJLhZpdsyhcr7X2sPA', 'https://lh3.googleusercontent.com/psL8d-ypOOBISTFtrxFTny7E4dHRDEN8oQG5rC4cL1A1EsV1qSBq07anUmwo2Dvj8sc', 'https://lh3.googleusercontent.com/MQrqZZDm4NtlfM-imzuxOIf1rwyejq16UdNmShWdagHNzxTHKGtA7XVQ7M4vinKq844', 'https://lh3.googleusercontent.com/CDNgrg_znCSbKkVai11uLkJkKteymGT6d87kMq9Z3_NslMzxR03KkTLGt3w2jqsbLA', 'https://lh3.googleusercontent.com/TAbadEroM96puk8N_FX0T-UTnfKP-9jiGufO43tY1--VaGFPUPc2CAxfqJaN4jS33A', 'https://lh3.googleusercontent.com/DxeeRR3rekPWHegd7A-OTwCA_sNdzhTSM2M0ZFZ9yu241VCE_aHTgKBq3NKLSKd7PkJE', 'https://lh3.googleusercontent.com/2TpnMjFWU9uOVuBB5tOSfrBnJiw4UA5jQERb6Zk8w9ZyYugroiS2j_119VsWtBKZNg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 20, 2010', 'updated': 1589952055, 'version': '1.8.0', 'recentChanges': '1.8.0:\r\n- New table with stars and constellations.\r\n- Performance and graphics improvements.\r\n\r\n1.7.1:\r\n- Scoring bug fix, minor performance improvements.\r\n\r\n1.7.0:\r\n- New table with ramps, orbiting planets, and sun with gravity.\r\n- Improved graphics quality.\r\n\r\n1.6.1:\r\n- Fixed bugs when field is zoomed.\r\n\r\n1.6.0:\r\n- Runs in 64-bit mode if available.\r\n\r\n1.5.6:\r\n- Option for unlimited balls when starting a new game. (This will disable high scores).', 'recentChangesHTML': '1.8.0:<br>- New table with stars and constellations.<br>- Performance and graphics improvements.<br><br>1.7.1:<br>- Scoring bug fix, minor performance improvements.<br><br>1.7.0:<br>- New table with ramps, orbiting planets, and sun with gravity.<br>- Improved graphics quality.<br><br>1.6.1:<br>- Fixed bugs when field is zoomed.<br><br>1.6.0:<br>- Runs in 64-bit mode if available.<br><br>1.5.6:<br>- Option for unlimited balls when starting a new game. (This will disable high scores).', 'comments': ['Still the best really free pinball game for Android, too bad there is no Linux version.', "I just opened the Play Store to search for a simple, free pinball game, and look what I've come to find! This game is amazing and actually not a waste of space. You definitely should expand on this by adding more tables. I also agree with the reviewer who suggested that more color schemes should be added should you play in a dark environment.", "I've been using this for years ever since there was only one table available. Thanks to the dev(s) for all the incremental improvements and adding new tables whilst always keeping the app streamline and ad free! Much appreciated :-)", 'Gem of a game! Simple and clean. Love to play in bed at night. Sound effects, graphics and colors are soothing. Open Source, no adds. P3/10.0', 'Great game! Thanks. Only thing I miss is immersion mode, cause I am always hitting the home and back buttons…', "Sill THE best Updated graphics look fantastic, much better visibility (like when this first came out years ago on tiny screens) and I love the new table! I'd easily call dozing cat the best developer on the play store, for supporting a great free game for so long.", "Found it while browsing F-Droid. Can't belive I haven't seen this game before. Its a gem for sure. So simple and clean. Just perfect. Looked it up on Google play only to give this review!", 'Great. Love the new line width option and newest table.', 'too simple and too floaty, otherwise nice', 'simple easy challenging and fun plus it isnt resource demanding and its under 10mb. honestly kinda reminds me of playing video pinball on atari 2600 for some reason. hope to see more tables soon. and listen to Erik E about level generation bc that would b brilliant. would honestly like more soothing relaxing type music like adrift in a sea of silver by dynatron and starforce.', "A bit of a hidden gem. I've only really explored the first table, but there are so many subtleties and techniques to it. I would highly recommend to anyone who is looking for dozens of hours of entertainment. Kind of wish it had higher contrast lines and maybe a light mode.", 'I like the simplicity of this game and that it is free of ads, but the color scheme is terrible, and there is no way to edit it. Dark blue lines against a black background are very hard to see except in a very dark room. I would rate higher if there were a way to change at least the background color.', "Simple, smooth and advertisment free. There are pinball simulators that are just as smooth with more complicated graphics but you'll need to pay for those or put up with advertising.", 'I only miss a score board and more levels (maybe let the game generate the levels). Other than that, perfect!', "Once I play this game, It's stops working.", 'Tiny file size, but great gameplay! Nice selection of tables and good options. Really satisfying!', 'One of the best pinball apps. Nice simple aesthetic, good tables, good physics, and completely free with no ads', 'Thanks for not having any advertisements or special permissions. Nice and simple pinball. :)', "Easy to pick up, hard to put down. Very high quality, and a game I'll be keeping on my phone for a long time.", 'Gorgeous, unique, and with brilliant sound design as well.', 'omg i love this pinball i can tell how much work was put in it im glad there are no adds no 100/10 😁', 'Amazing minimalist ad free. Great sfx!', 'BEST PINBALL GAME with no ads or purchases super rare and enjoyable', 'The best pinball for android!', 'Love it. More games like this!', 'those this app have no been updated in ages', "Now even BETTER THAN EVER...and best of all, it's STILL ABSOLUTELY FREE...NO ads, NO in-app purchases, NO NONSENSE AT ALL...Just ONE SUPER-COOL, FUN, DYNAMITE GAME!!! 😎", '👍', 'Requires zero permissions on your phone, light weight, endless fun. Every phone needs this!', 'Great game 👍🏼', 'Love it!', 'Pure', 'Great fun. I love the way the music and the sounds blend together. I have found two bugs. Firstly, if you press back during a game and then resume, the music stops. Secondly, if I exit to the home screen, the music continues playing and I have t close the app from the app switcher to stop it. This second bug is particularly annoying.', "This is probably the best pinball game I've ever played on a phone! No \nmicrotransactions, no gimmicks, just pinball. All of the tables are \ndelightfully challenging, and the graphics are incredibly smooth. I'm \nsurprised something so simple has managed to consume so much of my time!", "Small download and no ads, perfect for a retro style game like this. It's hard to go wrong with this if you like Pinball.", "Maybe the best free pinball game on app store, if you're looking for stripped down classic pinball style mechanics.", 'Great vector graphics and sound effects. This is a great piece of work, congratulations!', 'Thanks for adding the "Zen mode".', "Simple, engaging and fun. About all it doesn't do is have a place to put your pint while you play. Bravo. ;-)", "It's a great app, open source, no ads, just gameplay. It's amazing!"], 'appId': 'com.dozingcatsoftware.bouncy', 'url': 'https://play.google.com/store/apps/details?id=com.dozingcatsoftware.bouncy&hl=en&gl=us'}
