{'title': 'MyTargets Archery', 'description': "MyTargets is a free and even open source archery app, which helps you manage your archery scores.\r\n\r\n<b>Features</b>\r\n* Intuitive and easy to use\r\n* Beautiful Material Design\r\n* Manage equipment (bows, arrows)\r\n* Scoresheet (with print functionality for Android 4.4 and above)\r\n* Android Wear support\r\n* 25 Target Faces (including Field and 3D)\r\n* Support for several scoring styles\r\n* Statistics\r\n* Saved Sight Marks\r\n* Supports standard rounds\r\n\r\n<b>For Experts</b>\r\n* Track the performance of individual arrows\r\n* Track weather conditions like wind speed and direction\r\n* You can even create your own custom standard rounds\r\n\r\n<b>Translations</b>\r\nThe app is already available in over 20 languages. If your language is not yet supported or you spotted some mistakes in your translation, you can easily translate the app yourself on the following website\r\nhttps://crowdin.com/project/mytargets\r\n\r\n<b>Community and Beta Test</b>\r\nIf you want to participate in discussions regarding the future development of the app, you can join our G+ Community.\r\nMembers of the group also have the option to try out the latest beta versions of the app. Therefore if you can't wait to try out new features this is the place for you :)\r\nhttps://plus.google.com/communities/102686119334423317437\r\n\r\n<b>Problems</b>\r\nIf you find any bugs or you have ideas for new features you can either contact me directly via Mail or use the following ticket tracking system https://github.com/DreierF/MyTargets/issues", 'descriptionHTML': 'MyTargets is a free and even open source archery app, which helps you manage your archery scores.<br><br><b>Features</b><br>* Intuitive and easy to use<br>* Beautiful Material Design<br>* Manage equipment (bows, arrows)<br>* Scoresheet (with print functionality for Android 4.4 and above)<br>* Android Wear support<br>* 25 Target Faces (including Field and 3D)<br>* Support for several scoring styles<br>* Statistics<br>* Saved Sight Marks<br>* Supports standard rounds<br><br><b>For Experts</b><br>* Track the performance of individual arrows<br>* Track weather conditions like wind speed and direction<br>* You can even create your own custom standard rounds<br><br><b>Translations</b><br>The app is already available in over 20 languages. If your language is not yet supported or you spotted some mistakes in your translation, you can easily translate the app yourself on the following website<br>https://crowdin.com/project/mytargets<br><br><b>Community and Beta Test</b><br>If you want to participate in discussions regarding the future development of the app, you can join our G+ Community.<br>Members of the group also have the option to try out the latest beta versions of the app. Therefore if you can&#39;t wait to try out new features this is the place for you :)<br>https://plus.google.com/communities/102686119334423317437<br><br><b>Problems</b><br>If you find any bugs or you have ideas for new features you can either contact me directly via Mail or use the following ticket tracking system https://github.com/DreierF/MyTargets/issues', 'summary': 'Helps you manage your archery scores.', 'summaryHTML': 'Helps you manage your archery scores.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.5648537, 'ratings': 2416, 'reviews': 1049, 'histogram': [101, 40, 80, 363, 1829], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '7.3M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Mantis Tech', 'developerId': 'Mantis+Tech', 'developerEmail': 'support@mantisx.com', 'developerWebsite': 'https://mantisarchery.com/', 'developerAddress': '2270 US Hwy 30\nOswego, IL 60543', 'privacyPolicy': 'https://github.com/DreierF/MyTargets/blob/develop/PRIVACY.md', 'developerInternalID': '8639465375648959228', 'genre': 'Sports', 'genreId': 'SPORTS', 'icon': 'https://lh3.googleusercontent.com/d6b_lRQBG7wWZQ24OgireBgUk_RZeA2oiwJ_CfX5hwFxHp4Xn05Kjkau9SRYuOsMJSs', 'headerImage': 'https://lh3.googleusercontent.com/OHfZHYIH33xynN3jdlu5qQ-CHVPgl7JnXGBdvzNuiLGXla2dxHgtj3mlQORlwdrGLMzP', 'screenshots': ['https://lh3.googleusercontent.com/eLIA0FwHiNHkhsBYOz3jnWp6HkOE-vtiyyPMg9PzCJj8l3vtITYvKKQX87uZa31dSB0', 'https://lh3.googleusercontent.com/HhWb_M5UaVoMS_Y1yC0yoie5-MRTYi3_nw83Qw_k2CpRPK4TkWxKICkXvGnEiCWb2fg', 'https://lh3.googleusercontent.com/KTTkH5ivocvlC4QN7MUfF9cqgXMASRtojnQqbpRtBHzo7Mw-rGPScX_D1YcRej6HZuo', 'https://lh3.googleusercontent.com/ts6GHPez6iF-U9u2DGxESmgTZKjAJ9FoQPLAQNMQewsY0NqxNuE-8SsA53Pu0vsuawk', 'https://lh3.googleusercontent.com/WWFtedezyJT_sqWQ_i5hkWPe7OWWi3LPxaqjWbv5Vy4JKongfEcx9KLhr9IcHB6cTsw', 'https://lh3.googleusercontent.com/10Bu93sc-yG3ZQrTelJe8rHcnm4S7pTp90lgX6dU7tJ_hMXc7sSWiJ2xNJMh32BLzJED', 'https://lh3.googleusercontent.com/hZ6BykNG1biKchxpfQ_tKFN1jffvJjqE5-3jlvW16hZgcfUpZXGKY2vooyODiX1pjf8', 'https://lh3.googleusercontent.com/hUA5U49yh_nKMu2RNRjM_5tdDd0ply6ZMM7GOjgsznXf6H1S-aE5OM4v6raTqoLCEO8', 'https://lh3.googleusercontent.com/atHuey4oPnNrtYzMnLIIkrbk3Pc4DlZeKTaQG5rw4kuxLeIbdMN8NmamXWh6KEbU2No', 'https://lh3.googleusercontent.com/d9oTw-5mNUrPhBkwxC05Rg5fof3bFl1KQ3dT4uRP5eFJPfzkGGSv8J9GdpjmSQob_8I', 'https://lh3.googleusercontent.com/zKWNURlYidL1BrzX2_64PJFZiZlTNJsBc-xdIfi0D0iHZ9e7LrrWKqVswqYSTeTPUACW', 'https://lh3.googleusercontent.com/FDqEPyl7hm_Eq_fm1AeHxOGXyLqPVs0UVGoXZ7EN1lpUWnH7qGAsGmURCqBoitpJzKJb', 'https://lh3.googleusercontent.com/jmrHkX-qevWI4745LzWG4s04JDGWJNQAsvR_2jBDQtt5cc66TyYYEgiLOavOL7kQhy7A', 'https://lh3.googleusercontent.com/o9xTK5XTjNyzc5TaaKOXpra3eff7mRJNqIUjBIbLBJKmBE0sIM0DWfWWfnRfDc0HYJU', 'https://lh3.googleusercontent.com/uX852Pdy0gybxucACgmEMgp7i99jYqtPGcdgEkqp5P-1yG2_zQuB-cFnKsMmurS93dY', 'https://lh3.googleusercontent.com/8_nNw7KPeg-UxzxK6lN0vHt82_I82BwHmu-ptNauH5ZvTu4O7w8LSd23UzKPD-5H7yA', 'https://lh3.googleusercontent.com/VykxmxAGLQcqQpp-pV4Pbl7HrOfYsPeH-gYdkkrfBOi_jJaMKiRAvnFA6T3YLoQtRPMt', 'https://lh3.googleusercontent.com/FAK0gNfLf_EgCL8JfN29NaJMrNTlhiCwGONDFxn2GOZxWpJINWp3U7keV7wPrnA3sDo', 'https://lh3.googleusercontent.com/ssMYKU-48GB0k4JVieCgK_tI6B9u-z8VzLfUUoHjzghEFpb-OPL81FxiZEcd7fNNOA', 'https://lh3.googleusercontent.com/WUOLLK8doQCdNgbFwh8k9ih40SG6AwpFxqIf22MuD3PzINm9D3-9PfZvixVkpU3LlOA', 'https://lh3.googleusercontent.com/B6PwqM270lP-kcJsClZ3TM0z0Ucv1XG8x99Ur6e6BO0A7031kiCFsULDdnzwjfsm7A', 'https://lh3.googleusercontent.com/-77LOI1Gkb2iv3Xsj2_eSWHxiVOhb8aqV-olCskLI_Tk4Jt6iKpRD92mNI7HON-Kvos', 'https://lh3.googleusercontent.com/FtePTceRuPu8XP3xsZJGJ7lfOYkoYkxFD7udtW-tmcL5PZB1WWUSvDWVRIeeRq9reO4', 'https://lh3.googleusercontent.com/Ps7hePKzcRD96Peifg9xo4TW6fd9mYk1EJBCZdbeAVBMWGRIlzVmSx0_MJ_Ph61oFw'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Oct 23, 2014', 'updated': 1591024090, 'version': '3.0.5', 'recentChanges': '- Completely new main screen\r\n- More performant Scoreboard (with PDF export and signing)\r\n- Comments can now be added to every training, round and end\r\n- Delete single shot button\r\n- Finger slip detection\r\n- Timer can now be used independently of a training\r\n- Timer now also works when the screen is locked\r\n- Timer and input stay on top of the lockscreen\r\n- Up to 24 arrows per end\r\n- Unlimited arrow numbers', 'recentChangesHTML': '- Completely new main screen<br>- More performant Scoreboard (with PDF export and signing)<br>- Comments can now be added to every training, round and end<br>- Delete single shot button<br>- Finger slip detection<br>- Timer can now be used independently of a training<br>- Timer now also works when the screen is locked<br>- Timer and input stay on top of the lockscreen<br>- Up to 24 arrows per end<br>- Unlimited arrow numbers', 'comments': ['pretty, clean but disappointing Try to set it up for a range with 28 targets, all at different distance, different target size. no joy. Also it puts a wrong date on the score card. It should be date completed, not day created.', "Been using this for over a year and was one of my favourite apps. Had everything I wanted. Mistakenly came to depend on it. Got 'upgraded' yesterday and simply stopped working.", 'Few minor glitches with the DAIR target but this is a great ap for archery shooters. It does so much and is so easy to use. The variety of targets you can select is fantastic. The data provided is amazing and so much easier to read and see compared to other target aps. So easy to mark arrows you just drag and drop on the target. Recommended.', "Apps not bad once I learned how to use it. My BIG GRIPE is: I cannot track my Xs on Vegas 3-spot. If I score a 10, it looks like an X. Missing that golden 10-ring around the nickel-sized x-ring. Please fix this. I'd pay for the app with this simple feature. 🎯 Got it thanks. But it scores 11s not X's. 😒 There's an X-5-4-3 option. Any chance you could add X-10-9-8-7-6 option? You know Vegas Style (?) Figured it out - recurve style? Umm ok.", 'A good app to track arrow hits and average arrow score. Wish it had multiple shooter option.', 'Fantastic app, really easy to use and great data available after you log a shoot', 'This app is very helpful but sadly is no longer usable on a smart watch, which was my main reason for picking this product. The only thing I would like to see is my Handicap score. a place to record it would be perfect and if you stored my email and the score keepers email - one for indoor and one for outdoor, we could then submit scores at the push of a button at the end of the day.', 'I love the software - easy to use.  Love the timer which you can turn off or on.   I would love if you could add ratings to shoots.  This would be simple modification and would allow archers to compare there shooting on different rounds.  My second thing I would love to see is a ratings table for archers which they could post scores to after they shoot.  So archers everywhere can compete and track.    Fantastic work.', "this seems like a great app so far! there are some bits of it that i don't quite understand yet though and i was hoping someonw could help me. i recently shot two indoor rounds and decided to log them under 'training with standard round'. for some reason the app automatically assigned a target size and distance to these rounds, both of which were wrong and both of which i can't figure out how to change! is there somewhere i can do this similarly to in the 'free training' option? Thanks", 'The score keeping is great and I love the Wear OS integration. My main gripe is the "backup and restore" feature DOESNT WORK! As someone who has multiple phones and just wants to make sure i can backup my data, this is a major disappointment for me. If that feature worked, the app would be near perfect.', 'Have used it for a couple weeks and it is the most comprehensive app I have found for scoring and saving training (paid app or not)', "This is a very flexible app, you can use it to quickly record the score numbers or get technical and plot positions etc.  The thing that has really sold me is how you can email a pdf of your scoresheet to the club secretary, I've never done that role yet but she assures us that she prefers receiving info this way.", "This app is a must have for any archer. The inputs are very user friendly. The stats are exactly what is needed for tracking. Very happy I found this tool as it will definitely help in my progress. So many variations included it's hard to believe it's a free app. Thankyou Florian Dreier for the time you put into making this.", "Been using this since starting to shoot in the summer and it has been excellent.  The only issue I have found is when trying to log a custom round on different targets, only the first target face gets used. I could be missing something, though.  Other than that, it's perfect.", "fantastic app, great for scoring all sorts of standard rounds, and you can make your own, i would say it is not that intuitive when first using, but do persist as its the best I've seen and really easy once you are used to it.", "I really love this app, I've been shooting for a year and this has really helped me track my progress. However it's becoming really annoying when I have to look at all my scores to find my PB for each round. Is it possible to add a PB page so my best scores are all available on one page.", "I love the app and think it's the best one for target archers available. The flow through the app is easy and marking arrows is precise.  Maybe i missed it but having a notebook for training remarks but independent from tracked trainings would be great.", 'This  is a great app. I am only scratching the surface of its capabilities. Both I and my 11 year old son use it constantly. Saves a lot of fluffing around with paper scoresheets and then translating to spreadsheets.   Thoroughly recommended- I would pay for this app!', 'A really good application. Easy to use with the latitude to customize according to your individual needs. If there was one recommendation, it would be to include the facility of a second or third scorecard, for league or tournament shoots.', "For someone who has a coach that is not an app in archery, this really can't be the best app you could use. I would say that a chanhe they could make is maybe having a outdoor season and a indoor season. Then people can track there progress over the years of there seasons. They sould also make the ends 3 arrows per end", "great app... really helped me dial in my bow and track my shooting. only problem is I can't figure out how to set up a second round on a practice day. if I could figure this out it would be 5 stars all the way!", "The one thing that need to be fix is the graphic chart. When i shoot pass midnight the graphic chart looks messed up. I know not many people shoot pass midnight, but hey, wouldn't it be great if it is run the way it suppose to?", "Really don't want to give a bad review but the restore and backup function still doesn't work properly, you can't restore your data if you change phones or lose them Other than that the app is good for score keeping and tracking your archery progress", "Good app to use but it has its own share of drawbacks : can't backup and restore data from my old phone. No help is available for retrieving the backup. Some inputs from development team would be handy.", 'this app is very helpful when come to collecting score and it gives you a chart to see your improvement all for free withe no ads, what could be better!!', 'A brilliant app for practice to see how your grouping, where you grouping and gives you easy to understand information on your overall scoring during pratice.', 'Useful app, however backup restore function not working properly. Unable to restore from google drive backup after changing phones. Please check if there is a problem with the feature.', 'I love this app. The only thing that would make it better would be release aid tracking. I shoot both thumb and hinge releases with my compound bow.', "Works as expected, more so Because it's free.", 'I love it I was a little confused at the beginning .but I get it in work great', 'Great app, but I wish there was a way to do multiple profiles for additional archers.', 'A great app. I use it every week at the range to keep track of my performance.', 'Simply a perfect app with a lot of options and features! The best I have ever tested!', 'Great APP, extremely easy to use. Can track progress and patterns. Also weather conditions.', 'I would love a few horseback archery targets on here, other than that this app has been amazing', "I love this app. It's pretty useful and i like how there's a timer", 'New to archery, I found this app very intuitive and easy to use. Many thanks to the authors.', 'Great app but far too easy to skip an end without noticing.', 'Very helpful and useful. But if can be multiple accounts would be great', 'Otherwise SUPER app, is it possible to add Field target faces?'], 'appId': 'de.dreier.mytargets', 'url': 'https://play.google.com/store/apps/details?id=de.dreier.mytargets&hl=en&gl=us'}
