{'title': 'Tux Rider', 'description': 'Control penguin Tux, riding down a snow slope, collect fishes, earn scores and advance through nine unique levels!\r\n\r\nps: see help for game controls.', 'descriptionHTML': 'Control penguin Tux, riding down a snow slope, collect fishes, earn scores and advance through nine unique levels!<br><br>ps: see help for game controls.', 'summary': 'Ride penguin Tux down a snow slope, collect fishes, beat time to advance levels.', 'summaryHTML': 'Ride penguin Tux down a snow slope, collect fishes, beat time to advance levels.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.81, 'ratings': 2012, 'reviews': 787, 'histogram': [342, 140, 181, 241, 1106], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '9.4M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'drodin', 'developerId': 'drodin', 'developerEmail': 'tuxrider@drodin.com', 'developerWebsite': 'http://drodin.com/tuxrider', 'developerAddress': '315/315, Moo 12, Thepprasit Rd., Nongprue, Banglamu, Chonburi, Thailand - 20150', 'privacyPolicy': 'http://drodin.com/tuxrider/', 'developerInternalID': '8824295758525264116', 'genre': 'Arcade', 'genreId': 'GAME_ARCADE', 'icon': 'https://lh3.googleusercontent.com/Cmfb_ca2vabPjWDiAvLPSFU63sBKDjAXtiEFgDLP0cukVX6uvniwe1tSQExMPc26gg', 'headerImage': 'https://lh3.googleusercontent.com/c9BChfMqKNFX1On_ywux3Ad9Qoa8mRpi--OrFi_vlM2_71H7NK_SPdzFZPdoGEZ5mkg', 'screenshots': ['https://lh3.googleusercontent.com/KmwV5rp7vdYLj0hFukgXyYxkFtZTu1vO2mlz08X0_QqIMUQiQs4StUn0-RJy3bC8lkc', 'https://lh3.googleusercontent.com/uGCl1Lz3YyudmbNz7fEwQ0u3igXoJ8AcIJLvSF0l4VRsXrXDpCQuH7sJoLfFO22whog', 'https://lh3.googleusercontent.com/7wQKjSCKU_PAB_RupPR4gZp_1DpkX6CwGj4POIYhv1q0iw5C6DPv5vrzu5Gs8wP58Fk', 'https://lh3.googleusercontent.com/vjPFy1WBRaXHh8I1cJr4WBUGMNK2Wv-8exz_S8gD9arlJKuIfMZfn1lS2XhgwNHMiQ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Apr 28, 2010', 'updated': 1576653154, 'version': '1.5.0', 'recentChanges': 'Ads removed\r\nPrivacy Policy added', 'recentChangesHTML': 'Ads removed<br>Privacy Policy added', 'comments': ["As a Linux user, I find this a bit different. This version is very unstable and crashes often, also the in-game audio isn't there", 'Honestly, the old version was better, it had sound effects that were not so obvious when they looped, the game had music, it was in 3rd person, the speed wouldnt just stay stuck in 10 m/h. Basicly, this remake is trash :(', 'In this game,penguin should be visible so that control is good just like tux rider in linux desktop.Please improve it.', 'You can get the 3rd person one if you Google tux racer apk and the first link is what you should click', 'I luv this game i used to play in my school computer lab when I Was in childhood', 'Just like in the linux computer.', 'i love this game', 'aushom! game but not popular', "childhood's favorite game 🤗", 'Worst game i ever played 😒😒', 'Very bad game', "A pretty good port of Tux Racer. Would appreciate if on-screen contols were added because the motion controls can be annoying. Also, on devices without the menu or camera key, it's impossible to change the view. Also there's no music during the race (though that's not a super big issue like the first two). If the first two issues were fixed, I'd give it 5 stars.", 'Aarti sahu', 'aa', 'I can see tux till he start the race. Then tux is invisible!  The game stopped after few seconds. A crash report sent...', 'Accelerometer responses not sensitive enough; acts like it wants to turn but doesn\'t turn. Isn\'t clear when the machine zeros, so it\'s hard to get going fast enough soon enough. Maybe have a calibration page, in which you can see your tux responses in bar charts? Or allow the user to dial up/down the sensitivity? As it is, with a "perfect" run on "bumpy ride", still can\'t complete it fast enough... and yes, the penguin seems slow at first.', 'Does not work.', 'Fantastic port of the Free and Open Source classic on Linux!', "But two of of the races don't work", "I love Tux Racer, always have, but passing this on my Galaxy Note 3 is glitchy. On the flying penguins level (the level that made me love thus gave when I was younger) starts normal and then it starts moving really slow. The penguin won't go faster  than five mph and I can't get anywhere. Is this user error on my part? O_O", 'After about one second the simulation runs at about 1/10 speed, even on low video quality.   Worthless on my Galaxy Tab 3 8.0 with Android 4.4.2', 'Hey guys, major fix for Galaxy Note 10.1 needed. The game orientation is a problem. When im racing down the slope and want to turn, my horizontal screen is playing with me. My left is up and right is down its like the orientation of the game was set as horizontal but the orientation of the controls is portrait.', "Doesn't work on my lg gw620 goes from the loading screen to a black screen with music in the background. Id love to see it fixed though!", 'Speed falls down, when reaching high speed in all fast levels: flying pinguins and up. Please fix, love this game', "As much as I don't like giving 1* it just doesn't work.", 'little bit buggy. it is as though the penguin gets pinned down on the floor and cannot move sometimes.', 'None of the controls worked and the penguin went agonizingly slow. Original linux game was much better', 'Galaxy tab 10.1 tux swings all to the right wnen starting the game....', 'Just like the Linux game... but it is buggy on controls, ESP w/accelerometer. Flying penguins levels buggy also. Still nice for android', "Great! Some may not like it because they don't pick it up and master it but once you do get it, its great..", 'Its alright. Not as good as the original Linux version. (Rooted Nook Color).', "If you have played Extreme Tux Racer, you should see this. It's a great port. Now if someone would do SuperTuxKart.", 'The steering is impossible on a galaxy tab 4 10" screen and on an LG ls620. The game is quite unplayable.', "Good game but on some tracks have a bug, on this tracks doesn't go faster than 5 km/h", 'sec in 1st map, Cm9 4.0.4', 'Really really good so far but the higher levels need fixing. I love it. It was one of my faves when I got my Linux computer and I really want to play it here :)', "Its pointless to port the best game ever if the controls don't work", 'W.T.F I am running ESET.', 'Bad controls nd boring', 'Smooth as anything on my Epic and motion controls work surprisingly well. Harder than I remember!'], 'appId': 'com.drodin.tuxrider', 'url': 'https://play.google.com/store/apps/details?id=com.drodin.tuxrider&hl=en&gl=us'}
