{'title': 'Vision - Crypto - Portfolio & Multi-Chain Wallet', 'description': 'Vision helps you to keep track of your crypto and gives you an overview of your portfolio. With the help of its integrated wallet, it is also possible to receive, send, and hold crypto including the most favorite blockchain - Bitcoin!\r\n\r\nGet the full power of crypto in your new secure portfolio tracker and wallet! 🔥\r\n\r\n<b>Supported</b>\r\nBitcoin (BTC), Ethereum (ETH), Tether (USDT), Bitcoin Cash (BCH), Litecoin (LTC), OKB (OKB), Huobi Token (HT), TRON (TRX), Dash (DASH), DigiByte (DGB), Crypto.com Coin (CRO), USD Coin (USDC), Maker (MKR), Basic Attention Token (BAT), Dogecoin (DOGE), Paxos Standard (PAX), TrueUSD (TUSD), Enjin Coin (ENJ), 0x (ZRX), Augur (REP), Kyber Network (KNC), Dai (DAI), OmiseGo (OMG), MCO (MCO), KuCoin Shares (KCS), Synthetix Network Token (SNX), Holo (HOT), Nexo (NEXO), BitTorrent (BTT), WINk (WIN), JUST Stablecoin (USDJ), JUST (JST), Swipe (SXP), Binance Coin (BNB), Telcoin (TEL), Travala.com (AVA)\r\n\r\n<h1><b>FEATURES</b></h1>\r\n<b>PORTFOLIO</b>\r\nThe portfolio gives you a complete overview of your cryptocurrencies. The chart shows you how the price has developed and how much you have gained or lost in a certain period. Additionally, you can view your account balance in many different fiat currencies.\r\n\r\n<b>WALLET</b>\r\nWhen you create a wallet, it is very important that you store your received recovery phrase safely, because nobody but you has and should have access to your wallet.\r\nWith the wallet, you will be able to send and receive cryptocurrencies and we take care of synchronizing your balances and transactions.\r\nThe wallet supports BTC, ETH, BCH, LTC, DASH, DOGE, TRX, ERC20, and TRC10/20 tokens. We are already working hard to add even more.\r\n\r\n<b>CRYPTO EXCHANGE</b>\r\nWith the Exchange, you can swap your currency into different currencies in a very short time. Vision supports BTC, ETH, LTC, USDT, TRX, DOGE, TUSD, CRO, MCO and many more.\r\n\r\n<b>CONNECT WITH EXCHANGES AND WALLETS</b>\r\nConnect your portfolio to various exchanges or different wallets to automatically synchronize with your portfolio and view your account balance live.\r\n \r\n<b>MARKET OVERVIEW</b>\r\nThe market overview provides you with a list of many currencies and their corresponding price in a certain period in your selected fiat currency. You will also get a lot of information about each currency (market Info, pairs on different exchanges, development, social media sentiment, links, etc.)\r\n\r\n<b>PRICE ALERT</b>\r\nYou can create an alert to be notified when a currency has reached a certain price.\r\n\r\n<b>ANALYTICS</b>\r\nGet individual analyses of your assets and get, for example, an overview of which platforms you have distributed your money on.\r\n\r\n<b>NEWS FEED</b>\r\nTo stay up to date you will be offered a news feed with informative and current articles categorized between bitcoin, altcoin and blockchain topics.\r\n\r\n<b>LOGIN WITH YOUR GOOGLE OR TWITTER ACCOUNT</b>\r\nTo use your portfolio also on other devices, you can optionally log in with your Google or Twitter account.\r\n\r\n<b>DARK/LIGHT MODE</b>\r\nYou can switch between the dark and light themes, depending on what you like better.\r\n\r\n\r\nVision also offers a PRO mode to use the app to its full extent. By subscribing to the app, you are supporting the team behind Vision to continue to improve the app and update it regularly.\r\n\r\n<b>PRO FEATURES</b>\r\n- Multiple Portfolios and Wallets\r\n- Unlimited Exchange and Wallet Connections\r\n- More Analytic Features\r\n- Display Your Balance also in Cryptocurrencies\r\n- Extended Theme Options\r\n- We are working on even more!\r\n\r\n-------------------\r\n\r\n<b>CONTACT</b>\r\nE-Mail: support@vision-crypto.com\r\nWebsite: https://vision-crypto.com/  \r\nTwitter: @VisionCryptoApp\r\nInstagram: @vision_crypto_app\r\nTelegram: https://t.me/vision_crypto_en \r\nPrivacy Policy: https://vision-crypto.com/privacy-policy/ \r\nTerms of Use: https://vision-crypto.com/terms-of-use/', 'descriptionHTML': 'Vision helps you to keep track of your crypto and gives you an overview of your portfolio. With the help of its integrated wallet, it is also possible to receive, send, and hold crypto including the most favorite blockchain - Bitcoin!<br><br>Get the full power of crypto in your new secure portfolio tracker and wallet! 🔥<br><br><b>Supported</b><br>Bitcoin (BTC), Ethereum (ETH), Tether (USDT), Bitcoin Cash (BCH), Litecoin (LTC), OKB (OKB), Huobi Token (HT), TRON (TRX), Dash (DASH), DigiByte (DGB), Crypto.com Coin (CRO), USD Coin (USDC), Maker (MKR), Basic Attention Token (BAT), Dogecoin (DOGE), Paxos Standard (PAX), TrueUSD (TUSD), Enjin Coin (ENJ), 0x (ZRX), Augur (REP), Kyber Network (KNC), Dai (DAI), OmiseGo (OMG), MCO (MCO), KuCoin Shares (KCS), Synthetix Network Token (SNX), Holo (HOT), Nexo (NEXO), BitTorrent (BTT), WINk (WIN), JUST Stablecoin (USDJ), JUST (JST), Swipe (SXP), Binance Coin (BNB), Telcoin (TEL), Travala.com (AVA)<br><br><h1><b>FEATURES</b></h1><br><b>PORTFOLIO</b><br>The portfolio gives you a complete overview of your cryptocurrencies. The chart shows you how the price has developed and how much you have gained or lost in a certain period. Additionally, you can view your account balance in many different fiat currencies.<br><br><b>WALLET</b><br>When you create a wallet, it is very important that you store your received recovery phrase safely, because nobody but you has and should have access to your wallet.<br>With the wallet, you will be able to send and receive cryptocurrencies and we take care of synchronizing your balances and transactions.<br>The wallet supports BTC, ETH, BCH, LTC, DASH, DOGE, TRX, ERC20, and TRC10/20 tokens. We are already working hard to add even more.<br><br><b>CRYPTO EXCHANGE</b><br>With the Exchange, you can swap your currency into different currencies in a very short time. Vision supports BTC, ETH, LTC, USDT, TRX, DOGE, TUSD, CRO, MCO and many more.<br><br><b>CONNECT WITH EXCHANGES AND WALLETS</b><br>Connect your portfolio to various exchanges or different wallets to automatically synchronize with your portfolio and view your account balance live.<br> <br><b>MARKET OVERVIEW</b><br>The market overview provides you with a list of many currencies and their corresponding price in a certain period in your selected fiat currency. You will also get a lot of information about each currency (market Info, pairs on different exchanges, development, social media sentiment, links, etc.)<br><br><b>PRICE ALERT</b><br>You can create an alert to be notified when a currency has reached a certain price.<br><br><b>ANALYTICS</b><br>Get individual analyses of your assets and get, for example, an overview of which platforms you have distributed your money on.<br><br><b>NEWS FEED</b><br>To stay up to date you will be offered a news feed with informative and current articles categorized between bitcoin, altcoin and blockchain topics.<br><br><b>LOGIN WITH YOUR GOOGLE OR TWITTER ACCOUNT</b><br>To use your portfolio also on other devices, you can optionally log in with your Google or Twitter account.<br><br><b>DARK/LIGHT MODE</b><br>You can switch between the dark and light themes, depending on what you like better.<br><br><br>Vision also offers a PRO mode to use the app to its full extent. By subscribing to the app, you are supporting the team behind Vision to continue to improve the app and update it regularly.<br><br><b>PRO FEATURES</b><br>- Multiple Portfolios and Wallets<br>- Unlimited Exchange and Wallet Connections<br>- More Analytic Features<br>- Display Your Balance also in Cryptocurrencies<br>- Extended Theme Options<br>- We are working on even more!<br><br>-------------------<br><br><b>CONTACT</b><br>E-Mail: support@vision-crypto.com<br>Website: https://vision-crypto.com/  <br>Twitter: @VisionCryptoApp<br>Instagram: @vision_crypto_app<br>Telegram: https://t.me/vision_crypto_en <br>Privacy Policy: https://vision-crypto.com/privacy-policy/ <br>Terms of Use: https://vision-crypto.com/terms-of-use/', 'summary': 'Bitcoin & Crypto Vision at a Glance - Portfolio Tracker and Multi-Chain Wallet', 'summaryHTML': 'Bitcoin &amp; Crypto Vision at a Glance - Portfolio Tracker and Multi-Chain Wallet', 'installs': '50,000+', 'minInstalls': 50000, 'score': 3.72, 'ratings': 865, 'reviews': 466, 'histogram': [216, 34, 25, 86, 501], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '107M', 'androidVersion': '6.0', 'androidVersionText': '6.0 and up', 'developer': 'Vision Software UG', 'developerId': 'Vision+Software+UG', 'developerEmail': 'support@vision-crypto.com', 'developerWebsite': 'https://vision-crypto.com/', 'developerAddress': 'Vision Software UG (haftungsbeschränkt)\nHauptstr. 2c\n22962 Siek\nGermany', 'privacyPolicy': 'https://tronblocks.flycricket.io/privacy.html', 'developerInternalID': '7879969512976457339', 'genre': 'Finance', 'genreId': 'FINANCE', 'icon': 'https://lh3.googleusercontent.com/LntzH7ZORdu4_nLDyO8K5DQbqXcFks9ul3Vwe-Nlis7jjnuvTmdBH1-jv8DNJYI7nwk', 'headerImage': 'https://lh3.googleusercontent.com/_MWiaCX1MHK5IGx2IVfxJ9VPn2O7_-A_MLywBCANklknLnU66ZEm94jv5BQjwNObJXc', 'screenshots': ['https://lh3.googleusercontent.com/qQySYy73-9FOtHVmHq9ulW65E7cLlBb_Wf8fuKzFeItKfOhdRh-Ys-z-ODe8f4fAZXU', 'https://lh3.googleusercontent.com/uO9bNno7Ocl5i4UKDP2XjYsAOmO8r9GYJfYKBct-J0ZA-gO1SjKd9tuN2Bzu8ratSII', 'https://lh3.googleusercontent.com/LWGY_X7B21Alqur0BOikiaQA4bPHsPTci5fRBL_UmWML6LefJ-rw-AXNlK-qCfVENw', 'https://lh3.googleusercontent.com/xpS8ZZX6DGoNQ5kx1CSP2HzdDcgSwlItlzMZw3c0cp3FgATdGq-hfRNZf3uvNrpvm6o', 'https://lh3.googleusercontent.com/evku82R9L8RB7EqRXq_2T78rpBMM6HczfY4skC-_EXlKiwBim2IkoQJAAJepetdgRNc', 'https://lh3.googleusercontent.com/CdTVjDEoCk38h0DVuHav40mJq8xjc79WMhYXfkK3QyAkEi973ZVAX6JUGfn5doUtzic'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'May 13, 2018', 'updated': 1591440601, 'version': '1.0.57', 'recentChanges': 'We work hard to implement new features, bug fixes, and improvements regularly!\r\n\r\nChanges in this version:\r\n\r\n- Candlestick chart now available\r\n- Improved analytics page\r\n--- Chart Breakdown now shows the gain/loss differences much better and you can scroll through the chart to see the percentage changes\r\n- Bug fixes and improvements', 'recentChangesHTML': 'We work hard to implement new features, bug fixes, and improvements regularly!<br><br>Changes in this version:<br><br>- Candlestick chart now available<br>- Improved analytics page<br>--- Chart Breakdown now shows the gain/loss differences much better and you can scroll through the chart to see the percentage changes<br>- Bug fixes and improvements', 'comments': ['App is now accessible, but my wallet was not ported over, nor was it available when I reverted back to Tronblocks. I have lost all of my funds because of this, as I was given no warning that this transition was going to happen and did not have the opportunity to generate a recovery phrase. My wallet has effectively been deleted and now I have no way to get my funds back. Do not download this app.', 'So I log in to my phone. Want to check on my wallet. Guess what? The app updates and deletes any traces of my wallet ? So all of my coins are lost now ? Wow ... Not to mention that I was already logged in to the old app. No question to do an update just went through with it...', 'I was running tronblocks. After getting an update notification i update all my apps and realize that tronblocks is not there any more. After one hours of frustration I could see a new app was installed called vision. After i run this app i realize that this is a kind of replacement for tronblocks. The support says they have notified through tronblocks but i did not see any. Any ways i think there are better ways of handling such tasks than what vision did. So vision gets a thumbs down from me', "My wallet was not ported over. I recovered my wallet but it wasn't showing my frozen TRX. I contacted support and they were extremely quick with their response and help. I recovered all my frozen TRX with their help. 5/5 rating for the Vision support.", 'Frozen assets (trx) are not being shown in balances. However, every hour application notifies user that frozen assets have been receieved/sent/receieved/sent on a loop. Transferred assets also are not showing up in balances.', 'App not opening since first updated . Not happy at all. Please advise since uninstall and re-install did not work ..', "App crashes and won't open. Basically lost all my tron. You need to ask my permission before forcing an update like this. You will pay", 'not working. just showing a white page', "White screen on start. Doesn't load up.", "Doesn't start, keeps stopping at once", 'Garbage, tronblocks should of stayed solo instead of joining this trash.', 'very good and very useful', "Used to be called tronblocks. Loved it. Woke up this morning to find out it's a completely different app. Uninstalled and moved to tronwallet..", "Recently I have noticed that this was unlisted from tron.network website as recommended wallet.  I also experience some kind of issue. For the past 1,5 week I am not able to get any kind of rewards from voting on representatives. I tried changing between different ones, giving 3-4 days for the rewards to arrive, but nothing worked. No matter how good payments are from representatives.   It also has some bugs like BTT price never updates, you are unable to see your previous transactions.   Because this was unlisted from tron.network website and rewards issue I have decided to move my tokens to another wallet I have had.   I hope this wallet will get fixed although I haven't heard any news for this wallet in a while now.", "This was a forced update for me! Updated overnight. Wallet completely changed; lost some coins, had transactions I didn't do, current value never changes. I didn't try to withdraw any yet, but hopefully it works! So far...hate it and not trusting it. **UPDATE** disabling the TRC-10 did work for showing other coins. Thanks! The current value still doesn't update, but the more I mess with the app, the better I like it.", "like most of the post I've read, I too have NOT been able to move my TRX from this wallet. it pisses me off because I never would have tried this unless I was redirected to it by my nano ledger. I wrote an email to have them explain the problem and I still have not gotten a resolution. does anyone have any other ideas. I want my coins!!", 'SENDING FAILED TRY AGAIN FIX!! You cannot have your cold wallet on the same device otherwise you will not be able to complete ANY transactions. You need to download the app onto ANOTHER device and then import your cold wallet onto that device. Now after scanning and signing transactions using BOTH devices everything should work fine.', 'Functional tight App, great starting point for any user, nice to see Btc trading.', 'Fails to mention that it has NO CUSTOMER SUPPORT!! I have sadly been given FAR more customer support for a TRX wallet I dont even use than for this mobile one!!! Seems a bit insane that if I know my private keys and moninumaric passphrase than my "password/pin" shouldnt matter one bit. We are cautious with crypto and rightfully so with all the hacks so most smart people will use a temporary password to ensure legitimacy before actual adoption, that\'s pretty logical I would think? Maybe that\'s just me. Regardless, right now I believe I just had about 400 TRX stolen flat out.', 'Not open app !!!!!!!\U0001f97a\U0001f97a\U0001f97a😟😟😟', 'had the wallet for awhile. no issues. I was really worried after reading these negative reviews so I moved a portion of my TRX tokens out of the wallet to see if I would lose my transaction but everything went fine. I never write reviews and felt compelled to say my experience was great and I have no worries about my funds or security using this wallet. See you on the Moon 👍', 'This update from TronBlocks to vision is amazing. This is everything I needed', "Amazing!! Thank you for the automatic token recognition!! It's so important for those of us who have hundreds of different tokens! Also, the multiple token send feature is so great! Now I can send ten or even hundreds of different tokens in one transaction! Thank you Tron Society! See you as an SR very soon! 😎", "Its great app and moves fast but its not loading my info for sent and receives. Plus why did they make another wallet app with a dex instead of just updating this one that's not smart. The other app Is ugly this one is way nicer.", 'Nice Wallet! good design and very intuitive. ONe issue i have is not being able to see my transaction history... am on latest version. I did see it once but when i click on history nothing now shows.', 'Love this app. Please update to make asset not remain balance to disapear. As atm, asset still in the list although not any balance there. It is annoying as too many scroll down to choose asset has balance. Need to add token filter feature.', 'Great app, can view transactions before they confirm. Can view balances as well. Just wish that I could see the timestamped history. Sometimes I would like to see where my TRX comes from, and when.', 'My BTT balance just went down when I started voting for BTT. it seems to have taken some of the BTT I had received instead of adding more, perhaps your app is not reading the balances and past air drops accuratly?!', "When I dont have to add tokens I'll be happy. I dont want to add every token each time I get them. Please fix this i would like to see all my tokens without having to add them.👍", "wallet functions okay but if your wanting a platform to spend your tron look elsewhere so many duplicate projects. spent 4500 tron (125$ usd) on twx token that's not even genuine. get another app you'll thank me later", 'Correcting my earlier comment. it is no longer possible to paste a pasword into the pasworf field on the Freeze screen.', 'Awesome app, love it. Easy to use, access multiple wallets.', "Even after today's update the history still doesn't work. Otherwise a great app.", "good app but doesn't show value of wallet, just a glitch im aure will be fixed soon enough but otherwise great.", 'Good app but it has glitches - can see history, balance and dollar amount not formated correctly', 'Ive sent 9 trx from my ledger wallet to this scammy wallet and never recieved it. Good thing i didnt send all my trx to this wallet. Plus, this has been months ago since never recieved! I knew something was wrong with this app. Anyone using this app is better off using tron wallet me app. Waaaay better.', 'much easier to use.. one item is not able to see all coins in wallet', 'Good app. I like the design. But my 500trx is not reflecting on my balance.', 'great app fast and reliable, has a lot more features then other crypto wallets and will be the future ps feel free to donate to me if you like my wallet address is.. TXJYQP6rvAFF3BpQG5o9PqmT2NSrTNg6jN', 'Caused both of my phones can not recharge. My phone is samsung note 8 and note 4.'], 'appId': 'com.eletac.tronwallet', 'url': 'https://play.google.com/store/apps/details?id=com.eletac.tronwallet&hl=en&gl=us'}
