{'title': 'OpenBoard', 'description': 'OpenBoard is a 100% foss keyboard based on AOSP, with no dependency on Google binaries, that respects your privacy.\r\n\r\nFeatures:\r\n - Spell correction\r\n - Themes\r\n - Emojis\r\n\r\nThis app is opensource, the code is available here: https://github.com/dslul/openboard', 'descriptionHTML': 'OpenBoard is a 100% foss keyboard based on AOSP, with no dependency on Google binaries, that respects your privacy.<br><br>Features:<br> - Spell correction<br> - Themes<br> - Emojis<br><br>This app is opensource, the code is available here: https://github.com/dslul/openboard', 'summary': 'An opensource keyboard that does not spy on you!', 'summaryHTML': 'An opensource keyboard that does not spy on you!', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.11, 'ratings': 244, 'reviews': 152, 'histogram': [21, 7, 19, 68, 126], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '24M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'dslul', 'developerId': 'dslul', 'developerEmail': 'danielelaudani@protonmail.com', 'developerWebsite': 'https://github.com/dslul/openboard', 'developerAddress': None, 'privacyPolicy': 'https://gist.github.com/dslul/9518b6bbff3bdf802cc9a03012012924', 'developerInternalID': '6930663337756230740', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/3-4WdR-O7-Go1Y3V1HnF8P5_RtFvekZcAbviKkZBX2-mbHiTmukV_dMdmVmpcm_463k', 'headerImage': 'https://lh3.googleusercontent.com/7on07lfpDfFR0gVU0D6aH0vQ498tuUhd1IxtD8lJ5q6lH_eL4NabocWYUVO3Jk54pLw', 'screenshots': ['https://lh3.googleusercontent.com/qHmampz9a8XwtsU9uSSe2UKraOD5u1bVKWNvPz76OrTkyWMUgF13zgjyKY78dzy5QGRC', 'https://lh3.googleusercontent.com/OQ0QxeYCSrq1o-SdKFjnesVSFCUao8lcDgnBUCnxgBdmPu8H3ZPAxhhL67JcyEXF8fQ', 'https://lh3.googleusercontent.com/Kja56MKpT0DifJhgxQJvOBQwLQYtM3LEVoMA7O2zuQR1zzq5IznVsUGz8xcZONnsXg', 'https://lh3.googleusercontent.com/2F5NU-LOraPEOvYlXaOIc1ye-Ix-ZSxyPEfh8EqCjo7tdLFSeNoTkWLmZxMabPD08T8', 'https://lh3.googleusercontent.com/C_4AStf9NJnXz8fEKLppDuPCJouWBRRj7U8hPMOf-QSTqipE8x1CaWyJ8Yibf_oghMM3'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 31, 2019', 'updated': 1580149298, 'version': '1.3', 'recentChanges': '- visual changes to themes\r\n- add toggle to disable globe key\r\n- added polish language for autocorrection\r\n- Spacebar swipe navigation\r\n- swipe on delete key to select and remove text\r\n- bugfix\r\n- Removed more permissions', 'recentChangesHTML': '- visual changes to themes<br>- add toggle to disable globe key<br>- added polish language for autocorrection<br>- Spacebar swipe navigation<br>- swipe on delete key to select and remove text<br>- bugfix<br>- Removed more permissions', 'comments': ["Very good! I've switched from SwiftKey. Openboard has better typing accuracy. I'd like more language options though, since it lacks the indigenous languages of my region (i.e. Sami). I would also have prefered a faster way of swapping languages as a multilingual typer. E.g. a slide between languages on the spacebar as some apps have, as with OB you have to press and tap. I like the clear shift between languages since it helps me keep my work conversations and my native-language talks seperate.", 'Almost the best keyboard for Android phones... But... Need emoji button, autocorrect does not work for me for some reason, regardless of language... Positives: lightweight, simple, no accidental presses on comma or full stop when pressing spacebar... Waiting for emoji key and autocorrect to resume use... Edit: autocorrect works but needs more work, especially with other languages, eg. Croatian.', "This is almost the perfect keyboard app for me (using it now). There are just three problems: 1. New or unusual words are not highlighted & are unable to be added to my personal dictionary. 2. Emojis have quite a few blank entries on my phone (tried on two) - white boxes with an X through them. 3. Emojis with different skin tones should be 'stacked' and selectable via a long press. Other than that, fantastic - looking forward to future releases! 👍", "I thought this was it. Privacy yes, autocorrect yes, great layout without excess garbage yes. I was so excited. But it only uses one language dictionary at a time. App needs to offer autocorrect from at least two enabled languages simultaneously (like Swype did). If you can do that, I'd happily pay for it.", 'Galaxy S8, Pie 9.0.0 - I was not looking for a keyboard but I happened upon OpenBoard while looking for something else in the Play Store. Since I had never heard of OpenBoard I decided to try it for myself. For a simple keyboard without a lot of options it works really well. I was using some of the big name popular keyboards but have since switched to OpenBoard. What I like about this keyboard is it is lightweight, snappy, has no extra clutter, and no connection to the internet or account is needed. This keyboard has enough options to meet my needs and performs well as a daily driver. My thanks to the developers for a simple good looking keyboard that performs really well. Job well done!', 'Great keyboard once you get used to it. Thanks for making it an making it freely available! Is there a possibility for you to add an optional number row on top of the keyboard? Selectable by an option in the settings?', 'I love it! Using the keyboard to write this review. The only suggestion I want to say is to add an option to put a Number strip at the main keyboard so its more convenient. Other than that, very good app indeed!', "I had great hopes for this KB, I love open source and no dependencies on Google framework but it's useless without swype typing. What KB in 2020 is still hunt and peck on mobile? I don't get the terrible decision to not include this option. I know it means more programming but it's open source, I'll even help with it.", 'Sensible and user friendly. Personal dictionary is useful for non English terms that are needed. And there are no nonsensical double and triple word predictions like in Swiftkey. Uninstalled Swiftkey after a lot of that kind of rubbish.', 'Nice and responsive and pleasingly streamlined. I would just like the option to have word suggestions appear in my chrome google searches and in other incompatible text fields; eg this review box did not display suggestions when typing this review.', "This keyboard is actually great. Sometimes the spell correction turns off when it shouldn't though, like right now.", 'Very nice , simple keyboard. Would use if they added the number row at the top, unfortunately a deal breaker for me.', 'Was looking for clean and simple keyboard without any predictions and other stuff. And this is it. Just perfect!', "This is an accurate keyboard replacement that does not use an internet connection, so what you type does not go to a company's server (at least through the keyboard), and stays on your phone. It will still learn from your what you type to give you more personalized suggestions and can give next-word predictions (both of which can be disabled). I'd love to see a permanent number row and for the emoji skins to be consolidated (or the ability to choose a skin tone in the settings and only have that skin tone appear). The main bug I see is the emoji key does not appear by default on a non-SMS app (the send key appears instead and you must long-press it to switch to emojis). I tested this on Telegram and FB Messenger. If you could implement a feature to permanently add it to the keyboard (preferably as a separate key instead of replacing the enter key), that would be wonderful.", 'It has the same swipe-on-spacebar and swipe-on-backspace gestures as Gboard, which was the only thing I had been missing on some other keyboards.', 'Is really good but please add the option for a number row at the top.', 'Good, light keyboard. A suggestion would be to reduce the size of the emojis, so more appear on the keyboard', 'Finally found a good one! Nice correction, Privacy and no bloat. I like the delete gesture too. Thanks, where is the donate button?', 'So good keyboard. I was looking for something like this. Fast, functional and also open source. Just two misses to be perfect for me: swipe write and no symbols on main keyboard. Thanks for this app!', 'Just lacking glide type feature (which is big enough to cost a star), otherwise a dream keyboard without a doubt...', "Good start. I'd like to see dictionary shortcuts entered when hitting enter or space instead of reaching up to the suggestion box. Also, some word suggestions enter on hitting space but some dont. High mark for the control over the cursor when swiping spacebar, its really good.", "There's no Japanese or Chinese input. Please add it anytime soon...", 'Dont like the lack of a fully black board with white text, the auto complete always capitalizes the 2nd word or it just misses words other keyboards usually get pretty well. Good start though. But not ready for prime time.', "An edit to my previous review: everything seems to work well except that when I press the language switch button, it doesn't switch language but rather changes to any other keyboard I have installed on my phone", "Beautiful, and suppocts the Dvoark layout. With the fact that this keyboard is open source and isn't tracking me, and has a dark theme, 5 stars.", "Could do with a user guide. I'd never have known you can get to emojis with a long press on Enter if I hadn't ploughed through all the reviews.", 'Good keyboard only thing it is missing is a swipe function for typing not just erasing', 'Its so good but can i ask why my keypad dont have emoji, please check it and fix it ASAP. Thanks', 'need native keyboard language switch and themes where keys are separated by thin lines instead of keys being square. needs clipboard and selectall/copy/paste controls', 'Nice and straighforward keyboard. A black borderless theme would nice.', 'Giving out 5* because of the concept [[OPEN SOURCE]] ! Hoping to see MORE FEATURES in near future. Please change the emoji layout to “scroll” from swipe. Add an option to resize height.', "Good, just selecting the emojis is annoying because it doesnt scoll vertically and no search for emojis. Other then that it's fine.", 'Is there any chance of getting autocorrect to work when you tap into the middle of a word that you already typed and start editing it? Gboard can do this. Also, the app crashed when giving contacts access.', 'Great keyboard, always been a fan of AOSP but will probably switch back because of lack of swipe typing.', 'A keyboard with no trackers? An instant 5 stars for me. All I ask from the dev is to make predictions work on a non-SMS app. Thank you for all your hard work!', "Doesn't harvest my data, no ads, simple.", 'Works well. Typing this review with it now. Just only wish it had a dark/gray theme.', "Could do with a black theme for AMOLED screens, but otherwise it's perfect!", 'Almost perfect. Missing the Number row though....', 'No support to other languages/dictionary and swipe for now =('], 'appId': 'org.dslul.openboard.inputmethod.latin', 'url': 'https://play.google.com/store/apps/details?id=org.dslul.openboard.inputmethod.latin&hl=en&gl=us'}
