{'title': 'Financisto - Personal Finance Tracker', 'description': "Open-source personal finance tracker.\r\n\r\n- Multiple accounts, multiple currencies \r\n- Home currency and exchange rates\r\n- Transfers with downloadable rates\r\n- Scheduled & recurring transactions\r\n- Split transactions\r\n- Hierarchical categories with custom attributes\r\n- Recurring budgets\r\n- Projects and payees\r\n- Filtering and reporting\r\n- Cloud backup (Dropbox, Google Docs)\r\n- Automatic daily backups\r\n- QIF/CSV import/export\r\n\r\n*WARNING*\r\n\r\nPlease DO BACKUP before upgrade!\r\n\r\nPlease DO NOT move Financisto to SD card if you're using the widget and/or scheduled transactions. \r\n\r\n*PERMISSIONS*\r\n\r\nGET_ACCOUNTS/USE_CREDENTIALS - For backup on Google Drive\r\n\r\nINTERNET - for downloading currency rates in multi-currency transfer; to do online backup to Dropbox and Google Docs;\r\n\r\nCAMERA - to attach pictures to transactions.\r\n\r\n*FAQ*\r\n\r\nQ: Why currency XYZ is missing? \r\nA: You can add any currency manually. Go to Menu -> Entities -> Currencies -> [+]\r\n\r\nQ: How to delete account/transaction/balance etc?\r\nA: Long tap on an item in the list to bring up popup menu\r\n\r\nQ: Shortcuts do not work on Home screen\r\nA: Try to restart your phone, it helps with most of the launchers out there", 'descriptionHTML': 'Open-source personal finance tracker.<br><br>- Multiple accounts, multiple currencies <br>- Home currency and exchange rates<br>- Transfers with downloadable rates<br>- Scheduled &amp; recurring transactions<br>- Split transactions<br>- Hierarchical categories with custom attributes<br>- Recurring budgets<br>- Projects and payees<br>- Filtering and reporting<br>- Cloud backup (Dropbox, Google Docs)<br>- Automatic daily backups<br>- QIF/CSV import/export<br><br>*WARNING*<br><br>Please DO BACKUP before upgrade!<br><br>Please DO NOT move Financisto to SD card if you&#39;re using the widget and/or scheduled transactions. <br><br>*PERMISSIONS*<br><br>GET_ACCOUNTS/USE_CREDENTIALS - For backup on Google Drive<br><br>INTERNET - for downloading currency rates in multi-currency transfer; to do online backup to Dropbox and Google Docs;<br><br>CAMERA - to attach pictures to transactions.<br><br>*FAQ*<br><br>Q: Why currency XYZ is missing? <br>A: You can add any currency manually. Go to Menu -&gt; Entities -&gt; Currencies -&gt; [+]<br><br>Q: How to delete account/transaction/balance etc?<br>A: Long tap on an item in the list to bring up popup menu<br><br>Q: Shortcuts do not work on Home screen<br>A: Try to restart your phone, it helps with most of the launchers out there', 'summary': 'Financisto is an open-source personal finance tracker for Android platform.', 'summaryHTML': 'Financisto is an open-source personal finance tracker for Android platform.', 'installs': '500,000+', 'minInstalls': 500000, 'score': 4.399606, 'ratings': 14472, 'reviews': 5917, 'histogram': [626, 427, 1082, 2734, 9600], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '6.7M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'Denis Solonenko', 'developerId': 'Denis+Solonenko', 'developerEmail': 'denis.solonenko@gmail.com', 'developerWebsite': 'http://financisto.com', 'developerAddress': 'Beecroft, NSW, 2119', 'privacyPolicy': 'http://financisto.com/privacy.html', 'developerInternalID': '5307405042142927115', 'genre': 'Finance', 'genreId': 'FINANCE', 'icon': 'https://lh3.googleusercontent.com/pwOY9-z5eDZGQ6cuSeRGWQ6qWb7HrY0MLwCeswTRYhAGXQ-TnT6tFBhDwHsN151JHw', 'headerImage': 'https://lh3.googleusercontent.com/rsrmTk7x-ab6-K9bg_jOYqfKhGJAwYjhcJP5KurlkxrNnQafwsaqCWTYbJK-1KfUIw', 'screenshots': ['https://lh3.googleusercontent.com/YjuDbx9Vqum0tjgZjgwiNKyFipyAq6V6lkf5oiQHW73nCSpND4UtNDuR55IiaY7xuIA', 'https://lh3.googleusercontent.com/ax0MYDDcMRjKAYPvEFi_pcsLKHFVoaqJ7VWmp7ZbazUGMz62IuP_rw18VNSRTP490cfo', 'https://lh3.googleusercontent.com/gzPmqEpIcUOWTqW3RzyeqoLgvTOA2RziSccyiwRHJZ-IbltapI_xj2OVLjCt1rZoXw', 'https://lh3.googleusercontent.com/1n9P5QENRdkA64I5Ee5uAIdkLXdgwXxdOfqM1_MYooxI3TgLD5jgaQbuQCPwWxyWrw', 'https://lh3.googleusercontent.com/Qg2jpo3T7QlKKjWAr0HdbKUNmrltBobqnin-uFuWgsSRcZBmjbdRMOdbQxLEdWmht2o', 'https://lh3.googleusercontent.com/R5hi4YRlLy4saDKCl__MndQwiT_NFwHRXeuajXzGtgzrbOrI8uljMD5LgUcZ-qgb_upI', 'https://lh3.googleusercontent.com/fj9wnVizQippIdo5ScNB0Ji3iMlsX_VJsAhULj0BrXIVQPaOtcsJxLS9JFPD58MaxWSl', 'https://lh3.googleusercontent.com/FzazIqP0PJzzlZwYngN7ornmQlG2AjdDibA4hnmnr66nW52JYH-qwHq7qMYyx4Ca4zA'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': None, 'updated': 1575251430, 'version': '1.8.2', 'recentChanges': '1.8.2\r\n[+] Release new features and bug-fixes from the open-source contributors.\r\n[*] Option for payee/project/location selector.\r\n[*] Few more bugs to iron out, please bear with us.', 'recentChangesHTML': '1.8.2<br>[+] Release new features and bug-fixes from the open-source contributors.<br>[*] Option for payee/project/location selector.<br>[*] Few more bugs to iron out, please bear with us.', 'comments': ["Been using this app for a long time. However, after the recent update I cant just type the payee and hit save. It leaves the payee blank and now I have transactions listed but I have no idea where it's from. So now you have to tap on the saved payee name for it to record which is inconvenient for me since I'm used to just typing in and saving the info. Not sure if that's on purpose with the update or a glitch. The app is still great that's just a detail that irritates me now.", 'Update: please fix the exchange rate, as it not saving. Excellent multi currency application, can track spending in different currencies easily. The widget is easy to balance in different currencies and can enter transactions as it opens the app.', "Helps me a lot.. Thanks to developer. I have some suggestion: Schedule transaction and transfer shouldn't decrease nominee of an account, before it's time to collected.", "I've been using the app for years. But the new Payee selector is a pain. I thought I had the process down to just hit the filter button first then type the payee. That works for Payees you already have but if you try to type in a new Payee in that box it just comes up as blank unless you add the payee with the plus button. It would be great if it had the option to go back to the old payee box.", "I've been using Financisto ever since I switched from Windows Mobile 6 to Android. I solely use it to keep track of my daily expenses and it does what I need it to do. Like most other users, I'm not a fan of the new Payee selector. I often forget that when entering a brand new Payee, I have to press the + sign. Otherwise the transaction will have a blank Payee assigned to it.", 'I like the app, but latest update (it seems like it has been rolled back already) killed the usability. On 1.8.2 it crashes in 100%  cases  when you use filter in "blotter" or "category report". Device -  Galaxy S7 Edge (Sprint). I found that since Feb 08 I lost all my entries. New backups are not back compatible :(...  5 starts anyway for previous long 9 good years of use.', 'I love this app in general, at least until the update last night. I HATE having to scroll through all of my payees! It was much easier to start typing and have the list pop up than it is to scroll through every payee, please change that part back! or add a place to start typing at the top of the payee list to get to the right one quicker!', "I've been using it for years. It made my revenue and expenses transparent. Simple look and great features. I like it except the new payee selector that debuted in version 1.8.2. I use this app among all day for all my expenses, for example: after shopping. The new selector is hard to use for me, too slowly. Now I have to touch the funnel icon to type everytime when I add a new transaction. Please let us to set default payee input method in the settings. I prefer old style input with autofocus.", 'I have been using this app for more than 3 yrs now. I am a licensed CPA and finance professional and I can say that of all the dozens of tracking apps out there, this is the cleanest, simplest, most accurate and tiny in size money managing app I have ever used. I employ it for both personal and business and when I file my own taxes each year it is the easiest thing in the world pulling reports and various filters to get the info I need. Highly recommended & reasonably priced!', 'The new payee selector needs to go. Very good app but unfortunately the new update ruined it. Now when adding a new payment I have to scroll through a gigantic drop-down list of payees to find the correct one with no filtering option on the name. Please either revert this behavior or at least give the option of selecting the old behavior. With that change this app would be 5 stars.', 'I was used this app long back. But now i forget my password or something happend in password. I try to recover, but there is no option for recover. It is a very useful app and user friendly. I tried with some another app still i am not satisfied. Please can you help me to solve this issue ? Thank you for your cooperation.', "New Version - Backwards Step i like others am struggling with the new transaction entry screen, it used to be really quick and easy; it's now slightly clunky. also there's a bug in the blotter screen and the total at the bottom doesn't display completely on my HTC U11+, the tail end of the total is missing so i only see the first 4 numbers. that said i won't be changing any time soon; please fix the bug and give us the option to get rid of the funnel! Thanks", 'Great app. Just really needs a couple more features: 1. Rollover for recurring budgets 2. Select multiple specific accounts (check boxes rather than radio buttons) for a budget (e.g. I can spend "entertainment budget" money from checking, cash, and credit, but not from savings)', "I've been using this for years and it's worked out great for me, until I upgraded to a Moto G7 with Pie. The widgets are taking up 2 vertical spaces instead of 1 (a 2x1 widget is taking 2x2 spaces) and I can't fit more icons around it. Please fix.", "Very good app that I use for 2 years now. A wiki is missing to explain some of the functions. I still don't know how to use properly the attributes for example", 'This app is simple and straightforward, just recently it always crashed when I want to attach any picture in each transaction. Any suggestions from the developer? Other functions work very well for me except that..', 'What happened with the payee field in this last version? The content is not saved! Too complicated. When will be released a new version to fix this interface issue?', 'V1.8.2 crashes the app when you try to use the filter function. This can be fixed by ticking Show payee and show project in the New transaction screen options in preferences until this bug is fixed!!!', 'Again the reports are not working. This happens from time to time, probably after updates. The reports are the most important part of the app for me, thus compiling transactions without analysis...:(', 'Hi developer, I am a big fan of this app since years ago. I still do, but I found out that the "Schedule Backup" is not functioning. Sad!', "The Debit/Credit selector in the report of category doesn't work. The feature works fine up to April-May 2019.", 'there is a bug in the app. Reports are stuck on Expenses category. cannot filter.', "No update more than a year. Some problem on reporting with split transaction. Split transaction doesn't include in report.", 'Good application. However would be excellent if the app can generate pdf reports that can be shared. Thanks.', 'App is a waste of time since the update, soon as you search for a transaction the app stops working & needs to close. I hate the new payee selector. Really need to revert back to v 1.8.1', "Better than the paid/closed-source apps. Offers a vast sea of features that are organized well to make you aren't overwhelmed. Mad props to the dev!", 'Ultimate.....no words...I have just started using it....and its best till now....just some fancy modifications for appearances will make it perfect....', 'Its very good apllication and flexible to track my personal account. Now the application improvement already cover same as 1.8.1 and additional feature is very good.', "Great app but this latest update made the payee field no so user friendly. Also I can't update my budget filter as of today for some reason.", 'Great app. Been using it since forever. Simple UI and gets the job done.', 'Very useful application..It will be great to add debt management.', "It's crashing when you try to use blotter+ filter by location. Samsung Galaxy S7 edge, Sprint", "Was good until recently. I can't backup to Google Drive anymore", 'It would be great if you add a report which reflects all accounts balance at the end of each month', 'Not able to fetch reports now. They were working before updating the app.', 'simple and easy to use, and the best part of its free.', "There is a problem with export/import via CSV, in export we can't specify which account t export, but in import the choose of account is required.", "Please some body tell me, what's the use of attributes of categories, since those are unavailable to be used during transaction??", 'the lastest version is better than the drop list payee. i like it', 'Any excellent apps for finance management..'], 'appId': 'ru.orangesoftware.financisto', 'url': 'https://play.google.com/store/apps/details?id=ru.orangesoftware.financisto&hl=en&gl=us'}
