{'title': 'Pixbar', 'description': "Pixbar modifies your device's navigation bar to have solid buttons. This is meant to resemble a certain device that has an exclusive on these kinds of buttons. Currently, Pixbar is meant for phones with stock Lollipop and above. It also is compatible with LG devices. This works without any root permissions needed, as well!\r\n\r\nPlease note that this app does NOT add a navigation bar if your phone uses physical buttons. It is simply an add-on to those that already have navigation bars.\r\n\r\nSupport for Xperia and other devices with slightly different navigation buttons will be available in a future release.\r\n\r\n\r\nNOTE: backgrounds from screenshots are from the Backdrops app. Nova Launcher is the launcher used. Elun icon pack was used in the first screenshot", 'descriptionHTML': 'Pixbar modifies your device&#39;s navigation bar to have solid buttons. This is meant to resemble a certain device that has an exclusive on these kinds of buttons. Currently, Pixbar is meant for phones with stock Lollipop and above. It also is compatible with LG devices. This works without any root permissions needed, as well!<br><br>Please note that this app does NOT add a navigation bar if your phone uses physical buttons. It is simply an add-on to those that already have navigation bars.<br><br>Support for Xperia and other devices with slightly different navigation buttons will be available in a future release.<br><br><br>NOTE: backgrounds from screenshots are from the Backdrops app. Nova Launcher is the launcher used. Elun icon pack was used in the first screenshot', 'summary': 'Pixify Your Navbar', 'summaryHTML': 'Pixify Your Navbar', 'installs': '5,000+', 'minInstalls': 5000, 'score': 2.98, 'ratings': 180, 'reviews': 126, 'histogram': [46, 21, 46, 18, 46], 'price': 0.99, 'free': False, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.0M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'dunrite', 'developerId': '5114010943968769179', 'developerEmail': 'support@dunriteapps.com', 'developerWebsite': 'http://dunriteapps.com', 'developerAddress': '100 Grandville Ave SW Suite 203\nGrand Rapids, MI 49503', 'privacyPolicy': None, 'developerInternalID': '5114010943968769179', 'genre': 'Personalization', 'genreId': 'PERSONALIZATION', 'icon': 'https://lh3.googleusercontent.com/ZG-m43O2eHCatxSZJWhHzHETsIcgmm5PMiMX0dLcF3FwxJb1ju-yvxne1N0UR04-mQ', 'headerImage': 'https://lh3.googleusercontent.com/g1qpja6vkO7cQklNgl8EIurxY_eu-dvOEvs2vwxdyWTOUReZhEpQu6cEqq606VdeqsXT', 'screenshots': ['https://lh3.googleusercontent.com/UZu2wDuzJLx1_rkMVvhKPF5cw7vVoRaLiTr87zlGDcq8qKigSs9M-9yrb3SgCbspBw8', 'https://lh3.googleusercontent.com/kFwegKpOuKZx1Xb2XfCvwPpO0EpeHSUawu100kQRM4FHeSuNFAGh9eo3a8n7OuNrnYqR', 'https://lh3.googleusercontent.com/s6q8WHAYRX3vCElF0hwxht1Cl0g7NVPVT6sQwbjOyVnGGOpKX9BWVIEy1V3r43ISioA', 'https://lh3.googleusercontent.com/rROsnXSJmOtU2npkVO3nSxux-t4JwWxzJQMs3eIuVIniLgoN_kwcUFZsbCiq6Uv9A1I', 'https://lh3.googleusercontent.com/OhE6rTINSxFq1aYyGNY1aLqEm_DtIxTYLItTh5mWP2X9gUjP_r_2kGGcIJGFxvdEQ5g', 'https://lh3.googleusercontent.com/y43BDhTojMAOi9b-xO_voOgl7B3YdxC29WzadXTlNJSR26gq6qXYyCPqX3coT5HT1OS2', 'https://lh3.googleusercontent.com/0fC62M4ScmshtyNhq-ovQQlhsitLR5fC4WPtMgbl4JP-4ExMb4cHhVFbkzger2_2Ww', 'https://lh3.googleusercontent.com/xumRAKCDO99OGfdap4uNX6Oc1wKD4Y6Hoss2UCDFAnLOuuGaM-hymgvERK1WZZNn3g'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Feb 13, 2017', 'updated': 1495671629, 'version': '1.2.5', 'recentChanges': 'v1.2.5\r\n- Added option to flip button order\r\n- Added links in About to request features and report bugs', 'recentChangesHTML': 'v1.2.5<br>- Added option to flip button order<br>- Added links in About to request features and report bugs', 'comments': ['I have an S8, and all it did was show my already default nav bar with the \npixel nav bar. I like the animations and the look, but not what I was \nlooking for. Just needs a few fixes and it should be better. At least I can \nget a refund 😁', "Overall it's good but on my LG G5 the center circle isn't placed in the center, paying a dollar for this app I didn't expect such imperfection", "Doesn't work as expected with OnePlus 5. Instead of 3 navigation buttons, i can see 6 navigation buttons after applying pixbar, waste of money", "Nifty, but not perfect. I have a Nexus so I wasn't expecting any issues and don't have any, buy yes that YouTube glitch is still there.", 'Works flawlessly on my G6 non rooted, looks like a Pixel softkeys now and you can change the colors too, GREAT JOB.', 'You might want to clarify that in your description. What it appears to be is a way to change the color of the soft keys. Nothing says it will not work otherwise...', "It is OK. But it doesn't work in some apps, like Chrome and others. You can still see borders of your navigation bar still.  I think it really needs to mature", 'The YouTube bug is still present. There is also a bug with Google photos where the bar reappear when visualizing a fullscreen picture and rotating the device', 'Is not big enough to cover the buttons on the s8 nav bar please add support', "Didn't work on my OnePlus 3 was never able to align the things waste of money", "It doesn't work when I clear the app from recent applications, please fix it", 'It stops working in some apps. Please fix', 'I purchase this app but now I want refund my money because it does not shows the nav bar every where, so I want my money back.', 'Added new icons but still has the original ones on too', 'Ha sido mejorada!', 'While opening camera buttons gettings unfilled', 'Working awesome in Moto G5 plus with no issues at all. Really love this app....', 'Amazing for $1 works and fits perfectly on my Moto g3', 'Refund!', "Displays on G6 now but fill of center sits ever so slightly off center and can't seem to align the side buttons fill", 'In response to your comment asking if they were still too big. Yes they are, if you have an email I could email you a screen shot of what they look like', 'Screen overlay detected blocks Android permissions', "4 updates in 2 days, that's what I call real improvement!", 'Nice and simple app to change your standard navigation buttons a little. Changing the vertical directions would be nice to fill the slight gap I have in my navbar buttons.', 'Button fill disappear on its own intermittently and also when phone reboots.It will only reappear once app is opened again.Please fix this otherwise simplest app to have pixel like nav bar.', 'Buttons disappear suddenly and after reboot. Now I felt I have been cheated. Totally waste of money.', 'You fixed the issue quite fast, impressed', "It works but on the G6 the icons are too low. If you could add an option for vertical adjustment that'd be great!", 'Love it.', "There's no point in having this app if it has to stay open for it to work. Looks great! But it takes up memory. And another cool feature would be for it to rotate the 'previous' button (the triangle) when the keyboard is out otherwise it gives it away.. Please make my dollar worthwhile.", "This is an awesome app. I love how my Moto Z Play can share some of the same aesthetics of a Pixel device. The pixel-like soft keys don't line up perfectly, but that is quite alright with me. A surprising thing I found was the color feature. Adding color definitely makes it look better; it fills in the soft keys more nicely (from my perspective.) Kudos to the dev for creating this app. Thanks a ton.", "Nice app! Not perfect of course but it's really nice so far. Only big issue is that when I'm watching YouTube videos in landscape I have to fiddle around with the nav bar to get the pixbar icons to go away. Not a total deal breaker but definitely something I'd like to see fixed.", "I love the look and feel that this app provides, and the implementation is clever. However, it's far from perfect and it has made my Moto X Play rather sluggish and unstable at times. Especially Chrome, Facebook, Amazon, eBay, and the Google app. I appreciate that there isn't much the developer can do with the overlay in Chrome (yet), but some performance/stability improvements would be great. Definitely one to watch!", "It looks very nice and it does work; however, there is a bug I've noticed that is a little annoying. If my phone happens to sleep while in an application or game that is in immersive mode and I wake it back up, the navbar will draw itself over the application, blocking any app keys underneath it. When this happens, you also can't interact with the navbar either. The only way to get this to go away is to trip the notification shade. I love the app and what it does, I just hope the developer reads this and fixes it.", "The original nav bar disappears in the camera app but the Overlay just stays there staring into the darkness.  Fix it maybe?  Im using stock oxygen os camera app if that's useful for ya.", 'Using 7.1.1 on a Nexus 6, Pixbar is slow to actually launch after start, but once you get it working it seems to be okay. Future updates will only improve this basic, but enjoyable addition to my phone.', 'Does not work on LG G6 due to taller screen. Needs vertical alignment options. On other phones works fine. May interfere with touch zones or gestures depending on the launcher you use.', 'Great work, but - I see some black pixel in shapes (not enough big shapes from this app), in app the preview should be pinned in bottom of screen, another thing - I would to like move them up and down or make them little bit bigger / smaller and for the end, could be good change position of shapes (like triangle on the right side)', "Doesn't show when using Chrome, and won't go away when watching YT in fullscreen when the buttons are supposed to go away. Still love it though, just needs some work", "Neat concept but on my OP3 it doesn't stay colored in, especially when switching to the camera or having the screen on/off otherwise I like it. Within time it'll get better"], 'appId': 'com.dunrite.pixbar', 'url': 'https://play.google.com/store/apps/details?id=com.dunrite.pixbar&hl=en&gl=us'}
