{'title': 'Micopi', 'description': "Micopi allows you to assign a unique image to every person in your phone's contact list. If you do not happen to have a (decent) photo of someone you know, you can use this app to simply generate one.\r\n\r\nYou can carefully pick a design for each individual contact or let Micopi assign its generative art to a whole bunch of phonebook entries at the same time.\r\n\r\nDon't worry, your information is not saved in Micopi, used for other purposes or transmitted to us.\r\n\r\nPlease note, applying an image to a person cannot be undone. Micopi has been thoroughly tested but we recommend making a backup of your most precious contacts and pictures, just in case.", 'descriptionHTML': 'Micopi allows you to assign a unique image to every person in your phone&#39;s contact list. If you do not happen to have a (decent) photo of someone you know, you can use this app to simply generate one.<br><br>You can carefully pick a design for each individual contact or let Micopi assign its generative art to a whole bunch of phonebook entries at the same time.<br><br>Don&#39;t worry, your information is not saved in Micopi, used for other purposes or transmitted to us.<br><br>Please note, applying an image to a person cannot be undone. Micopi has been thoroughly tested but we recommend making a backup of your most precious contacts and pictures, just in case.', 'summary': 'Missing Contact Pictures\r\nFill your phonebook with unique images', 'summaryHTML': 'Missing Contact Pictures<br>Fill your phonebook with unique images', 'installs': '1,000+', 'minInstalls': 1000, 'score': 2.5428572, 'ratings': 70, 'reviews': 38, 'histogram': [34, 7, 4, 7, 18], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '3.8M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Easy Target', 'developerId': '6624751335838954563', 'developerEmail': 'hello@easy-target.eu', 'developerWebsite': 'https://easy-target.eu', 'developerAddress': 'Postfach (P.O. Box) 40161\n10061 Berlin, Germany', 'privacyPolicy': 'https://micopi.flycricket.io/privacy.html', 'developerInternalID': '6624751335838954563', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/OFCk47FgrYw8q2KLl-eWE9nTO70WyZr7dZQRk_Z4zPCEtUxPjbb4OM2L-NcwRB76Ny4', 'headerImage': 'https://lh3.googleusercontent.com/X5OP40yIiJ7TvUhLQRhOLJOM1limJ0C98tsKnhhpfoGkY6llzQZCxQfU1jsJ-1yiT_Xf', 'screenshots': ['https://lh3.googleusercontent.com/C8HJoiYK25X0StjM0kq2J1bitq13p7VxFGFkpB8GYeCPeGmfDZ3fEmFxd2Zfd1sgWE6V', 'https://lh3.googleusercontent.com/b38Uup9-3-xgmRyTAt6cTsONwfvhB5a1b-A7a-D3laDs0uEnqPJZMNsRlLzPSCFusYs', 'https://lh3.googleusercontent.com/n-aTiM_isNROBclEwmu1534IYnXZ4dLMdqDn1ZT6bCAxFT-bkgj3deSMjuiGy9IUgW33', 'https://lh3.googleusercontent.com/lycYV9MrERdjdLTzz-0fEnIzMGxqVRWqWEg8PIjfGJoUjrCfOBqzOt2DobSgD7Jjfg', 'https://lh3.googleusercontent.com/BUNNNZnXIZkilvBiPNhHigZj1CK7hzHkunk5MFm9x_9xAfR_nbd9T87wswEX-NfaqJA', 'https://lh3.googleusercontent.com/EKMArEnrx2ia-ywPYp6PmNpuXEtsABgH9YBWi08e9PV8jnyMJV7iIDFhxLn2ru9FcA', 'https://lh3.googleusercontent.com/act0ifu85zxZ3sCtCUapVJn1DJapB-NRPpr1MJbkp47M4rLgtaoV2Cqr_B6a_lzT6bI'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': True, 'containsAds': True, 'released': 'Sep 30, 2019', 'updated': 1574688786, 'version': '1.3.16', 'recentChanges': 'Fixed a bug that did not restore previous in-app purchases correctly.', 'recentChangesHTML': 'Fixed a bug that did not restore previous in-app purchases correctly.', 'comments': ["Stingy move, uninstalled immediately. Good thing I've got an old APK from last year! Ditch this steamer, delete the Free version, snag the previous version 6.1.91 from APKmirror, then use trusty ol' Titanium Backup to detach the installed app from Play Store updates. Still works just fine, and I'll never be bothered by this idiocracy again for the rest of my life. Peace sucker", 'I had installed this app years ago.. well a version of this app when it was named micopi pico. It was so great then, it automatically assigned pictures to all my contacts but now it weirdly expects me to select each contact individually to change pics? That makes no sense at all.', 'Like most recent negative reviews, you can only change contacts one at a time now and have barricaded the option to make a mass change behind paywall. I have too many contacts and not enough time to waste tiptapping.', 'I have used the "free" version of this app for years.. Recently, the developer updated the free version to no longer work I have no problem with supporting the developer, however the premium version of the app lacks the basic functionality that used to exist. The new interface is terrible and even the "premium" version doesn\'t let you do the things the free version used to. Needless to say I am upset and will be issuing a refund. Please add functionality back - I\'d be willing to pay!', "All functionality has been pay walled. The previous free version could auto assign to contacts with no pictures or reassign to all contacts. Now, you have to do every contact individually and the new images are simply bad (maybe the good ones are pay walled too). Not to mention it spams you with a full screen ad after each and every assignment. This is the pinnacle of forced purchase. It's simply disappointing and most of its reviews will tell you how it went down the gutter.", 'I still prefer the old version that has the option to automatically select all the contact on my phone, with this new version its stressful for me to start doing all the contacts on my phone one after the other and I hv 700 contacts on my phone. Pls developer or admin can you bring back the option that does it automatically. Thanks', 'I did like this app, but after paying for the plus features which apparently can be used once and needs to be purchased each time you want to use them.', "Everytime i format my device, First i sign in my google account to sync. Contacts then i make sure to download 'micopi'. This is wonderful app ❤️", "Can't auto generate for new contacts anymore, unless you pay. I'd rather have ads than pay a one-time fee. Sorry to the developers, hope they change their mind.", 'Used to love this app. Not so much anymore. The assigned photos are of very low quality and with incorrect alphabets for random contacts.', "I literally JUST bought the app and I can't use the paid features; it wants me to pay again. Also, things are missing from the old version. No style settings?", 'Dev removed features which shipped originally with the app and put them behind a pay wall with the newest updates', 'Latest update fixed a major issue. Works like a charm now. Defo recommend this app to liven up boring default profile images.', 'What a shame! Select contact is super lag, no automatically pick non-avatar contact And generated avatar seem rarely random', 'Adding contact photos to 1 contact ruins contact photos in others. The ruined photos are super pixelated', 'Auto missing pictures no longer works like the free version of before', 'This app is the worst downgrade it could possibly be from the previous Micopi. I have no idea how the developer, in the right mind, decided to unpublish the other one and curse us with this absolute dumpster fire instead.', 'So I purchased the purchased the plus features. Yet everytime I relaunch the app, it asks for me to purchase it again. None of the stated features even work. What gives? Have I been scammed?', 'I paid for the app last week now it asks again for payment.', 'Have to buy premium to select all contacts? Such a downgrade', 'No more bulk option even after payment', 'Awesome app adds life to contacts', "I'm about to purchase the full version, but will it be usable on my other devices that's using the same Gmail account or do i need to buy it again and again??", "Finally! Lacks features but I'll wait.", 'The update made the app completely useless.', 'The good thing is over now. Sad reacts only !', 'Fixed and updated.', 'Not User Friendly...', 'Good'], 'appId': 'eu.ezytarget.micopi', 'url': 'https://play.google.com/store/apps/details?id=eu.ezytarget.micopi&hl=en&gl=us'}
