{'title': 'The Elder Scrolls Legends Tracker', 'description': "The Elder Scrolls Legends Tracker is an assistant application for Bethesda card game The Elder Scrolls Legends that allow you to manage your collection, decks and games statistics.\r\n\r\n* The app don't use your Bethesda account, there aren't any link with game account. All user data like collection and matches need to be set manually!\r\n* Cards are not translated (all cards are in english)\r\n\r\nFeatures\r\n- Game basic informations session\r\n- Card's sounds, set as ringtone!\r\n- Card's full art, set as wallpaper!\r\n- Easy Search, Filter and Favorite Cards\r\n- Collection Manager\r\n- Easy Search, Filter and Favorite Decks\r\n- Decks builder for Public and Private deck manager\r\n- Matches Manager\r\n- See class or deck wins, losses and win rate\r\n- Arena draft helper\r\n- Season informations like reward, patches and your Ranked Statistics\r\n- Spoiler session for new cards revealed (Heroes of Skyrim)\r\n- Quick access to Bethesda Articles and News\r\n- Offline support\r\n\r\n\r\nThe Elder Scrolls Legends Tracker is now an open source project\r\nhttps://github.com/edipo2s/TESLegendsTracker", 'descriptionHTML': 'The Elder Scrolls Legends Tracker is an assistant application for Bethesda card game The Elder Scrolls Legends that allow you to manage your collection, decks and games statistics.<br><br>* The app don&#39;t use your Bethesda account, there aren&#39;t any link with game account. All user data like collection and matches need to be set manually!<br>* Cards are not translated (all cards are in english)<br><br>Features<br>- Game basic informations session<br>- Card&#39;s sounds, set as ringtone!<br>- Card&#39;s full art, set as wallpaper!<br>- Easy Search, Filter and Favorite Cards<br>- Collection Manager<br>- Easy Search, Filter and Favorite Decks<br>- Decks builder for Public and Private deck manager<br>- Matches Manager<br>- See class or deck wins, losses and win rate<br>- Arena draft helper<br>- Season informations like reward, patches and your Ranked Statistics<br>- Spoiler session for new cards revealed (Heroes of Skyrim)<br>- Quick access to Bethesda Articles and News<br>- Offline support<br><br><br>The Elder Scrolls Legends Tracker is now an open source project<br>https://github.com/edipo2s/TESLegendsTracker', 'summary': 'Manage your Elder Scrolls Legends cards collection, see decks, matches and more!', 'summaryHTML': 'Manage your Elder Scrolls Legends cards collection, see decks, matches and more!', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.97, 'ratings': 240, 'reviews': 116, 'histogram': [26, 12, 21, 62, 117], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '88M', 'androidVersion': '4.2', 'androidVersionText': '4.2 and up', 'developer': 'Édipo Souza', 'developerId': '%C3%89dipo+Souza', 'developerEmail': 'edipo2s@gmail.com', 'developerWebsite': 'https://edipo2s.github.io/WabbaTrack/', 'developerAddress': 'Brasil\nCuritiba - PR\n80730-300', 'privacyPolicy': 'https://goo.gl/UQv17F', 'developerInternalID': '6049889718662429553', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/Vk-Vfj_GTdloXOu9D1YR2zqUByc9edInKko2xN58NM_TnbHvFk6xHT3CbudKjrK48Zrz', 'headerImage': 'https://lh3.googleusercontent.com/7NvC6e9qcDB9l0Ho6oRnIIDozIknNEgjQgvlQ5myykmTSpBh0JmpA0NHB2c5WWTObclP', 'screenshots': ['https://lh3.googleusercontent.com/n4C7QCdB7ppKMt3Ql27A2bdATF04nnqA2kx189BPLTz8sP_lbrO_n63tY7KFco8E9A', 'https://lh3.googleusercontent.com/BJoV5spDPfZSSSRgnXEijD605pPNu-rcxp0CSBQVq5wY8lO1mrOOBDX-zie-kJchN38', 'https://lh3.googleusercontent.com/g1aRzy_RgwFYEW4KclCWiaautdiei905l6y2cbYVY18LtdKCoUzTnlpRCVlNHeACrOWQ', 'https://lh3.googleusercontent.com/mQ4t20ud8SWqOMnRNy3xENEXdmHLVefmknNVqG4iilvyLqthVbAg2WkykRmdwvqCq2Q', 'https://lh3.googleusercontent.com/HbtZ0eNn2wrDMFbnR6ocokeFbD1K5JHjLdQgi_Apwl6U0GRV5eLUB-8Wh6Vsp6QV28qc', 'https://lh3.googleusercontent.com/cf5Y2t5VcvEDflXvEPGuEp5ypdRnclFDM7LSpDoZixaLXbZoYjsuVdvQYoO3_FvYFq4', 'https://lh3.googleusercontent.com/G5U10DxaH3Dm_bm0eUiglFTkiPK6TWnH2MNTazbjt0au-8vWRsQmTM2Qu9icnSdPPw', 'https://lh3.googleusercontent.com/xEL7yy9vXkoCWGpjCB_x9zzMYgQZrlQzynjjxGIKT2ca0MrKOyHFtAfyTWgsUWtmKLI'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': True, 'containsAds': True, 'released': 'Dec 8, 2016', 'updated': 1543157514, 'version': '1.9.2', 'recentChanges': "This version:\r\n* Add FrostSpark Collection\r\n* Add support for triple color decks\r\n* Add support for triple color cards in arena\r\n* Add all tokens of Houses of Morrowind\r\n* Fix articles news list\r\n\r\nLast version:\r\n* Add 'Monthly' as same search key of 'Reward'\r\n* Add Houses of Morrowind Cards\r\n* Add Forgotten Hero cards full art\r\n* Add Barbas tokens\r\n* Remove all ads from lists\r\n* Fix alternative art cards not showing token. (Grisly Gourmet)", 'recentChangesHTML': 'This version:<br>* Add FrostSpark Collection<br>* Add support for triple color decks<br>* Add support for triple color cards in arena<br>* Add all tokens of Houses of Morrowind<br>* Fix articles news list<br><br>Last version:<br>* Add &#39;Monthly&#39; as same search key of &#39;Reward&#39;<br>* Add Houses of Morrowind Cards<br>* Add Forgotten Hero cards full art<br>* Add Barbas tokens<br>* Remove all ads from lists<br>* Fix alternative art cards not showing token. (Grisly Gourmet)', 'comments': ['Great app, it takes a few hours to enter in your collection... but it is worth it. A complaint I have with it other than that is the duplicate cards that enter your deck after a build. Please address this issue devs and this app would get 5 stars from me.', 'This is a good app, i like being able go upload my decks to share with the public but one thing i have to say is i cant view the comments on the decks i have built, maybe im able to but there is no clear way to do so.', 'got it to see previous nerfs and whenever I click on a nerf the app crashes... just want to see the cards during the time i didnt play', '5th star is coming when & if app gets updated, since it is the only app and its already behind some sets.', 'You should update the whole app to fit the new legends client look and feel.', 'Have to manually enter cards app is pointless', 'This app really needs some instructions.', 'I wanted to know if there will ever be a floating window added.', 'Pls give instructions on how to use this app thanks', 'update please?', 'No updates', 'Your app is great but you\'re missing the "monthly reward" filter criteria! That\'s my only complaint, love it apart from that.  Edit: yes that\'s what I meant, a category of its own would probably be more intuitive overall. I noticed you categorized the monthly reward cards as core set, nothing against that. Another thing you might be interested to experiment in might be the android shortcuts! Thanks for your work man, I\'m really looking forward to this app. :)', 'Is good', 'helpful', "Very fast dev response to a suggestion! Crashes a bit sometimes, but boots back up super fast, so I don't mind too much.  Edit: Arena Draft always crashes before getting to a full deck. Still ok, but changed to 4 star for now. Will change to 5 when landscape implemented.", 'Overall good app for card info. What I wanted was to access the deck collections, but when I type in "budget" in the search, nothing appears. When I scroll down, I did find some decks with the "budget" in the name. Search function not working properly?', "I just finished entering my collection.  Edit: I found Glass Helm. I'm pretty sure that I just missed it the first time.", 'WHERE IS THE CLOCKWORK CITY UPDATE?!', 'Awesome!', '面白い 面白い', "How does this really help manage if it doesn't connect to TESL directly? Connecting to Google or FB doesn't help. There's no way I'm manually creating my decks & inventory. Please provide clarity. Thank you", "I like this app, but I can't get it to import my Legends-Decks collection. The instructions in the app don't provide accurate detail. With some more work, this could be a really useful tool.", 'Why is there no way to connect your legends account? Definitely would up the rating if that was implemented...', "Card stats are always current. Ads aren't intrusive. Easy access to balance changes and history.", 'Great app. But guys cannot import collection from legends decks. trying to log in from google it gives error: disallowed useragent. Fix pls.', 'Great app, one thing I do hate is the full page add when clicking on a news update from the system tray, the ad often stops the app from loading correctly and I miss out on whatever the notification was', "I'm liking this app a lot! It mentions in the description that there is no link with the Bethesda account. Does that mean that I would have to manually edit my card collection, and my wins and losses?", 'Great app! Functionality added all the time and kept up to date.', 'Great looking and working app. Also love the leak notifications for the new set :)', 'Excellent app, does everything it says on the tin with minimal adverts and the option to pay to remove them anyway', 'Dedicated developer. Useful app. What more do I want?', 'Dev updated the app 4 times in one day... He obviously cares.', 'I have a suggestion. Why not try doing the same thing they did with fall out 4 and their app. Would vastly improve the quality of your app.', 'Amazing app, 5 stars for great work! Import deck and collection worked finally! (You first need to manually import your collection in Legends Deck in order for this app to import them here)', 'Grat app for TESL', 'I made a public deck but it crashes every time I go to decks', 'Great app. Lightweight, minimalistic, and informative. Lets me air out deckbuilding ideas on the go!', 'A great piece of engineered software', 'Reel nicy', 'trash'], 'appId': 'com.ediposouza.teslesgendstracker', 'url': 'https://play.google.com/store/apps/details?id=com.ediposouza.teslesgendstracker&hl=en&gl=us'}
