{'title': 'wX', 'description': "wX is a free, no-ads, and open-source ( GNU GPLv3 ) advanced weather application that is geared towards storm chasers, meteorologists, and weather enthusiasts. NWS ( National Weather Service ) data is optimized for mobile format and provided for divisions not normally covered together in the mobile space: SPC, WPC, NHC, OPC, etc. Level 3 and Level 2 Nexrad radar ( single, dual, quad pane ) are provided and displayed using the mobile variant of OpenGL. This weather app is not affiliated with NOAA or the National Weather Service. \r\n\r\nIf you *only* need current conditions and your local 7 day forecast then this app is probably more then you need although it will easily provide those 2 things as well. If you are looking for wasted screen real estate or fancy graphics this app is not for you. Given the depth of information covered there is a steep learning curve if you seek to use the program in it's entirety, help information is available and touched on below. Common weather acronyms are used throughout so you should be familiar with those as well. Currently United States locations  are supported. \r\n\r\nHELP is available from the main menu and by tapping on any text in the settings activities. \r\n\r\n- Current forecast, 7 day conditions, sounding data for an unlimited number of locations from NWS.\r\n- Customizable home screen\r\n- (Android only) Tiles can be rearranged by long press and then drag and drop on Tabs: SPC, MISC, and IMAGES\r\n- OpenGL based Nexrad radar interface with numerous options. Level 2 in the lowest tilt for base reflectivity/velocity is also available. 2 pane and 4 pane version also available in MISC tab.\r\n- Optimized text product viewer for easy access to AFD,HWO and others from any NWS WFO.\r\n- Vis/IR/WV/Radar mosaic viewer ( with animations ).\r\n- Widgets ( nexrad radar, radar mosaic, vis, afd/hwo )\r\n- SPC products ( such as Watches/MCDs/Convective Outlooks/Mesoanalysis )\r\n- WPC products\r\n- Weather models\r\n- NHC products\r\n\r\n(Android only) Notifications:\r\n- Local alerts\r\n- MCDs impacting your location\r\n- MPDs impacting your location\r\n- Convective outlooks for your location\r\n- US MCD/Watches\r\n- US tornadoes\r\n- US MCD\r\n- US MPD\r\n- NHC Atlantic and EPAC advisories\r\n\r\nRequirements: Android 4.1 or higher with 1GB of memory at a minimum ( recommended ). \r\nAccess required: App needs access to Your Location, Network Communication, Systems tools ( run at start-up for alerts ).\r\n\r\nThis app is licensed under the following license available online at ( and in source code zip):\r\nhttp://www.gnu.org/licenses/gpl-3.0.html\r\n\r\nFAQ at:\r\nhttps://docs.google.com/document/d/1OQrviP10XBvQZ7QKh5R4bsd72ZKffK5f0ISRuCaSk5k/edit?usp=sharing\r\n\r\nSource code at:\r\nhttps://gitlab.com/joshua.tee/wx\r\n\r\nRelease notes at:\r\nhttps://drive.google.com/open?id=0B9OogdTO1kXqcVJwekpwemFwSXM", 'descriptionHTML': 'wX is a free, no-ads, and open-source ( GNU GPLv3 ) advanced weather application that is geared towards storm chasers, meteorologists, and weather enthusiasts. NWS ( National Weather Service ) data is optimized for mobile format and provided for divisions not normally covered together in the mobile space: SPC, WPC, NHC, OPC, etc. Level 3 and Level 2 Nexrad radar ( single, dual, quad pane ) are provided and displayed using the mobile variant of OpenGL. This weather app is not affiliated with NOAA or the National Weather Service. <br><br>If you *only* need current conditions and your local 7 day forecast then this app is probably more then you need although it will easily provide those 2 things as well. If you are looking for wasted screen real estate or fancy graphics this app is not for you. Given the depth of information covered there is a steep learning curve if you seek to use the program in it&#39;s entirety, help information is available and touched on below. Common weather acronyms are used throughout so you should be familiar with those as well. Currently United States locations  are supported. <br><br>HELP is available from the main menu and by tapping on any text in the settings activities. <br><br>- Current forecast, 7 day conditions, sounding data for an unlimited number of locations from NWS.<br>- Customizable home screen<br>- (Android only) Tiles can be rearranged by long press and then drag and drop on Tabs: SPC, MISC, and IMAGES<br>- OpenGL based Nexrad radar interface with numerous options. Level 2 in the lowest tilt for base reflectivity/velocity is also available. 2 pane and 4 pane version also available in MISC tab.<br>- Optimized text product viewer for easy access to AFD,HWO and others from any NWS WFO.<br>- Vis/IR/WV/Radar mosaic viewer ( with animations ).<br>- Widgets ( nexrad radar, radar mosaic, vis, afd/hwo )<br>- SPC products ( such as Watches/MCDs/Convective Outlooks/Mesoanalysis )<br>- WPC products<br>- Weather models<br>- NHC products<br><br>(Android only) Notifications:<br>- Local alerts<br>- MCDs impacting your location<br>- MPDs impacting your location<br>- Convective outlooks for your location<br>- US MCD/Watches<br>- US tornadoes<br>- US MCD<br>- US MPD<br>- NHC Atlantic and EPAC advisories<br><br>Requirements: Android 4.1 or higher with 1GB of memory at a minimum ( recommended ). <br>Access required: App needs access to Your Location, Network Communication, Systems tools ( run at start-up for alerts ).<br><br>This app is licensed under the following license available online at ( and in source code zip):<br>http://www.gnu.org/licenses/gpl-3.0.html<br><br>FAQ at:<br>https://docs.google.com/document/d/1OQrviP10XBvQZ7QKh5R4bsd72ZKffK5f0ISRuCaSk5k/edit?usp=sharing<br><br>Source code at:<br>https://gitlab.com/joshua.tee/wx<br><br>Release notes at:<br>https://drive.google.com/open?id=0B9OogdTO1kXqcVJwekpwemFwSXM', 'summary': 'Advanced US weather app - Radar, Models, Vis sat, Obs, SPC, WPC, NHC,..more', 'summaryHTML': 'Advanced US weather app - Radar, Models, Vis sat, Obs, SPC, WPC, NHC,..more', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.74, 'ratings': 523, 'reviews': 316, 'histogram': [15, 5, 10, 36, 455], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '20M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Joshua Tee', 'developerId': 'Joshua+Tee', 'developerEmail': 'joshua.tee@gmail.com', 'developerWebsite': 'https://stormtrack.org/community/resources/wx.34/', 'developerAddress': None, 'privacyPolicy': 'https://docs.google.com/document/d/19dUHb0ZPJ9zO046FOAgYq8mJPoUtASA8ZiBraRHWnU4/edit?usp=sharing', 'developerInternalID': '7329835759476759114', 'genre': 'Weather', 'genreId': 'WEATHER', 'icon': 'https://lh3.googleusercontent.com/Kd5tcsNqBf64CorbPATR-kY3k_np1G6fFaihkyP8nnAFt3YCWnU49gaWmSiYvMnkZ5k', 'headerImage': 'https://lh3.googleusercontent.com/I4RJx1KJzzvhg_Yqib_sPvKnD2Uw51e2EZk5mwoIxKIuG_9iWqlH97RS99GMn1oAe0c', 'screenshots': ['https://lh3.googleusercontent.com/uV-LxZh0XXsKb-3DnbfLgiBgovcA2nArLnCbXZpgnEZ7d-CoiE2G-YX-iN_5n_224g', 'https://lh3.googleusercontent.com/LyGYM0PXiaZHOcrT_Xvz5dZ2vohjg26bQNA-pQKqRI8Ff3XgWNc8T5rAY9nfC0OXxDs', 'https://lh3.googleusercontent.com/vgjZsaRLcjCa7VHJpk4zEEKe-7LuXsX8qQJiVpem1qWf6c25gw81zDzcnE_817FryGvn', 'https://lh3.googleusercontent.com/WwpXQBf00L7sAfb-kV9r4NJaVD4Lrqi28WSRrfecJYVGZEgFVyn2yCkwY3BPyOew_vNo', 'https://lh3.googleusercontent.com/kSNMohOB17BEqPA65go3tQKaZgipUEjFnNgX89Dq8D_OuPyI0i_Y9HCa-WrQThP7QEU', 'https://lh3.googleusercontent.com/5j-E7pCqeAPccxgmiBl7t86nwLBkgv6vObRrEb_vFATUAfPD-MtOgHOQCnrHNGSuifA', 'https://lh3.googleusercontent.com/ayY0LG_R_FWp9eNaBoq-Vi6AF2TAuaCX6NHVrIc4vuVsHzxR5InKfUy3ZKmWnxlLbw', 'https://lh3.googleusercontent.com/oFdQphUl-sxe_6Y6ya1rAq718prMOLsJUzph9fdtBV2yCYvmrW65zx-sesWexaM5Nw', 'https://lh3.googleusercontent.com/w4gA0DxSfgSKSU8rdr5L4ISHFY8Pgs9Vs8MaT9LG3oxfRanr9_cBX1VgwgzHdT7kKY1l', 'https://lh3.googleusercontent.com/naRgrxmL5O_p8VAYSBYwwsMlveBSQDBDL2hQh4q_rqvMmhnBw5Xi2ijFnKrCwX1mnDI', 'https://lh3.googleusercontent.com/nGZl44m8LMtb52hmCK4_LM7Qg7EbLXOlIkD0FeQCFTDJNGWLbdcXYSQgyGt7W1OJtKw', 'https://lh3.googleusercontent.com/ETGQBZKPcmY80yY-Tne9ivo5veoeSdGbDKXgbeB91u6gEy90T4DRL-fAmlMP8395uJo', 'https://lh3.googleusercontent.com/f_fLr65_tHw7ODpbshgsTGeSuwamvZjyRujZ-gKCh5CWwq2XmKi3_Ippgek-wup15g', 'https://lh3.googleusercontent.com/vnqARd6rhqmYsRxMMrZEpgxcwoPLLdJ7DUrmc3SffRj5r72cHRTj_UMn2jEigQ9OBZ4', 'https://lh3.googleusercontent.com/uoPzVpK_wyL-OZmFE2HRUEp9kNe1dZlp2vpOy2yYUNfPOXwY4IC6h_DdeNrb-RORMRQ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 28, 2015', 'updated': 1590479769, 'version': '55473', 'recentChanges': 'Please see release notes here (tap to open clickable link):\r\nhttps://docs.google.com/document/d/1A7rvP3QrJg0QqoEtKgU4B_VqLkjECijb4CFtXyNQNAM/edit?usp=sharing', 'recentChangesHTML': 'Please see release notes here (tap to open clickable link):<br>https://docs.google.com/document/d/1A7rvP3QrJg0QqoEtKgU4B_VqLkjECijb4CFtXyNQNAM/edit?usp=sharing', 'comments': ["A dream app come true , thank You so much!! Ever since the original Storm app went away , and a bastardized version offered , then went all pay for everything , I've been searching for something like this , it's complete and amazing !!", 'Up until 2 days ago, this app worked great. Now, all In get when It bring it by up is a white page. I have found that by uninstalling and reinstalling it makes it work again for about a day, but it goes white again by the next morning.', "One word.. Awesome! This is not just a radar it's a weather information hub and a storm spotter tool! So many little things you can do .. I am still finding features I have not seen yet after using it for a year but I have pretty much figured out now all the different menus and options and can navigate it fast in the field ! I appreciate all the time and work that had to go into the ap!", 'I live in northern California. Everytime I request current conditions, it displays southern California. I wrote and included a screenshot and still not fixed or accurate. Need to uninstall. Bye', 'Best Free radar for storm chasers uses same radars as apps costing 10$ or more Absolutely Amazing app!!!', 'This is the best mobile weather app for weather enthusiasts, hands down!', "Great app. I would actually pay money for this app. It's a little slow on my S9, but considering all the info it has, this is one of the best weather apps I've used. L2 radar, standard! Excellent!! I just wish it was a bit faster downloading radar. Also, it would be nice if I could use my AllisonHouse subscription as an alternate radar provider. But, it's free! L2 radar! It's now my goto radar app when I want to know where the rain is!!!", 'Whether I want a quick forecast and radar or more in depth forecast discussions and velocity maps, this app has it all. I, for one, appreciate the simple design and focus on content vs an app that spends too much time trying to look pretty. If you spend a little time learning and setting it up, you can turn it into a customized powerhouse. And the developer is lightning fast responding to questions. All this for free. A+', "I love this app. It's my go to app for all my weather needs. It is pretty technical with the weather terms and very indepth. As long as you understand what you're looking for and what you're reading you'll love this app.", 'Great and very comprehensive. I would suggest including Regional Weather Roundup current conditions products applicable to each state/WFO area, additional Environment Canada weather products and figuring out how to integrate Canadian weather data into the interactive radar map (a la RadarScope) in an upcoming update. Maybe even a way to have separate product displays for U.S. and Canadian locations on the home screen (one playlist that only appears when accessing U.S. locations and another for Canadian locations). There is also a bug with the location section in which the app restarts if you include a sizeable number of locations. Quash that bug, so if a user adds like 15 locations (or even 210+, like I did), the app will remain act normal if you choose to add any more.', "Not sure what happened, but after the most recent update, there seems to be a widget malfunction. You can drag them onto the screen, they occupy screen space, and you can touch them to open the app, but on the home screen, they're invisible. Stopping and restarting the app (and the phone), clearing the cache and data, have no effect. Otherwise, this is still the best weather app on the market.", 'Excellent app. Plenty of information and easy to use and personalize. The interactive radar display is particularly useful as well.', 'This app is hands down the best weather app. Before I was with Weather underground before IBM took over, glad I switched, creator is very responcive to questions or comcerns. Two thumbs up.', "Does everything I want. A little tweaking out of the gate is necessary but that's the best part, you can tweak everything. Sometimes I get a little lost finding things, but still my favorite weather app.", 'This is absolutely the only weather app I use! Outstanding developer and excellent app! The developer has put so much work into the app and that is so greatly appreciated! Best weather app BY FAR! I always recommend this app to all of my friends!', 'Great app for on time and accurate weather! More importantly, fast, direct from the NWS, radar options are outstanding! Average user might be overwhelmed with the amount of information, amateur weather watchers will love it!', "Great app. But some maps don't load the animation at all, screen just turns white. Fix that for 5 stars.", 'I use iit all the time im a STORMSPOTTERS for state ohio i use my radar 24/7', 'I am a forecaster and I have to say, this is the BEST app I have ever come across for weather information. SPC, local NWS and powerful nexrad products all in one app. Highly recommend!!', 'If I could give 10 stars, I would... Update: This app is now my primary weather app. Well thought out, extremely customizable and pretty much one stop shop for everything. If I could give 6 stars, I would.', "Absolute best weather app ever for tracking severe weather. I dont know how anyone could put a bad review for this app. It's amazing!", 'Amazing app - my number 1 goto weather information.', 'The best app for real weather radar data.', 'I love the app but I wish there was a way to switch the velocity to mph instead of kts.', 'Fantastic app. Keep up the great work', 'Great totally free access to advances radar products.', 'This radar app has it all.', "Unbelievable app, coming from a semi-pro meteorology buff. This is something I've been looking for. It's generally speaking just a collection of publicly available data but it's concisely laid out in one place instead of managing 50+ different bookmarks. The widgets and radar features are very cool also. Only wish would be to have the preview photos (thumbnails) update and actually show the image they link to (a current image.) It's not a big deal though. Thank you for sharing this with us!", "Fantastic app! I've long since been looking for a weather app that cleanly displays reflectivity and velocity without a cluttered UI. This satisfies that and so much more! 5 stars from me, the only thing that could make it better is if you could customize new quick toggle buttons on the radar screen for certain lvl 3 data, e.g. you'd have three buttons at the bottom- reflectivity, velocity, and SRMV, or tilt level toggle, or correlation coefficient etc to avoid pop-up menus.", 'This app is amazing. It shows wxr, level 2 and 3 nexrad data, and it has a usable interface. It even has dual and quad pan modes. All this is for free. 2 other apps of the play store that do the same thing cost 10$. My favorite is the velocity data. In quad pane mode I can see the normal rain (reflextivity), velocity data (to see rotation), and correlation coefficient (to see if debris is getting lifted into the air). And I can toggle the degree of the radar. Perfect', "Way more than just a radar, in fact, I don't even use this app for the radar. There is so much useful and interesting info waiting to be gleaned. It is also very easy to navigate compared to the gov site, and even though I may not understand alot of the various readings I appreciate their presence. Love the storm/spotter reports and the satellite info too. Everything about this app rocks! A huge thanks to the developer for making such a useful and interesting app!", "Like a lot of other reviewers, I stumbled across this after PYKL3's development ended and that app stopped working.  This is a solid effort that's really well put together for something that's free and open source!  There's more information that you can shake a stick at, and plenty of customization (although it can always use more, like adjustable delays between animated frames, and things like that.)    The only issues I have with it are the national radar map graphic is squished and can't be zoomed, so it's almost impossible to select radars from that particular image. (Radars can be selected by long-pressing on the actual radar window itself, though which is even more handy!)  The other issue is that city/town names on the edge of the display tend to get all bunched up and unreadable.  Animation is slow or doesn't render correctly on L2 data, but I see the author has offered a possible solution to that, so I'll update this if it fixes my problem there.    So, that's it.  A few tiny little issues but not enough to deduct any stars.  The more I use it, and more I learn, the more I am impressed with the effort put into this app.", "At first, I installed and then dismissed. While this app isn't too pretty and isn't the fastest, I have come to use it more and more, finding it a very helpful dashboard. It's sort of like the Microsoft Teams for Weather data, integrating many sources into one place. I use it in conjunction with more robust radar apps (used PYKL3 previously and now RadarScope) for overall awareness, forecast, and planning.", 'What I love are the WIDGETS that are included!   The UI is complicated and designed for weather nerds and storm chasers, and takes some getting used to and quite honestly research to understand how to use it because of the immense amount of data available.  Thanks so much, Dev, it is a fantastic and useful tool!  And the widgets, bro; the widgets!', "Best weather app for geeks! As a former meteorologist, I've been consistently disappointed by most weather apps since android came about. This app changes all of that! Level 2 radar, dual pol products, the entire spc sref model outputs, surface observations and a ton more! This isn't an app for someone just looking for a quick forecast, but perfect for those of us that know the ins and outs of forecasting.", 'I agree with others that this is an amazing amalgamation of data and graphics for a free app!  This has data and information that you have to pay for when using ANY other app that has the data, and many paid apps have less data. TREMENDOUS tech support. Developer spent a good amount of time helping me with a problem. Be patient and give yourself time to master the app and you will be glad you did!', "I'm loving this app the more I use it! As a weather enthusiast, soon to be studying Atmospheric Science, it's nice to have a ton of the resources within one app. Normally getting all the resources is a pain from having to go to many different websites flooding tabs in your browser. Radar is clean and gives you all the options: base reflectivity, velocity, etc - sometimes have to pay for apps to use those modes. For the regular person it maybe a lot, though for me it's perfect!", "Very useful app as it contains all of the SPC information, radar, weather forecast and more in one convenient place. What I especially love about this app is the ad free experience. Compared to most other weather apps, do I really need to have ads shoved in my face when there's a tornado warning? Much thanks to the developer for making an app that can provide potentially live saving information and isn't bloated with ads. Kudos!", 'This app is very in depth. It has proved invaluable to my family on two road trips. On two occasions we were able to change our route and seek shelter while encountering tornadic thunderstorms, once near Waco and once in the TX panhandle. Without the tools available in this app, we would likely have driven right into those storms unaware of their severity. Thank you for developing this app.', 'Weather data beyond my own compression, feeds from the NWS. Fascinating and interesting, overwhelming resources available. Excellent, recommend for weather enthusiasts and more.'], 'appId': 'joshuatee.wx', 'url': 'https://play.google.com/store/apps/details?id=joshuatee.wx&hl=en&gl=us'}
