{'title': 'Envelop - Upload and Share Files', 'description': "Very simple to use. Upload a file, get a download link and share it.\r\n\r\nThere's no file limits. No tracking. Your files are kept private.\r\n\r\nEnvelop runs on Blockstack. Which means you decide where your files are stored. You can use the default storage or setup your own storage by following Blockstack's instructions. Login with your Blockstack account, or create one quickly and for free.", 'descriptionHTML': 'Very simple to use. Upload a file, get a download link and share it.<br><br>There&#39;s no file limits. No tracking. Your files are kept private.<br><br>Envelop runs on Blockstack. Which means you decide where your files are stored. You can use the default storage or setup your own storage by following Blockstack&#39;s instructions. Login with your Blockstack account, or create one quickly and for free.', 'summary': 'Share private files easily, without losing their ownership.', 'summaryHTML': 'Share private files easily, without losing their ownership.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.26, 'ratings': 118, 'reviews': 62, 'histogram': [12, 1, 8, 15, 80], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.6M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Bloco', 'developerId': '8455149190118690625', 'developerEmail': 'hello@envelop.app', 'developerWebsite': 'https://envelop.app', 'developerAddress': 'Coimbra, Portugal', 'privacyPolicy': 'https://envelop.app/privacy_policy.html', 'developerInternalID': '8455149190118690625', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/Qd2A2wJzbF7XGAiFd-riSO1y-bkFzvwDiANx8-3mtlyZgCaDgghNh9fx7DF8XHZOvA', 'headerImage': 'https://lh3.googleusercontent.com/Kj-Zq_rSKkMEmXKPjv01lPt9QvkFQgVNiDnHguD9aMOMy92VOI5y-yRYzzRvxcqFidU', 'screenshots': ['https://lh3.googleusercontent.com/9I2L108BDlUsWOasXc2ac263SFLW35dxptIBbFsE3oS2aG1BDwL8w4TLyXA-AhOTfoiF', 'https://lh3.googleusercontent.com/w2TV60vmC_XBi7MghOZ1Kr_hf4pUwD6teWWeyCGW9aj2gybn8aOeFH5bWzSzBOgpwA', 'https://lh3.googleusercontent.com/gyS7BkjemPKy9Uwmdm9iZmVkzw5xsC9gkMJlq7u6ziNX6jyGZyAs9CdYhr9CAz9ZbQ', 'https://lh3.googleusercontent.com/QuO4W4T7YbCrfNDaQnZP8BcoydPs5vBclpYEf-93EF_0Gy4Nh52mDRZnDUKlwNyrF09Q'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 17, 2019', 'updated': 1581502282, 'version': '1.2.8', 'recentChanges': '- Support for the new gesture navigation.\r\n- Fixed some glitches with the file menu position after its open', 'recentChangesHTML': '- Support for the new gesture navigation.<br>- Fixed some glitches with the file menu position after its open', 'comments': ['I like the features that it gives, that\'s why I still gave 5 stars, but I have problem with the app or Blockstack, I created an account but the app itself never allow me to sign in and keep saying "error signing in with Blockstack" after selecting an ID and hitting the button saying "Finish Sign In". I tried Signing In using Chrome through your website and it seems fine, but the app never allow me to make it through.. Please fix it.', 'Seems to work good on my phone. Trying to open on my Surface to load something from there. It is a pain in the butt. I gave up. Too much confusion between Envelop and Blockstack.', 'Great and safe app to upload and share files. The app is easy to use ! I liked it. I recommend this app. Thanks !', "It's a great app, I however feel you should add a feature that shows how many downloads each file has and perhaps even a profile of each account.", 'Updated review: App is very easy to use as it has a very simple user interface, uploads files fast and sharing the uploaded files is very easy as well. Had a small issue during the initial signup but the devs quickly resolved my issue.', 'Really wonderful app but the reason I am giving 2stars because it is taking too much time to upload files which I want to share that file link. It only shows uploading and stuck on that. Even thought after updating is the same issue', "still some issues . no folder system i.e u can not create folder, u can't upload multiple files at once or can't upload folder .", 'Simple and clean user interface. Way to use, but works effectively.', 'My doubt is incase this service could be stop and my file will be freeze? And where to access my file in different dapp because this is blockstack gaia storage every file connected to my blockstack id.', 'I am logout this application after I am singup but not open this app please help me sir. Lots of data in this app please help.. I am using this app 5 month...', 'The most internal storage for free I like this app very much😎', 'It take too long to upload a small picture can u send demo video or send some tips too resolve it.', 'This one is very useful for me to quickly share something with strangers 😇 I hope you will keep it free forever (with limitations if needed)', 'All the thing said about the security and owning the file is all not true. It just a file sharing tool. As soon as the other party got the link it allows to downolad the file. So i uninstalled it.', 'Simple and useful app.', 'Damn!!! it is truly a life saver. A very small suggestion from my side, try to increase the upload and download speed.', "Can we have one landing page with multiple files for recipient to decide which file they'll download", 'It takes a lot of time to upload', 'Highly recommend this app. You are the only one who has access to your own files and the app is easy to use. Files are also stored decentrally and you can share files easily to someone who does not need a Blockstack ID or the Envelop app for him/her to easily download the file you are sending.', 'Rather than selecting only individual file at once for uploading give an option to upload multiple files at once', 'How to select all in same time', "Please add the option to sign in with Google! It's annoying we are not able to signin", "It's great. I have a few questions. Is it really unlimited free storage? Don't you guys have to pay for the cloud storage? Kindly reply to this one. P.S- I am giving 1 star just to get your attention. Once you reply I will edit it.", "nice idea. don't know for what reasons this app execute shell command. please preview link(photos and videos) before sending.", 'Taken long duration on uploding files so i give 3stars', 'The interface is ugly af.', 'Works well now thank you.', 'very useful app', 'Finally you people helped me out and it worked for me.Thanks alot', 'Can we create folders in this?', 'Installed but not opening Pls assist me', 'I no yeas this app but really wonderful', 'File Sending Magic', 'You can save tha storag', 'Nice super App', 'It is just awesome', 'Very slow', 'Very Useful', 'The best', 'Good'], 'appId': 'app.envelop', 'url': 'https://play.google.com/store/apps/details?id=app.envelop&hl=en&gl=us'}
