{'title': 'Equate', 'description': "Equate is a unit converting calculator designed to make converting from one unit to another fast and simple. \r\n\r\nFor example, to convert 1/4 cup into tablespoons, type 1÷4, press cup, and then press tbsp.  That's it.  \r\n\r\nTo find the number of Dollars in a Bitcoin, simply move to the currency tab, click BTC, and then USD. The result will be the price of a Bitcoin in US Dollars. Currency conversions use rates that are updated every 20 mins.\r\n\r\nApp is ad-free and open source (see Github link below).\r\n\r\n\r\n<b>Units Types Supported:</b>\r\n- Currency and cryptocurrencies\r\n- Temperature\r\n- Weight\r\n- Length\r\n- Area\r\n- Volume\r\n- Speed\r\n- Time\r\n- Fuel economy\r\n- Power\r\n- Energy\r\n- Force\r\n- Torque\r\n- Pressure\r\n- Digital\r\n\r\n\r\n<b>Features</b>\r\n- Convert between historical and modern dollars: find how much $15 in 1945 is worth today\r\n- Scrollable and selectable history of operations lets you recall both previous queries and results\r\n- Operator keys intelligently disable to prevent syntax errors\r\n- Dynamic font sizes keeps your numbers large and on screen\r\n- Parenthesis matching will automatically highlighted a matching parenthesis set\r\n- Smart parenthesis automatically close without causing an error\r\n- Implied multiplication added between numbers and parenthesis\r\n- Fully editable display allows for editing the middle of a input\r\n- Copy, cut, and paste operations fully supported\r\n\r\nTips/tricks:\r\n- Hold percent button for ~4 seconds to switch with EE\r\n- Hold a result in history to delete it\r\n\r\nCheckout the open source code on Github:\r\nhttps://github.com/EvanRespaut/Equate\r\n\r\n<i>Send comments, suggestions, and bugs to LlamaCorp1 (at) gmail.com</i>\r\nDesigned and coded by Evan Respaut.", 'descriptionHTML': 'Equate is a unit converting calculator designed to make converting from one unit to another fast and simple. <br><br>For example, to convert 1/4 cup into tablespoons, type 1÷4, press cup, and then press tbsp.  That&#39;s it.  <br><br>To find the number of Dollars in a Bitcoin, simply move to the currency tab, click BTC, and then USD. The result will be the price of a Bitcoin in US Dollars. Currency conversions use rates that are updated every 20 mins.<br><br>App is ad-free and open source (see Github link below).<br><br><br><b>Units Types Supported:</b><br>- Currency and cryptocurrencies<br>- Temperature<br>- Weight<br>- Length<br>- Area<br>- Volume<br>- Speed<br>- Time<br>- Fuel economy<br>- Power<br>- Energy<br>- Force<br>- Torque<br>- Pressure<br>- Digital<br><br><br><b>Features</b><br>- Convert between historical and modern dollars: find how much $15 in 1945 is worth today<br>- Scrollable and selectable history of operations lets you recall both previous queries and results<br>- Operator keys intelligently disable to prevent syntax errors<br>- Dynamic font sizes keeps your numbers large and on screen<br>- Parenthesis matching will automatically highlighted a matching parenthesis set<br>- Smart parenthesis automatically close without causing an error<br>- Implied multiplication added between numbers and parenthesis<br>- Fully editable display allows for editing the middle of a input<br>- Copy, cut, and paste operations fully supported<br><br>Tips/tricks:<br>- Hold percent button for ~4 seconds to switch with EE<br>- Hold a result in history to delete it<br><br>Checkout the open source code on Github:<br>https://github.com/EvanRespaut/Equate<br><br><i>Send comments, suggestions, and bugs to LlamaCorp1 (at) gmail.com</i><br>Designed and coded by Evan Respaut.', 'summary': 'Intuitive and fast unit converting calculator with real time currency. Ad free!', 'summaryHTML': 'Intuitive and fast unit converting calculator with real time currency. Ad free!', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.77, 'ratings': 292, 'reviews': 167, 'histogram': [5, 2, 2, 29, 251], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.1M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'LlamaCorp', 'developerId': 'LlamaCorp', 'developerEmail': 'LlamaApps1@gmail.com', 'developerWebsite': 'https://github.com/EvanRespaut/Equate', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '7475596223061293935', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/6OfQaCnPwq2XrhTiufg2TJWT15Yl508XJ50NeNsZ1O_m_GEnikfROo7fFuyDosT8mbfk', 'headerImage': 'https://lh3.googleusercontent.com/90MB7aLwQurx6GtZ6WeFxiqabYVZdMR_sb1GpTyZKN2uge_h91foj9rhMSJlXDgwWMA', 'screenshots': ['https://lh3.googleusercontent.com/tBu_wzYyK4YvieretzG8SXJVL4sUb6CXvcw_jv0IWYlGjQ_zkc54FpgN3eORYYXJx78G', 'https://lh3.googleusercontent.com/mLuJue_yA7t_vIAm98YQA8NnugT3KjXJRHjtm_A0gzB5JpI_a3BcQFNOhhNbGjgM2EwM', 'https://lh3.googleusercontent.com/v4DBrh15gWlMxK4O6ZwLCin1U6nswTi-BZ9F4j5jhgPVSEi8F5SuUs3kzyMb-yFDh382', 'https://lh3.googleusercontent.com/YIZmX4COiPjnpl7U--T9CjFOeAVH5D6d5zMAGU1qpU951HaBNHwLOtaZ2RETktnIJQ', 'https://lh3.googleusercontent.com/ZrMF637iuW-_M6f290_RWf0dabdG9FOdfmj8y2er-ulrxXP8gzqM-NKHoVaR__1aUVt7'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 29, 2015', 'updated': 1590936570, 'version': '2.0', 'recentChanges': 'Hotfix for currency updater.', 'recentChangesHTML': 'Hotfix for currency updater.', 'comments': ["I've been using this calculator for years, perhaps soon after launch. It's still the best calculator app. There are no ads and the developer is careful in their work. I would like to request a small feature. Recently used items appear as a priority. I regularly convert the same currency that is not on the primary list. It is not optimal to search for the conversion every time. Thank you.", 'I have used Equate on my mobile device for a couple years now and am very happy with it overall. I do a lot of measurement conversions and the app makes it quick and easy for me. However, I do think that it needs more units of measure. For example light output and light density (lumens and foot candles respectively). Also, including more obscure units such as the troy pound and the tower pennyweight would be very useful to someone such as myself; to others perhaps only humorous.', 'Best converter/ calculator app in the Play store hands down. A must have on every device I own.', 'Heaps of useful everyday type conversions and dead easy to use. I love it and use it at least once or twice a week saving me massive brain draining conversion calculations... 👍', 'Ad and GSF free, works great. Should put units in sidebar, make the calculator larger and easier to manage. would be nice to see full history in portrait mode.', 'useful, but has a major bug: converting 1 furlong to yards returns 219.999999907002, this is wrong, 1 furlong is exactly 220 yards. A similar problem occurs when converting 220 ysrds to furlongs.', "Excellant app, really easy and pleasant to use, most of what I need is there, but one thing missing - how about density? As a brewer I'd love to be able to convert between specific gravity, Plato and Brix.", "It's a must have app. Damn fine work. Now all currencies work aswell, bumped to 5 stars.", 'A very useful app, and yet takes up so little space. Highly recommended.', 'Full featured. Interface can be awkward', 'Thank you so much for this app. It is my go to for every conversion. Perfect!', "Ridiculously complicated and not user friendly. It's very difficult to switch between from and to options. Have all the positive reviews been bought?", 'Great app! Simple and easy to use.', 'Absolutely the best Calculator/Conversion/Exchange app going!!!', 'The app is good,only think is can you have normal mode, only for numbers?', 'Essential & opensource app.', 'the only non-scientific calculator app i need. hands down.', 'Quick, Simple and...I Love It!', 'so many currencies removed', 'Has all the functions I want.', 'the best calculator on android', 'Great conversion tool.', 'This application has a good graphic user interface, with a slightly unusual, but intuitive way of arriving at your conversions and calculations. Unfortunately, the currency conversions don\'t work at all, with the message "Internet timeout" instantly appearing every time the app loads. Update: Currency conversions now updating within seconds whenever called upon :)', 'Unexpectectedly, the app became useless since many currencies disappeared. Please, fix it somehow. Update: back to my favorite calc/unit converter app', 'It was a great app, but recent update lacks many foreign currencies for conversion than previous version. Plz bring back other currencies like BDT, XAF, QAR, SAR etc. TIA', "Really great app; has all the conversions I need, and they are easy to find thanks to the customizable buttons. With the new currency source it became quite near to perfect. And it's open source too!", 'Its a great app again! tnx', 'this app replaced my regular calculator app. used to be better (screw yahoo for that) but still good.', 'Very handy.', "It is a great app, but the recent lack of currency updates unfortunately impinged upon its usefulness. But it's back, and I have upgraded my rating. Love it!", 'This is a great application. Love the fact that it covers all your \nconversation needs plus provides a useful calculator. Two issues with this, \nhowever. Firstly, the currency statistics no longer update for current \nmarket prices, which really undermines the usefulness of one of its \nfeatures. Additionally, it would be really useful to be able to provide \ncustomized exchange rate or two for comparison purposes. Thanks and keep up \nthe great work.', "There may be Calculator/Converter APs out there that are equal or better than this one ...I frankly don't know.  What I do know is, for me this is a terrific piece of equipment.  It does exactly what I want & need easily, fast & effiently ...and no advertisements! Congratulations to the programmer(s)!  Job well done! Thank you!", "Provision for user defined exchange rate should be added so that calculation doesn't vary during time of calculation while to internet service.", 'Do all the necessary jobs, also open sourced with nothing hiding behind. \nWhat else can you expect? Best converter ever used.', 'Originally got it on F-Droid for offline currency conversion, ended up being so much more. Will definitely come in handy!', 'Does lot of converting calculations plus currency math, and no ads! But I \nwant to see a more options in settings i.e. number of characters in output. \nAnyway, thanks for making a useful app.', 'Really happy with this app. I even use it as my basic calculator. I like \nhow easy it is to skip between units of measurements. I use it mostly for \nfinding volume for cooking, basic math, currency exchange and distance.', "Would be good if the history doesn't get wiped, when the app is updated", "By far the most useful calculator I've ever had. Thank you", 'Excellent app, I love the way it works, and it is super lightweight, kudos to dev'], 'appId': 'com.llamacorp.equate', 'url': 'https://play.google.com/store/apps/details?id=com.llamacorp.equate&hl=en&gl=us'}
