{'title': 'AnLinux : Run Linux On Android Without Root Access', 'description': "This application will allow you to run Linux on Android, by using Termux and PRoot technology, you can even run SSH and Xfce4 Desktop Environment!!!\r\n\r\n\r\nIf you are new to Linux, or you don't quite understand how it works. Before posting 1 star review, you could email us at exalabdevelopers@gmail.com.\r\n\r\n\r\n\r\nThe source code could be found here : https://github.com/EXALAB/AnLinux-App\r\n\r\n\r\nFeatures:\r\n\r\n*NO ROOT ACCESS REQUIRED!!!\r\n\r\n*Lots of Linux distro supported:\r\n\r\n1. Ubuntu\r\n2. Debian\r\n3. Kali\r\n4. Kali Nethunter\r\n5. Parrot Security OS\r\n6. BackBox\r\n7. Fedora\r\n8. CentOS\r\n9. openSUSE Leap\r\n10. openSUSE Tumberweed\r\n11. Arch Linux\r\n12. Black Arch\r\n13. Alpine\r\n\r\n*Xfce4, Mate, LXQt, LXDE Desktop Environment Supported\r\n\r\n*Install multiple distro without conflict\r\n\r\n*Provide uninstallation script to fully uninstall distro\r\n\r\n\r\n\r\nNote : \r\n\r\n1. This app required Termux to work, it could be install on Play Store.\r\n\r\n2. About device requirement:\r\n\r\nAndroid Version : Android 5.0 or above\r\n\r\nArchiteture : armv7, arm64, x86, x86_64\r\n\r\n3. Currently supported Desktop Environment:\r\n\r\nXfce4, Mate, LXQt, LXDE\r\n\r\n4. For any suggestion or issue, please open an issue on Github.", 'descriptionHTML': 'This application will allow you to run Linux on Android, by using Termux and PRoot technology, you can even run SSH and Xfce4 Desktop Environment!!!<br><br><br>If you are new to Linux, or you don&#39;t quite understand how it works. Before posting 1 star review, you could email us at exalabdevelopers@gmail.com.<br><br><br><br>The source code could be found here : https://github.com/EXALAB/AnLinux-App<br><br><br>Features:<br><br>*NO ROOT ACCESS REQUIRED!!!<br><br>*Lots of Linux distro supported:<br><br>1. Ubuntu<br>2. Debian<br>3. Kali<br>4. Kali Nethunter<br>5. Parrot Security OS<br>6. BackBox<br>7. Fedora<br>8. CentOS<br>9. openSUSE Leap<br>10. openSUSE Tumberweed<br>11. Arch Linux<br>12. Black Arch<br>13. Alpine<br><br>*Xfce4, Mate, LXQt, LXDE Desktop Environment Supported<br><br>*Install multiple distro without conflict<br><br>*Provide uninstallation script to fully uninstall distro<br><br><br><br>Note : <br><br>1. This app required Termux to work, it could be install on Play Store.<br><br>2. About device requirement:<br><br>Android Version : Android 5.0 or above<br><br>Architeture : armv7, arm64, x86, x86_64<br><br>3. Currently supported Desktop Environment:<br><br>Xfce4, Mate, LXQt, LXDE<br><br>4. For any suggestion or issue, please open an issue on Github.', 'summary': 'Warning : This app require Android 5 + and Termux to work.', 'summaryHTML': 'Warning : This app require Android 5 + and Termux to work.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.92, 'ratings': 1277, 'reviews': 648, 'histogram': [204, 61, 122, 132, 755], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.7M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'EXA Lab', 'developerId': '8450947575366721624', 'developerEmail': 'exalabdevelopers@gmail.com', 'developerWebsite': 'https://exa.starinc.xyz', 'developerAddress': '6296 Jalan Selandar, Kesang Pajak, 77000, Jasin, Melaka, Malaysia', 'privacyPolicy': None, 'developerInternalID': '8450947575366721624', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/K7PIrXPKQcrNhTTi0cYhtF8jL77Bnfzgo6ckNmdiPpwh1ONnWkuyTyA0labZKEgEubc', 'headerImage': 'https://lh3.googleusercontent.com/YoyPwTFyVVf44b8wirmjsDFczF0B0fSc3Ec2xkq-APbnIRR1EVdg3Ah6Py6crot6HQ', 'screenshots': ['https://lh3.googleusercontent.com/-11YRXyPaHNjaxovUF5vzin0TEIIcvt3Dw6nRejpowDcHfFO-c1wC0tdKBnyO1gqpoHd', 'https://lh3.googleusercontent.com/Bv7dHolNJmcGUk2SY8PvpYSMW2IQ1oVb0OXrnI1EX3n98gc9BcpoH6_F5E8P1rRC8TS7', 'https://lh3.googleusercontent.com/032GtFwOyc4qsf05zssV4R4NrPOEafohwqLPrOcKGu4r6UvR8lSOlsqKgi_YuKnfHg', 'https://lh3.googleusercontent.com/6MfaLnSIrCH6WO0a_ACNSEjmRKcDzPU1l6psmgiSTA7Xpuk1UtyVymyhmFiSa48YzW68', 'https://lh3.googleusercontent.com/PUxV0REerE1n4bsY4mCf3OLvF1ghu58FXcmo9Hx9vl_0hvvhw2pVIEAn5Chcax3UD1Y', 'https://lh3.googleusercontent.com/MkV7Hb1YL8tWd3VT9K73bfI_cqgNxm8Dtha_UloT16KwWdF-cBhsQ3iF1sRYZ5r_-M8', 'https://lh3.googleusercontent.com/ENNKnpzJMwi2FaqfHHB1oLbzn2WbmbHyOiEFPLeETCJHG_LCjVD0fdEQbHYWxbjQB24', 'https://lh3.googleusercontent.com/FtkJn9VD9KM8utr28dnwxeWU8502XlerhgZ6AuPxu1_hA76-iKR42s5j9zFHjudcflU'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': True, 'containsAds': True, 'released': 'Aug 15, 2018', 'updated': 1582619945, 'version': '6.10 Stable', 'recentChanges': '*Bug fixed\r\n\r\n*Disable Parrot Security OS for arm and arm64 users, this is a sad decision to make but official arm repo still broken, they will be back one the official repo is fixed.', 'recentChangesHTML': '*Bug fixed<br><br>*Disable Parrot Security OS for arm and arm64 users, this is a sad decision to make but official arm repo still broken, they will be back one the official repo is fixed.', 'comments': ['I love it!! The only problem is, Parrot OS isn\'t available at all, there\'s an unsupported box in place of the Parrot OS box when I click on "choose" the same goes with the "Choose" option in the"Desktop Environment" option I\'m using Samsung Galaxy S7 with Magisk root with android 9', "after installing ssh, dpkg shows error And cant install other packages. and other basic packages needs to be install manually, like net-tools, ping, busybox and others as well. Can't switch users,after creating user, switching shows error. but once you manage to switch, and trying to get back root, su throws an error.There is no password for deafult user.You cant login. its like auto login. Cant change hostname, etc. Fix those things, and ill give 5star But anyway, i like the app..", 'Was having some issues with Arch, but other distros are working fine. Thank you for your work 👍', "Ok I have installed this and termux. I managed to get ubuntu shell in there and functioning. Then realized I dont know what an ubuntu is or does so I'm pulling out. Point is, I dont know anything and I got it in and back out no problem..if you are into this it's got to be almost too easy. Give it a try. One thing. When I saw references to running as root and root repository is that just inside the new shell or my android fs?", "I can't even use it... There is just a white screen, that I can't skip", 'tried many different distros on different devices and it has never worked', 'It helped solved my problems i had with andronix! This is the best man', 'This is the best Linux on Android app I have found, especially now that I found out how to get WiFi working. You just need a VPN or app that uses the VPN protocol, even a free one. My recommendation #notsponsored is 1.1.1.1, which works perfectly.', 'This absolutely amazing application try it great kali linux enviroment', "This application is awesome as it actually allows me to run ubuntu under a functional desktop environment. Most alternatives would only have ubuntu run with only it's core functions installed and if you are lucky, You might have access to an ancient variant of the twm window manager that barely works. It did take a while to install but it seems like everything is working except for maybe some minor graphics drivers for opengl support which I can probably fix manually anyways. Great Job!", 'Does what it says, if your phone has good memory, thats pretty much everything you need for linux', "Doesn't work for using a graphical desktop - lots of errors/dependancies etc. Babied it along for some of the problems (manual apt installs etc) but finally gave up. Paid for it too, but didn't help. Refunded It was useless for me, other than to start a shell. :v/ UPDATE TO REPLY: I will have to reinstall and attempt it again, when I get a chance. I will send screen shots. I tried installing the UI it the Termux shell as your instructions stated.", 'I wanted to install parrot os but when I went to the dashboard to pick parrot os it said not supported fix this plz', 'Seems great. Makes the process easier for people not knowing much about linux. I guess there may be a (small) bug when installing Ubuntu + LXDE: The "xstartup" file created wants to start XFCE, which I had to change to "startlxde". Would be great to correct this for future users. (Edited to 5 stars from 4, because of the quick answer and resolution).', 'firefox-esr [Parent 14267, Main Thread] WARNING: failed to open shm: Permission denied Android 5.1.1 I got error when i started firefox-esr I think "kali-armhf/root:/dev/shm" Correctly not mounted or binded', "I don't understand why some say this doesn't work.. I just got Debian with the full desktop environment to work on my phone.. and it blew my mind cause i didn't expect it to work. I still have some questions though.. Will i get sudo access after rooting my phone? Do all commands that require sudo not work, or only certain ones(top doesn't work.. apt does for exp) A huge thanks to the developer. Hoping to see more from you soon, I'll be following this project :)", 'great app! i could use this in pentesting. however, if I run su request from termux and start the parrot OS, i could not start the vncserver. It seems like i could only run the vncserver in normal user. and i think this could also be a problem in other OSes. Also, the parrot os seems like broken. it can update its repo but unable to install ALL PACKAGES (even nano)', 'Poorly documented. Instead of sarcasim in your instructions in regards to user complaints use that energy to better document the installation. You have troubleshooting information which is great but how about something on installation errors. Better yet how about an installation guide. The UI in the app is not intuitive. I promptly uninstalled it.', '2 stars instead of 1 just because i appreciate the fact that someone is trying to make this happen. I need something that "just works". Got this error: E: This installation run will require temporarily removing the essential package libandroid-support:arm due to a Conflicts/Pre-Depends loop. This is often bad, but if you really want to do it, activate the APT::Force-LoopBreak option. E: Internal Error, Could not early remove libandroid-support:arm (2) I was not willing to disable the package.', "After Samsung decommissioning LoD (thank God I didn't buy a Samsung device) I was really bummed about the fact I can use my phone as my fallback dev machine for simple stuff. Anlinux is so far the most stable solution I've tried so far. Yes, it is not for regular users but is not as rocket science as you might think. Kudos to the developers!", 'i like yourbsoftware, and where its going! I need to be able to cut and paste from your ratings stuff. Also, just a thought, why not have it start a distro looking like an install of that distro, right? Please send a howto sheet. And put the 127.0.0.1:5704 stuff in the instructions. Like, do I open that in Chrome or remote desktop? which do you recommend?', 'It is a great app but can you please add Linux mint and manjaro linux', 'Best app for running Linux on Android because others are way too much resources it need but this is integrated with The Phone system as well that easy to learn and configure, but some problem exist when running a few programs like wps office, chrome or Wine. Please help. Overall.. Good job EXA Lab. Team !!!', "works is able to run ubuntu mate (partial) and kali mate (full). You can even vnc into your phone's hotspot from a second tablet (my ocatore phone is faster than my tablet). works better on android 5-7 due to restrictions on android 8-9 causing linux errors. I recomend hackers keyboard and realvnc with it", 'i will add to 5 five stars if you answer my question. When i ran ngrok, it says "illegal instruction", well yes i had ran it before and it didn\'t show like that, but then when i logged out from the ngrok and i tried it once again, it happened, "illegal instruction". how can i fix it?', 'This app is excellent!!! now on my two non rooted phones i have one Kali linux distro and a Parrot distro on the the other one... coupled with the vnc viewer app two full virtual desktops!!! thank you developers!!! i didnt know this could be done without root. on my rooted phones i have Kali nethunter :) but one thing i might add is with your vnc desktops they dont timeout like the Kali nethunter one does alot. So very good work all around... keep it up.', "Cool, but there's a couple of issues, like synaptic won't open and firefox does not display web content, just a blank page. Is there an issue with drawing method or something?", "some pakages in kali requires root acces but the script of this app doesnot provide it. I install wifiphisher in it but it doesn't work how to fix it and in kali nmap and other tools also doesn't work properly. it alwaya shoew error . i have reinstall it 5 to 10 time but error doesn't fix. please work on it. -------------------:", "Looks great, but I have an issue when downloading a Desktop Environment. I have '/usr/local/bin/vncserver-start: line 4: vncserver: command not found' error... I don't know what to do. Help please", 'firefox dont work either something about it goes under another name or something the command I use is a apt - get install Firefox which returns an error... then the one time that I did get apt- get install Firefox- ESR to install it opened but with a black screen... why not just include the packages in the repo', "amazing little app, ive used it to set up a little desktop for when im out and about, i would recommend to anyone that's new to Linux or Termux", "Doesn't actually do anything, just tells you to copy commands i to Termux. Which would actually be acceptable, if the commands handled network errors properly, and didn't turn into an error rain the moment a download fails. bash's set -e is your friend.", "Doesn't work. I installed parrot os and then tried to setup desktop env but on pasting and running the command in parrot it says cannon find package xfce4, xfce4-terminal etc. Please help me. I've put the issue on GitHub also and will give a 5 star if it works", 'works great, and in the debian environment I then set up, apt-get install calibre worked, and then allowed me to ebook-convert foo.epub .azw3. Also, glad I uncommented the lines in start-debian.sh to enable /sdcard, and to use the same homedir as Termux.', 'The best and easy way for run linux without root, works perfectly on every device, LOVE 💜', 'The given commands are not working properly. I had installed kali linux and parrot os. The application window is not working and showing a blank pop up. I did this more than of 10 times. Request you that to fix these issues and reply as soon as possible.', 'Thank you so much for this app now I can do so many things', "I'm amazed this actually works without root. Still trying to figure out how to get the desctop up, but kudos to the developers for the great work!", "After recrencing the Termux wiki I found out that the desktop enviorment must be broadcasted as a vnc server that a vnc viewer connects to. The developer isn't very clear on how this stuff actually works. Edit: Reply is outdated.", "Cool app. But I'll give this app 5 stars when the developers address the /usr/local/bin/vncserver-start: line 4: vncserver: command not found. No answer to the problem has been given here or on the github."], 'appId': 'exa.lnx.a', 'url': 'https://play.google.com/store/apps/details?id=exa.lnx.a&hl=en&gl=us'}
