{'title': 'Exodus Privacy', 'description': 'Exodus Privacy helps you to know which trackers and permissions are embedded in apps installed on your device.\r\n\r\nThe app downloads reports from Exodus Privacy (https://exodus-privacy.eu.org/) and shows them to you app by app\r\n\r\nSource Code: https://github.com/Exodus-Privacy/exodus-android-app', 'descriptionHTML': 'Exodus Privacy helps you to know which trackers and permissions are embedded in apps installed on your device.<br><br>The app downloads reports from Exodus Privacy (https://exodus-privacy.eu.org/) and shows them to you app by app<br><br>Source Code: https://github.com/Exodus-Privacy/exodus-android-app', 'summary': 'Show trackers and permissions from other installed apps', 'summaryHTML': 'Show trackers and permissions from other installed apps', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.44, 'ratings': 443, 'reviews': 210, 'histogram': [22, 4, 39, 66, 310], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.0M', 'androidVersion': '4.2', 'androidVersionText': '4.2 and up', 'developer': 'Exodus Privacy', 'developerId': 'Exodus+Privacy', 'developerEmail': 'contact@exodus-privacy.eu.org', 'developerWebsite': 'https://exodus-privacy.eu.org/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '6041606273110847820', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/MzxXJP9FbonInViu2srh0Sv6DMk4wfXB3Ns5pP0j7POLCBWBQO2hlx7g6ouOr1lO5g', 'headerImage': 'https://lh3.googleusercontent.com/8f944oCZaflm9iInQ5lkL323tPGpXtgzSD1y8Bh_iuYVa1USwJkbHfC6nlOnYUM_CEg', 'screenshots': ['https://lh3.googleusercontent.com/kyc2fnxfa5YSF9_LJoNqj4nuwQ8WdDrPrXpsHjTkXXz_fl5l1jC9GM58sXSr_rPByTM', 'https://lh3.googleusercontent.com/5VGYMt0uZ0jFgFoqbSmwLV3yumzu6QP5ZRFKtrjxXjb5bMNvoSjgGqOh0Qq2AvlvMGQ', 'https://lh3.googleusercontent.com/EIUzTq5zbsDZkGhUAil4Tbzhk09yWgQmrhCGW0E6FgwNhmtvBFtIZ5vvkI4oXKHgrwU', 'https://lh3.googleusercontent.com/jNoms9KCG0KIgj_vpOY5eSqc-Dh00VSrh4a8Ji-yrBIoUbSEJ5ML81VK0soAKro-lko', 'https://lh3.googleusercontent.com/xUKAvPw8ZXbB52H0jC1LWxwILOOVFq-hM-i5xFuo2WGAjpo9NzIz_SpEvSMthMxzOaE'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Apr 3, 2018', 'updated': 1574295369, 'version': '2.0.0', 'recentChanges': '2.0.0:\r\n- Rewrite of report page \r\n- bug fix', 'recentChangesHTML': '2.0.0:<br>- Rewrite of report page <br>- bug fix', 'comments': ['thank you so much for this app that cares about our privacy! it lists installed apps and counts granted permissions. it\'s a good start although the list can\'t be sorted or filtered (eg apps reading contacts). in my case tracker download timed out without error and every app "hasn\'t been analysed" so i have to run classyshark3xodus manually. it would be handy to have buttons to uninstall or modify permissions. also a list of all permissions with details on click snd which apps make use of it.', "Great app! For each of your apps you can see how many trackers, and specifically which trackers they are, as well being able to tap each one for more info. The UI is super clean + simple, yet there's also a ton of functionality. I came across their website also, where you can search for any app, and check which trackers it uses, before you install! I recommend εxodus to everyone, and couldn't live without it. Keep up the awesome work guys!", 'Great app. Thank you for putting this tool out there. I had several apps installed that had so many trackers that it blew my mind a little. It also forced me to reconsider what apps I really need. One option I wish you could include in the future is the ability to sort the results. For example, it would be nice to sort by amount of trackers or permissions in order to see the worst offenders at the top of the list.', 'The app is OK. But informational only most of the time. Trackers are like cookies I think. Most apps need at least one to function. So, that aspect isn\'t made very clear and therefore the colouring scheme sucks a bit (green, orange, yellow, with weird thresholds) So, yeah, informational only. This isn\'t a "must have" application (yet). But the idea is interesting. And it s promising.', 'Best ever app, please create your own privacy store. even 20 safe apps in each category would do the trick. Accept my congratulations on a job well done.', 'Good with room for improvement. APP HAS 1 MAJOR DEFICIENCY - DOES NOT SCAN ANY SIDE LOADED APPS! App also needs some UX and functional improvements. Add sort by functions - install date, tracker count, permission count. Add elevator scroll accellerator. Add a submitt/report app function. Make reported libraries live links to library description/risk with additional link to library website. Add a settings/config feature. Add scan/report option for each app on install. 3 star can easy be 5 star.', "Useful and accurate information is reported, but I docked one star because there's no filtering or organization (or options to choose from in that regard), and it's also a very broad reporting of basic information. More in-depth analysis would be greatly appreciated. Great work though!", 'I would pay for a version that not only shows trackers but also blocks them.', "Love this app for the unparallelled visibility it gives! Could there be a future feature of creating a report for all of the apps and their permissions/trackers so that we don't have to go one by one? That would really be the icing on the cake!", 'Rev. Deleted 6 apps, too many trackers... Orig. Very fast, practical assistance with finding software trackers in apps. Two thirds of my Playstore apps were covered but far fewer Samsung provided apps that were built-in on my older phone.', "this app has no controls. all it does is look at your current apps installed, compile a list of them and their published privacy policy, and then adds their default requested permissions. however, it doesn't tell you in the app if those permissions are currently enabled on your device or not.", "Excellent app to keep you informed about the apps you're using, needs a few extra features though, like sorting, filtering and dark theme. Many thanks", "This is a really useful tool for identifying trackers on the apps in your phone. For more information on the tracker companies, see Exodus' website and Yale Privacy Lab's github page.", "Doesn't analyse even Google apps, just tells all app permissions enabled and marks everything as suspicious behaviour.", "Excellent app, didn't know there were vast amounts of trackers for the installed apps. Finally got rid of many apps.", "Could you add an option to submit APK's for analysis within the app itself? The current flow of going to the website is too tedious.", 'Great for raising awareness of unwanted tracking services in your apps. wish: sort app list by number of trackers/permissions. wish: donate to have specific app tested by Exodus.', 'Works. Removed a lot of apps based on trackers reported.', 'Hello developer Good details but what do you suggest is the best app to deal with permissions.For the Trackers too,specifically in conjunction with the Exodus app? Will you include a way to change permissions directly in your app at some point ? Thank you', 'Doesnt scan a single sideloaded app. funny how you guys ignoreit when its the most important kind apps to check. 3stars for effort', "If you are using the Play Store then you should be using Exodus Privacy. It's not perfect but, an excellent start to increasing awareness of and defending against surveillance capitalism.", 'An easy way to learn about the privacy implications of the apps on your phone.', 'Can provide sorting function? e.g show the apps with highest number of tracker on top...', "Would've gave it 5 stars if it could scan fdroid and other appstore apps", 'need a feature to submit an app not scanned yet', 'A true no permissions required privacy app, thank you much for designing this', "I didn't get a single detail of any app installed. Like seriously? You guys haven't checked apps like Drive or Firefox?", '0 tracker signatures detected. 2 permissions', 'Very useful app Recommend 👍🏻', 'thank you for showing what these apps really do.', 'Find out what trackers are in apps', 'A Excellent App', 'Is this same dev as classyshark3exodus??', 'i would say that . its really great app', 'Great', 'Great app, but it would be useful if there was a button to uninstall the apps when clicked on.', 'so slow', 'A very handy app that lets me know trackers and permissions for each \ninstalled app. I have removed a few apps due to the numerous trackers they \nuse, which I was unaware about until running Exodus Privacy.', 'Nice, helpful app! I heard about this on All About Android recently and \nimmediately downloaded it to check it out. It does good information on what \npermissions and trackers your installed apps use. Straight forward, "does \nwhat it says on the package". No bells and whistles included, which is \nnice, though it would be even better if there was a way to sort the app \nlist by number of trackers and by number of permissions.', 'This app is a COMPLETELY USELESS facade. I have over 100 apps and for EVERY \none it says "This app hasn\'t been analysed by Exodus Privacy yet." I left \nit run over night thinking it might work in the background but after 24 \nhours still no change. WHAT A HOAX.'], 'appId': 'org.eu.exodus_privacy.exodusprivacy', 'url': 'https://play.google.com/store/apps/details?id=org.eu.exodus_privacy.exodusprivacy&hl=en&gl=us'}
