{'title': 'Linux CLI Launcher', 'description': "Are you sick of all those <b>colorful</b> and <b>chaotic</b> launchers?\r\nDid <b>Icons</b>, <b>App Drawer</b> and <b>Dock</b> bother you enough? \r\nDo you miss those times when you could do whatever you wanted with a simple command? \r\nThen, <b>T-UI Launcher</b> and its Linux-like CLI (<b>C</b>ommand <b>L</b>ine <b>I</b>nterface) is exactly what you need.\r\n\r\n\r\n<h2><b>Features:</b></h2>\r\n• <b>T-UI commands</b> (like <i>uninstall</i>, <i>open</i>, <i>sms</i>, ..)\r\n• <b>Native Android/Linux</b> commands\r\n• <b>aliases</b>, use your favourite commands faster\r\n• <b>suggestions</b>, to help you compose your commands\r\n• <b>RSS reader</b>\r\n• in-app <b>notes</b>, for your to-do list\r\n• <b>reply</b> to your notifications directly from your launcher\r\n• online <b>theme</b> repository, <b>share</b> your own setup with the community\r\n• <b>TUIXT</b>, in-app text editor\r\n• extremely highly <b>customizable</b> launcher\r\n• <b>CLI music</b> player\r\n• full Linux-like <b>CLI</b> interface\r\n\r\n\r\n<h2><b>Some T-UI commands:</b></h2>\r\n• <b><i>uninstall</i></b> [app]\r\n• <b><i>sms</i></b> [contact] [text]\r\n• <b><i>call</i></b> [contact]\r\n• <b><i>calc</i></b> [expression]\r\n• <b><i>search</i></b> [google, playstore, youtube, files]\r\n• <b><i>wifi</i></b>\r\n• <b><i>flash</i></b>\r\n• <b><i>share</i></b> [file]\r\n• <b><i>mv / cp</i></b> [file] [dest]\r\n+ many other Linux commands\r\n\r\n<h2><b>Useful links:</b></h2>\r\n<b>Wiki</b> -> https://goo.gl/5znteK\r\n<b>Google+ community</b> -> https://goo.gl/aoMnXX\r\n<b>GitHub</b> -> https://goo.gl/As4JG6\r\n<b>Twitter</b> -> https://goo.gl/pgWs8V\r\n<b>Telegram</b> -> https://goo.gl/sqy2ft\r\n\r\n<b>TIP</b>: don't install this if you don't like having a CLI as your home Launcher, if you hate Linux or those two things together.\r\n\r\nThis app uses the Device Administrator permission.", 'descriptionHTML': 'Are you sick of all those <b>colorful</b> and <b>chaotic</b> launchers?<br>Did <b>Icons</b>, <b>App Drawer</b> and <b>Dock</b> bother you enough? <br>Do you miss those times when you could do whatever you wanted with a simple command? <br>Then, <b>T-UI Launcher</b> and its Linux-like CLI (<b>C</b>ommand <b>L</b>ine <b>I</b>nterface) is exactly what you need.<br><br><br><h2><b>Features:</b></h2><br>• <b>T-UI commands</b> (like <i>uninstall</i>, <i>open</i>, <i>sms</i>, ..)<br>• <b>Native Android/Linux</b> commands<br>• <b>aliases</b>, use your favourite commands faster<br>• <b>suggestions</b>, to help you compose your commands<br>• <b>RSS reader</b><br>• in-app <b>notes</b>, for your to-do list<br>• <b>reply</b> to your notifications directly from your launcher<br>• online <b>theme</b> repository, <b>share</b> your own setup with the community<br>• <b>TUIXT</b>, in-app text editor<br>• extremely highly <b>customizable</b> launcher<br>• <b>CLI music</b> player<br>• full Linux-like <b>CLI</b> interface<br><br><br><h2><b>Some T-UI commands:</b></h2><br>• <b><i>uninstall</i></b> [app]<br>• <b><i>sms</i></b> [contact] [text]<br>• <b><i>call</i></b> [contact]<br>• <b><i>calc</i></b> [expression]<br>• <b><i>search</i></b> [google, playstore, youtube, files]<br>• <b><i>wifi</i></b><br>• <b><i>flash</i></b><br>• <b><i>share</i></b> [file]<br>• <b><i>mv / cp</i></b> [file] [dest]<br>+ many other Linux commands<br><br><h2><b>Useful links:</b></h2><br><b>Wiki</b> -&gt; https://goo.gl/5znteK<br><b>Google+ community</b> -&gt; https://goo.gl/aoMnXX<br><b>GitHub</b> -&gt; https://goo.gl/As4JG6<br><b>Twitter</b> -&gt; https://goo.gl/pgWs8V<br><b>Telegram</b> -&gt; https://goo.gl/sqy2ft<br><br><b>TIP</b>: don&#39;t install this if you don&#39;t like having a CLI as your home Launcher, if you hate Linux or those two things together.<br><br>This app uses the Device Administrator permission.', 'summary': 'Improve your Android experience with T-UI', 'summaryHTML': 'Improve your Android experience with T-UI', 'installs': '500,000+', 'minInstalls': 500000, 'score': 4.5351195, 'ratings': 13959, 'reviews': 6874, 'histogram': [697, 272, 566, 1748, 10673], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.4M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Francesco Andreuzzi', 'developerId': '7278677227391352388', 'developerEmail': 'andreuzzi.francesco@gmail.com', 'developerWebsite': 'https://plus.google.com/communities/103936578623101446195', 'developerAddress': 'Trieste, Italia', 'privacyPolicy': 'http://bit.do/c8Vbx', 'developerInternalID': '7278677227391352388', 'genre': 'Personalization', 'genreId': 'PERSONALIZATION', 'icon': 'https://lh3.googleusercontent.com/R5ON0vEyOON2xmkZtFj0L5e4HgQwkbr42ZKnlFLd9AXbIUR9LlhA_bgWEwq-C2z5XJ8', 'headerImage': 'https://lh3.googleusercontent.com/-e7pwUwLx1HnEGevdTcXZRbaneptCxqHcFs_LYHBRNOeR7O1Ezay4jf-gfAQK-k0W2U', 'screenshots': ['https://lh3.googleusercontent.com/_RQuqHiNRluvT49koBM9XhAXg44YW5EpCFA_MzyQopoZXquwA6RnVTnZMQlIrFuUK6uB', 'https://lh3.googleusercontent.com/bMS4LCT1tQ8eO8kl2dLuKMvjVoRk5AwS_pdYtpxUWqjhynsu2Fro4E7-rWjFQadA5FE', 'https://lh3.googleusercontent.com/RKYTZroHcCXVTaUh69BHMhCVCr5nC7cs9OoRSJ_D7a2-3k06lsYpJ89RgqhEOKRa5WI', 'https://lh3.googleusercontent.com/DePQ8xHQ72k6laMrbCRmuZ6YyiM6GPJtU-Ud94eBymqTvCjsYDJSYsW--cTtPD-_xTw', 'https://lh3.googleusercontent.com/An0YDfO_jgChEobOzyu8OPqGATaofEH2VEOr0_cUHctBL1tFZmrLCZdaDQxmBZGoHw'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 29, 2015', 'updated': 1571318825, 'version': 'v6.15', 'recentChanges': '- the "donate" command has been removed to accomplish the new rules\r\n\r\nThere\'s nothing new in this release, feel free to ignore this update if you want.', 'recentChangesHTML': '- the &quot;donate&quot; command has been removed to accomplish the new rules<br><br>There&#39;s nothing new in this release, feel free to ignore this update if you want.', 'comments': ['Best app that lets you feel like you are on a Linux environment though it has some problems like the volume isn\'t controllable in the console, whenever I try to change the volume it always takes me to the "do not disturb" window and I don\'t know what to enable because it\'s not there. I would be happy to give this app a 5 star if that is fixed. Thanks', "Very solid, having a console as your launcher makes things for me too natural. My only nitpicking would be to include a ctrl shortcut much like termux has, as once I tried to ping an IP straight from the launcher and I couldn't stop, as I normally would with ctrl+c. Also trying to play music straight from the console made it stop responding and/or resetting, but that could be blamed on the phone I think. This is no replacement for termux, but for what it is, it's pretty solid.", "I have been using this launcher as my daily driver for the last two years and I can't imagine living without it. This launcher is truly amazing, with almost infinite customization options and it's capabilites to tweak most all your phone's functions, this app is a tinkerers dream. I love the simple and minimalistic aesthetic of the terminal and the familiarity to the Linux commands it offers. Thank you Francesco for your amazing work and I would love to see new features in future updates!", "Far better than any UI homescreen. Can't use my phone without it. Just a couple issues on my end. The built in XML editor won't launch and the uninstall command does not work. What do I do? A reinstall did nothing. It worked before but just stopped I'm not sure when.", 'This app is so underrated. It works very well. I can\'t believe that people actually try to come up with a reason as stupid as "this teensy feature doesn\'t work" just to rate 3 stars or less. Stop focusing on small errors which is just a phone updates fault and start focusing on the huge working benefits and abilities! BEST APP IN ENTIRE HISTORY! MUST BUY (FREE)!', 'I use t-ui daily its fast and once used to, really great minimalist launcher, history of last apps launched is a must and last call on the same desk, one tap and recall or relaunch!! Config to customise (nice coupling with the O keyboard.)', "Awesome launcher. Been using it for a year with minimal problems, a couple of crashes here and there nothing major. Customizable and really easy to use. I get a kick out of freaking people out in the metro, makes them think I'm hacking them.", "I'm a bit on the fence with this one. Honestly, I love the endless possibilities for customisation, and file viewing from the launcher itself is pretty neat, but I just can't see myself using this as a day-to-day thing. As a Linux fan, I definitely like the concept, but it just feels a bit out of place.", 'Very cool launcher, uses less resources, and fast. But could you add a command that list recently installed apps or arranges apps based on installation date , finding them through the [apps -ls] command is fraustrating.', 'v6.15 does NOT allow you to change themes, it always says "no internet". The same v6.15 from f-droid works perfect. Google Play version is broken!', "Awesome app. Have been using this for more than a month now and has made my phone usage alot faster. This was the case until my phone updated to android 10 which had the new intuitive gestures which are pretty addictive. But the thing is, this app doesn't support gestures. And setting this default removes gesture controls. I would love to start using this again with android 10", "[Gratuitous praise here] It takes a lot of effort to think of complaints, but here's one: there's no input cleansing on the config files so errors can cause a crash; reparation is easy but inconvenient. Also, I'd like to be able to put some status lines on the same line, like batterty, time, and user all together or some combo together. [EDIT] 'music -play' doesn't always play music, but when it does t-ui crashes. Not a very critical feature but it'd be nice to see fixed.", 'Amazing experience! I really like the launcher. Easy app access with hints. Although I would like more commands and more flexibility..', "I've been using this launcher since about a month, and I'm totally into it. I can do some many things just by typing away at the keyboard. Command Line Interface (CLI) is a powerful thing in the computer world, and this is one of the best implementations of the Linux CLI on an Android device.", "I really love this launcher but the dev doesn't update it often which makes me sad in addition to that being a security vulnerability. I hope the dev hasn't abandoned the project.", 'This was a good app but for the last 3 weeks i am getting a no internet access error when i am trying to change the theme, please fix this.', "Bad update!!! This is my favourite launcher so far. Using it for 2 years now. But this latest update (v6.15) is not working, it crashes as soon as it's launched. So I reverted back to the older version!!!", 'Amazing CLI. Very customizable, tho at the moment the themes are broken, tho someehat easy to edit yourself.', 'Its been three months only, but i love the app. Except for a failure to play music; every time i execute the music -play cmd, it crushes, please help me fix this problem, my android version is 9pie. Otherwise, good staff, expecting more better features, thanks.', "After use it now for years on three Galaxy S generations, I can tell it's really good... Awesome work from developers 😎", "I'm loving it. Just add some customisation to make it fit better in the screen and i will totally use it as default.", "I used to use this launcher in 2017 and there was no problem, when when I came back now, I found so many problems: no internet access when I'm online, no rss updated, crashes when using cmd music....", 'The best launcher I have ever installed. If you master it completely, you will never unistall it. Recommended for linux bash users, it brings you to your favourite environment.', 'Amazing App. I loved it more when they kept the source code open. I have made a few changes according to my usage and it is working like a charm. I adore the developer. Thank you.', 'Fantastic launcher..super fast..although would encourage the developers to add more features..but 5 * for lag less experience..god speed', "This is the best thing that has happened to my android phone. I've be using it for about a year now and I can't imagine going back to the regular Android display. It's so smooth and helps me daily. You should totally download and use this. Oh and it's so cool too. People see my home screen and wonder how much of a crazy geek I am. Totally love it", 'Love command line interface to Android! Totally frustrates people who pick up your phone to use it without permission. What the f:×!: is this? Can be heard from non-cli savvy interlopers :) Very satisfying...', "Works great! I've used it for a long time and I'm satisfied with how natural terminal execution is, even if it is not a legit shell. I can always drop to Termux if I want.", "it's a really cool launcher and it's really easy to use. I just think it would be a cool addition to make notifications show up in the prompt EDIT: I said this when I first got the launcher but just after a full day of using it and starting to feel more at ease in it I have explored the config settings and boy am I happy. The possibilities are endless. You can do so much with this launcher. It is the most amazing thing ever. I would say more but there's a limit. Must have this!!!!! Recommended!!", "Absolutely love the app! Hope to see future development! I would love to see the ability to set custom names for apps (Example: Have Chrome show up as Browser). I know you can do the alias command, but that doesn't change what it shows up as. The other feature I'd like to see is some gesture options. So we can do like pinch out to open Google Now or something.", "Genius. I always love this idea, going so far as to build my own, but they couldn't compete with this by far. The automatic recommendations are perfect and make this idea not only possible, but a potential for a daily driver. In fact I am using it daily, with the added benefit of being super geeky. Also the support for theming, aliases, and everything else is magnificent and makes this one of the best launchers for android in my opinion. Highly recommended for geeks like me.", "Yes, I'm sick of those tiring cluttered launchers. This one is simple, intuitive and even good to get familiar with consoles. Incredible.", 'definitely not the best for day to day use,.but its great for doing some stuff that you really cant do with a gui launcher.', "I thought this would be funny for a few days, but I actually fell in love. No more getting lost in icons, I can do everything I need more directly and efficiently. I've been using this launcher for a few months now, only problem is that sometimes shortcuts are not found, which is fixed by the refresh or restart command. Awesome interface for people comfortable with bash!", "cmd: music -play = Stop working Linux CLI Launcher (Unfortunately Stopped Working). Please fix this problem. I'm using Poco F1 Armored Eddition. Please do something, I need update to fix this issue...😥😢", "I was hesitant at first, unsure if I had enough CL knowledge to enjoy this app. But it's been my favorite launcher hands down. I finally feel like I use my phone with purpose. No more endless swiping or trying to track down an app, or habitually checking social media apps, etc. All business. Love it. Being able to alias a contact is excellent for texting.", 'The experience with this ui is really natural for a regular user to be amazed. This UI still have some difficulty to use but it satisfied my need of non regular interface.', 'Wonderful work. At first, I installed this as a joke just because it sounded ridicoulus, but this has been my daily driver for more than 2 years now. Extremely flexible and extends way beyond the standard home screen in terms of functionality. Not to mention completely open-source. Definetely worth to check out!', "Great! Really really great! I guess this has involved a colossal amount of time and effort and I tell you is worth it. Only one minor thing. In the last version I tried, couldn't edit the xml directly from the launcher. Minor bug that doesn't taint the fantastic experience.", "Love it! Favorite phone app ever. I find my phone much more useful and much less distracting with this Launcher. The only problem that I have is that if t-ui crashes, I get thrown back to the phones default launcher and have a little panic attack when greeted by all of those silly pages of icons and suddenly can't remember how to navigate icons anymore."], 'appId': 'ohi.andre.consolelauncher', 'url': 'https://play.google.com/store/apps/details?id=ohi.andre.consolelauncher&hl=en&gl=us'}
