{'title': 'Notepad', 'description': '<b>Features:</b>\r\n• Quickly create and save plain-text notes\r\n• Optionally create rich-text notes using Markdown or HTML (Android 5.0+)\r\n• Beautiful, easy-to-use UI with Material Design elements\r\n• Dual-pane view for tablets\r\n• Share notes to and receive text from other apps\r\n• Auto-saves drafts\r\n• View Mode for notes with clickable links\r\n• Sort notes by date or by name\r\n• Keyboard shortcuts for common actions (see below)\r\n• Integration with Google Now "note to self"\r\n• Import and export notes to external storage (Android 4.4+)\r\n• Zero permissions and absolutely zero ads\r\n• Open-source\r\n\r\n<b>Keyboard shortcuts</b>\r\nSearch+M: launch Notepad from any application\r\nCtrl+N: New Note\r\nCtrl+E: Edit Note\r\nCtrl+S: Save\r\nCtrl+D: Delete\r\nCtrl+H: Share', 'descriptionHTML': '<b>Features:</b><br>• Quickly create and save plain-text notes<br>• Optionally create rich-text notes using Markdown or HTML (Android 5.0+)<br>• Beautiful, easy-to-use UI with Material Design elements<br>• Dual-pane view for tablets<br>• Share notes to and receive text from other apps<br>• Auto-saves drafts<br>• View Mode for notes with clickable links<br>• Sort notes by date or by name<br>• Keyboard shortcuts for common actions (see below)<br>• Integration with Google Now &quot;note to self&quot;<br>• Import and export notes to external storage (Android 4.4+)<br>• Zero permissions and absolutely zero ads<br>• Open-source<br><br><b>Keyboard shortcuts</b><br>Search+M: launch Notepad from any application<br>Ctrl+N: New Note<br>Ctrl+E: Edit Note<br>Ctrl+S: Save<br>Ctrl+D: Delete<br>Ctrl+H: Share', 'summary': 'A simple, bare-bones, no-frills note taking app', 'summaryHTML': 'A simple, bare-bones, no-frills note taking app', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.391892, 'ratings': 1498, 'reviews': 727, 'histogram': [141, 0, 101, 141, 1113], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.5M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Braden Farmer', 'developerId': '5462843777539313894', 'developerEmail': 'farmerbb+notepad@gmail.com', 'developerWebsite': 'https://github.com/farmerbb/Notepad', 'developerAddress': '14873 S Echo Canyon Lane\nBluffdale, Utah 84065\nUSA', 'privacyPolicy': None, 'developerInternalID': '5462843777539313894', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/_l1b-XlrwtY6y9LXCLgF9-7dHzi3hjSPDZ1jNgEm_mvoXu4ZVJ5PFL7IyFwiAZghwg', 'headerImage': 'https://lh3.googleusercontent.com/-phYQ8PobfIlhIyKMXA7MJTBK8Kjc-L21xPK5K0_-dWs0E4Ipp8kw_etXMUrDW_2clQ', 'screenshots': ['https://lh3.googleusercontent.com/nw-otLYlCKDNiS99x3gROtxGxDuK0q-tRvtcTIc3o4mVo8tq3wc_Xw_iCTavFFPWHP4', 'https://lh3.googleusercontent.com/NkVEo5Ygo_533yhbakQr1cGPgRA6D2Zm4llyf9AaEJ0UAvk_aHttEkyNJA1qsMECFCU', 'https://lh3.googleusercontent.com/9TbhBCG_n-ib1CzBYTqRZUy4hq1tDTlW5JJeTEYoMMGjq_ZD2AsJVfgIz-G9Ia6JXAnD', 'https://lh3.googleusercontent.com/pqlPmbmqrOqDKcjLSS4fk7ozL8ZQ6T7rI0xiZalzt9c_CkJBDPr3ldAG--CK1_DjfQ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Feb 10, 2014', 'updated': 1591072687, 'version': '2.3.6', 'recentChanges': '* Fixed issue where note contents could be overwritten if app was started from the Share menu\r\n* Option to add timestamp to the filename of exported notes\r\n* Brazilian Portuguese and Norwegian translations', 'recentChangesHTML': '* Fixed issue where note contents could be overwritten if app was started from the Share menu<br>* Option to add timestamp to the filename of exported notes<br>* Brazilian Portuguese and Norwegian translations', 'comments': ["Which id10t thought it a good idea to use first line of the 'txt' instead of the actual filename... I would need to alter them ALL. OR different text codings only to get a list of jumbled letters.", 'Simple and dependable! This app does what it should cleanly, without being overloaded with options! Nice!', "Simple, Easy to use, Small app. One disadvantage is it doesn't sort.", "Youre's and FX make Android work. Thank you.", "Doesn't export properly", "Love, but... I've been using this app for years and I love it. I had the option selected to just save without asking. today I selected all and accidentally hit a letter. all of my text that I'd saved for years was replaced by the letter d. this happened to be a very important note to me, so perhaps I should be using a different app for it. the point is I couldn't find an undo. is there any way to get that note back?", "I'm tired of just a simple notepad needing network access, having in app purchases and ads. In their own ways each one makes your notes less secure, because ads and purchases mean there's a database it's connected to and that can be hacked. This one is JUST NOTES. No bull and no insecurity, no annoyance and no ridiculous list of features to clog your screen with buttons. You just type, save and edit your dang notes, like you asked. Lack of bold and other text editing tools, but you don't need it", "The apps excellence is in it's simplicity. Have been searching for an app like this for months. I had an old app from note 4 days that was never upgraded. Notepad app does exactly when I want. Simple page management. One page per list. Exports a text file rather than obscure json files. And to boot, you can also print them. Great job and thank you!", 'Works perfectly as advertised and as intended. I accept the limitations in exchange for the minimal permission & resource demands, zero ads/upsells and free price. In a perfect world it would have folders for additional filling and support minimal formating (bold, italics bullet list) ..but I wanted rock-solid basic Notepad and I got exactly that.', 'I want a text editor (note pad, word pad) that will allow to read a text file (.txt) from the chip installed in my chrome book, allow me to edit that file (type, cut, copy, paste and search) and then allow me to write that text file back to the chip in my chrome book. Does such a thing exist to support chrome book? Please help.', 'Could not be simpler, with simple help. It has just the right interface for foreign language VOCAB with several word phrases but where no other flags needed. There s no one notepad for all needs, no matter what a legal stenographer may tell you ;-)', 'Love this app its great...i have so much saved info but there is a glitch once editing a note an saving it to folder you need to choose which note to save to as in update but sadly more often than not it duplicates another..... (1) very annoying but i still love it!', 'Best note taking app. I use it daily. I love its minimalist design and startup speed. A must have app for all Android devices.', "Excellent app! Thanks so much Braden for making this! It's the first notes app that isn't loaded with ads, let's me backup and restore, doesn't require excessive permissions , and doesn't need a subscription fee to use. I really would like to pay a one time donation since I think it is worth it. Please consider making this an in app purchase or release a pro version that can bought separately.", "Notepad is a very useful and simple app. Creating a new note is very simple with the app shortcut and can be easily shared to other apps. In a way this does exactly what it should and get out of the way. In a way it's a text area with a share button. It's amazing already, but could be improved with two small changes. 1. Delete note after successful share, and 2. Add another button that shares the first line as title and the rest as the body. Thanks for a great app!", "I really like this app, I take notes on books, research, and other stuff. Please, I love this app, add like a redo button. Sometimes I mess up and delete stuff, and I don't see an option to redo it.", 'Excellent. Super simple, no complicated stuff. Just what I needed to make quick notes on the go.', "So pleased to have found this perfect no nonsense app. I haven't found any other as good. I like being able to make a printed copy, being of an ancient generation! Thanks. Liz Short.", 'dark mode is not fully dark mode, there is that blue line. implementing dark mode must be such a challenge for so many apps to get it wrong if at all', 'Best app. Simple, does the job. The app would be great if passworded and if can be backed up. Excellent app.', 'Can export/import!! No ads!! The only must have features besides the ability to take notes. Yet so many of these apps are lacking.', 'Need a text search utility. It becomes necessary when you take long notes.', "Pretty much exactly what I've been looking for - a decent plain text editor capable of saving/exporting to TXT file as backup. Can also import existing TXT files. Not interested in html/markup but it can apparently do that as well.", "I can't figure out how to save the file I edited. Multiple times a message says it has been saved, but original file is never changed.", "Clean, neat interface. Simple, fast, reliable. Can import/export as text files. Some basic but useful settings. You can multi-select to export all files very quickly to a location of your choice. Perfect for what I want plus NO ads!  For those who haven't worked out how to export: Long press on a Note from the main screen where all notes are listed. Select as many notes as you want to here. Press the SD card image. Choose a location to save from the top left options. Press save. Boom!", 'It would be perfect if I could store notes in the cloud via Google Drive, Dropbox, Box, etc.', "Nice little app. I like I'm not limited (yet) ok n how many notes I can make. I would like the option of moving notes up or down the list so I can keep topics together or decide what's priority. Thumbs up.", 'Perfect notepad app. Does everything required in simple straightforward manner. Ad free! Excellent!!', 'Very good app please add slide menu instead of top action bar to provide more space for writing.', "Eligantly, simple. Safe, since all your data is stored locally and not exposed to cloud. I only transfer files via usb from my phone to computer when it's something critical like personal financial data and account passwords etc.", 'Does exactly what it says on the tin. I especially like the export function for writing .txt files to external memory, sd card etc. Very easy to use. I can now reset the date/time on my dashcam, when the battery has been removed with ease. Far easier than using well known online apps, that seem to send you around the houses to save a document where you want.', 'Most reliable note pad ever. Been using it for years. Love using it. :)', "I like it as a quick note app. I can't find where it keeps its database, and there is no backup function (although there's import and each individual note can be exported). The Notepad supports bold, italicized, and coloured text by means of markdown if you know how to make use of it. Notes can be viewed in a read-only mode and changed in the other mode. There's an option in settings for it to ask before saving, 3 fonts, 6 font sizes, light & dark themes. Notes can be sorted by date / name. The app is SIMPLE & SUPERB FOR QUICK NOTES, which I think is what it is intended for.", "Can't live without it. Can make notes of thoughts, to dos, recipes, and then easily export them to the computer via a txt file.", 'Using it daily 😁. Great app if you are looking to note down on your smartphone.', 'Very simple and easy to use. It will very helpfull if there an "undo" button in case to get back some deleted sentences.', "Has markdown support, prevents unwanted changes by asking to save and has a default preview mode (most of the time I don't want to edit notes) + dark mode. best 💯", "Can't display files directly without importing them (duplicating my files on memory) and can't sort the files by date.", 'This is the only Notepad app I can use without getting annoyed by useless features or a cluttered interface. It does one thing and it does it well. The only thing I would add is the ability to create folders. I take all kind of notes from todo lists to recipes and it would be nice to be able to group files in folders. Another feature that would be useful would be the ability to export and import all notes for backup.', 'Very good and simple app. But the title of the note should has a separate line not to be included in the note.'], 'appId': 'com.farmerbb.notepad', 'url': 'https://play.google.com/store/apps/details?id=com.farmerbb.notepad&hl=en&gl=us'}
