{'title': 'Taskbar - PC-style productivity for Android', 'description': 'Taskbar puts a start menu and recent apps tray on top of your screen that\'s accessible at any time, increasing your productivity and turning your Android tablet (or phone) into a real multitasking machine!\r\n\r\nTaskbar supports Android 10\'s Desktop Mode, allowing you to connect your compatible device to an external display and run apps in resizable windows, for a PC-like experience! On devices running Android 7.0+, Taskbar can also launch apps in freeform windows without an external display. No root required! (see below for instructions)\r\n\r\nTaskbar is also supported on Android TV (sideloaded) and Chrome OS - use Taskbar as a secondary Android app launcher on your Chromebook, or turn your Nvidia Shield into an Android-powered PC!\r\n\r\n<i>If you find Taskbar useful, please consider upgrading to the Donate Version!  Simply tap the "Donate" option at the bottom of the app (or, on the web, click <a href="https://play.google.com/store/apps/details?id=com.farmerbb.taskbar.paid">here</a>).</i>\r\n\r\n<b>Features:</b>\r\n\r\n• Start menu - shows you all applications installed on the device, configurable as a list or as a grid\r\n• Recent apps tray - shows your most recently used apps and lets you easily switch between them\r\n• Collapsible and hideable - show it when you need it, hide it when you don\'t\r\n• Many different configuration options - customize Taskbar however you want\r\n• Pin favorite apps or block the ones you don\'t want to see\r\n• Designed with keyboard and mouse in mind\r\n• 100% free, open source, and no ads\r\n\r\n<b>Desktop mode (Android 10+, requires external display)</b>\r\n\r\nTaskbar supports Android 10\'s built-in desktop mode functionality. You can connect your compatible Android 10+ device to an external display and run apps in resizable windows, with Taskbar\'s interface running on your external display and your existing launcher still running on your phone.\r\n\r\nDesktop mode requires a USB-to-HDMI adapter (or a lapdock), and a compatible device that supports video output. Additionally, certain settings require granting a special permission via adb.\r\n\r\nTo get started, open up the Taskbar app and click "Desktop mode". Then, just tick the checkbox and the app will guide you through the setup process. For more information, click the (?) icon in the upper-right hand corner of the screen.\r\n\r\n<b>Freeform window mode (Android 7.0+, no external display required)</b>\r\n\r\nTaskbar lets you launch apps in freeform floating windows on Android 7.0+ devices. No root access is required, although Android 8.0, 8.1, and 9 devices require an adb shell command to be run during initial setup.\r\n\r\nSimply follow these steps to configure your device for launching apps in freeform mode:\r\n\r\n1. Check the box for "Freeform window support" inside the Taskbar app\r\n2. Follow the directions that appear in the pop-up to enable the proper settings on your device (one-time setup)\r\n3. Go to your device\'s recent apps page and clear all recent apps\r\n4. Start Taskbar, then select an app to launch it in a freeform window\r\n\r\nFor more information and detailed instructions, click "Help & instructions for freeform mode" inside the Taskbar app.\r\n\r\nThis app uses Accessibility services.', 'descriptionHTML': 'Taskbar puts a start menu and recent apps tray on top of your screen that&#39;s accessible at any time, increasing your productivity and turning your Android tablet (or phone) into a real multitasking machine!<br><br>Taskbar supports Android 10&#39;s Desktop Mode, allowing you to connect your compatible device to an external display and run apps in resizable windows, for a PC-like experience! On devices running Android 7.0+, Taskbar can also launch apps in freeform windows without an external display. No root required! (see below for instructions)<br><br>Taskbar is also supported on Android TV (sideloaded) and Chrome OS - use Taskbar as a secondary Android app launcher on your Chromebook, or turn your Nvidia Shield into an Android-powered PC!<br><br><i>If you find Taskbar useful, please consider upgrading to the Donate Version!  Simply tap the &quot;Donate&quot; option at the bottom of the app (or, on the web, click <a href="https://play.google.com/store/apps/details?id=com.farmerbb.taskbar.paid">here</a>).</i><br><br><b>Features:</b><br><br>• Start menu - shows you all applications installed on the device, configurable as a list or as a grid<br>• Recent apps tray - shows your most recently used apps and lets you easily switch between them<br>• Collapsible and hideable - show it when you need it, hide it when you don&#39;t<br>• Many different configuration options - customize Taskbar however you want<br>• Pin favorite apps or block the ones you don&#39;t want to see<br>• Designed with keyboard and mouse in mind<br>• 100% free, open source, and no ads<br><br><b>Desktop mode (Android 10+, requires external display)</b><br><br>Taskbar supports Android 10&#39;s built-in desktop mode functionality. You can connect your compatible Android 10+ device to an external display and run apps in resizable windows, with Taskbar&#39;s interface running on your external display and your existing launcher still running on your phone.<br><br>Desktop mode requires a USB-to-HDMI adapter (or a lapdock), and a compatible device that supports video output. Additionally, certain settings require granting a special permission via adb.<br><br>To get started, open up the Taskbar app and click &quot;Desktop mode&quot;. Then, just tick the checkbox and the app will guide you through the setup process. For more information, click the (?) icon in the upper-right hand corner of the screen.<br><br><b>Freeform window mode (Android 7.0+, no external display required)</b><br><br>Taskbar lets you launch apps in freeform floating windows on Android 7.0+ devices. No root access is required, although Android 8.0, 8.1, and 9 devices require an adb shell command to be run during initial setup.<br><br>Simply follow these steps to configure your device for launching apps in freeform mode:<br><br>1. Check the box for &quot;Freeform window support&quot; inside the Taskbar app<br>2. Follow the directions that appear in the pop-up to enable the proper settings on your device (one-time setup)<br>3. Go to your device&#39;s recent apps page and clear all recent apps<br>4. Start Taskbar, then select an app to launch it in a freeform window<br><br>For more information and detailed instructions, click &quot;Help &amp; instructions for freeform mode&quot; inside the Taskbar app.<br><br>This app uses Accessibility services.', 'summary': 'PC-style start menu & recent app launcher, with Android 10 Desktop Mode support!', 'summaryHTML': 'PC-style start menu &amp; recent app launcher, with Android 10 Desktop Mode support!', 'installs': '500,000+', 'minInstalls': 500000, 'score': 4.07754, 'ratings': 3798, 'reviews': 1664, 'histogram': [446, 182, 335, 497, 2335], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.2M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Braden Farmer', 'developerId': '5462843777539313894', 'developerEmail': 'farmerbb+taskbar@gmail.com', 'developerWebsite': 'https://github.com/farmerbb/Taskbar', 'developerAddress': '14873 S Echo Canyon Lane\nBluffdale, Utah 84065\nUSA', 'privacyPolicy': None, 'developerInternalID': '5462843777539313894', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/RMSmQK8OYPVeeyr_OI3NlsbS1YiYyDX8BlpBaNycI2VBPHQxRBnxalejAnHWWCAyGaA', 'headerImage': 'https://lh3.googleusercontent.com/HM_BuAiS2_mO_v-zPToQxd0skk-TxockrXzOFIU49vGOPb0RdZp9qA2aKQOV0zFnWEEI', 'screenshots': ['https://lh3.googleusercontent.com/a1n8ifEz6IsYGIMtwz6n-cBeHk3L2h5ulDpUP06n1mhReb7fNSWDkveOTGd3feuqWA', 'https://lh3.googleusercontent.com/wGPml0clBKL27Ee0kL0rz3frMQtnUfh_uePsyO2f3-OAzp7dK_JX5DYUJYkKEXgIPl8', 'https://lh3.googleusercontent.com/E4acaJFXLApKTRn86gYT5ZYPwT-O4CZX9jkUkUfJDDAtUTr1GtyxOSSEMcfgqDFiKNlL'], 'video': 'https://www.youtube.com/embed/VmjHDKBnhTI?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/VmjHDKBnhTI/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 19, 2016', 'updated': 1591203448, 'version': '6.0', 'recentChanges': "Taskbar now has full support for Android 10's desktop mode! Requires a USB-to-HDMI adapter (or a lapdock), and a compatible device that supports video output.\r\n\r\nSee xda's excellent writeup here: https://www.xda-developers.com/taskbar-samsung-dex-desktop-mode-android-10/\r\n\r\nAlso, see the changelog detailing many more new features here: https://github.com/farmerbb/Taskbar/blob/201/CHANGELOG.md", 'recentChangesHTML': 'Taskbar now has full support for Android 10&#39;s desktop mode! Requires a USB-to-HDMI adapter (or a lapdock), and a compatible device that supports video output.<br><br>See xda&#39;s excellent writeup here: https://www.xda-developers.com/taskbar-samsung-dex-desktop-mode-android-10/<br><br>Also, see the changelog detailing many more new features here: https://github.com/farmerbb/Taskbar/blob/201/CHANGELOG.md', 'comments': ["It's a great application, and it being open source is the icing on the cake. I just don't (yet) rate it 5⭐ because it lacks the option to display apps over it (or auto hide when launching and full screen app); clicking on a recent app shortcut opens and new instance of the application instead of bringing forward the already open one; and we can't resize the taskbar height, width nor icon size. It's still really neat and useful, though.", 'Awesome, looking for a handy options to launch some frequently used apps, and found this one. I sideloaded it to my tv and works cool, but please add an option to hide the taskbar with time out. It popup everytime tv turned on.', 'nice, but some functions missing.', 'This needs to be the default launcher for everything Android!!!', "Used to love this app so much! But totally not feeling that new taskbar popping up all the time... Bummer. Now it just adds mess to my desktop. On average I now have 3 icons representing my most-used apps on my desktop... I just want the menu and the Windows, but can't figure out how to disable the taskbar. Am I missing something..? Also, hiding icons by default, Instead of hiding dozens of apps one by one, would def have my vote!. Hopefully something for your future consideration:-)", 'Absolutely fantastic, this brings real desktop-like multitasking to my phone. Even in phone mode I can flick through apps way faster than the stock recent apps on my phone allows. This app is incredible and Im excited to see how far this app goes', 'I love this app and works on oneplus 7 pro but there is one big problem it made my screen unresponsive I could only use back and home gestures but was not able to do anything els until I asked google to open the app then it worked but it keeps happening I tried to open 2 apps.', "Works fine, covers almost my every expectation from this software. Although I've thing: I like to remap my physical buttons and want to hide taskbar arrow and expand the taskbar on physical button press. But there is no shortcut for it in the app", 'Great app, enjoy using my tablet finally. There is a bug in freeform mode when apps open in small window even if default settings is maximized. When I close and relaunch app it opens maximized as it should. Hope in future updates this gets fixed.', "Incredible. Now just add the option to use a custom notification area in the right bottom with quick actions, and to hide the status bar completely, to save more space, and it will be perfect. Another useful thing, though I think it's not possible to do on non-rooted devices, would be to make the taskbar fixed, and reducing screen for all other apps.", "It was awesome because the pictures were way better quality! I wouldn't know what to do without it. It is a big improvement to my life. You should download this app, trust me, you will not downloading this app.", 'Incredible idea and perfect execution, easily deserving a 5 star. This is one of my must-have apps. Rarely any app makes to that list and this one made it easily. Awesome work, devs.', 'Freeform mode on any device. This app is the only one which makes Android really multi tasking. Tried and working perfectly on every device. Great work.', "I installed this app on my Chromebook. It's useful but infuriating as the trigger button gets in the way of opening and closing other full screen items.", "The idea AND execution are great (at lease it works well), though it looks somewhat rough around the edges. Some features I'd really like to see: Menu mode - go straight to start menu when tapping the expand arrow and auto-collapse when menu is closed; Different styles and background shapes for the arrow; Expand/collapse and start menu opening animations; Start menu background blurring (when transparent); Custom icon size for start menu; Only show the apps found in Recents screen.", 'Almost there! Would benefit from a more PC-like minimize, ability to only show running apps in Recent, a maximize to fill screen instead of fullscreen and the ability to hide window buttons..', "Awesome! I've been looking for a good pc launcher for a couple of months now and this one ticks all the boxes including ones that I didn't even think of.I love the how it supports widgets and has so many different setting so that you can customize your experience. But as much as I love it I've found that the launcher feature has a couple of bugs to do with screen rotation.One bug being that the columns and row change around and make some apps disappear depending on what position the screen's in.", 'I love this apps, makes multi tasking awesome.one area i will love to see improvement is being able to minimise the freeform window to tray and the window be re-sizeable. Am using android 9 phone.', 'I love this app. Glad I found a floating launcher. The app is perfect however can you please add an option to make the button to be floating just like assistive touch. That feature will be useful for single handed operations. Will change it to 5 stars after you add that features :) Thanks devs', 'I like this app as it is seamless to work with second screen app to use my phone as a desktop computer.', "It's nice, but there are major bugs that needs fixing right away, the app launches a new activity of the same app instead of recalling the old one, at one point u have 6 window's in the recent Pannell of the same running or can be a compatibility issue with apps like duo great job though", 'Fantastic does exactly what I want. I would like if there was an ability to position it in the middle of the screen edge but it is fine', 'I love this launcher, I\'ve been using it for the past 6 months and it has completely replaced my default launcher. There are a few sizing issues while launching games that I play which have to be brought into full-screen mode after it launches in "standard" size because it won\'t do it straight away, even if I do select "maximized" in the new window setting. Overall though it serves its purpose and is a great way to keep multiple app tabs open and switch between them effortlessly!', "Works great thanks. Sometimes when I enter in some menus it seems to freeze(it doesn't allow me to press some buttons but after I go back to the previous page it works)", 'I suppose it works for a lot of things... But not for widgets. blank screen when selecting one. Maybe you can get it to work though... worth a shot to download.', 'Very accessible, customizable app! It does exactly what is claims, which is to give a "Start Menu" like button and a taskbar of sorts. It lets you click on a button that gives you access to all your apps, and it can be modified so that recent or desirable apps are pinned to the taskbar. I am using this on a tablet that has a phsyical keyboard, so the "Windows" setup is what I wanted. This app really delivered!', 'I\'m not sure if I\'d call this app "abandoned", since it still receives bug fixes. "End-of-lifed", maybe? I\'ve used Taskbar since it was first out, and it\'s great. It\'s not snobby, if you want to use multi window apps on a tiny screen, it says "You go, power user. No rules." But obvious stuff like edge snapping, remember window location on launch, make it so that apps can\'t overlap it, and a bigger start menu grid (my #1), never got added. This is almost perfect, why\'d ya stop short of heaven?', "Great app! One thing that would make it even cooler is the ability to center the taskbar on the screen instead of having it always the the left or right. Also, it would be cool if we could put widgets in the dock's empty space. I'd love to put a clock or a battery indicator or something like that to truly give my tablet a PC feel. Again, love the app! Thanks for putting it out there! v5: Changed my review from 4 to 5 stars because this is now exactly what I need! Thanks for the new features!", 'The closest you will get to Windows experience on Android. I have 2 suggestions: should be able to pin and remove pinned icons to taskbar (esthetics, the most recent ones showing up making taskbar clustered is a pain to my eyes), and also when you permanently set taskbar visible, the other apps should reach to the height of the taskbar, not have the taskbar display over the app. If you could add those 2 things, this would be complete.', 'i really like this app! One suggestion/request: please add a default freeform window size for a maximal 4:3 aspect ratio, not just half sizes. i am unable to get custom sizing to stick for a game I enjoy (in landscape mode). I start it in half screen and then manually resize it to 4:3 but it stretches the contents. on restart, it goes back to half screen. i have tried the workaround suggested but I have been unsuccessful.', "Works great on tablets, I'd like for the launcher to get rid of notification bar and add it to the taskbar", "Great idea and for the most part works well but missing 2 features that would make it complete. 1 There's no way to minimise the floating app, would he great to have a floating bubble when minimised, also would be useful if we could create a shortcut to launch an app in window mode from any other launcher or side bar app, hope it continues to be developed. Thanks", "Nice idea but there should be an option to blacklist apps. It is annoying when I try to play an action game and the button keeps on popping on the top whenever my finger mistakenly touches the edge of the screen. There should be an option that this app won't work while a selected fullscreen app is open.", 'This app is really awesome 🙃 its really useful while playing games , btw is there any setting where as when i close the window popped up, it goes right back on the game im playing with?', 'Fantastic app! Would be great if a scaling option (make the whole bar smaller) and a "middle/center" placement option were available.', 'Very useful app, theb best of its type I have used. Is it possible to make the widget panel auto-refresh: I find I need to allow the wigdets I have chosen every now and then. Also, at the same style as the widget panel, can we have a panel for selected apps, folder enabled? Thanks.', "Fits my needs exactly. Highly recommended. Though it hasn't been updated in a while. Hopefully the dev didn't abandon it.", "Even when the taskbar is collapsed it prevents touches from registering in the app running in the foreground, that it's like a transparent can't-touch-zone. Very uncomfortable", "I love the app! It makes everything simple for me. Oh btw if the developer dont mind me giving a suggestion, it'd be more perfect if there is an option to make a single click on the expand button will also open the drawer right away for even faster usage. Thank you!", 'I must say the app is perfect. Does as it advertises very well. But i have one gripe....when i unlock my phone the taskbar app pops up insteadbof the homescreen. And i am either on the homescreen or another app and it still happens. Not sure if its a bug. Please look into it.'], 'appId': 'com.farmerbb.taskbar', 'url': 'https://play.google.com/store/apps/details?id=com.farmerbb.taskbar&hl=en&gl=us'}
