{'title': 'SMSdroid', 'description': "SMSdroid is a special messaging app letting you send messages with any other messaging app.\r\n\r\nThis app is open source software build in spare time. Adding bad comments in market won't help much to make it better.\r\nPlease add your issues with this app on the app's website.\r\n\r\nFeel free to help translating this app to your language here: http://ub0r.de/translate/smsdroid/", 'descriptionHTML': 'SMSdroid is a special messaging app letting you send messages with any other messaging app.<br><br>This app is open source software build in spare time. Adding bad comments in market won&#39;t help much to make it better.<br>Please add your issues with this app on the app&#39;s website.<br><br>Feel free to help translating this app to your language here: http://ub0r.de/translate/smsdroid/', 'summary': "SMSdroid let's you read text messages.", 'summaryHTML': 'SMSdroid let&#39;s you read text messages.', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 3.9723501, 'ratings': 7712, 'reviews': 1910, 'histogram': [1255, 272, 675, 734, 4774], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.4M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Felix Bechstein', 'developerId': 'Felix+Bechstein', 'developerEmail': 'android@ub0r.de', 'developerWebsite': 'https://ub0r.de/projects/', 'developerAddress': 'Felix Bechstein\nFriedrich-Ebert-Damm 21b\n22049 Hamburg\nGermany', 'privacyPolicy': 'https://github.com/felixb/smsdroid/blob/master/PRIVACY.md', 'developerInternalID': '5306942296653450328', 'genre': 'Communication', 'genreId': 'COMMUNICATION', 'icon': 'https://lh3.googleusercontent.com/CUN8rKUojs7wRVfZ33JsGB0vCQspSXWzkLRJrj7HuOfTRMKbrHS8P6r7B8REbItLgYs', 'headerImage': 'https://lh3.googleusercontent.com/EHUd5rqiZMXTUDN22sRePx-6pa1V4nujD18zMru27EUhadEQlWZNcPf6XsKCq5NiDm0', 'screenshots': ['https://lh3.googleusercontent.com/T5e75PJAXqz350yfZ0YQ_sOka3DiU__fdpd9nQkI-cjzc-e0olc5uivOGSdGodvkmJ58', 'https://lh3.googleusercontent.com/5t37uCK3Tu1BpY50AwdxI5jN9f4YnEfbXyYudA2Q1rs4QPxoPrKKErjQlMspv-dgbWE', 'https://lh3.googleusercontent.com/HBsNSugD3ffvZAi3DBgwoDG7odG2JnVEcw8Gvi2ljsc6iWY6FBXMpPdtuW21jfwFwsY'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': True, 'containsAds': True, 'released': 'Mar 21, 2010', 'updated': 1553508247, 'version': '1.7.7', 'recentChanges': '* compliance to new Google Play Store rules', 'recentChangesHTML': '* compliance to new Google Play Store rules', 'comments': ['Stealing data revenue in playstore ONLY. But i recall using it in a different, downloads, were also seven times faster.', 'Horrible, automatically spams my friends with random sms that i sent them long time ago and in very wrong order. Made my day today a living hell.', "Id love to answer these review questions bt the app doesn't even open!", 'I am really very proud to app', 'I love this', 'cool and good wicked uprising😎😎😎😎😙😙😗😗😚😚', 'Good simple com sat', 'dawlod sms app', 'Love it', 'suck', 'Xd', 'yes ok', "I'm trying to fine the service I looking for I things it's will be good", 'No MMS no pics only sms', 'I cant even find a prson', 'Brilliant, thank you. Sends and receives fine using 2013 Asus Nexus 7 tablet with Virgin Mobile UK data SIM', "I think it's gonna be a OK,  thanks everyone,", 'Does not send have to go to another app to send', 'Excellent app better than other', 'Like it easy to use', 'Really awesome!', 'Everything is good for me.', 'Superb nice', 'Good', "I dislike that my keyboard hides my message that I'm texting after about 4 lines.... The app doesn't continue to move up as u type. Therefore u have to stop typing. And start a new message. Annoying. I enjoy all of  the features to customize. But that's it. I cant even use my bitmojis on this app. It's not an option.", "This is such a glitch like I want to try to do it but it won't do it it would not let me it froze in the middle of me doing it and then I said you can't do anything is his contact info like developer please fix that glitch because it says here I'll look at the pictures I look at pictures before down with something so I can know if it's good this looks so good like I can get my mom's phone number stuff like that but now I can't because it froze so developer I'm not being mean but can you just fix that glitch", 'Does not shows sent messages in the conversation. only receive messages are visible. I need some solution for this', 'I think a lot of reviewers have missed the point of this app. If all you want to do is send a regular SMS though your phone\'s provider then this probably isn\'t the app for you. It is most powerful when coupled with WebSMS, allowing me to automatically send messages for certain number prefixes through a cheaper web-based provider.  My first complaint is that it could look a little prettier. It\'s not as ugly as WebSMS but a little padding around the text could make all the difference. Perhaps the developer wanted to fit as much text on the screen as possible but screens are relatively large and high resolution these days. The "Black" theme is also more like grey under the Material Glass theme for some reason. With those two issues fixed, it would look much like the stock Messaging app.  My next complaint is that starting a new thread fires up the WebSMS interface instead of allowing you to type into SMSdroid directly. This inconsistency is a little jarring and there seems little reason for it. I guess SMSdroid is simply lacking a recipient selector.  My last complaint is a minor one. The multi-select button doesn\'t actually do anything.  All in all, a thumbs up from me.', 'Fantastic, only app I found that works on Marshmallow for writing texts to sent items.', 'Very hard. Upset', 'Its ok and nice', 'WHAT IN THE TARNATION ANDROID TEXTING', 'Love the app', 'FAKE APP', 'Minə', 'A', 'Talhaanasir', 'Veryyy good', 'عالییییی', 'Amazing'], 'appId': 'de.ub0r.android.smsdroid', 'url': 'https://play.google.com/store/apps/details?id=de.ub0r.android.smsdroid&hl=en&gl=us'}
