{'title': 'Democracy Droid!', 'description': "Democracy Now! is a national, daily, independent, award-winning news program hosted by journalists Amy Goodman and Juan Gonzalez. Pioneering the largest public media collaboration in the U.S.\r\n\r\nThis application streams or downloads the independent media broadcast Democracy Now! The War and Peace Report. It supports streaming and downloading the audio and video broadcast - this includes watching and listening to individual stories, reading transcripts, and streaming the live stream.\r\n\r\nIf you like the app, I encourage you to donate to Democracy Now! at their website.\r\n\r\nThis app is Free and Open Source, and there are no advertisements (the Democracy Now! license is a Non-Commercial derivative license). This app is fully featured and will more than suit the daily needs of a Democracy Now! fan.\r\n\r\nThe source code for the application, under GPLv3, can be found here: \r\nhttps://github.com/fenimore/DemocracyDroid\r\nAny and all feedback is appreciated. Either open an Issue on github, email the developer email below, or leave a review and I will try to respond promptly.\r\n\r\nThe episodes are licensed under Creative Commons, Attribution-NonCommercial-NoDerivs 3.0 United States.\r\nI have no affiliation with the production of the show, merely the distribution.\r\nIf you don't already watch it, check it out, http://democracynow.org", 'descriptionHTML': 'Democracy Now! is a national, daily, independent, award-winning news program hosted by journalists Amy Goodman and Juan Gonzalez. Pioneering the largest public media collaboration in the U.S.<br><br>This application streams or downloads the independent media broadcast Democracy Now! The War and Peace Report. It supports streaming and downloading the audio and video broadcast - this includes watching and listening to individual stories, reading transcripts, and streaming the live stream.<br><br>If you like the app, I encourage you to donate to Democracy Now! at their website.<br><br>This app is Free and Open Source, and there are no advertisements (the Democracy Now! license is a Non-Commercial derivative license). This app is fully featured and will more than suit the daily needs of a Democracy Now! fan.<br><br>The source code for the application, under GPLv3, can be found here: <br>https://github.com/fenimore/DemocracyDroid<br>Any and all feedback is appreciated. Either open an Issue on github, email the developer email below, or leave a review and I will try to respond promptly.<br><br>The episodes are licensed under Creative Commons, Attribution-NonCommercial-NoDerivs 3.0 United States.<br>I have no affiliation with the production of the show, merely the distribution.<br>If you don&#39;t already watch it, check it out, http://democracynow.org', 'summary': 'Democracy Now! The War and Peace Report: free (GPL) and no-Ads', 'summaryHTML': 'Democracy Now! The War and Peace Report: free (GPL) and no-Ads', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.66, 'ratings': 174, 'reviews': 85, 'histogram': [5, 1, 12, 8, 146], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'Fenimore Love', 'developerId': 'Fenimore+Love', 'developerEmail': 'exorable.ludos@gmail.com', 'developerWebsite': 'http://fenimore.github.io/DemocracyDroid/', 'developerAddress': '~Between Places', 'privacyPolicy': None, 'developerInternalID': '5904075517669368826', 'genre': 'News & Magazines', 'genreId': 'NEWS_AND_MAGAZINES', 'icon': 'https://lh3.googleusercontent.com/EBaDudE8RaqAyWT2tOxhxFiYM85HwJAa3Et5eLRGNrG_y_V_mtSBpwUf2-lQbJ-bReq3', 'headerImage': 'https://lh3.googleusercontent.com/t3PgrDSKsOhkpfp4cPk17BHNTzpJgiV0t4hnr57y7GlOTwUX-HmUC9cmuUvt7NC29HM', 'screenshots': ['https://lh3.googleusercontent.com/7PKCmzgQezDkDZKb_jsmwN9jBZ4GBliFmpu1TIc7kNNewogettw-eHRRGG8yb3OaGYw', 'https://lh3.googleusercontent.com/wpMySL8cEpylb4SOFBDk5S39gFSjA9dwl45ohlRKGJQnVstsCsaWPJckxZkjOA3d1GWh', 'https://lh3.googleusercontent.com/AqQVxAdJXodULxbnAau5ClSmbP4rw0TU2svEpoqpN8gpX2u7oEp88gBWHE2EpT217hs', 'https://lh3.googleusercontent.com/aClWAptmJggwg9ar1DSJfw8I1TcQFzOvP5F4J4VcXPhLq4YaQYBJhixZvaUwX90-mQ', 'https://lh3.googleusercontent.com/JihfgzbyEVMoSasXQ-Hvud7sL11SrMV0Lc0smJVDUmNdscMdwDlB-DtQ_fWQLUhGPw8', 'https://lh3.googleusercontent.com/UoOXH516bB4qgHKpAoXLMWCtGEnE3dxTCXBHX2cap1TZvByLP4pfFKkA-D2hU_3MXAA8', 'https://lh3.googleusercontent.com/en9SKkX63-snshsNaWbOGao-u0C3DBDhr0ry3n4pXtT7DmYRsoO4sPNjc8fI1eDnyH0', 'https://lh3.googleusercontent.com/ujQX5JRREBYXV5OcEIBQXQ6VhVnSAaoq_h29eMuMu10FTpnb079kjbwHfLU_oBzWdg', 'https://lh3.googleusercontent.com/J3UbYfIUZ16kK3XeMiSYVtNm2tUWXQ1PM538WkpzHbSgV4kFIvkLVq-gPAmPyo0TSg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone 10+', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 11, 2015', 'updated': 1527716012, 'version': 'Varies with device', 'recentChanges': 'Playback controls were added to the notification drawer.', 'recentChangesHTML': 'Playback controls were added to the notification drawer.', 'comments': ['Great app, but more importantly, great journalism that is objective, gives you the whole truth, and not influenced by coporate news outlets. Keep up the good work, you guys! :)', "App has no option in settings to control where downloads are stored so I fear them NOT on external flash storage where for example siblings can exchange there cards to watch episodes under sheets at night seperately. I also wonder where file can be found for us to move ourselves with dailymotion for example encrypting its files and even MAKING them expire now. May I help you add 'mesh' to this app and increase curated selection? That means Obama's best speeches ETC once local can automatically be shared via wifi between devices across entire urban areas anonymously once trafficked just once via isp perps. Wifi is for peer to peer not just Routers. An entire world lacks broadband but has individuals willing to share getting permission to share rich otherwise gridded content. Please let me help you slay that dragon. MESH you deserve to OWN but will you rise to this dare? The web via satellite or private for profit pipes is for losers, the rest of us need to save the 5 ETC bucks recently gouged a month for mesh ONLY AMoled 8 ish inch 4k screens fit for 3rd world families to surround and gobble wisdom from.", 'Great way to get my Democracy Now fix. I like all the different ways to get the show whether via audio or video.', 'The worst app news ever, not because of the news but because the news are never up to date. Useless news app', 'Excellent in depth coverage of the key issues.', 'excelent reporting had enough of neo fasist coorporat agenda so called news media in both us and canada,find this app media refreshing and intuetive.reminds me how media was before reagan.', "The fact that DemocracyNow hasn't been covering the Women's March on the Pentagon shows that they have become faux-progressive Democrat hats playing team sports politics. It's time to unsubscribe from propaganda aimed to exclusively help Team Blue rather than empower grassroots progressive and radical movements.", 'Democracy Now! is by far my most trusted news source, a true example of proper journalism. Amy Goodman and Juan Gonzalez are two of my favourite journalists, with the exception of Bob Woodward and Carl Bernstein. 9/10.', 'The clear place to hear the news the right correct true news', 'Great source of news coverage', 'the video loads slow.', "Refreshing, Informative, Independent, Truth Seaking, Truth Speaking DemocracyNow! That's Always Been An Independant News Source; Free From The Undo-Influeces Of Private Organized Wealth &Over-Reaching, Media Market Ownership Monopoly Power Of These Old 2Party Corporate Welfare FAUX NEWZ Media Establishment Network's That To Many American's Have Fallen Prey To; For These Last 40Years Of 1%Reaganomic's that Allowed 6 or 7U.S Billionaire's To Sieze Ownership Control Over 90+% Of U.S Media Markets!", 'Excellent news casts', 'I highly recommend the democracy now app. The program is worth its weight in informational gold. If anyone is interested in the whole truth, not just sound bites, democracy now is the way to go.', 'exceptional truth in the world outside the privledge. My beloved father Sidney was a regular on kpfa in Berkeley. Om bless you Amy.', 'best news outlet that I know. not paid for by big corporate', 'INDEPENDENT NEWS SOURCES.!!😎❤🙏', 'Top notch. Thank you', 'free as in speech!', 'Democracy Now is my #1 news source. Amy Goodman and Juan Gonzalez and the \nothers do an excellent job. They do great interviews with a wide variety of \nguests, many of whom are ignored by the corporate media. I urge everyone to \ndownload the app or view the program on cable TV or online.', 'Love, Love, Love this App.   You get the best news and information and a real education so much better than your typical corporate news like CNN or MSNBC.    Real facts and great perspetives.   Thanks Fenimore for doing this you are making a differents in the direction of Love......', 'Excellent! Most issues are fixed quickly, but it usually works great! Thank \nyou so much for creating this!', '(Also when i unpin or repin to full screen or half screen it resets to \nbeginning so again \'stream\' same minutes multiple times🌚...) Please like \nthis so people will have awareness. To cast to big screen off ulimited cell \ndata only the challenge is to not trigger metering so solution is likely to \nuse podcast app to create file then play via wifi from local file that way \nthe limited hotspot data limits won\'t apply! First world problem perhaps \nbut 64 gig cards are fast and under 20 bucks i paid 40 usd for 2 terrabit \ncard for now antique zte max just weeks (years ago) after it hit second \nhand at bookstore and still use it in also cheap under $100 light phone \nwith under $20 monthly including ALL taxes and fees unlimited LTE (prepaid \n5 line promotion) Bottom line thanks but everyone needs to flag other app \nnow and get it off playstore a nuisance for YEARS i hope it is gone? P.S. \n"are you in itunes? "', "Easily a 5 star app if the live stream of the War and Peace Report didn't \ncrash after a few seconds. The video.", 'The donate buttons are more intrusive than ads.', 'Amy Goodman is a national treasure.', 'Plays in the background, can switch between listening and watching.', 'Love this app. My number one source for news.', 'te', 'Awesome!', 'Excellent!', 'Very informative', 'Amazing source of real news', 'Love Democracy Now Real News that counts', 'The top source for real, investigative reporting.', 'love it.  thank you!', "This app used to work great, now I can't get it to dl episodes with any kind of speed (10 min got me ~5% of an episode on various WiFi connections), and streams just won't load. I thought it was a cache problem but I uninstalled & redownloaded already. I love this app, help!", "I absolutely love DN but have had to resort to downloading episodes because the video cast has not worked for me now on multiple occasions. Before I would just close the app and start it back up and it would eventually work. BTW, I've tried with Wi-Fi and Data enabled and Wi-Fi on its own and Data on its own and nothing is helping. Please fix this.", "Great app. When watching podcast, it'd be great if there's fast forward or rewind 30 second feature from the App. Sometimes the broadcast freezes and requires buffering even with hi-speed net.", 'Honest, critical reporting'], 'appId': 'com.workingagenda.democracydroid', 'url': 'https://play.google.com/store/apps/details?id=com.workingagenda.democracydroid&hl=en&gl=us'}
