{'title': 'Status', 'description': "A message from the idiot that wrote this program:\r\nStatus has not been abandoned, but is now incompatible with a growing range of devices due to a variety of problems. Unfortunately, there is nothing that I or any other developer can do to prevent this. If the Play Store says that your device is incompatible, then there is nothing that I can do to help you other than point you to one of the links below about why it will not function.\r\n\r\nhttps://www.androidpolice.com/2017/04/10/android-o-feature-spotlight-apps-can-no-longer-draw-top-system-ui/\r\nhttps://www.xda-developers.com/android-o-is-breaking-apps-that-overlay-on-top-of-the-status-bar/\r\nhttps://issuetracker.google.com/issues/36574245\r\n\r\nStatus will continue to receive support for devices below Android Oreo for as long as it remains in the interest of the community.\r\n\r\n---\r\n\r\nStatus is a status bar replacement that draws an overlay on top of the system-generated status bar. This means that the actual status bar is only hidden under the replacement; touch gestures are not overridden, and the standard notification panel is still shown. It needs a lot of permissions in order to obtain the information needed to display in the status bar. These are listed below.\r\n\r\nPermissions:\r\n- Accessibility Service: used to attempt to get the status bar color of the current app if the 'status bar coloring' preference is enabled.\r\n- Notification Access: used to get the icons of the current notifications.\r\n- System Alert Window, System Overlay Window: used to draw the status bar above all other apps.\r\n- Battery Stats: used to find if the battery is charging and what percent it is at.\r\n- Network State, Phone State: gets the type and connection of the phone network, and if airplane mode is enabled.\r\n- Wifi State: finds if wifi is enabled and how good the connection is.\r\n- Bluetooth: find if bluetooth is enabled & connected or not.\r\n- Location Services: finds if GPS is enabled.\r\n- Alarm: find if an alarm is set.\r\n- External Storage: backup/restore all settings from a file.\r\n\r\nSpecial thanks to the contributors that have helped to design the app, fix issues, and translate it to different languages:\r\n- Anas Khan: designed the app icon & helped with UI\r\n- Vukašin Anđelković: made a couple status bar icons\r\n- Ghost Ninja: also made some status bar icons\r\n- Eugenio Martinez Seguin: Spanish translations\r\n- Kim Inseop: Korean translations\r\n- Majida Whale: Chinese translations\r\n- Marwan ALsidi: Arabic translations\r\n\r\nWebsite: https://jfenn.me/projects/status/\r\nGithub: https://goo.gl/AUNgI4", 'descriptionHTML': 'A message from the idiot that wrote this program:<br>Status has not been abandoned, but is now incompatible with a growing range of devices due to a variety of problems. Unfortunately, there is nothing that I or any other developer can do to prevent this. If the Play Store says that your device is incompatible, then there is nothing that I can do to help you other than point you to one of the links below about why it will not function.<br><br>https://www.androidpolice.com/2017/04/10/android-o-feature-spotlight-apps-can-no-longer-draw-top-system-ui/<br>https://www.xda-developers.com/android-o-is-breaking-apps-that-overlay-on-top-of-the-status-bar/<br>https://issuetracker.google.com/issues/36574245<br><br>Status will continue to receive support for devices below Android Oreo for as long as it remains in the interest of the community.<br><br>---<br><br>Status is a status bar replacement that draws an overlay on top of the system-generated status bar. This means that the actual status bar is only hidden under the replacement; touch gestures are not overridden, and the standard notification panel is still shown. It needs a lot of permissions in order to obtain the information needed to display in the status bar. These are listed below.<br><br>Permissions:<br>- Accessibility Service: used to attempt to get the status bar color of the current app if the &#39;status bar coloring&#39; preference is enabled.<br>- Notification Access: used to get the icons of the current notifications.<br>- System Alert Window, System Overlay Window: used to draw the status bar above all other apps.<br>- Battery Stats: used to find if the battery is charging and what percent it is at.<br>- Network State, Phone State: gets the type and connection of the phone network, and if airplane mode is enabled.<br>- Wifi State: finds if wifi is enabled and how good the connection is.<br>- Bluetooth: find if bluetooth is enabled &amp; connected or not.<br>- Location Services: finds if GPS is enabled.<br>- Alarm: find if an alarm is set.<br>- External Storage: backup/restore all settings from a file.<br><br>Special thanks to the contributors that have helped to design the app, fix issues, and translate it to different languages:<br>- Anas Khan: designed the app icon &amp; helped with UI<br>- Vukašin Anđelković: made a couple status bar icons<br>- Ghost Ninja: also made some status bar icons<br>- Eugenio Martinez Seguin: Spanish translations<br>- Kim Inseop: Korean translations<br>- Majida Whale: Chinese translations<br>- Marwan ALsidi: Arabic translations<br><br>Website: https://jfenn.me/projects/status/<br>Github: https://goo.gl/AUNgI4', 'summary': 'A simple yet customizable status bar replacement. No root needed.', 'summaryHTML': 'A simple yet customizable status bar replacement. No root needed.', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 3.9835026, 'ratings': 15809, 'reviews': 7112, 'histogram': [2297, 641, 1514, 1925, 9429], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.1M', 'androidVersion': '4.1', 'androidVersionText': '4.1 - 7.1.1', 'developer': 'James Fenn', 'developerId': '5937321955284727208', 'developerEmail': 'dev@jfenn.me', 'developerWebsite': 'https://jfenn.me/', 'developerAddress': '1096 Covington Place\nAllison Park, PA\n15101', 'privacyPolicy': 'https://jfenn.me/policies/?status', 'developerInternalID': '5937321955284727208', 'genre': 'Personalization', 'genreId': 'PERSONALIZATION', 'icon': 'https://lh3.googleusercontent.com/iqDsRaWtCl4aV5OzKb8FzKuO2p6ntSplrLCNc5K1beRZRsrbcRWmWFJrLSK-EO1obas', 'headerImage': 'https://lh3.googleusercontent.com/qG3h0IGFtcQAo-hN9lW-8qzG_XW61XgSoNvTEW9kg61F4DIELzFrXZUSqY9Y1L9CMcs', 'screenshots': ['https://lh3.googleusercontent.com/orHCRjlxgqWbXEkQbX2ZFRPyEUCgbTBCS5bLtwxP-bqOkyVOEMUVqejpD4xACBYm5wHn', 'https://lh3.googleusercontent.com/twzGOnWpqkZhkwL0aaK2811jOZ7IKplBZBYU3FzkZDmL0QVghTAQxMIc4YDsgKa_MmqS', 'https://lh3.googleusercontent.com/RuJcvjkX5qfYNZJLrBqSUeSo0Tg_CUGUDD8XuKRb-C-VQQ1-pBsZEr-OgQU-vUN2mtRK', 'https://lh3.googleusercontent.com/ktKYl6FgNO7GaH1QiZVAMXyTQzTY_fgsUmZOoPUhx1o71DMn59KhSg2E9hI8fnP6STU', 'https://lh3.googleusercontent.com/rqqMOGgqva1ps8sW4TWbQwe-MfYyVvyuHYCsqcj7bhF4zpGZdmbyNxQBnDqZ0Xj4QpbH', 'https://lh3.googleusercontent.com/i_GXcN59-_OFQGDHWcOkdrhJsOSWdoDMaxm3w8uytXBLkQlkH5H9zzxBxUZEvrmw3w0', 'https://lh3.googleusercontent.com/YUAmoAkgNevi48jSynU5LJ0SWw0dBdqHnerpIgr84xW9ihZmrT5lZLD2AGlR854hpA'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 8, 2016', 'updated': 1518196749, 'version': '3.7', 'recentChanges': '- improved permissions system\r\n- fixed help/FAQ section\r\n- improved app/activity setting design\r\n- arabic translations by Marwan ALsidi\r\n- fixed font issues\r\n- other random bug fixes/improvements', 'recentChangesHTML': '- improved permissions system<br>- fixed help/FAQ section<br>- improved app/activity setting design<br>- arabic translations by Marwan ALsidi<br>- fixed font issues<br>- other random bug fixes/improvements', 'comments': ["It is really good. Some options that I didn't expect but did end up being useful. There are still a lot of bugs but fixing it will really improve it. I would use it but because of the bugs and my low-performance phone, I wouldn't risk it. I may or may not try to use this again in the future.", "This app is a well designed. Well thought out app, it just simply didn't have everything I was looking for. That or I just didn't figure it out haha. I appreciate that there's no ads or paid aspects of this app. This is how UI editors should be designed. Even though your app didn't fulfill my needs, kudos to you developer. You know the right way to publish apps like this.", 'There should be a option where you can turn on status bar in landscape mode. Please add this idea Im saying it for the better.', "Status bar looks great! Plenty of options for customisation, however, I uninstalled the app due to power consumption. If your phone has a weak battery, this may not be for you. If you keep a power bank with you, I'd recommend trying this app. My phone battery usually lasts the day, but this app drains power in only 4 hours down from 12. Overall, easy to use, looks great and customisable. Only real downside to this; power consumption.", "Great app. Been using for over a year now. But the network icon still remains even when airplane mode is on and the network bar isn't always correct. Also, can't u make the status bar more material, you know some apps don't really retain a particular color.. the status bar is supposed to change like the normal system status bar.", "App is doing what i needed. but but but don't stop reading there, It has some issues like, no dual network indicators for dual sim devices. Application Icons not showing, and Suggestion :- You can add battery percentage inside the battery bar. AND Icons can be hide totally if there is no room, but battery and signal icons should be constant. Please solve these, I'm loving this app. Please.", "Nice customization app, but having lots of bugs and drawbacks 1. Dual SIM (which you said you're working on) 2. Some app icons are shown as a solid squircle 3. Regardless of an app notification importance level, its icon is shown unless I manually disable it in Status 4. There's a weird sun icon among my notification icons which doesn't show up in the default status bar. (There's no corresponding notif in my notifications panel) 5. VPN icon s missing 6. Immersive mode isn't supported 7. Looking aweful on lock-screen", "Verry good application only, i can't see my correspondants names when they call or when i got some messages. The notification bar isn't hidden. Can someone help?", "really changed the color of the statusbar, this is the only app that can do. works well for me. tks developers! no rooted needed! some people say the GPS icon still, ok if you use location service like Google, the icon will be the same like GPS! it's simple to understand, the app works fine and all ways", "App seems to work good but I wish there was a way to resize and move all the icons in groups (for like the wifi, 4g, battery, etc.). Also I really just want to use this to keep android from changing the color of the bar. Would be nice if I could just make this app invisible so I can see my stock bar, but this apps status bar would keep apps from going full screen and changing the color (like when Gmail makes the status bar white and I can't see the icons).", 'This app is nice and work safely but sometimes its stop work when after I viewed any stories on Instagram..please do something about this', 'Hi developers, may i ask something ? Why my status don\'t hide at certain apps ? I already checked the control and "re-hide" it but it doesn\'t work. But, early days i use it it did hide ! Now it somehow unable to hide. Please fix it. The rest features already good, i guess it needs more icon ? Such as the data saver, hotspot, etc.', 'Good app, but it stupid working a lot, and every time I try to enable it, it makes me "turn on" the permissions, but I\'m not turning them off, so its just stupid', "Does everything it's supposed to, but the Bluetooth icon won't indicate wether or not my device is connected. i have to go to the lock screen, where the bar doesn't show up, to see.", "It keeps on off-ing itself long after i tick the 'ignore permission' & keep it open in background on my MM... Any ideas how to keep it on for good..? Update: it went off evry time i use googleplay music, idk what's d connection tho, i hv to re-do d permission ritual over & over again, for d rest of my life.. *sigh", 'There are applications where the original status bar of the phone is hidden, such as when using the camera phone, or the instagram camera, or the instagram stories, whatssap stories. but STATUS remains fixed, it is not removed, I am interrupted with the screen or image, what can I do?', 'Location (GPS) icone does not gets removed from status bar when location turned off, it stays shown even when location turned off. In order to remove it i need to disable the App and then enable it again which is very annoying.', "It's great! Really. Tho it has issues like when i turn on the data,its icon won't even show on the notification bar. Hope you can fix it. Thanks", 'My phone is using Android 6, I hate the dynamic change of the statusbar color, then found this app that I need. The only issue is the text/icon sometimes disappear when customizing this app.', 'The worst app i ever used . When i changes the size of any icon it not changes and i edit carrier name then also not shown on status .👎if you fiz this solution i rate to 5 stars', "Please, would it be possible to recreate the tablet system bar from Android 4.1.2 that ran across the bottom of the same screen? I have looked EVERYWHERE for an app that does this and I can't find anything.. I'll even pay! I hope you can help. Many thanks", 'Hey there ! You need more improvements regarding this app. The main one is colour change with the home screen i.e. the launcher home screen with wallpaper and also th apps.', 'I have been looking for a descent status bar changer that will work on my old phone for years! This is awesome! Thank you.', 'I would pay $20 for this. have spent 40 hours this last year working on this issue. can even fix firefox white statusbar.....what am I going to do now with ALL my free time trying to find a solution !! ?? thank you Mr. Fenn ❤❤❤❤❤❤', "Mine always Crashes, like it's really easy to work with it just crashes way to much and i cant get anything done. Hope this gets fixed soon.", 'This app is amazing. Perfect if you want to change the look of your phone whitout any trouble. Looks really good when completely set up.', "I don't know why, but if you enable data indicator, it says 4G even though I have LTE. Please fix and I will rate 5 stars. 🙏", 'Great app but would like you guys to improve the notification... Maybe instead of notifing me just indicate the number of notifications like iphone... But great app tho', "Just crashes .. I can't even turn it ON or move away from main screen to the other tabs to configure it. I granted all permissions but still crashes on Android 6.0, Leeco le s3; any older apk versions I can try?", "The reason why i rated this 3 stars is because on the lockscreen it isn't transparent, it has a green color that i can't change... Is there any possible way to fix this?", 'It is awesome app iam using it since 1 year but it is only 1 sim card supporter please add it dual sim displayer', "It's nice but it's so very bad because this app was just like crash , because when I use it they stopped.", 'Permission still error ... Please fix it !! I had high expectations for this app', 'Developer has been stalled. Cannot update app', 'This app yet amazing has a problem,every now and then it has to be given permission again,now it wont even allowe to give permission plz fix before receiving a 5 star', 'I love it. Just that. When I customise, I really wish I can see preview somehow. And a notification heads up example so I can test it.', 'I like it! but dude, even if I turn off the volume to hide status. it still hides it.', "When I open the app it's okay and not laggy however after a few seconds it crashes. I will give 5 stars if this will be fixed.", 'Works perfectly on older Android versions, a real shame Google have stopped this app from working on the newest versions of Android.', 'Great app, highly customizable, improves stock experience vastly. Thank you!!'], 'appId': 'com.james.status', 'url': 'https://play.google.com/store/apps/details?id=com.james.status&hl=en&gl=us'}
