{'title': 'Ever Translator (Screen translate)', 'description': 'Translate text anytime and everywhere, even you are gaming!\r\n\r\nFeature:\r\n・Translate any text without exiting current app.\r\n・Translate any un-copyable text\r\n・Translation anytime!\r\n・Offline translation with Google Translate app\r\n\r\nScheduled:\r\n・Improve OCR results\r\n\r\nIf your device is a Galaxy Note series, you can add this app into the S pen shortcut.\r\n** If you get any crash, please click the report button instead of close button, thanks! **\r\n\r\nGithub project: https://github.com/firemaples/EverTranslator\r\n\r\n\r\nThanks for:\r\nrmtheis/tess-two\r\nhttps://github.com/rmtheis/tess-two\r\n\r\nboatmeme/microsoft-translator-java-api\r\nhttps://github.com/boatmeme/microsoft-translator-java-api\r\n\r\nMuddz/StyleableToast\r\nhttps://github.com/Muddz/StyleableToast\r\n\r\ncrashlytics\r\nhttp://try.crashlytics.com/\r\n\r\nhttp://binwaheed.blogspot.tw/2015/03/how-to-correctly-take-screenshot-using.html', 'descriptionHTML': 'Translate text anytime and everywhere, even you are gaming!<br><br>Feature:<br>・Translate any text without exiting current app.<br>・Translate any un-copyable text<br>・Translation anytime!<br>・Offline translation with Google Translate app<br><br>Scheduled:<br>・Improve OCR results<br><br>If your device is a Galaxy Note series, you can add this app into the S pen shortcut.<br>** If you get any crash, please click the report button instead of close button, thanks! **<br><br>Github project: https://github.com/firemaples/EverTranslator<br><br><br>Thanks for:<br>rmtheis/tess-two<br>https://github.com/rmtheis/tess-two<br><br>boatmeme/microsoft-translator-java-api<br>https://github.com/boatmeme/microsoft-translator-java-api<br><br>Muddz/StyleableToast<br>https://github.com/Muddz/StyleableToast<br><br>crashlytics<br>http://try.crashlytics.com/<br><br>http://binwaheed.blogspot.tw/2015/03/how-to-correctly-take-screenshot-using.html', 'summary': 'Screen translator - Translate text anytime and everywhere, even you are gaming!', 'summaryHTML': 'Screen translator - Translate text anytime and everywhere, even you are gaming!', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.412162, 'ratings': 1495, 'reviews': 869, 'histogram': [404, 111, 141, 141, 696], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '23M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Firemaples', 'developerId': 'Firemaples', 'developerEmail': 'firemaples@gmail.com', 'developerWebsite': 'http://www.firemaples.com/', 'developerAddress': None, 'privacyPolicy': 'https://sites.google.com/view/privacy-policy-evertranslator', 'developerInternalID': '7779413311369285640', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/62UX-NR6yVY3BrO1pPqBqS6cL88J38xeA02d4IE76EW3on7ij2wlKw8bdOuOvcpcrlNl', 'headerImage': 'https://lh3.googleusercontent.com/ZhaKaG7qiO-UyAH7lC7YKXDRTBe4sEIuCdkMlEptQtAaxWuE17toFCkb68soGu2QNbSu', 'screenshots': ['https://lh3.googleusercontent.com/bwO7hVBe4cEF5MBKKRAdSsEFYW9Rg4BVrW_hrxvgJit9m2mXwShc9X14s98wm0nHHw', 'https://lh3.googleusercontent.com/jQkCZNxyRGyX4FwKpWCn7yi_cJs30f1HvpQe7iGn3d_iyHkITr1Skk7jiCHZ9HeQkqHm', 'https://lh3.googleusercontent.com/Mzqlu85nbv7qlwJNnbW6O1PLXJFcvFqSc7qfVqUAeKAPMz2ssGfodaBivTs5H7ICWtU'], 'video': 'https://www.youtube.com/embed/Y0OjF-luuDE?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/Y0OjF-luuDE/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 29, 2016', 'updated': 1553533384, 'version': '2.4.4', 'recentChanges': '● Fix Google translator issue\r\n● Fix some dialog not closable\r\n● Add shortcut to notification shade on Android 7.0 and upper\r\n● Fix errors', 'recentChangesHTML': '● Fix Google translator issue<br>● Fix some dialog not closable<br>● Add shortcut to notification shade on Android 7.0 and upper<br>● Fix errors', 'comments': ["This app is very difficult to use. The floating bar also defaults to the top right hand corner of my screen underneath all the tabs I have open. I can't click on it to bring it back on top without bringing up a different menu. So I have to go to the notification bar and reset it which takes time on my super slow arsed device.", 'As someone who plays JP games, this app is a staple for me. While the OCR does have issues, I\'ve simply adjusted by getting a JP keyboard & fixing up what will be translated myself. Sadly my kanji leaves a Lot to desire, but I can manage by magnifying a screenshot. The "hassles" are worth it w a free app that has neither ads nor limits. One thing I don\'t blame the app for having issues with is Stylized fonts. The OCR doesn\'t do well w them & frankly neither do I.', "TL;DR : it's far better than the rest, super awesome app 1. It worked, simple, and easy to use (at least for me) 2. It's full free, no ads, no limit usage (this is the reason I straight up give *5) Yes, if you're like me who played a foreign (especially JP) games and need in game screen translation, this is the app you're looking for. The others are full of ads, and it's not free just to get more translation. (Spoiler alert : they just give you like 10 times trial)", "Works great and fairly simple to use. It took a little bit to get used to but works fast if you follow the directions, just make sure you know what language your trying to translate because setting it to automatically detect the language won't work (I'm pretty sure this is a Google Translator issue and not the app that's using it). Overall it's the best on screen translator app I've used and is a tremendous help.", 'Once installed, there is no floating button that appears, it has been reinstalled repeatedly the same. Even though last year it could still function smoothly, hopefully this will be fixed.', "This app is great! Tho it's a learning curve to it, once you figure it out it's awesome! The people saying it doesn't translate correctly just aren't using the app correctly. Does what it says & the fact it's free is incredible! I use it to translate Chinese characters.", "Better then the rest, but still needs improvements...(specially in ocr scanning) I like the fact that it dosen't have usage caps like other on screen translators!", 'Medium OCR detection but you can edit it so get a good translation. Still good to use!', "It really helpful...must download you really need this kind of app well designed... It's need just little bit improvement and wallah..", "Fantastic app. Nothing beats this. I had been looking for this kind of app for a long time. Playing Japanese games never felt so great with this! It's working without any problem on my device. I really like how the app can detect and translate any form of text without closing apps or games that I'm using. And the text detection is working perfectly 95% of the time. Very recommended.", 'I don\'t know why but the app cannot see "1" in the japanese language text', 'Really love the concept and appreciated ypur work but I got this "ERROR: Screenshot failed cause of memory not enough, please try again later." eventhough I got like more than 40 GB free of internal storage (I didn\'t add more storage in SD card)and can\'t even get access to translation. Try reinstalled many times but didn\'t work. (Samsung Galaxy S10 plus). Please fixed this I really want to use it properly.', "It's okey but there's a problem, the menu did close and the drawing screen didn't close, i have no choice but to restart my phone. :(", 'It only identifies text in black and white background, not vice-versa or other text color.', 'At first theres no floating icon , then i figured out the permission has been denied by it self, so i must prompt it, and now its working U should put get.permission thing, i think. so the setting pop up and ask for permission to display over app', 'Please add this feature : 1. App will asking to activate "Floating App Setting". 2. Setting in the app to individually download "OCR File" of each language 3. Ads for u to get more money for development', "The most infuriating app I've ever used. It crashes about %80 of the time. When it does finish a translation more often than not it's absolute gibberish, at least with Japanese.", "This app is wonderful! Thank you very much. I wish I could mark a few favorite languages so that I haven't to scroll the whole list but it's fine, I like and use this app very much and often. Edit: It seems the reader can't handle diagonal text, only horizontal.", "Excellent app however its ocr capability doesnt feel as effective as others (specifically screen translator by langslab, if they had use a subscription model isntead of charging per amount of time you translate I would've definitely used it), personally I wish it could be better. Aside from that papago could be added as an additional provider, as far as my experience go papago has the best translation when it comes to japanese and korean language.", "Fantastic app, I've been looking for an app like this for years. I can now use foreign website and apps with no problems rather than having to screenshot and use google translate which is also great but in other ways. Thank you developer, great work.", "the scanner (translating detector?) itself isn't good... for most of the time it captures the wrong alphabets/letters/words so the translated results are usually wrong!", "This app does excatly what I wanted to do. It is the only app without many ads and hassle free on-screen translator with copy-paste. Nice job developers. If it's possible try to add auto detection of language on-screen to translate it into desired language. Again, nice job.", "App was literally working yesterday, so I'm a bit sad that it isn't working anymore please fix. Like for real for real I know that this has been a problem for a while since others have talked about it in their reviews so please stop being lazy and fix it.", "Didn't work. Just showed a bunch of random numbers and letters", 'The app doesnt even translate words, I have a visual novel game that im trying to play its in japanese. I want to translate it from japanese to english and when I translated the selected text all it gave me was this "\'r8 CT $ § T £ § EAT £ \\ Ch T: Utat%\'] § 3\'éJ" a bunch of gibberish, its not even translating the text.', 'The OCR has some issues, especially if the text is white with a black outline, but the app works as advertised. The only other issue is that it occasionally closes without warning. It works well enough for playing games in Japanese.', 'English: Great app! I can Prank my friends that i can speak Japanese', "After trying about 100 different types of on screen text in several different apps I couldn't get it to OCR anything, much less translate it. OCR text is always empty. Don't waste your time downloading.", 'Translator engines are all incapable to translate, so that showing multiple translated results in a single popup would be brilliant rather translate the same thing repeatedly by different engines clumsily.', 'Its good but it lack something. And it is Image translation. Could not translate on images or photos. Like for example, Reading Raw comics, Magazine and etc.', 'The floating bar didnt show on my phone, when open the app first time it just quick blank white transition', "This app was the best in game translator now after todays update the app's error message freezes everything on my phone it stays on the screen only comes out when I restart the phone. please Devs fix this issue ASAP coz I use it every day all day please!!!!", "While it's a bit clunky at first, I got used to the ui so quickly that I now view it as an easy to use app. It singlehandedly makes a lot of foreign games playable, and I love it.", 'Useless I mean I tried it in Chinese Language but It Makes me download another app and download a language files, and then you crop the screen/phot it takes so long to Finish and the result are Terrible Their still mandarin Sign', 'What\'s with the error? It says "ERROR: can\'t save the screenshot because of not enought memory..." I got a lot of storage left but why is this happening? please fix this', "Best Screen translator on market, fyi still can't use Google App as Provider translator even offline phrases downloaded, if this things can works, it's really reduce translation time for end users", "Can't open it, not worth to download it. Just waste of space. When I open it, it's only flashed white screen for a second and back at the main screen. Really disappointing.", "so far it works,not too good not too bad,and it's 100% free of charge", "recommended app... just... can't seem to translate diagonal vertical such as japanese... hoping there would be an update for translating diagonal or vertical words in the future :)", 'Although this app has a simple UI/UX, I find it very useful compared to the other bulky, ad-bloated, money-asking apps above. Thanks for this app. Please keep it awesome.'], 'appId': 'tw.firemaples.onscreenocr', 'url': 'https://play.google.com/store/apps/details?id=tw.firemaples.onscreenocr&hl=en&gl=us'}
