{'title': 'DankChat', 'description': 'Chat in multiple channels at once, regardless if the streamers are live or offline, with FrankerFaceZ and BTTV emote support built-in!', 'descriptionHTML': 'Chat in multiple channels at once, regardless if the streamers are live or offline, with FrankerFaceZ and BTTV emote support built-in!', 'summary': 'A simple app to chat on Twitch.tv', 'summaryHTML': 'A simple app to chat on Twitch.tv', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.3, 'ratings': 213, 'reviews': 124, 'histogram': [17, 10, 8, 31, 144], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.6M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Felix Schmid', 'developerId': 'Felix+Schmid', 'developerEmail': 'felix.schmid@flxrs.com', 'developerWebsite': None, 'developerAddress': None, 'privacyPolicy': 'https://www.privacypolicies.com/privacy/view/a7c2deee447bc402cbcf05db5d7fe5d5', 'developerInternalID': '8038816527989853556', 'genre': 'Entertainment', 'genreId': 'ENTERTAINMENT', 'icon': 'https://lh3.googleusercontent.com/5wyXdrqAo1vkqxicB8MLQd6dg2Uu_xOP1duwn4JqThXf_wgrJLwhG-Zw5VLFLW8Z9ig', 'headerImage': 'https://lh3.googleusercontent.com/BHT0ym0Z1z76hwrNCwEY0eAlgCZBTcHIW1FptJ-3N9ZhmlHn1HfXtb_vHgQXmDw0hg', 'screenshots': ['https://lh3.googleusercontent.com/y10xDZOylNq3xDnB6AvP7oDCD0FBgisyYKTJJQcLtfuA7w1e29-YN1eqzFNk2zcQZoN2', 'https://lh3.googleusercontent.com/kq5pegDBiiSaEvl8AmXS9YL9R1O4bi8o4N7KwZ3fXXLCfdVhhY2YwzGBR-duJngMbB8', 'https://lh3.googleusercontent.com/CS0vpXw4OSVheFRMI1V-GnzdM0Z9w3QXJlrVLc_fgbKskdLFMon211S9PL0qkLUGLGLt', 'https://lh3.googleusercontent.com/uQ75jSeuu3UtWHigzHtwVlnSVs9AtZtGSjhusn6PYFqG-KY5sepwbOe9uCqWcGMEYG3u', 'https://lh3.googleusercontent.com/QvqRJ9i3MqlKCj6sy5zyUsajbag51PdmcDUjSXwkrXY49W_rH2nSlcxEaBtk1CCz5hvz', 'https://lh3.googleusercontent.com/pgmPK7b_l_GdBAnCYEy-RIxxYg2LGtrztPnLr0jJnS7JrupH1cn-hUJR91n6XDZiXJo', 'https://lh3.googleusercontent.com/a8Io8-LirGIQE5ThyxS9xAsHtuQHYcu8jCI5deWhbRjKKMqRZfqqzckOCyVoaxWSifY', 'https://lh3.googleusercontent.com/0o3Aoqv3dHI-L_ZIWN9JrR9H2XgrV64ITTfRX3WsO4PMIfgHy3res99O8zqKprUo21k5'], 'video': None, 'videoImage': None, 'contentRating': 'Teen', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 9, 2019', 'updated': 1591305974, 'version': '1.9.7', 'recentChanges': '- DankChat now shuts down when exiting with the back button, the home button/action should be used to minimize \r\n- Fixed crashes caused by corrupted cache entries\r\n- General dependency updates', 'recentChangesHTML': '- DankChat now shuts down when exiting with the back button, the home button/action should be used to minimize <br>- Fixed crashes caused by corrupted cache entries<br>- General dependency updates', 'comments': ["Fantastic, Simplistic, quick and easy. Only gripe I have is, I wish i could make the font bigger. I usually use this on my tablet from a distance of about 6ft away. It'd be nice to be able to size it up then it'd be perfect. :D Uses your FFZ and BetterTTV emotes you have already. EDIT: Just checked the app out again. They added a font size adjuster. It's awesome. :D 5 Stars.", "It's a great app! I have to think hard of what i would like to see in this app, it makes my twitch widepeepoBlanket experience so amazing. Things that would be cool, a highlight on the tab witha new message... PepoThink great app :)", 'Great app, was having the problem where it would not connect and managed to solve it by loggin in again because for some reason it thought my phone was a new device and was asking for a verification code, if anyone is having a similar problem do what I did. Keep up the good work developer some more quality of life and optimization and this app is close to perfect.', "An app that save batteries. Expect 3-4X more battery life of the official Twitch app in chat only mode. I use it when my computer show the stream and i'm the bed with my phone for chatting. Very apreciated. I would like 3 things to see in near future : Channel points, list of all viewers and moderator fonctions to be able to moderate.", "Would be worth 5 stars, if it didn't crash every 5 minutes :)", 'Probably the best stand alone twitch chat app. My only feature request would be the ability to turn off the emote suggestions. They regularly get in the way of my ability to type.', "I've used this for a long time now and it's the best for Twitch chat on your phone. TTS features would be something I'd like to see.", "This is a very useful app for mobile friends who don't have a PC, very easy to use.", 'Works great but bttv emotes are not showing now', 'Great chat app, simple, clean, not overloaded with useless functions. See BTTV and FFZ emotes in chat. Exactly what I was looking for. You could create a donation link, willing to support.', 'Amazing. Im suprised it doesnt have more downloads. 10/10', "It's great so far but I'm not sure if it's just me but after a while the chat starts to lag and slow down, maybe due to all the animated emotes spam or something. But it's a great app for what it is and for what it's trying to be. Also, is there any way we could change the color of the text to white instead of grey?", "Does what it says but it has extremely high battery usage and no option to save channels for quick access. It's kind of a hassle typing the channel names every time. Multiple channels seem to use more battery so I can't just leave them all running. No big deal.", 'Fantastic app! Really useful, any thoughts of adding built in chat translation? Using web translation trying to translate everything (username) alters the correct translation. This would be a great feature. Thank you for such a great app.', "Love it and it's easy to use", "It's really great and one of the best apps out there not like the other apps that either doesn't have bttv or doesn't show your subbed emotes, but the biggest problem with it is there is no, (recent used emotes) button, you have to go and look for the emote every single time, and there is no chat customization like how big it is and other stuff", 'Best there is. No doubt. Now you need to start putting ads, and an ad removal option for $1 PepeLaugh', 'i cannot login on my account, help dev', 'Very good app shod look at mix chat for Facebook youtube mixer so all chat can be seen in 1 app keep up the good work', 'Nice app smile :) I do wish it had the ability to add /whispers and /mentions though. Unless there is and im blind. Oh and, timed out messages should be made a bit transparent like it does in chatterino imo. Dank/8 , great app', "Are the subs emote free? Because whenever i try to chat my message dosen't seem like it registred", "It's a great app but can you give it a light mode, sometimes dark mode is hard to see. Please and thank you.", "Works well - is there a way to send whispers though? I received some but don't know how to respond to them.", 'I like the app and all but please add a pop out for chat :)', "good for chat, but doesn't show the stream at all?", 'Nice app dude, can you add no top bar and a font scale please?', 'Very peepoPog, also saves your streamers which is nice', "DankChat changed my life, I used to have nightmares about the war back in Vietnam, among things such as stress, fear to a specifc number that would result in lethal damage at Blizzcon,the cold war, retarded weebs winning a chat war, bob saget's incident in 1990, stuttering hobos... but as soon as I found this apk things are completely different, and the benefits of it come in instantly, I can't describe the amount of gratitude and relief this masterpiece has granted all of us. FeelsDankMan", 'Excellent twitch chat app, keep up the great work!', 'Just the app that every twitch user needs. :)', 'Best twitch chat app for Android right now!', 'I was blinded by science.', "Been looking for something like this! Minor things I would change but I'm sure they'll happen in the near future. Amazing thanks OkayChamp", 'Cx. Great simple app for gif bbtv emotes on Android. Cheers ☺👍', 'Sadge its works..... I guess', 'Works well with bttv emotes', 'Best Twitch chat client for Android ever, looking forward to more dank features', "Doesn't work properly.", 'dank app FeelsDankMan', 'Best Twitch chat app'], 'appId': 'com.flxrs.dankchat', 'url': 'https://play.google.com/store/apps/details?id=com.flxrs.dankchat&hl=en&gl=us'}
