{'title': 'ToneDef (DTMF Tone Dialer)', 'description': 'ToneDef is a small, powerful open source tone dialer featuring full DTMF, blue box, and red box modes. Dial using the keypad buttons, enter a predefined sequence for automatic playback, or select an entry from your contact list. A small slice of phreaking history! ;)\r\n\r\nFull GPL V2+ source code is available on GitHub: https://github.com/Fortyseven/ToneDef\r\n\r\nPERMISSIONS: Requests access to contact list to allow for dialing a number attached to a contact.', 'descriptionHTML': 'ToneDef is a small, powerful open source tone dialer featuring full DTMF, blue box, and red box modes. Dial using the keypad buttons, enter a predefined sequence for automatic playback, or select an entry from your contact list. A small slice of phreaking history! ;)<br><br>Full GPL V2+ source code is available on GitHub: https://github.com/Fortyseven/ToneDef<br><br>PERMISSIONS: Requests access to contact list to allow for dialing a number attached to a contact.', 'summary': 'ToneDef is a free, powerful tone dialer featuring DTMF, bluebox, & redbox modes!', 'summaryHTML': 'ToneDef is a free, powerful tone dialer featuring DTMF, bluebox, &amp; redbox modes!', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.33, 'ratings': 139, 'reviews': 62, 'histogram': [13, 6, 4, 8, 105], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.0M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Bytes Templar', 'developerId': '6674439910033933073', 'developerEmail': 'fortyseven@bytestemplar.com', 'developerWebsite': 'https://github.com/Fortyseven/ToneDef/releases', 'developerAddress': None, 'privacyPolicy': 'https://bytestemplar.com/mobile-privacy/', 'developerInternalID': '6674439910033933073', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/DANSb_hLERCACj0GqcZoJDNma8MPJFj6tK3xonpSGaseMJ88ALY-paOIM3EB23shL1s', 'headerImage': 'https://lh3.googleusercontent.com/Px_st0X55R0DSyaJsvsVTpDqV-B5U1_iwLwsEo1dvvfMivDGQEbYgtdlLJD0BfXtOe8', 'screenshots': ['https://lh3.googleusercontent.com/tdwGcwfPzXKRDqIgjklCm2uFUW_RA5NdCvuCuXcf9vDIlB-ZBu-z9j7J20NSJPC6gw', 'https://lh3.googleusercontent.com/YkJmEa9XPS2XdVqChe7T3MiiUQV3L6lZ_hkGHqdSCZC8-a_lXGDTN4cFskkWXreCWVQ', 'https://lh3.googleusercontent.com/LggpeGRMH4cS8Ef4JH0kb6wXRj0zu6ZhIG6kZL35bJqaxaIcIMZ_sD4neTVN30ilwBaF', 'https://lh3.googleusercontent.com/VyDpDYjLCLM-tYQ3Z-71Eih2VrPw3O3y6SVGGua1PVsBzBvutpixIvluv_MqvWvgtltO', 'https://lh3.googleusercontent.com/jACkt0ud1nVyEoLhYm3W7rrTpygNczjLKITS_23QzP7fc4T4JS4_q6J_r2bN278Kwc4', 'https://lh3.googleusercontent.com/IvYHOMvFmasZam39ODciwQPlcS5TPmx5jjgWps-UjRLZ0PcwR7MehYbyWd2aNidSVU8', 'https://lh3.googleusercontent.com/AfTyXWs-8G6lugFzDSIKE_33625OXI3bbSQ3b-vxD2OJ9ftcWYSoOzczRxsBy23pDBw'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Apr 11, 2014', 'updated': 1565621418, 'version': '20', 'recentChanges': ' - Fixed theme issues causing config dialog rendering problems (Good catch, tacarrie!)\r\n\r\nPREVIOUSLY:\r\n- Implements modern Android permission requests\r\n- Improved accuracy of one-shot sounds\r\n- Added better error checking for some operations\r\n- Cleaned up some of the code\r\n- Changes to appease the Play Store\r\n- Tone playback is now more stable on long presses. (Thanks, tildearrow!)\r\n- Sequence dialing now parses extended DTMF; no longer forces digits-only input. (Thanks, Tomino2112!)', 'recentChangesHTML': ' - Fixed theme issues causing config dialog rendering problems (Good catch, tacarrie!)<br><br>PREVIOUSLY:<br>- Implements modern Android permission requests<br>- Improved accuracy of one-shot sounds<br>- Added better error checking for some operations<br>- Cleaned up some of the code<br>- Changes to appease the Play Store<br>- Tone playback is now more stable on long presses. (Thanks, tildearrow!)<br>- Sequence dialing now parses extended DTMF; no longer forces digits-only input. (Thanks, Tomino2112!)', 'comments': ['Excellent app concept and design but has several major bugs. Tones shift in pitch over time, preventing receiving equipment from recognizing the tone. Interference is heard when playing multiple tones together. On my phone, accessing the DTMF dialer causes the app to crash entirely. But again, love the concept and the features the authors included.', 'Does what it says, except for one thing: "dial a contact" errors because it doesn\'t have contacts permission, but the app never seems to prompt for said permission. It must be granted manually via app info, which not everyone would probably think to do. Edit: Thanks for getting back to me so quickly. With the August 11 update, the app functions pretty well perfectly!', 'To help with the clicking after every sound: you can continuously play a 0.1 Hertz tone in the background with no way to turn it off.', 'Works exactly as it should. Loud, clear and tone persists as button remains pressed.', 'Best Dialer by far. All standard tones, extra tones, blue tones, international rings busy codes and dialtones, plus red tones just for good measure. Seriously, everything I could ever want, the only DTMF I need.', 'Awesome app with everything a person (especially a person with an interest in phone systems) could need. The only thing that could be added is a DTMF decoder, but still, this app is stellar.', 'Works great....needed 16 button for some ham radio projects that my Motorola radios dont generate..', 'Update: with the new update, everything is perfect! this is the best DTMF dialer available for Android now! thanks guys for your hard work!', 'Continuous tone supported. Everything works as expected. Great App.', 'Great app works flawlessly and love the design :-)', 'Great. Does what I need when I am using my Google come to place speaker calls.', 'Like that you can use long tones. Thanks for the app guys!', "another junk tone dialer that does not work at all. Here's my 1 cents worth!!", 'An accurate tool and wprks very well. Thank you.', 'not dialing the destination. hear tones but no response further. Thanks for feedback.', 'Best DTMF tone app in the world!', 'it works but crashes a lot', 'Good for phreaking.', 'Brings me back.', "This app is pretty much perfect as it is, generating the full spectrum of DTMF codes and some extras too!  One thing I'd love to see is a DTMF decoder that turns tones into numbers, but it certainly doesn't feel like its missing it.", 'Needed a DTMF tone generator that could generate ABCD for transmitting commands to my repeater controller over the air, works great! Having all the box tones in there too is really cool although i think none of that stuff has worked for a couple decades now...', 'For those who know what some parts of this are and what they did, this app is a well made and fully functional, as well as a wonderful reminder of where the phone system has come from. Nice work!', 'This app really works, and it works smoothly, helped me in so many dtmf based projects.', 'It crashes often under 7.0 Android.  Keypad is missing Q and Z.', 'Great interface and good contact integration. Looks good and has some fun features to play around with!', 'How do you choose a phone number when a contact has more than 1 number', "Didn't work at all for what I needed it to do.", 'Very cool. Wish these tone generators could still be utilized like when I was a kid :-(', 'Doesnt work', 'Android 7 pixel xl', 'Nice App! Its really useful.', 'So much awesome.', 'I could not access my contacts, it kept giving me errors.', 'Good app, does what it says on the box without ads.', 'Perfect just as it is!', 'Win', 'yaas', 'Very nice', 'Max W.Chips would have loved this...', 'This is really great for testing decoders.  Thanks!'], 'appId': 'com.bytestemplar.tonedef', 'url': 'https://play.google.com/store/apps/details?id=com.bytestemplar.tonedef&hl=en&gl=us'}
