{'title': 'Cache Cleaner', 'description': 'An ad-free open source tool for cache cleaning which does not require rooted device.\r\n\r\nYou do not need this app anymore if you are on Android 6.0 or newer. Just go to Settings -> Storage & USB-> Internal/External storage and click on Cached data in order to clear all the cache.\r\n\r\nDue to limitations in Android 6.0 and newer, Cache Cleaner is not able to clean internal cache on Android 6.0 and newer. However, cleaning of external cache should work properly on all versions of Android.', 'descriptionHTML': 'An ad-free open source tool for cache cleaning which does not require rooted device.<br><br>You do not need this app anymore if you are on Android 6.0 or newer. Just go to Settings -&gt; Storage &amp; USB-&gt; Internal/External storage and click on Cached data in order to clear all the cache.<br><br>Due to limitations in Android 6.0 and newer, Cache Cleaner is not able to clean internal cache on Android 6.0 and newer. However, cleaning of external cache should work properly on all versions of Android.', 'summary': 'Just a cache cleaner. No adds, no root required.', 'summaryHTML': 'Just a cache cleaner. No adds, no root required.', 'installs': '500,000+', 'minInstalls': 500000, 'score': 3.821839, 'ratings': 5281, 'reviews': 2472, 'histogram': [1153, 171, 333, 424, 3196], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.0M', 'androidVersion': '2.3', 'androidVersionText': '2.3 and up', 'developer': 'Frozen Developers', 'developerId': 'Frozen+Developers', 'developerEmail': 'frozendevs@frozendevs.com', 'developerWebsite': 'https://github.com/Frozen-Developers', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8630351315364626285', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/-mSMTuEcE07rfGUiUyuBBL38hqTVL0uTZKgvllgVQbC-goQVwdZZuduPNDXhWxrrhXM', 'headerImage': 'https://lh3.googleusercontent.com/hFi_7nPK20iEWUeAcT0aiNyFmMNDrBvTP4FrcwaqY4_s0asWyM4HygaxnhUIYD8s6Rk', 'screenshots': ['https://lh3.googleusercontent.com/CwuORv1frpxtW-OC0-ghYzEL8vosnDxSKwDQyALcg3f9DqW5pbMF0A6hvk-GaVi_NA', 'https://lh3.googleusercontent.com/z6zMqYaRpd3qPD_WXAUUaEYwC8qh81LYAiX44__5OuiENBg5adrTCRyFC0UY-1tUuVU', 'https://lh3.googleusercontent.com/8SrULSSVFiD0gPzDVvBf2y9nRbP-YteOLPRwjeqv0sa5RE1jJ6_DUMvLOKekXuxmgA', 'https://lh3.googleusercontent.com/5PKF9hKwYPZYAm2YFBXoth5serdZoAUxA7U6GKT7OYsgqtvpk9ZNjEo8Rc7IssVn4D69', 'https://lh3.googleusercontent.com/knTk6Au6M7-Nz9vL-hxPpUhqSKpRIoHOGAYCFN1a5dhJoi0OHB7VBr_c89I6KT34ZG_8', 'https://lh3.googleusercontent.com/cVwc7jlVxREJqXdirlAxn7nWfe8YOq1TEa9aM0MgKJIIP61vYaQFwh2uh8VC3u56USU', 'https://lh3.googleusercontent.com/Gkz0xabI3F08OVihgzuNoT2wSQEAZNcGFBbnYBWz2L_XSz9q7HS6yEgCO5OIAud9cOg', 'https://lh3.googleusercontent.com/X___uudhrpWKa2ly3DU5gCjkYt_cIZ7nDRnHVYH4X_u7q0yvrj94vLqCYYaIz-GiLgQr', 'https://lh3.googleusercontent.com/ooyUe2-3snbxXOFMWr372A208f_pff0kesHeEch-s3EoiHKtfLwR2MZhnBJz7VuTc90'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 20, 2013', 'updated': 1461531687, 'version': '2.2.3', 'recentChanges': 'v2.2.3:\r\n- Fix crashes on Lollipop', 'recentChangesHTML': 'v2.2.3:<br>- Fix crashes on Lollipop', 'comments': ['Its my Android 4.2.2 and this app after all having a small size and ad free, cleans my whole cache memory and relive my phone. Each time whenever I used it, it proved satisfying to me', "If you're looking for a cache cleaner, this one is the best and without ads... but it will not satisfy you... if you're a placebo effect lovers.", 'Easy to clean itself automatically. FANTASTIC APP. However, the team developers did not update latest version. 🤔😯', "Tells me there's no cache right after installing, when I know theres apps with cache and I double checked. Indeed this app will tell you theres no cache when there is.", "It didn't clean almost anything. After the cleaning, I checked some apps in Settings-Apps and found more than 300 Mb of cache.", "I really loved the simplicity of the app and gave it a 5-star rating after the first cleanup. Then I saw the rest of the comments and I have to say that it didn't clean the cache after all (went via Storage to check for each individually). It's nice if you want an overview of how much an app is storing, but that's about it.", 'Does exactly what is says it does. No ads, and straight to the point. Would recommend!', 'When I seen the no ads, and size of the app, I was really happy. But this app kept saying after I scanned that I have no cache. I went into apps individually and found I had tons of cache to be cleaned. Deleted app, and have gone back to cleaning individual apps until I find something worthwhile.', "20* no need to open the app again because it's set and done and it tells you . cache cleaned . 20* great tool", 'Not Working for me , nothing shows only an empty screen.', 'It failed to clear my cache from my Apps I had to clean my cache manually at settings😭', 'says no cache when I know there is. Please fix for google pixel xl. I tested on my fire hdx 4th gen tablet and it works perfectly. I am guessing the way the new phones are with no cache partition is reason this app fails to work. I wonder if it forced obsoletion.', "Discovered it on F-Droid. I've been using it for Android 4.4, now found it on Google Store and using it on my BB Aurora. Cleans your device cache in a couple of clicks without ads. Small footprint, too.", 'I am very satisfied with this app, it is really cleaning cache from storage. Android 8.1', 'Did nothing and only popped up with a message saying my cache was clean in under one second. Must be out of date.', "Always says there's nothing in my cache when i know there is. Even gave it a few days to see if it would notice my junk. Still nothing. Can't even really use it as long as it keeps saying that. Uninstalled.", "The problem is that it doesn't recognize the cache. It shows cache empty but apps do have cache considerably big. I tried it on Android 8.1.1.", 'what am i missing ? After install i hit the install button and it opened and said cash cleaned. what? all apps, not possible. Then it froze on myV 20.', 'finaly my search is end , love this apk, its really work and dont show the fake cache report , its show only the original cache report that matched by the app cache report and also geniunly clean the cache , sorry for bad english.', 'Sometimes some residual caches of some apps are left uncleaned. But otherwise works very good. Keep it up. Very simple & easy to use.', "Somehow this app is surprisingly fast, simply just tap then all the cache cleaned, amazing app so far, also with no ads. (Btw, I'm using GOME K1)", 'Does not work in Android 8.1 Used it for 4 yrs in my older phone but now useless.', "Simple, small and clean.. very effective! I found app what i want good job devs.. This app deserves 5 stars. 😘 Advice: Don't add other features like clean master add and ruining their application day by day..", "this app is garbage, don't waste your time. I thought the bad reviews were from users who are not using the app properly, unfortunately like many others with the same complaint , it says cache is empty and it is not.", "Doesn't clean cache. Old app. Maybe works in the past for lollipop or kitkat.", "NOT WORKING 😠 It scanned my 152 app and select some app that has some cache file, ok well. but after cleaning cache by this app and checking a app then..... it has no changes. It doesn't work. Waste my time 😑", 'Froze the first time it deleted the cache and now lies when I scan, saying I have "no cache detected" when I definitely do..', 'Best Cache Cleaner app. It does what it says. Simple app, no gimmicks, light and useful. If you clear cache frequently, this app is highly recommended.', "Installed, opened and it could no cache to clear. AppMgr showed 256 MB to be cleared. Doesn't work on Oreo I guess.", 'Free, no ads, tiny & fast. Must have in old phone with little ram.', "Didn't clear anything on my Galaxy s7 running Oreo 8.0. Maybe it worked on older systems, but not on the above.", 'It works, no over bloated software, cleaned my cache quick and easy.', 'It really doesnt recognizes the cache. After the install it said there is no cache to clean, but when I checked an app it showed me it had 18mb of cach. Dont bother installing it!', 'After running this app I checked and it did NOT clear any cache, still have to clear each item one at a time. Not only am I uninstalling I am also recommending that no one wastes their time with This.', "I'm confused does the automaticly clean cache on app start up mean on start up of your apple it any other app I start does it clean that one?", "doesn't work, but it gives U a message that it cleaned all, i checked and ny apps were still cached. my phone is cheap so maybe why", 'Nice, just scans all apps for cache size, lists them by size, and takes me to the Apps list to let me clear them manually.', 'Small efficient and no adds nor constant Internet access. Thank you!', 'Bot sure about any1 else who have installed this app. but this cleaner took over 5 mins to clean 10 MBS. of cache files from my android😨 im uninstalling & dwnlding another app.👍', "its low size tool app,and its easy to use thanks Cache Cleaner, i'd just cleared 400mb cache in just a second haha ,i realy love your app💖"], 'appId': 'com.frozendevs.cache.cleaner', 'url': 'https://play.google.com/store/apps/details?id=com.frozendevs.cache.cleaner&hl=en&gl=us'}
