{'title': 'Periodic Table', 'description': "An ad-free, open source, holo styled interactive periodic table with list of element properties and list of isotopes based on Wikipedia's database.", 'descriptionHTML': 'An ad-free, open source, holo styled interactive periodic table with list of element properties and list of isotopes based on Wikipedia&#39;s database.', 'summary': 'Ad-free periodic table with list of isotopes.', 'summaryHTML': 'Ad-free periodic table with list of isotopes.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.49, 'ratings': 298, 'reviews': 67, 'histogram': [8, 5, 20, 56, 205], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.2M', 'androidVersion': '2.3', 'androidVersionText': '2.3 and up', 'developer': 'Frozen Developers', 'developerId': 'Frozen+Developers', 'developerEmail': 'frozendevs@frozendevs.com', 'developerWebsite': 'https://github.com/Frozen-Developers', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8630351315364626285', 'genre': 'Education', 'genreId': 'EDUCATION', 'icon': 'https://lh3.googleusercontent.com/yOInqNERkaEEuXKMZ6w2Sj5Yir-vG06nWkuXpzmghV6YgUVMb2tEYqGOeB-9J-vfNBI', 'headerImage': 'https://lh3.googleusercontent.com/FhrXmYDpug7azzy3q1ok2VszqPWJqDVOshxBtJd2wg2DTZYUL-GHnvMZmtthsKcT5Q', 'screenshots': ['https://lh3.googleusercontent.com/s6b_lVc5fQ08AMNPTAq64P29iVP5shy7YeJYpseMDJuyzTHLPWIJnXISOgMwknJuFA', 'https://lh3.googleusercontent.com/tugab2GBYnt8AHqz9I5ufza6ezBM0x8H-8ih3dsye9Q2q9_wk0QRsaD1WdO6JXXY_PEg', 'https://lh3.googleusercontent.com/BZBOKMSJ8s6o1YxRqqDH1-22iPJ-S6r_rW5yG_iUefaDyoatzbrZrwPGm0y0uvO5Rw', 'https://lh3.googleusercontent.com/ygrnVeCV8yYmQ71NWdG1qKqZe-o2Dd1HvNxv9-WPWSoUO8JZ8zsu1LVEK0Sh-mEwRRo', 'https://lh3.googleusercontent.com/v9Q6eTiS1RW-Cj_0fA05iGRHYHP8X9h6hPDVdk9bjdtuI1P2R2_qaCPeR-797zNY-z4'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 13, 2014', 'updated': 1415981136, 'version': '1.1.1', 'recentChanges': 'v1.1.1:\r\n- Update database\r\n- Security and stability bug fixes\r\n- Add support for RTL languages\r\n- Add support for Android 5.0', 'recentChangesHTML': 'v1.1.1:<br>- Update database<br>- Security and stability bug fixes<br>- Add support for RTL languages<br>- Add support for Android 5.0', 'comments': ["Free. No permissions. Can't list alphabetically. But can search by name or symbol.", 'Best free app of its kind. Has element information with links to the web for updated info. Also isotope information.', 'Great app. Simple and useful', "I would never be able to know about this app if my teacher wasn't suggested me. Just today morning my teacher told us about it and now I downloading it.Hope for the best...", 'This app help me too much', 'I\'m not a professional chemist and dont know if the information provided by the app is complete and accurate.  I\'m just assuming it is.  Here\'s my reaction to the program.  Pros:   Simple, clean, easy to use user interface.   Much information provided.   No ads.   No permissions required.   No distracting eye candy.   Small memory footprint.   Open source - presumably spyware free.  Cons:   It has crashed on me, but nothing bad happens if it does.  It just restarts.  Hopefully, someone will find the bug.  Suggestions:   It would be nice to have links to a definition of each chemical data type ("sublimation point", "triple point", "heat of vaporization", etc.)   "Unknown" is reported when there is no data.  It would be nice to divide that into true unknowns (i.e., yet to be discovered), "not applicable for this element", and maybe "does not exist for this element." - Or maybe those last two are the same.', "I really appreciate this dev's attention to detail on this app. It does exactly what it says and requires no permissions at all. This dev doesn't have many apps to his name, but they are all very simple and effective. Great job and keep up the great work!", 'Perfect app but there are some errors helium lies in p block according to picture but S block is also correct since outermost shell has 2 electrons so it may lie in S block', 'Please put the symbol of the elements instead and make them large, bolded. Thank you.', "Can't beat the easy access to isotopes and their half-life.", "Would be perfect if it stated the uses of each element for those of us that don't know that", 'Update your info fellas! All elements thru 118 are named now!', 'The 117 element is tennessine not us', 'Listing stable and unstable isotopes is good feature.', 'Must have to view different elements at a glance with usual parameters.', 'Good app with correct isotopic information i used it for isotopic data of elements', 'Fine but not good', 'Better than other apps for periodic table... Liked it..', 'This app is very usefull app for student', 'Better than any other', 'Perfect and a nice user interface', 'Simply the best periodic table', 'Nice app for periodic table', 'Best', 'Light weight!', 'Go for this is an excellent app', 'Very good.', 'Love this app', 'So nice', 'Good', 'Nice', 'Useful', 'Good', 'good', 'Good', "I have paid for apps but none have been like this, great design, very fast, can zoom into table or view it as whole, can seach for elements(v.fast), gives heaps for useful information for any level of experience and it's adfree and doesn't cost anything. Devs for this app are legends, for whom i shall forever be grateful", "The holofied theme makes this look clean and built in into the system unlike other similar apps that are cluttered and old fashioned. Just add a legend in the table and it'll be golden.", 'This app helped me study for a test', 'this is tight', 'Excellent! Simple, fast, uncluttered, easy to navigate. Searchable list of elements, zoomable table view, lots of data and wikipedia links for more.'], 'appId': 'com.frozendevs.periodictable', 'url': 'https://play.google.com/store/apps/details?id=com.frozendevs.periodictable&hl=en&gl=us'}
