{'title': 'Night Screen', 'description': '「Night Screen」is a Material Design Application which can protect your eyes from being hurt by screen, creating a mask at the top of screen in order to make screen darker. We can solve the problem that the lowest brightness is not low enough in some devices.\r\n(PS: Even though you are using our application to make screen darker, you should reduce the time watching screen in a dark environment.)\r\n\r\n( Enable permission in Android 6.0: "Settings" app - "Apps" - The gear icon - "Draw over other apps" - "Night Screen" - Then enable it )\r\n\r\nOtherwise, this application is open source under GNU GPL v3 License.\r\nGithub Repo: https://github.com/fython/Blackbulb', 'descriptionHTML': '「Night Screen」is a Material Design Application which can protect your eyes from being hurt by screen, creating a mask at the top of screen in order to make screen darker. We can solve the problem that the lowest brightness is not low enough in some devices.<br>(PS: Even though you are using our application to make screen darker, you should reduce the time watching screen in a dark environment.)<br><br>( Enable permission in Android 6.0: &quot;Settings&quot; app - &quot;Apps&quot; - The gear icon - &quot;Draw over other apps&quot; - &quot;Night Screen&quot; - Then enable it )<br><br>Otherwise, this application is open source under GNU GPL v3 License.<br>Github Repo: https://github.com/fython/Blackbulb', 'summary': 'Protect your eyes from being hurt by screen at night', 'summaryHTML': 'Protect your eyes from being hurt by screen at night', 'installs': '500,000+', 'minInstalls': 500000, 'score': 4.2637954, 'ratings': 7469, 'reviews': 2895, 'histogram': [824, 190, 361, 904, 5187], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '301k', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Paper Airplane Dev Team', 'developerId': '5783913542139019388', 'developerEmail': 'fythonx@gmail.com', 'developerWebsite': 'https://feng.moe', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5783913542139019388', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/RYeHBiZykol4rICHnc0Ep9_GhGS2djNJLuUBEHRCRFxYhHAUfYNN92wHEIZhhe5ZrzJb', 'headerImage': 'https://lh3.googleusercontent.com/pUREuq30G9pBB5oMK5h5HG6xHdYvZ22W5fMb9SNYInYJfw81LC6Cr3JjptbYtzfRhHE', 'screenshots': ['https://lh3.googleusercontent.com/2W2QLmgDxDjCTUKEVLoEvS4fK3YOMihkPWSoIp2MkZpD-iVEbCLyx-OEUm5QNDF_XA', 'https://lh3.googleusercontent.com/mCwvKx7wj3MFUzq2oPU6Qf23oWWzmH0qkghyvXpanaS1xGkp_sxFLtfJ_UC5epv3DuA', 'https://lh3.googleusercontent.com/cvyb3MH-i3lOQix34x-yqsTuaTdXkDP5b05-TLhkTLipj5MRYeY-JImQ6GFt_m_N10Ci', 'https://lh3.googleusercontent.com/Po7vnHkQPflWlYZYQfIOLwLGcwD7KU3pXK9INIX6mIHkF7f0yYIrZvt98QKNwtKPpfET', 'https://lh3.googleusercontent.com/ItplAQWl-ldWBLTOL7zCvcEGvRSO0zTzzND6O-7az6jw9UfDrPL6ktUxGzjS0nplh04'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Feb 1, 2016', 'updated': 1550334446, 'version': '2.2.0', 'recentChanges': '- Update French/Turkish/Polish translation & Improve English translation\r\n- Update UI\r\n- Add more options\r\n- Add open source licenses\r\n- Fix foreground service permission in Android 9\r\n\r\nWelcome to discuss & feedback in our telegram group~ (You can find link in more settings)', 'recentChangesHTML': '- Update French/Turkish/Polish translation &amp; Improve English translation<br>- Update UI<br>- Add more options<br>- Add open source licenses<br>- Fix foreground service permission in Android 9<br><br>Welcome to discuss &amp; feedback in our telegram group~ (You can find link in more settings)', 'comments': ["Love the sleek UI and icons. Unfortunately, it's a bit tedious to have to use a home screen shortcut to toggle it or open up the app to modify the amount of dimming. The auto mode has never worked for me. The biggest let down for me, however, is that it does not affect the notification shade or lock screen.", 'Good app except I have an LGM322 and it has a very customized ROM and OS. Any chance you can get it to request android.permissions.WRITE_SECURE_SETTINGS to get the status bar and settings and whatnot to be as dark as possible? Thanks', "Great app, except it doesn't have an off switch. You have to open apps, find the program, and manually force stop it to turn it off. That's a bit obnoxious. Otherwise, it does exactly as I need and gets my screen nice and dark.", 'Awesome app, thank you for your work. Perhaps add an intent for on and off instead of just one for toggle. This would make it easier to integrate into tasker and other uses.', "It did not work for the first few seconds, apparently because it has not been given the permission to draw over other apps. Then it took me to that permission screen, and it started working as it should. Tiny download, no ads, just perfect. I'd give it 6 stars if I could.", "Great app. Works a charm. Only thing is I can't quit the app unless I go into app settings and force stop it.", 'Nice app, but (correct me if I were wrong) based on the description it does NOT filter the harmful blue light... Only puts a filter on the screen, so your brain would still remain awake at night.', "If the app's automatic timer mode worked, it would be perfect. The interface is great and simple, and looks perfect with any UI version. Unfortunately on Oreo, even with battery optimaztions disabled, it still doesn't enable or disable automatically.", 'It works like a charm. Everything is within reach and settings are quick, controlling brightness and "yellowness" is as essy as one can think of. Simple yet very useful utility for all my devices.', "It does what it says and what it's supposed to do. Any rating bellow 5 stars shows that people don't know what they're looking for. Minimalistic toggle widget is also execellently designed.", "I have been using this for my LG V20 for almost 2 years and I no longer have the dreaded ghosting effect thats prevalent in this smart phone, but not only that its uses very little resources so it won't eat the battery as much.", 'A great app with a simple ui, not complicated to understand and easy to use. The only down side is that sometimes when I activate it my screen starts to flicker...', "Dimming function works. Widget to turn on and off from phones widget bar doesn't work. You have to turn on and off the icon until it does what you want. I will change my rating to 5 if that was fixed", "I'd love to thank to you for this app. it's so simple. it's literally easier my life. thank you so much.", 'Excellent. Very small & simple as should be, no ads, light on permissions, open source (at time of review). Works great, love it.', "Love it. So simple and ad free. Works great too. Only way to get my screen dim enough so it doesn't keep me up at night or blind me.", 'Soft app and useful. Android system should already has the function of night screen, the minimum light of my screen is still too strong. Do not reduces your battery consume to IPS screens, because just makes more black the pixels.', 'Works great, opens fast, no intrusive ads, easy to use, multiple options, attractive UI. I downloaded 10 dimmer apps for trial and this one was the winner =)', 'Excellent job. It needs a few improvements like over the notification bar and while switching apps the screen becomes bright again transiently.', "I've been using this app for 5 years and it's my ride or die but sometimes at night when I'm reading it glitches and BAM my eyes are blinded bc the light is back to being bright.", "The timer mode isn't work properly, please fix it", 'The best screen filter-dimmer! Nice UI that blends nice with the rest of android, minimalistic, ad free and pretty much all you need', "Great app, would be perfect if it had a widget that would enable the user's settings with a tap.", 'Totally love it. It does just what is says on the tin and at such a small size it is easy to use.', 'Works perfectly. Simple and easy to use.', 'Works perfectly for Samsung S8, comes without ads, and with a simple UI that includes a dark theme.', 'Best of the best, tiny size, superb function', "I can't turn it on.. I click on the left top, but my notifications are still on light mode. Did I configure something wrong? I am pretty sure the dark mode configuration is on.", 'Works well (Oreo), non-intrusive, easy to toggle. What I needed.', 'Simple, effective, up to date and ad free. Easy 5 stars.', 'For size and features without ads✔️', 'Good App....it has the button in my notification panel for quick use along with flashlight and other buttons', "works fine but doesn't dim the notification panel.. fix if possible", 'Does exactly what it says. No ads. very easy to use', 'Great but needs simple on/off button..', "Awesome app that does what it's supposed to do perfectly", 'very useful app to protect our eyes from LED screen.', 'Great App With Very Little Size ony 200kb Great Work Done by this app since last 4 years', 'Great application for the ones who are at their phone without anyone knowing that they are', 'seems to make my V20 screen recover from ghost imaging'], 'appId': 'info.papdt.blackblub', 'url': 'https://play.google.com/store/apps/details?id=info.papdt.blackblub&hl=en&gl=us'}
