{'title': "Tap'n'Turn", 'description': 'Tired of enabling the screen rotation everytime you want landscape mode? Automatic rotation always rotates the screen in the wrong moment? Then this App is for you!\r\n\r\nInstead of rotating the screen right away, it displays an icon which allows you explicitly adjust the orientation.\r\n\r\n**Important**: To use the app, please start it up and follow the directions on the screen. It works best, with the Android setting "Auto-Rotation enabled". Tap\'n\'Turn will take over the control of your auto rotation instead.\r\n\r\nThis is an Open Source app, the official homepage is here: https://gabm.github.io/TapAndTurn/\r\n\r\nIf you find bugs, please report them here: https://github.com/gabm/TapAndTurn/issues', 'descriptionHTML': 'Tired of enabling the screen rotation everytime you want landscape mode? Automatic rotation always rotates the screen in the wrong moment? Then this App is for you!<br><br>Instead of rotating the screen right away, it displays an icon which allows you explicitly adjust the orientation.<br><br>**Important**: To use the app, please start it up and follow the directions on the screen. It works best, with the Android setting &quot;Auto-Rotation enabled&quot;. Tap&#39;n&#39;Turn will take over the control of your auto rotation instead.<br><br>This is an Open Source app, the official homepage is here: https://gabm.github.io/TapAndTurn/<br><br>If you find bugs, please report them here: https://github.com/gabm/TapAndTurn/issues', 'summary': 'A simple App to help with auto-rotation', 'summaryHTML': 'A simple App to help with auto-rotation', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.75, 'ratings': 117, 'reviews': 78, 'histogram': [21, 3, 18, 14, 59], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.8M', 'androidVersion': '4.2', 'androidVersionText': '4.2 and up', 'developer': 'gabm Apps', 'developerId': 'gabm+Apps', 'developerEmail': 'gabmtuc@gmail.com', 'developerWebsite': 'https://gabm.github.io/TapAndTurn/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '4803748896434386482', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/oi3bJ_Z3lVPc2qlEqe-6Bv7_aSj5Zyj2wd3uBAp53LCC-a95dNenEYsKPXpEAYtVYQ', 'headerImage': 'https://lh3.googleusercontent.com/ppTNvZ7R74SAk_ojhGpZzwn5Tgd-ywPg5T7HM6cjg_QKrBgBbmBp2Nk4djZf5TNA4DM', 'screenshots': ['https://lh3.googleusercontent.com/pgczcrs74deOLf881-lQ2a_yinO7e2mDMBmG22vdvrvmRaeizrMahUmWWOtMjeTEjqo', 'https://lh3.googleusercontent.com/X1U1d1w3QR5L1ReG1di5GoxwreZnDu5nX3M4o1u4v49VYI8iBrzqZGCwROCP85_sCTQ', 'https://lh3.googleusercontent.com/PTxkWz9CwlGpQfqBQWAlduuUsMGNRSIwbo49ou-SzpNoAiLU4hgRX2CcTGchCc7lPyw'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'May 30, 2017', 'updated': 1504507162, 'version': '2.8.0', 'recentChanges': '- added color customization\r\n- auto return to default orientation\r\n- auto reactivate when permission is back', 'recentChangesHTML': '- added color customization<br>- auto return to default orientation<br>- auto reactivate when permission is back', 'comments': ["Not working fine. It's laggy in performance... After system boot it's not wake up automatically, sometimes it wake automatically but it's not hiding the bubble from screen. It shows the bubble continuously after system boot sometimes. No option to select some apps work in default orientation. While this app ON the landscape games also locked with portrait then we need select to landscape but here the game screen stretches from vertical screen to horizontal. that looks lstreching a 9:16 to wide.", 'Actually: i want to love it, but it is totally unreliable. Despite Battery exclusion & Permanent notification, the service consistently dies and cannot be resurrected without launching the app. very broken and apparently ABANDONED 2018 ••• i love it. thank you!', 'It worked great...when it actually worked. It kept turning itself off, rendering it useless. I uninstalled it after having it only a few hours.', "Android 9, Oneplus 6. Works, stops, restart, works briefly. This is only 1 of 2 apps with the approval for each turn. I used Adaptive Rotation for years. It's no longer on Play store. Transferring it with APK does not work with Pie. ..", "Perfect!!! Thank you for this!! I was so sick of it rotating when I didn't want it to!! This lets me choose to rotate so quickly and easily, without changing settings!!!", 'Great app. Please keep it free. Please add option to have de button in center-center, center-left, right-center, etc. (all five positions). Thank you.', 'Works great, i have this feature on my s10 and i Now have it on my older devices thanks to this app', 'I wanted to use this with gesture mode on my OnePlus because the Android one only works with three-button setup. However, despite service running, the icon seldom shows and I cannot really use this.', "great idea but very buggy. once you use the rotation arrow the app has a mind of its own and rotates randomly. pity as this is close to exactly what I've always wanted", 'Works beautifully immediately when launched, but stops within minutes. Service is enabled config is correct.', 'Does not work in oppo color os, when you turn the device it displays the icon but when you tap the icon nothing happen, i tried changing the setting and stuff but the problem is the app not the settings', "The only app I ever actively looked to donate to / buy pro version of. Downgraded to Android 8 from Android 10 and now I'm happy again.", 'it seems to be the only app that does exactly what I want. Unfortunately, since upgrading to pie, it never runs', "I liked it. Just one thing, please allow a custom button posisition. It's too far away to reach", "Doesn't work on pie. Keeps getting killed despite exclusion from battery optimization", "Great app but doesn't stay active after a few minutes", "doesn't work anymore on pie. service keeps being killed despite putting it on whitelist", 'Subtle but effective solution to unexpected screen rotation', 'This app is a must and should be standard by Google I love the button option. .', "Ain't working. I already gave permission yet it keeps on turning off everytime", 'Please leave icon in same place and add vibration option.', "Doesn't work with android 10", 'garbage again the same problems that the others have 1 - 0 Stars 🌟😠😠😠😠😠😐😐😐😕😕😕😕😒😒😒😒😒😒😒😒😒', 'It works on Oreo!', 'What a useless piece of trash', "Working here on lollipop. If it fixes the functionality lost with adaptive rotation lock broken on nougat, I'll be very happy. Please add opacity control and the ability to center the icon on the screen--the center can usually be reached with the same hand holding a tablet when reading in bed, but the corner depends on which side you're on. Allowing the screen to reverse could also be useful.", "Works as advertised, does what it says it does, but comes with a major flaw - it overrides all screen orientation, not just auto-rotate. Does a great job of preventing the screen from rotating while I'm laying on my back reading, but when I launch a game or app that requires a particular rotation, it prevents it from rotating. Several of my apps either crash or cannot be used, and for some of them rotating the screen after they load does not fix them. End result is the app ends up causing more problems than it fixes.  If you want to always control screen orientation, no matter what, this app will do it. But if you want to rein in an overly sensitive auto-rotate, then give it a pass, because it will break any app that requires a particular orientation.", "THIS WILL MAKE YOUR LIFE EASIER! You won't have to change rotation in the notification bar anymore. Love it.  Used to use Adaptive Rotation Lock, but it hasn't been updated in years and does not work with Pixel 2 XL, this app does the same thing but works better, plus the screen overlay is in the top corner, making it much easier to use.", 'This is a must have app! It tames unintentional screen rotation by presenting an icon to confirm. Seriously great!', 'Buggy and randomly turns itself info at random. Difficult to use, should be able to turn on landscape without rotating the phone...', 'Giving 4 stars. A notification shortcut tile for turning on/off service would v perfect and make worthy of 5 stars.', 'Can you add a whitelist feature for games', 'Nice app with no ads. i hope there is a x-y custom location on next update.', 'This does exactly what it says on the tin. Great little app!', 'Not working on One UI...', "it's great but it should ovelay the keyboard, which it doesen't.", 'too inconsistent', 'Absolutely brilliant', 'Does what it says.  Feature Suggestion: Allow the user to choose whether the arrow is on the top or bottom of screen.', "A very handy implementation of this absolutely essential ability. Sometimes it stops working for no reason, and then I have to deactivate and reactivate it to get things going again, but this is really the only inconvenience I've come across."], 'appId': 'com.gabm.tapandturn', 'url': 'https://play.google.com/store/apps/details?id=com.gabm.tapandturn&hl=en&gl=us'}
