{'title': 'APRSdroid - APRS Client', 'description': 'APRSdroid is an APRS application for Amateur Radio (HAM) operators. It allows reporting your position as well as sending and receiving messages. It also conveniently displays nearby stations as a list or on a map.\r\n\r\nFeel free to contact the author via e-mail with any issues you might encounter. If you are not satisfied, you will get a refund, no questions asked. As there is no way to reply to Play user reviews or to see who wrote them, please use e-mail!\r\n\r\nTo make full use of APRSdroid, you will need an APRS-IS passcode for your callsign. You can request one in advance at http://aprsdroid.org/passcode/\r\n\r\nAPRSdroid is Open Source Software written in Scala and licensed under the GPLv2.\r\n\r\nThe APRSdroid features are:\r\n * See what is going on on APRS with the Hub View or on the map\r\n * One-time or periodic position reporting to APRS\r\n * APRS Messaging support\r\n * Get detailed information about a station\r\n * Follow the movement of a station on the map\r\n * Support for GPS and network location\r\n * Bi-directional APRS-IS support via TCP and AFSK\r\n * Unidirectional position reporting via UDP and HTTP\r\n * Bluetooth TNC support (beta quality)\r\n * Status Bar notification when running and for incoming messages\r\n * AFSK decoding via microphone\r\n * Smart beaconing\r\n\r\nThe following features are planned for the next months:\r\n * Position reporting profiles\r\n * Tablet UI\r\n * USB serial support\r\n\r\nAPRSdroid requires some permissions on Android: http://aprsdroid.org/permissions/', 'descriptionHTML': 'APRSdroid is an APRS application for Amateur Radio (HAM) operators. It allows reporting your position as well as sending and receiving messages. It also conveniently displays nearby stations as a list or on a map.<br><br>Feel free to contact the author via e-mail with any issues you might encounter. If you are not satisfied, you will get a refund, no questions asked. As there is no way to reply to Play user reviews or to see who wrote them, please use e-mail!<br><br>To make full use of APRSdroid, you will need an APRS-IS passcode for your callsign. You can request one in advance at http://aprsdroid.org/passcode/<br><br>APRSdroid is Open Source Software written in Scala and licensed under the GPLv2.<br><br>The APRSdroid features are:<br> * See what is going on on APRS with the Hub View or on the map<br> * One-time or periodic position reporting to APRS<br> * APRS Messaging support<br> * Get detailed information about a station<br> * Follow the movement of a station on the map<br> * Support for GPS and network location<br> * Bi-directional APRS-IS support via TCP and AFSK<br> * Unidirectional position reporting via UDP and HTTP<br> * Bluetooth TNC support (beta quality)<br> * Status Bar notification when running and for incoming messages<br> * AFSK decoding via microphone<br> * Smart beaconing<br><br>The following features are planned for the next months:<br> * Position reporting profiles<br> * Tablet UI<br> * USB serial support<br><br>APRSdroid requires some permissions on Android: http://aprsdroid.org/permissions/', 'summary': 'Amateur Radio app for APRS: Track friends, exchange messages, get tactical info.', 'summaryHTML': 'Amateur Radio app for APRS: Track friends, exchange messages, get tactical info.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.04717, 'ratings': 1315, 'reviews': 781, 'histogram': [459, 124, 111, 136, 483], 'price': 4.95, 'free': False, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.4M', 'androidVersion': '2.2', 'androidVersionText': '2.2 and up', 'developer': 'Georg Lukas', 'developerId': 'Georg+Lukas', 'developerEmail': 'georg@aprsdroid.org', 'developerWebsite': 'http://aprsdroid.org/?pc=Market', 'developerAddress': 'Georg Lukas\nAm Sülzehang 12\n39171 Sülzetal\nGERMANY', 'privacyPolicy': 'https://aprsdroid.org/permissions/', 'developerInternalID': '5958986981049215499', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/EFJg63fqfDwPBHM3dy3YRlc3os-dqi944NORzDpDxuyUTRQ1ND23kfe5-CV_pZUJPRg', 'headerImage': 'https://lh3.googleusercontent.com/fMJ1Hk2sYXtG-Pwgl4eCJZAzLKKRmCkzigLZhijVc5f5Ts9XeDCZVkllvLxxK1BNHH4', 'screenshots': ['https://lh3.googleusercontent.com/TAV4QsMvpSzrsttkmsUEEqrc5B7tjnao_A2eLXUB6EeqB5nAwVj8DgRKcgTTXsNR3g', 'https://lh3.googleusercontent.com/pU-gQz9R__4JA0pi2zNxt-Nq4JADwDxpYHzx0COqswhoVUK9OvHHUz9laevLjLeCgA', 'https://lh3.googleusercontent.com/-XTRi4Ka3i6itXQn4_FfqJsqLM1oAFi2X78ljHTO-FZbCbEgQLaGPd-V_iA_umYr7sc', 'https://lh3.googleusercontent.com/PB4uwVGwKnIeP1_qmkhYHgcXmgeVRjV7nvVwtGDIRtsmpBh0YH-hQIqqpOCzT5vyH6k', 'https://lh3.googleusercontent.com/ZJ9x6HiTeYcMe6nnONdqQXYa94jdL_RvXwpA60pFC6tTiPWBBArqTwaqS2HfPYHBZA', 'https://lh3.googleusercontent.com/8KLEW2d8_fvinFqJInuxjJo352xc-kkLgaS9wdTKPDmgkfKa4tS3v49OOshZj_FM0Q', 'https://lh3.googleusercontent.com/qHA8ph1qZ7sh6j5IRBSqhL9n8OygcPIJ3YWlcNpzRNrX9aUaWx7fwH-7vtAAUuGf1Bo', 'https://lh3.googleusercontent.com/3ArnFAoKXp3lXn0egz2BETjQ8Vb4g_1kb8rX0FdrK3I3N-gYIRAHNjcCSf54r9p7rg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Apr 18, 2011', 'updated': 1541005469, 'version': '1.5.0', 'recentChanges': 'JSON import/export of configuration, new USB code, many fixes', 'recentChangesHTML': 'JSON import/export of configuration, new USB code, many fixes', 'comments': ["The app crashes constantly and is unusable on a Pixel 2 - I've used the app for a long time and it has been fine, so this is a recent issue. If the issue is fixed, I'd give it 5 star rating - when it works, it is great.", "I installed this on an older galaxy s7 edge and it works great. My more modern Galaxy Note 9, not so much. It works, but the map crashes every time I try to use it. No biggie, because I wanted a dedicated device to track stations and send messages and my older phone works just fine. The developer's webpage says they have stopped supporting the app, so don't expect to get a response regarding updates.", "Recently went to use the app since the latest Android update and it no longer worked. Read the reviews on here and saw others with the same problem. Spotted a fix further down that said go to the authors Github page and go in to builds and download the latest apk file and install. Did this and now working, hopefully Google Play Store will be updated so others don't have a problem.", "Tried getting it to work on two different devices, one version 6 and the other with version 8. No dice. Oh well. I've read it works pretty well on an older device with an older version of Android. Maybe I'll track down an older used phone or tablet and try again or blow big bucks for a proper APRS radio.", "The app seems to work well in a desktop, but opening the map in the app crashes the app. It is bothersome to see that the developer is detached from communicating with the contents. If you're working on a fix, please let us know.", 'Works great, just be sure you have an older device. To play it safe I would use something with Android 7, other than that it works as expected, still waiting on my cable, though aprs-is works good.', 'Needs an update. Used to work great. Got a slightly updated phone (Google Pixel XL) and now APRSdroid crashes a lot. I was able to send out a beacon and a message 1 time. Now it seems to be in continual crash mode. Startup warns that this software is for an earlier version of Android and may not work. Last update 2018. Great App, but time for an update fix.', 'App runs great on my Galaxy s10...only complaint is that the app crashes when I try to view a station in the built in map. I have to go on aprs.fi or use OSM to view where the station is. A fix for this would be great!', "I have tried for a few weeks to get my password. I have sent multiple emails and check my spam folder every day. I feel like I wasted $4.95 I'm apparently not the only one having this problem. Google shouldn't allow us to be robbed. Piss poor service I finally got my passcode after a few months of waiting. Sept-Dec Finally got the passcode after multiple emails and months of waiting. I have enjoyed the app, but the wait knocked off 1 star.", "Good app, depending upon your hardware and use. It didn't work for me as there is no option to use a serial TNC over USB. To those of you complaining about a password: the developer does not issue the passwords. There are automatically generated from your callsign. Do a simple web search for 'APRS password' and enter your callsign.", "The comments about waiting forever for a passcode are unfortunately true. Originally I thought it was due to foreign verification of licenses but I have a license from the US FCC and its easily verified based upon my PayPal payment's addresses and emails. I've waited much too long and will seek out an alternative. Sounded like a decent application but the support team is lacking.", "Have always loved the app, but some functions, like the map, don't work with the current Android versions.", "Got a new phone and now with Android 10 the app crashes when I go to the map. It then won't start up anymore but crashes every time I attempt to start it. I know there is only one developer but it would be nice to get a fix. Otherwise the app works great and is the only one of it's quality inn the app store.", 'This version does not work on Android 10. However all you need to do is Google the app and go to the authors GitHub page and telhen download the latest apk and install it. Works fine on my Google Pixel running Android 10.', "Aprs crashed on startup Everytime. And I don't like this link. import SSL certificates. It fixed the problem, but going to delete and post until you fix the problem. Google pixel, most recent upgrade.", 'Worked great for a while on Galaxy S9+, now after an OS update the app just crashes on start. Still works on an old Galaxy S5...', 'I, too, have enjoyed this App for several years. However, like others have said, it now crashes immediately on my Galaxy Note 10+. This all started in November 2019. Hope it gets resolved soon as it has been a great application. 73 de Bob AJ5C', 'Complete garbage if you are using the newest version of Android software on your phone or tablet. Crashes every few minutes. The developer is on hiatus since there have not been any updates in more than a year. This is probably another dead app for aprs. Waste of time and $', "Excellent app. Have used for many years. Recent phone upgrade i discovered the app is not compatible. I'm optimistic there will be an update soon.", 'The app worked well on my old android phone. Since upgrading to a S10 the app crashes frequently plus the map function fails. Please fix the app, I love it!', "No longer functional on Android 10. I used to use this app occasionally about a year ago on an older version of Android, and it was great. Worked perfectly, and at the time I didn't have to wait long at all for a verification code. However, it seems development has dropped off and the app no longer works now that I've moved to a newer device. Tried to use it recently and it does nothing but crash immediately. A shame, it was a good app.", "Unusable on Pixel 3XL Can install and set up my call sign, but after that I can't even open the app, it crashes instantly. Even clearing cache makes no difference", 'I have used this app for years and it works great. It is very dependable and if you just follow the process to get it activated, everything works nicely.  I would recommend two improvements to future versions:  1. If stopped at a location for more than say 10 minutes, the app should suspend broadcasting to save battery on the cell phone.  2. If the app had a "home location" and a target location set, then upon arriving to home, or a targeted destination, then the broadcast should turn off, saving battery time.  These two features would just make a great app that much better!', 'Awesome tool to use the APRS system. I can send text messages and emails from my device tethered to a walkie without use of a cell network...its a nice backup tool to have if the towers go down.', "I have enjoyed using this app immensely. However, as of today (11/12/19), all it does is crash immediately whenever you try to open it. I assume this is either a problem with Android 10 or Google Maps, as the developer has mentioned on the APRSDroid Twitter account. Lack of updating could also be an issue, but I've never had a problem otherwise since February, 2018 when I purchased this.", "A simply brilliant App! Works as advertised. I applied for a passcode before buying/installing the app as recommended and in fewer than 36 hours my passcode was emailed to me on a Sunday morning completely hassle free.  Installation and set-up of the app took five minutes and it worked flawlessly on the first try. It doesn't get any better/easier than that!  Only small hitch was the APRS-SI passcode application form does not work with Microsoft Edge so I had to switch to Chrome. After that, the transaction was flawless .  Nicely done, easy to use, and well worth the small fee to support the developer.  73 and thanks again. EDIT: Tested Tracking - works great, better than using HT.", 'Worked fine until latest Android update. Now it shuts down when I try to access the Map. Will update to 5 stars when fixed since it is useless without being able to see stations on the map.', "I purchased this on 1/28. Today is 2/6 and I STILL do not have a validation code. I sent them a copy of my amateur license, as requested in an email on 1/30. However, $4.95 was taken from my bank account immediately. 10 days and the app still is not fully activated to spot me on aprs.fi. If you purchase the app, don't expect to be able to use it any time soon. I am very unhappy and regret spending money on this.", 'Map function causes the app to crash now. The rest of it seems to work fine.', "This app is perfect, and I was up and reporting within minutes of install. I'm very new to APRS and still within moments,  I was configured and viewing my own location on aprs.fi. I'm looking forward to making full use of APRS, not just location data. I'm all about free apps but for just a few dollars, support the developer because this app is well made.", "Have used this app for years and loved it. Now Android 10 makes it useless Please fix or at least make a statement about the plans to either fix or that Android 10 and up isn't supported.", 'Waiting 4 days so far to be granted permission to use the app I have paid for. I understand the need to verify the status of amateur radio operators wanting to use the program; however, many apps and services that charge nothing seem to manage it in 1-2 days. I will change my rating when I have been given the opportunity to use the app!', "Worked for a week till the Android 10 update happened. Now it won't work at all. Also, passcode generators are available all over the net. You don't have to wait for one to be mailed to you. You do have to wait for an update to use the software. I'm out $5 because of this.", "I've used the app in the past but getting it again on my Samsung J7 I can not get any audio into the decove to decode. it doesn't seem to recognise the mic line as plugged in. No problems with other apps and the mic. worked well on older Android phones. Also have it on RCA tablet but the RCA makes so much RFI it covers the signal at the radio.", "Android 10 on PIxel 3: this app no longer works. It crashes upon opening. Also, I waited maybe 6 weeks to get my APRS-IS id. I was really looking forward to using this app. I wish they would at least update the description to say it's no longer a functioning app.", "Seems to open and close on latest version of Android only partially works on latest Android, shame as it's a good app, but needs updating especially as it's a paid for app?!!", 'developer abandonded this long ago. requests for updated features have not been added. not really useful anymore to be honest.', "Paid for the app, it ran to tell me to register. Signed up for registration, and now the app won't load. Crashes repeatedly.", "Paid for app, then told that I have to request a passcode and wait up to two weeks to use it? I got my code the next day only to discover it's my normal aprs passcode, the same one I use for direwolf. The approval should be real-time since my fcc and passcode info are readily available online. I know of some ways off the top of my head (software guy here) to do it so please contact me so i can help!", 'Sweet and simple. Does what it says. If I could ask for one feature please, Tasker/Locale support so we can change SSID without having to open app. This would be extremely useful for mobile, portable, handheld etc. users.'], 'appId': 'org.aprsdroid.app', 'url': 'https://play.google.com/store/apps/details?id=org.aprsdroid.app&hl=en&gl=us'}
