{'title': 'eduroam CAT', 'description': 'A tool to allow users to configure their device for eduroam wireless networks. This tool requires a configuration file from your home institution in order acquire the configuration settings needed. Due to limitations in the Android OS, the application needs to set up a screen lock if none is already set. The configuration file is in a standardised file format and can be obtained from eduroam Configuration Assistant Tool deployments (such as https://cat.eduroam.org and others). The tool also provides some status information on the eduroam connection.', 'descriptionHTML': 'A tool to allow users to configure their device for eduroam wireless networks. This tool requires a configuration file from your home institution in order acquire the configuration settings needed. Due to limitations in the Android OS, the application needs to set up a screen lock if none is already set. The configuration file is in a standardised file format and can be obtained from eduroam Configuration Assistant Tool deployments (such as https://cat.eduroam.org and others). The tool also provides some status information on the eduroam connection.', 'summary': 'The official configuration tool for eduroam wireless networks', 'summaryHTML': 'The official configuration tool for eduroam wireless networks', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 2.3243244, 'ratings': 2980, 'reviews': 1336, 'histogram': [1701, 140, 271, 201, 664], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '721k', 'androidVersion': '4.3', 'androidVersionText': '4.3 and up', 'developer': 'GÉANT Association', 'developerId': 'G%C3%89ANT+Association', 'developerEmail': 'playstore@eduroam.org', 'developerWebsite': 'https://www.eduroam.org', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5936198804375051443', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/YiBLe8uXav8MW07djUGG42zGU7qXbCIO5KJMteiRQ1UDLKDwCIkSvGRzh3uQuovninU', 'headerImage': 'https://lh3.googleusercontent.com/mqa4wQ2HCxag8tii9nx1hfFj0M_J2I_f3sKH8HMNxaux_yQeVEdP5EUWY9kUWDzuaOI', 'screenshots': ['https://lh3.googleusercontent.com/2oSjhAn8Wh82ZkBJaVIGUCbMtyphmaN55WUzYJ0t51rzqDZlW1ue-dD2fNLXXs0cOz8', 'https://lh3.googleusercontent.com/gPV9hv9NlHrF_nfxBYn6E0gUbq-S0rSpesfVLpXYTNwgjvp80qeJ1zycauaH9djfZ2g', 'https://lh3.googleusercontent.com/BuYusJwKZxyLcri_1kEdz7NOCmOSauKJ4nA8EUxBWL8NmRggyWxBuFFbykjpXKwb6Gg', 'https://lh3.googleusercontent.com/8bnL5Y8ET0_YbFgIM2XU3r10HL27p3WRYWU37NSfbMgk8dSwsRETMkO0Ntm35ColsVqK', 'https://lh3.googleusercontent.com/jWQQfnlJHodO19p2pbzwFxX_15zK61XhyYVxXROLfbiTaOu2VxhV30g2BFrr1ns17Ss', 'https://lh3.googleusercontent.com/0ZbLNdSUD1WBJpA5uDrQlhLPCIJm4r8gxKaK37qZjoTQJCpEUBQDmf5XLyMf4uTQiLrd', 'https://lh3.googleusercontent.com/dQKLL93XyaSgFELTmzn9UghKkpnSDqCOIuufIO9H0QMvuj1OBxBSw1_xjZLLRytlzAE'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 27, 2015', 'updated': 1572269827, 'version': '1.2.14', 'recentChanges': 'Fix for manual search issue 39 (github)', 'recentChangesHTML': 'Fix for manual search issue 39 (github)', 'comments': ["Really horrible app to use. Only positive is that once it's done, it's done. Not a friendly user interface and have to manually search several times before I get my home university despite being on campus! It was then listed as 470 miles away 🤦‍♀️ glad I've finally connected but surely there's a simpler and better way.", "As everyone said, the auto-locate function is way off. Even worse however, the manual search didn't work for me at all, and once I did find my institution by chance, it gave me an unfixable error! I had to end up setting everything up manually, that's how had the app is in its current state.", "Search by nearby universities is way off (525 km) since I study at UVIC-UCC not in Madrid. It had a bug that displayed my university but couldn't get the right profile (solved on third attempt), either way, it may be more frustrating than a simple app needs to be.", 'Once you do find your institution, and follow the instructions likely provided by them, it works well. However, I do not see why my profile was erased when I uninstalled the app - need to go back and do it over again, very annoying!', "Awful. If I could give a more negative review I would. Doesn't work at all at connecting people to the internet, such a complicated process for simple WiFi, don't know how this exists in 2020...", "It looks terrible, it doesn't work that well, I can't install it on site because I can't access the wifi first and we used to be able to log in directly to wifi, I don't know why anyone thought it'd be a good idea to switch to this", "totally useless: -Crash every time you load a configuration, it is impossible to go back to provide your credentials -It is unusable and counter intuitive -Search functionality is a great example of terrible design, it doesn't work and the GUI is annoying. Remove it from the store and go back to the design board, start over, is the best advice you will get.", "Easily the worst app I've ever had the pleasure of using. Words can't explain how poor the GUI is, extremely confusing. The nearby feature doesn't even work even after asking for perms for your location so you have to manual search. Manual search takes tens of seconds and took a few tries to find my school. There's two ways to install the config, online or in the app. BOTH are a pain and both failed to work. I've tried multiple times, reinstalled the app 3 times. Cleared the apps memory and tried again. The app says everything is OK yet I'm still disconnected. I've watched youtube videos following everything exactly but no luck. Been at this for little over an hour and still no luck (to connect to WIFI....] in 2019). Fix your app eduroam.", 'Unbelievably terrible app. The "nearby institutions" feature doesn\'t work at all, manual search is extremely user unfriendly. When I type the name of the institution into the searchbar, it returns different results each time within seconds. Also there\'s generally at least one institution with wrong logo displayed (not wrongly set, just wrongly displayed in the list), which means I can\'t rely on logos and have to read the whole names. Also, the way the logos are rendered in the list is really fascinating, haven\'t seen a design this bad since the 90s. All in all, everytime I have to use the app (and I actually have to support a few hundred users who need to use it from time to time), I feel the need to throw my phone over the rainbow.', "I was forced to use this by my employer to install the eduroam certificate to be able to connect to the local WiFi network. Once installed, I tried to uninstall the app and the certificate was also deleted. I don't want to keep crappy software on my phone that requires my location and access to all my files, but i guess I have to.", 'The fact that you now need an app to access eduroam (which is just a damn WiFi network) is embarrassing. Implement your authentication in a standards-compliant way and let users connect normally.', "Manual search by University name doesn't work at all unless on you're already on WiFi – ridiculous considering that anyone using this app is trying to connect to the eduroam WiFi, so mobile data may be the only option. Requires location permission to try to find your location, but the list of results still assumed I was 80km away from my actual location. The only reason I'm not giving 1 star is that the application did run smoothly once I was able to select my actual university from the list.", 'It worked, but the journey was tedious. Local area search is broken and defaults to London universities. Managed to manually search (on mobile data) for my university and found it, though the "distance away" number was vastly incorrect and the wrong logo was shown. Still, I was able to successfully log in and install my profile effortlessly. Shame that this app has a terrible UI and broken features, otherwise it could be far more useful!', 'Messes up bluetooth I got a new Android phone running the latest OS, which worked fine until I installed the certificate to use Eduroam. As soon I installed the certificate, it stopped detecting new bluetooth devices. I thought I got a faulty phone the first time, swapped it for a new one, same problem. Reset my connections, worked fine again. Installed the certificate, and it stops scanning for bluetooth again.', "Doesn't work, I should be able to connect to Eduroam via my phone's wifi menu, using my university ID and password, however it won't work. So I've downloaded the app (on my mobile data) and that doesn't work either. Extremely pissed off. Tried resetting my university password and double checked the ID, but Eduroam will not accept it. What's the point of even having this service.", "These geniuses are incapable of creating a simple app that doesn't suck. I wish my university just dumped them and created their own service. If you want me to go into details. The app disconnects internet every 5 min, and then reconnects again. Sometimes it just never reconnects and I have to waste half an hour removing it, and then installing it again properly, only so I get the same issue next day. It's embarrassing really...", 'Soooo complicated just to get wifi... The app doesn\'t find my university, even with the search feature... I had to download the app, go to my university website, download some file which is said to be "for computers only", add that file into the app, configure it, etc. Why make all this so complicated? Why make an app that can\'t even recognize your university when that is the very first thing it has to do to allow you a connection?', "App ist rubbish. The config search feature doesn't work at all. As a workaround, install the app, go to the eduroam Website in a browser and download the config file from there. When you tap on the download, the app will open it and install the configuration. The search feature on the website is also poor. My institution was not found, so I typed in my city and the institution appeared in a list of all institutions in that city. To repeat... HORRIBLE APP!", 'Not working. The list of configuration files takes forever to load. Once it\'s loaded, I still have to wait for them to be active. When I try to instal the file, it says "error read config file", whatever that means, without providing any sort of help whatsoever.', 'People are right, this is actually terrible. Location defaults to london, gui is unusual to say the least, along with confusing (like having a slider button to search manually), talking of which searching manually did not work for me, along with anything else on the app', 'The interface is poor and fully of bugs, the process of connecting to the Eduroam network is terrible if it goes wrong. Took me about half an hour and several attempts although I have heard it taking DAYS for others just to connect to a WiFi network.', "Works great, once it's set up. But the first configuration is not user friendly at all. It was for sure written by skilled coders, but without the assistance of any UI designers.", "I couldn't connect my phone one day. I downloaded this but it caused more problems and didn't solve anything. I tried again and it only became more complicated only to not solve anything. The circular logic in this is ridiculous.", "Can't connect to network as i can't find my institution. Manual search doesn't work at all for me. App looks like it's been done by someone who has just learned how to program mobile apps, what a joke.", 'it is working fine for me, and i can even uninstall the app as soon as eduroam is set up on my device. no complaints whatsoever. this is definitely easier than manually downloading and installing a certificate.', 'Eduroam never works, consistently fails and is an unnecessary barrier to accessing wifi at academic institutions. It should be completely scrapped.', 'DONT INSTALL - IT WILL BREAK YOUR WIFI!!!  Installed it because I was prommissed an easy way to install edoroam on my device.  before I installed the app eduroam was working but spotty, after trying to configure the network for 30min now the eduroam is completely offline and I am using mobile date', 'Not beautiful, but worked like a charm immediately. Thank you!', "Absolutely useless. Couldn't find my University, even though I'm sitting a couple of yards from a hub. Downloaded the certificate, and now it has completely disabled my wi-fi, so I'm having to use my mobile data. Wish I'd read the reviews first.", "Not very intuitive and difficult to use. I had to download the config file from the web site, which wasn't any better. Two stars because it worked eventually.", "For those who are struggling with installation, download the profile from eduroam cat website and not the app. Then open the downloaded profile with the app and enter your credentials. Don't forget to remove any previous profile of eduroam you may have in your wifi history before entering credentials.", "The current issue is that the parsing of the configuration fail throws and error. But the app has consistently failed on multiple android devices using different credentials for several years... can't really fail any harder than that.", "works ok, has been perfect until recently I keep getting disconnected randomly despite being well within range and should be getting best possible strength. Maybe it's just the system at my university but ehh.", 'Worked first time at my university - different institutions might have different experiences, but it was easy to use when you read the instructions, and you only really need to use it once and forget it.', 'Error: "turn on screen lock" appears despite it being on. Nothing helped.', 'Buggy and pointless. Constantly hangs during searches and doesn\'t list our eduroam network as a "nearby" option, even though I\'m 10 feet from a hub. Manual configuration is far more usable.', "Many parts of the app are simply non-functional. The whole concept of a third party app that I must type university credentials into is completely flawed. Why is eduroam so special that it needs it's own app to enter WiFi details??", 'Awful UI. It makes something as easy as connecting to WiFi an absolute chore. My university just implemented this, and all I can wonder is how much they got paid to use it.', "They couldn't hire a more stupid developer. Bad interface, bad programming. I sat a hour to figure out how to use this app to connect to my eduroam, couldn't manage, at in the the I needed to do it manually. Perhaps they use hostile architecture to reduce the number of people that can access the eduroam wifi so that the network doesn't overload.", 'It works, but God is it a bit old and outdated. Also the "local search" takes forever to populate for me and fills with locations that aren\'t cost to me first...'], 'appId': 'uk.ac.swansea.eduroamcat', 'url': 'https://play.google.com/store/apps/details?id=uk.ac.swansea.eduroamcat&hl=en&gl=us'}
