{'title': 'Glyph [REDACTED]', 'description': "Note: Ingress is copyright 2018 Niantic Labs. This App is not affiliated with Niantic Labs or Google.  \r\n  \r\nThis is the Android app to practice Glyph Hack, which is in-app game from Ingress (Scanner [REDACTED]).  \r\nThis app is developed for study,  so I can't guarantee the behavior of app.  \r\nIf you have something request, please write review or email for me.  \r\n  \r\nAnd if you want to cooperate collecting Glyph sequences, please fill and send this form:  \r\nhttp://goo.gl/forms/A1Dis5pkfGqBrr593  \r\n  \r\nThis app doesn't work on specific devices, but I don't try to support them at this point. sorry.  \r\n  \r\nThank you to many of sites which provide patterns of Glyph sequence, and all of supporters.\r\n\r\nGitHub: https://github.com/geckour/Glyph", 'descriptionHTML': 'Note: Ingress is copyright 2018 Niantic Labs. This App is not affiliated with Niantic Labs or Google.  <br>  <br>This is the Android app to practice Glyph Hack, which is in-app game from Ingress (Scanner [REDACTED]).  <br>This app is developed for study,  so I can&#39;t guarantee the behavior of app.  <br>If you have something request, please write review or email for me.  <br>  <br>And if you want to cooperate collecting Glyph sequences, please fill and send this form:  <br>http://goo.gl/forms/A1Dis5pkfGqBrr593  <br>  <br>This app doesn&#39;t work on specific devices, but I don&#39;t try to support them at this point. sorry.  <br>  <br>Thank you to many of sites which provide patterns of Glyph sequence, and all of supporters.<br><br>GitHub: https://github.com/geckour/Glyph', 'summary': 'The app for practice the Glyph [REDACTED]', 'summaryHTML': 'The app for practice the Glyph [REDACTED]', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.43, 'ratings': 624, 'reviews': 199, 'histogram': [37, 12, 12, 143, 418], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '3.0M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'geckour', 'developerId': 'geckour', 'developerEmail': 'master@geckour.com', 'developerWebsite': None, 'developerAddress': '京都府長岡京市井ノ内南内畑23-4', 'privacyPolicy': None, 'developerInternalID': '5721336960261308383', 'genre': 'Trivia', 'genreId': 'GAME_TRIVIA', 'icon': 'https://lh3.googleusercontent.com/seIls62FrFEd8qpHNSuDjr6-W4DbigPC4pIlZ48zHKtJ3J4ll4R8VFLt58uyZFenmA4', 'headerImage': 'https://lh3.googleusercontent.com/cfadZP9GJfDClJ0cWYPrFoeavvol4xz2btDcxyNeOvohW3KzUVTc-BXpSKU0OGly8Og', 'screenshots': ['https://lh3.googleusercontent.com/MTXT1-I3CK96BMxa0KFDhMXjgaFOexJxcGGCtPbiJWvleLZ9qrapIuvRD6rIgb1SHcQ', 'https://lh3.googleusercontent.com/h7i0pJCu1Vij0BfkS66n2Qq6soMsmxzuujoxXzqjemsMGu2F5vZ7OHbpNYHNedRkwWDf', 'https://lh3.googleusercontent.com/IDV_LrBmhk4TXY8uq-p81HTAKsujc3A4wzC6uGNWuY12pAfBCs0f6q4gI3ONP7ju8Q', 'https://lh3.googleusercontent.com/1WNFye19Tu1vyT8Hc4kqwaKLJh7ry__QQxyoVEnyZlxbKG98q-DXVZGNMWPtoxXuplSw', 'https://lh3.googleusercontent.com/XVjosjDTA1Sh-RNJ8MEmp9KAnKg8sRgriPwc5sHUiWhZiuQjhidtDe9Y7kr-D27Im7b-', 'https://lh3.googleusercontent.com/3K3_wkq9U3elmF7EDpZ6wFCRIOTvR6R9jpcch4EyNzf7Ufb7qRjaqaPif-tPHlzxwA', 'https://lh3.googleusercontent.com/pmNWWeFwkHGGpygziWpZ9gffxVu0H_nSq7nV6sbIQLXd9u5802tVcp1WMoMAhPNcyQ', 'https://lh3.googleusercontent.com/Yt2dUhsB0sd-W__ENrgURIlrNlA7jcnUzqJlTrxmNGgRoERl4EZgisokl7pnqjhSBmw'], 'video': 'https://www.youtube.com/embed/PSL-LHRYeAw?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/PSL-LHRYeAw/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 26, 2014', 'updated': 1565956278, 'version': '2.2.8', 'recentChanges': 'Improvement\r\n- Add new Glyph and Glyph sequences', 'recentChangesHTML': 'Improvement<br>- Add new Glyph and Glyph sequences', 'comments': ['Several glyphs are unfortunately missing from the app: Call, Response, Chase, Creativity, N, Osiris, Signal, Sustain, Sustainall, Toast. Otherwise the app works perfectly.', "In Ingress, when making a mistake on the final glyph, there's a small amount of time with which to press redo, to redo the glyph. The time in this app feels too short. Toast, sustain, and Osiris are missing.", 'awesome help to master glyphs. definitely put my skills over the top. rarely screw up a glyph now. just donated! recent glyphs (star, link, field etc.) are missing and it would be great to have them there. happy to help out if I can be of use.', 'Sorry for my previous comment. The imperfect glyph has a special way to draw. Hope that this can support split screen so I can play Ingress and this at the same time.', 'the new glyphs are missing (key, link, field, star). nice app! ⭐⭐⭐⭐⭐ New glyphs on! 👍🏼👍🏼👍🏼👍🏼👍🏼', 'Good for practicing glyphs, but still missing the Osiris glyph.', 'Thank you so much. The glyph thing was the best part of the game. Shame they discontinued ingress. At least we have stuff like this to remember what we once had.', 'By far my favorite practice app on android. Just donated. Would love to see new glyphs added: field star link shield key Thanks for the hard work!', "I just updated and can't see the new glyphs in the statistics page or show in dictionary. The new glyphs are Nemesis, Sheild, Star, Key, Link and field.", 'Thank you very much for this app! So nostalgic..', 'Hi, would appreciate if the glyph library can be updated. New glyph had been added since the last update. Thank you.', 'thanks this is great to practice your glyphs :)', 'Perfect ^^ Waiting the same experince for the prime :Dd', 'nice job on replicating ingress feels in your app. love everything. would be great if you could add a visual dictionary of the glyphs. thanks for this app :)', 'epic app. deffo donate , best way to practice glyphs and glyphing', "At first I thought there's missing a speed option, then after digging into \nthe comments I found I can input the actual commands to make Complex Hack \nhappen. Perfect UI and input tolerance, I easily forget this is not Ingress!", "I removed it because sometimes it keeps crashing, then re-downloaded it because this app resembles glyphing in Ingress the best by far. If they're able to fix the crashing-issue this app absolutely deserves 5 stars.", 'Tried a couple of apps for glyph hacking and this is the one I will stay \nwith. Thanks for your work.', 'Great update but complex hack is slow.Its not same speed like in game.Pls fix it', 'Imperfect is not in the dictionary', 'Best ive found', 'Great update. Such a beautiful app. I hope gekour will be the first to make a glyph having lockscreen :-)', 'Excellent app! Sensitivity to touch is bang on and the options allow newbies to Glyphing to pick up the language easily. Just one suggestion... Can you please try and introduce a Complex mode too for people like me who want to hone their skills on a complex hacks!', "Great app to learn glyph hacking in Ingress. It may look a bit sparse, but it has all the required functionality. And its learning function isn't drowned in unnecessary fluff. You do need to change the opt settings regularly to get the most out of it.  Maybe the author could put on his wishlist a 'level' beyond 8 that only consists of level 8 sentences that contain at least one rare glyph (glyphs that do not occur on level 1-6 or 7)  Really glad I found this app a month ago.", "The only one that works. I have used this app to practice and it's helped me improve my glyph game. The helpful part is the use of actual game sequences. The developer has been very helpful with updates to keep it current. Great job!", 'Any chance of being able to practice them at complex speed? Normal speed is too slow for me since the introduction of complex!', 'Great realistic app. Found one miss: If you hold a finger on some grid \npoint during glyph incoming after several flashes you start drawing a \nglyph. In this app you have to lift your finger and touch the point again.', 'It crashes occasionally but it is exactly the training till i wss looking for.', 'You should add the new glyphs (Presence, Consequence, Live again, Them, Worth, Share)', 'Does not work at all.', 'This app is the only reason I can glyph hack. Thank you so much!', 'Resistance glyph is wrong.', 'This could have been a paid app but it wasnt. Hence the author really deserved a small donation. Was looking for an app to practice the new glyphs since my return to ingress. The apps i used before were outdated. This is probably the only app available at time of writing with the updated glyph sequence and most importantly, the complex hack feature. Bloody wonderful! Thank you author. Please continue to update the app as new sequences are released. Really appreciate them.', 'What else would I wish for?', 'I apologize for this because i dont get how the help soc works so i cant help you, SO sorry, but good job on paying attention to your community dev, keep up the good work!', '"HACK" and "WEAKNESS" seem to be identical. A quick explanation in the description would be nice.', 'Over a week and no update with the new glyphs.', 'best guide for beginners to practice glyphing... keep it up...', 'Very accurate and good for practice', 'Matches more closely the glyph hacking experience in Ingress. Latest update solved crashing on HTC One M9.'], 'appId': 'jp.org.example.geckour.glyph', 'url': 'https://play.google.com/store/apps/details?id=jp.org.example.geckour.glyph&hl=en&gl=us'}
