{'title': 'QuickLyric - Instant Lyrics', 'description': '<strong>QuickLyric is a top quality lyrics app for Android from developers you can trust!</strong>\r\n\r\nCountless lyrics apps either bother you with a notification or force you to manually type the name of the song every time it changes. \r\nQuickLyric solves that issue and brings the lyrics to you instantly!\r\nWith a focus on its users, QuickLyric is the lyrics finder that is the most pleasant to use.\r\nGet rid of all the hassle and instantly access your favorite lyrics. On top of that, QuickLyric makes it easy to store lyrics for offline access and supports synchronized lyrics (karaoke).\r\n\r\n<strong>HIGHLIGHTS</strong>\r\n\r\n• Offline lyrics for free\r\n• The fastest lyrics finder\r\n• Synchronized lyrics - the ultimate karaoke experience right in your pocket!\r\n• Floating lyrics to enjoy your lyrics without interrupting what you\'re doing\r\n• Display an (optional) notification to access your lyrics even quicker\r\n• Quickly download the lyrics for your whole library of songs (Google Play, Spotify or your own files)\r\n• Identify songs with your microphone: hold your phone to the music and the lyrics will appear!\r\n• A top-notch support team that will gladly answer all your questions\r\n\r\n<strong>PREMIUM FEATURES</strong>\r\n\r\n• A night mode to rest your eyes at night\r\n• Exclusive new themes\r\n• Remove all ads - enjoy your karaoke without advertising\r\n• Support for Android Wear devices\r\n\r\n<strong>SUPPORTED MUSIC PLAYERS</strong>\r\n\r\n• Spotify\r\n• Google Play Music\r\n• Apple Music\r\n• Napster\r\n• Shuttle Music Player\r\n• Phonograph\r\n• PowerAmp\r\n• PlayerPro\r\n• BlackPlayer\r\n• GoneMAD\r\n• VLC\r\n• Rocket Player\r\n• Many others! Most music players are supported. If your player doesn\'t support QuickLyric, please get in touch with its developers.\r\n\r\n<strong>UNSUPPORTED MUSIC PLAYERS</strong>\r\n\r\n• SoundCloud is not yet supported.\r\n• Youtube will eventually be supported through floating lyrics.\r\n• Wynk Music is **partly** supported. Some songs will work, some will not. This is entirely their responsability.\r\n\r\n<strong>ISSUES? SUGGESTIONS?</strong>\r\n\r\nWe\'re always happy to hear from you!\r\nGet in touch with us via email or social media if you have any problem, request or suggestion.\r\nWe want to make sure you get to enjoy the world\'s #1 Lyrics Finder.\r\n\r\n<strong>COMMUNITY</strong>\r\n\r\nFacebook: https://www.facebook.com/quicklyric\r\nTwitter: https://www.twitter.com/quicklyric\r\nG+ Community: https://plus.google.com/communities/115504114424315189412\r\n\r\n<strong>ABOUT QUICKLYRIC</strong>\r\n\r\nThis app is free and ad supported. Ads can be removed easily by buying a subscription. The subscription model is imposed to us by the music industry and allows artists to get paid adequately. We thank all our premium users for their much-appreciated support.\r\n\r\nQuickLyric will request the "Notification access" permission only to listen for music. We promise we\'ll never access, read, or save your notifications. We respect your privacy.\r\n\r\nQuickLyric is Open Source and its code is publicly available on GitHub. The code is licensed under the GPLv3. Developers who infringe on our copyright will quickly see their apps removed from Google Play.\r\nAnyone can improve the app: https://github.com/QuickLyric/QuickLyric\r\nAnyone can help translate the app: https://crowdin.com/project/quicklyric', 'descriptionHTML': '<strong>QuickLyric is a top quality lyrics app for Android from developers you can trust!</strong><br><br>Countless lyrics apps either bother you with a notification or force you to manually type the name of the song every time it changes. <br>QuickLyric solves that issue and brings the lyrics to you instantly!<br>With a focus on its users, QuickLyric is the lyrics finder that is the most pleasant to use.<br>Get rid of all the hassle and instantly access your favorite lyrics. On top of that, QuickLyric makes it easy to store lyrics for offline access and supports synchronized lyrics (karaoke).<br><br><strong>HIGHLIGHTS</strong><br><br>• Offline lyrics for free<br>• The fastest lyrics finder<br>• Synchronized lyrics - the ultimate karaoke experience right in your pocket!<br>• Floating lyrics to enjoy your lyrics without interrupting what you&#39;re doing<br>• Display an (optional) notification to access your lyrics even quicker<br>• Quickly download the lyrics for your whole library of songs (Google Play, Spotify or your own files)<br>• Identify songs with your microphone: hold your phone to the music and the lyrics will appear!<br>• A top-notch support team that will gladly answer all your questions<br><br><strong>PREMIUM FEATURES</strong><br><br>• A night mode to rest your eyes at night<br>• Exclusive new themes<br>• Remove all ads - enjoy your karaoke without advertising<br>• Support for Android Wear devices<br><br><strong>SUPPORTED MUSIC PLAYERS</strong><br><br>• Spotify<br>• Google Play Music<br>• Apple Music<br>• Napster<br>• Shuttle Music Player<br>• Phonograph<br>• PowerAmp<br>• PlayerPro<br>• BlackPlayer<br>• GoneMAD<br>• VLC<br>• Rocket Player<br>• Many others! Most music players are supported. If your player doesn&#39;t support QuickLyric, please get in touch with its developers.<br><br><strong>UNSUPPORTED MUSIC PLAYERS</strong><br><br>• SoundCloud is not yet supported.<br>• Youtube will eventually be supported through floating lyrics.<br>• Wynk Music is **partly** supported. Some songs will work, some will not. This is entirely their responsability.<br><br><strong>ISSUES? SUGGESTIONS?</strong><br><br>We&#39;re always happy to hear from you!<br>Get in touch with us via email or social media if you have any problem, request or suggestion.<br>We want to make sure you get to enjoy the world&#39;s #1 Lyrics Finder.<br><br><strong>COMMUNITY</strong><br><br>Facebook: https://www.facebook.com/quicklyric<br>Twitter: https://www.twitter.com/quicklyric<br>G+ Community: https://plus.google.com/communities/115504114424315189412<br><br><strong>ABOUT QUICKLYRIC</strong><br><br>This app is free and ad supported. Ads can be removed easily by buying a subscription. The subscription model is imposed to us by the music industry and allows artists to get paid adequately. We thank all our premium users for their much-appreciated support.<br><br>QuickLyric will request the &quot;Notification access&quot; permission only to listen for music. We promise we&#39;ll never access, read, or save your notifications. We respect your privacy.<br><br>QuickLyric is Open Source and its code is publicly available on GitHub. The code is licensed under the GPLv3. Developers who infringe on our copyright will quickly see their apps removed from Google Play.<br>Anyone can improve the app: https://github.com/QuickLyric/QuickLyric<br>Anyone can help translate the app: https://crowdin.com/project/quicklyric', 'summary': "Instantly fetch lyrics while you're listening to music.", 'summaryHTML': 'Instantly fetch lyrics while you&#39;re listening to music.', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 4.2557845, 'ratings': 47277, 'reviews': 17549, 'histogram': [3442, 1354, 3883, 9583, 29012], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '13M', 'androidVersion': '4.2', 'androidVersionText': '4.2 and up', 'developer': 'QuickLyric SPRL', 'developerId': 'QuickLyric+SPRL', 'developerEmail': 'contact@quicklyric.be', 'developerWebsite': 'https://www.quicklyric.be', 'developerAddress': "1348 Louvain-La-Neuve, Place de l'Université, 16\nBelgium", 'privacyPolicy': 'https://www.quicklyric.be/policy.html', 'developerInternalID': '8300537349443277055', 'genre': 'Music & Audio', 'genreId': 'MUSIC_AND_AUDIO', 'icon': 'https://lh3.googleusercontent.com/2jif_zMZ72pi9NzwaEZQKf1yYU1v1uD0fg5wruk-dzf0q_RcSBmOmX1zFVepkMyEov0', 'headerImage': 'https://lh3.googleusercontent.com/0pneaNdgnevv5SQVbu4Tjx9c-bAYI1wR5tq-t6ojUG0mSL0TdVy_ETDkHaTt3JAtgGc', 'screenshots': ['https://lh3.googleusercontent.com/HIlLFaPkbzGR7uA6rZW3Wsm_EVs02jSSJwPRZ0KfxbukHhGM4A7TsJAgda23V3RDIrw', 'https://lh3.googleusercontent.com/G-1OJvlEk4eXd9HCZ5I0lem2Uo5Eb8GmRPTqOCa4C_Kf11TMWIsyvTBwTQvdE47AIMM', 'https://lh3.googleusercontent.com/HdqIpAQFmHeaGf46qBwSEyPbxGK61TeB89gyHj9e-4OssR_6z1MYcLXBqYC2o1hzTcw', 'https://lh3.googleusercontent.com/HC5KfRKZJFdABpZ-wU0yTYBbBAmkC7qlk_uSGytcWoh1sv3SJvfjxZgoPT8Cg4nFwvE', 'https://lh3.googleusercontent.com/W7V9hTOgMAgpKAkGbnTWPskzzHdEwzlzePjnYByyzQMQfs5cTb07yD13ZaS22uRVcMw', 'https://lh3.googleusercontent.com/JXnOD8FemoKacgPAEV60PPWyAobH1uaEFKiNvC5edJCRXs1FL-zWIPbg6wY24al3mgc', 'https://lh3.googleusercontent.com/U7pJJ_3hxWF-nhxhN3yx0swYcnO3WD23CTQqfKrVPSx34YBD-9xUxs43vjqU8G95zUw', 'https://lh3.googleusercontent.com/pSr1z1yzmxKIT8J1EsC1Cbo7l31IMq-cFraLNN8DOsgKifuSR_R--HODYV2Ak5FUtbnd', 'https://lh3.googleusercontent.com/cEJAWG_yzaJQmh32iGC-mNjn-Yw_Q5ek0jhaaS_U3QS-a-vI7c_R7193qvMHNUap7b8L', 'https://lh3.googleusercontent.com/arAVftkc9S3BKQJXzCMPuG8t3pq_b4XL4Nnm-OMOwitnID-CTNXgzBFtfqp8yC5uW7YY'], 'video': 'https://www.youtube.com/embed/j_GmV6w1TtI?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/j_GmV6w1TtI/hqdefault.jpg', 'contentRating': 'Teen', 'contentRatingDescription': None, 'adSupported': True, 'containsAds': True, 'released': 'Feb 15, 2015', 'updated': 1584248306, 'version': '3.9.0c', 'recentChanges': 'Update libraries', 'recentChangesHTML': 'Update libraries', 'comments': ["This app supplements my music listening by presenting lyrics in real-time. It should be obvious then, that I am LISTENING TO MUSIC and certainly will NOT tolerate ads breaking into my listening time, interrupting the music with jingles and sound effects. Not even once, far less every five minutes. Zero Stars is what you earned, one star is what the play store insists I give you, which is one more than you deserve! DON'T DOWNLOAD THIS !!!", "I don't recommend this app! Not a good app. I purchased this app and it's given me issues ever since. Doesn't pick up the live lyrics for most songs (sometimes the app loads for ages). The app is not accurate with the words of some songs, some words are missing in certain songs and this has happened a lot as well.", "This app is like Musixmatch when it was still branded as 'musiXmatch'—the good ol' days... back when it wasn't all over the place. But please PLEASE offer a one-time in-app purchase. Many people, including me, HATE app subscriptions. I would definitely understand if the cost would be fairly high when bought one-time.", "The ads are ridiculous. Can you believe that a full screen ad will pop up AND play sound in the middle of listening to your music? It's true, folks. I wouldn't pay to subscribe, but would pay a flat fee for no ads. Why does an app like this need a paid subscription? $4.99-$9.99 lifetime sub is how it ought to be. Otherwise, this does what it says. Pulls lyrics. But it's not consistently accurate for lyrics scrolling and a lot of older songs don't seem to come up in the app.", 'Honestly after the recent update of this app, it went off perfect .turn so stupid, adds here and there. Cant sync to songs anymore. It plays ahead or after the songs. Even wen lyrics ar saved. In a week time they get deleted. Something enjoyed is now annoying me wen it pop up. Pls review and smarten ur work!!', "Edit: To think this is an open-source app, the devs just added Ads and subscription payment to it. I'm kind of disappointed. First review: Very very very goooooood over all!!! No ads, offline lyrics, and no subscription fee!! Musixmatch - 👎 QuickLyric - 👌👍👍", 'Really impressed by this app. Gets the job done, does what it says. Simple interface with no useless features like other lyric apps. This app Needs more improvement but i am really impressed. If problems like glitching out sometime or crashing gets solved, then i will give it full 5 star rating. But still yeah very good application. Impressed.', "I love how it will pop up when a song is playing so you can get to the lyrics without having to search. My qualms and reason for not giving 5 stars is because it's finicky. Sometimes it pops up and other times it won't. And it takes a good bit before the lyrics will change to the new song. Fix and 5", "Used to be very efficient and accurate, but for the past months it's been taking ages to load lyrics... not a good thing when you have Quick in your name... Unfortunately for the devs, I don't see any reason why you should subscribe for the premium version, because of that very annoying problem.", "The app is named QuickLyric. But its not quick at all I'm sad. Fives lines of the song has been sang already but the lyrics aren't loaded yet. And when I play korean songs, romanization doesn't work or load so very slow even though I've also downloaded plug-in :'( I only wish it would be fast in the near future because I wanna continue using it and see for upgrades/improvements of the app.", "I love it . When I am listening to my radio and don't know what the song is I can open this app and it shows me what it's . And for Spotify it shows me the lyrics also if my tablet is muted it still works!", 'Dont see reason for premium to pay... After 3 song it stop working, it say it have no storage promission and it didnt leave app, i check and it have access, i try again and same problem, after reinstall it say it cant find lyrics from song, and that is song he found first time... Dont recommend at all, if u read somewhere it is good, be sure its payed review!!!', "1. Lyrics are sometimes off with the music. 2. Though I can read korean, it would be perfect if there is also an option for romanized lyrics of korean songs so I can sing along with the songs w/o having any troubles in reading 😅 3. I'm loving this app so much, thank you!", 'After trying many free lyrics apps, I ran across QuickLyric. Hands down, this app is the real deal. ANYONE interested in song lyrics, this is by far, the one you will want to download. My wife of 45 years has an incurable cancer and I have been looking for a song(s) to express to her what she has meant me and how she has changed my life. This app has been invaluable to help me find the song(s) to help me tell our story. Thank you QuickLyric!', "App is great, provides notification to the song currently playing, much better than any other offering. Why selecting whole lyrics isn't possible anymore? I used to send lyrics to people I shared songs with, it's not possible now.", 'Weird issue! When phone is held in portrait, Quicklyric will not start. Tapping the widget does nothing. Have to rotate phone to landscape, then the Quicklyric widget works. Now rotate back to portrait and it will continue working. Now start Spotify.', "This app is great for what it does, sometimes it doesn't work as intended or can't find some songs but I feel that's because I listen to a lot of asian songs. Surprisingly though it can still find lyrics for some of them which is great. Keep up the great works guys.", "I enjoy this program it requires internet at first to recognize the song but sometimes it doesn't find the lyrics for some songs and sometimes the synchronized lyrics freezes in some songs and sometimes it goes late or early than the song and i faced a new problem sometimes the program deletes the lyrics when i am offline and when i try to run the song i can't find it", "Its a good app, very useful for getting 2 lyrics to e song being played however wld lyk 2 address tht it tends to get some lyrics for some songs wrong n also it needs some additional features such being able to add lyrics lyk wat lyric grabber used 2 do n also everytime it can't find lyrics it tell storage access is required yet i granted it all access to storage, media and location, tht defn needs to be addressed but other than tht i give it a 👍 for its tasks of getting synced lyrics", "The sync is off by a second when using BT speakers/headphones, please allow local temporary sync to adjust. Also please add transparent background and nonclickable option for floating lyrics. If you do that I'm buying full version.", "I've tried some of the recommended apps by some music streaming services and this one satisfied my needs the most. You should definitely give it a try.", "It's ok actually. It gets lost some time and the lyrics don't match to the song a lot of the time but for the most part of it it is ok.", 'Album art turned off on mobile data but still downloads. Nice app but very slow. By the time the song is half played it will then show the lyrics, even on pro plan. ☹️☹️', 'Really great,, but I dont like the layout. If 4 ½ stars was possible, I would give it that. The app functions perfect, but I feel like the lay out could be better', 'Love how the app automatically plays when using Pandora or other music streaming sites. The lines are also correctly highlighted to match the words. Would give 5 stars but paid version is a little too high', "Good overall. Rarely gets the wrong lyrics. Sometimes synchronisation is a little off. I'm not sure whether selecting lyrics were wrong, or a little different does anything.", 'Very simple app to use. Just play your music and QuickLyrics will automatically search for the correct lyrics. I feel very happy to have this app.', 'The app is really good though. Although the ads are a hassle, I understand that it is a need so that the app will continue to run free.', "The app is good, I love the pop up. The down size is I can't find a way to reduce the text size in the pop up. It is way too big, I can't read the whole sentence.", "This app is amazing and gives you the words to every single song and it's easy to use! I recommend it for eeveryone!!", "Doesn't work without reading permission, I would accept permission for recording sound, but not for reading everything and for autostart!", "This is truly the best companion while listening to music. The synced lyric feature and pop up layout easily sealed the deal to be the best lyric app I've used so far. Worth it :)", 'It does not download the lyrics to all the songs in my playlist. Say if there are 3000 songs, it will download (or say it downloaded) lyrics to 250 songs. Then when I start the download again it repeats.', 'Pretty cool. Use it daily. Wish you could customize more with paid subscription. Current abilities are kinda boring', 'Great app! Very fast in providing correct lyrics even for Cover Songs. Just kindly make options to change lyrics-color highlight from orange to other colors and it\'s a "5". Thank you to the creator.', "A fantastic floating lyrics app for TIDAL. Quick response for every song I've tried. It seems lightweight and it's free with ad-free options (paid or watch a video 1 day.)", "It's really good for a sing a long whilst chilling out, it doesn't glitch or anything like that, it's great!", 'Incredibly useful when I want to find the lyrics for a song when I need to sing it or just to take inspiration. Does what it says. 👏', 'It does everything it should do, no problems with languages, English, chinese, Korean, it works perfectly. Nice.', "This app totally delivered. But there's usually errors with the Vietnamese font, I hope you can fix that."], 'appId': 'com.geecko.QuickLyric', 'url': 'https://play.google.com/store/apps/details?id=com.geecko.QuickLyric&hl=en&gl=us'}
