{'title': 'Counter', 'description': 'Counter is an open source tally counter for Android. It makes counting easier. No ads or unnecessary permissions. Enjoy!\r\n\r\nYou can have multiple counters with their own names and values. Values can be changed using volume buttons. There is a way to export all counters into a CSV file.\r\n\r\n\r\nThis is an open source application. If you want to fix a bug or propose a new feature, check out the project on GitHub: https://github.com/gentlecat/counter/\r\n\r\nIf you want to help with translation, please go to http://crowdin.net/project/simple-counter\r\n\r\n\r\nThank you for using the Counter. I hope you find it useful.', 'descriptionHTML': 'Counter is an open source tally counter for Android. It makes counting easier. No ads or unnecessary permissions. Enjoy!<br><br>You can have multiple counters with their own names and values. Values can be changed using volume buttons. There is a way to export all counters into a CSV file.<br><br><br>This is an open source application. If you want to fix a bug or propose a new feature, check out the project on GitHub: https://github.com/gentlecat/counter/<br><br>If you want to help with translation, please go to http://crowdin.net/project/simple-counter<br><br><br>Thank you for using the Counter. I hope you find it useful.', 'summary': 'Counter is a tally counter for Android that makes counting easier!', 'summaryHTML': 'Counter is a tally counter for Android that makes counting easier!', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 4.4717607, 'ratings': 3047, 'reviews': 938, 'histogram': [172, 30, 222, 384, 2237], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.2M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Roman Tsukanov', 'developerId': 'Roman+Tsukanov', 'developerEmail': 'googleplay@roman.zone', 'developerWebsite': 'https://github.com/gentlecat/counter', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '7707613003639252434', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/dvPnZK6yR0kw-nM0Vfcy7lNDmdYS50QMCa7318emsFIieB7AtbdJC0ykSv1tczw6udA', 'headerImage': 'https://lh3.googleusercontent.com/XR3x6Gooo9n6HNsJ_YS6gB484tKyU-7LLafUG1hUZTAEG9JgDcJ0Ijo9cqMfMcT-T4Y', 'screenshots': ['https://lh3.googleusercontent.com/qKWQZnatV4prOrt9AqZ0GEPclLQ9xZYiQWJn7OVspbmgRbZsMh7xL0MbuTQWYKUINQ', 'https://lh3.googleusercontent.com/5Dn1zBvb2EA2eh62x6p1zQ8LeN7JXDUlxzrW-lqSjIrpaSwx0Rfv0YDICM6tYxrLiDwH', 'https://lh3.googleusercontent.com/T1LI2aBYHXmEyRgDCCcwIzCIh-UbTiHPAO15m5v3M3Vfv0U5d6zYRxWuT7_2j2SFyw', 'https://lh3.googleusercontent.com/AweHPJYXFt-8xdoJaOY14zx0IEzq4Oo5YiQqyRpGsR4SAGe34HjqZWWA1Xlad-W8lyY', 'https://lh3.googleusercontent.com/0avHLT9eikeBMBB4u5-jYWglMqKX_4Dv1zThvEMFLpGUoh50CnBnWsxSR3Bvv9gXVcs'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 21, 2011', 'updated': 1547973272, 'version': '20', 'recentChanges': '- Added a way to increment the counter by clicking on the value\r\n- Value limits are significantly higher now\r\n- List of counters is now sorted alphabetically\r\n- Translation updates', 'recentChangesHTML': '- Added a way to increment the counter by clicking on the value<br>- Value limits are significantly higher now<br>- List of counters is now sorted alphabetically<br>- Translation updates', 'comments': ["I use this app daily for shiny hunting! It's excellent!! ONE THING, a minor, so maybe easy to fix. The app creates randomly a new counter that just sits in my counter list. Very weird! Max randomly generated counters is one. It bothers me not that much but if it can be fixed it would be very much appreciated. It saves me some time and actions before I can enjoy my hunts. And the counter list looks more clean if there aren't any random generated counters. Hope you can fix this. Love you guys!!", 'I do not ever leave reviews for apps I download But I just wanted to shout out to the developer for creating a no hassle, Non-Ad Intrusive app that is extreamly Handy for keeping track of Car counts at work. With this counter App, I can edit the counter name, add or subtract and if I wanted too, I could swipe up or down to add or subtract without clicking the buttons! Well done, well designed... and NO ADS!!!', "This app has many cool features and it's very useful and it also looks nice. And all of the great stuff is squished into such a small size! Although there is one problem: The sounds don't work properly.", "Working as a grocery employee during this pandemic currently, so we needed a non-pap solution to make sure we are within regulations for store capacity, and this app has come through as the counter app of choice. Low battery consumption, volume button support, and clean implementation into Android's user interface make this the choice. The sound not playing after one count in a certain direction might need to be fixed, but otherwise stellar.", 'Does what it says, no BS. Simply keep count of whatever you want. I like that you can use the volume buttons to quickly add or subtract from the count.', 'This app is great and perfectly made. It helped me keep tabs on all my school assignments. You can have multiple counters open at once and you can name them. You can use the volume buttons to count too. Also it has dark mode! :)', 'I tried a few counters and found this the best. Some counters are too sensitive and trigger unexpectedly. Some do not even allow you to subtract a count. I set this one to only count when I press + or - and it is perfect.', 'This is an amazing app. Very simple and a pleasing UI. No adds, no useless permissions required. You can get going once installed since it is very intuitive. Kudos to the developer for building something like this.', 'Let us get rid of the first counter. Update: I know you can rename and delete it but what I am saying is it keeps reappearing after I do so.', 'It\'s a good counting app, it\'s so annoying that it constantly adds "first counter" even if I delete it. Other than that it\'s a good app', 'Simple app that get work done. I need help from users. My prev mobile screen broke but som importants counts are to be retrieved. How to obtain values stored?', "Well it works (almost) There's no point in making multiple tabs because they all share the same counter", 'Simple, clean and I can use my volume buttons to count up and down. Perfect!', 'Perfect. Having the option to use the volume buttons to count is convenient.', 'It does, what it should do and what you download it for. Simple counter with some nice extra features (e.g. multiple counters)', 'Exceptional tasbeeh app! Loved it. Was just wondering if backing up could be added. It will definitely make it more awesome 👍', "Love it. It's simple and does what I need. Could you add a widget so I could put it on my screen so the hubby could find it easier. He is not computer literate.", 'I like the simplicity of this app but the lack of widgets make it unusable.', 'need a little change. the app plays the click sound only once and forgets to do again. might wanna fix the code there a lil bit', 'Really great app 1. No ads 2. Big counter text which allows to reward myself when I complete an hour of work 3. Logging multiple days is even more awesome. Really well thought and built.👏👏', "Extremely Effective App for its purpose. A counter for you to count up and down with, even without wifi. It even allows you to make more than one counter at a time, set their starting values, and save what you've done without additional input. A suggestion I do have for this app is the option to decrement the counter when the value is tapped, but otherwise A+.", "Does its job, but would like the ability to view values on all counters when displayed. Also, the ability to change the increments would be useful as well. This app does have some features others don't, but they make up for it with other features. One example is making it easier to go between counters. (directional buttons or swiping) Having to go through the list everytime can be tedious.", 'Love the counter! I wish you could put multiple not he same screen though!', "Best counter app; it's easy to use, no adds, nice and simple, and it's keeps multiple counters. I've had no problem with it.", "Best, truly FREE counter! Great modern interface, No ads, and it's actually free! I love it! A cool future feature would be a time stamp for each increment so you could plot it on a graph (I want to track how many trick or treaters we get per hour to plan how much candy we need). Thank you!", "Good with snags On my phone, holding it to press volume up means I risk squeezing the button for reset counter at the same time. I'd prefer to leave the volume buttons as volume and use the spare (shutter) button for counting. I'm a little worried too about debouncing the taps / buttons, and getting two taps when I only wanted one.", 'This app has every feature I was looking for. It has optional nighttime mode; can use volume buttons to count up or down; vibration, click, silence all at my choice; saves old counts with custom names; even lets me choose if tapping over the readout will increment.', "Yes, this is pretty useful, has a lot of good options, but it doesn't have the one thing I was looking for: a widget. It's a suggestion. Just a widget to make it a lot more versatile, and that will be fine stars for me", 'Very Nice and its beauty is its simplicity.  It gets a 4 because the counter can only handle up to 9999.  Please enhance the functionality to count 6 digits. Thanks', 'Good one, but resetting resets the value to zero always..make it to reset the value we saved when adding the counter. For example if I want 50 countdown counter. When I reset 50 value should come.....simple and easy to use', "Exactly what I wanted for a simple job. I count with a click and don't need to fuss with unnecessary extra features or ads. Simple, neat, easy.", 'I use this app for quickly counting rows in knitting and crochet projects. the only thing that might make it better is a little widget for the home screen.', 'A counter app that is simple, easy and quick to use.', 'Turned on sounds but it only makes clicks occasionally.', 'Best and simple counter. 100% am happy with this app', "5 star is deserved by this app. If you want to count on something when your mobile phone is on the other hand. It works great. It's a manual counting app. I love it", 'Would be nice if it can work when the screen is off and I use the hardware buttons to count.', "Got it for counting up my CAM in Digimon: Cyber Sleuth. Thank you! (I mean, it's a counter, if people complain they're just being touchy. Idk y this doesn't have 5 stars)", "It's a very nice fluent app.. but there's a slight problem with the audio.. and I was hoping for the widget.. despite that, I would still recommend this app as it have dark themes", 'It does what it says. Works well and is reliable'], 'appId': 'me.tsukanov.counter', 'url': 'https://play.google.com/store/apps/details?id=me.tsukanov.counter&hl=en&gl=us'}
