{'title': 'Caldav Sync Free Beta', 'description': 'Synchronise your calendar from a caldav calendar server. Fully integrated and transparent in Android account management. \r\n\r\nOpen source software.\r\nSource code available at https://github.com/gggard/AndroidCaldavSyncAdapater\r\nDo not hesitate to contribute (bugs, comments, patches, ...) !\r\n\r\nURIs for the different servers are available on the wiki : https://github.com/gggard/AndroidCaldavSyncAdapater/wiki\r\nDo not hesitate to complete or comment !\r\n\r\nFor owncloud, use url : http(s)://server/owncloud base/remote.php/caldav/principals/user_name\r\nFor baikal, use url : http(s)://server/baikal base/cal.php/principals/user_name\r\n\r\nFor bug reporting, please use the bug tracking system https://github.com/gggard/AndroidCaldavSyncAdapater/issues', 'descriptionHTML': 'Synchronise your calendar from a caldav calendar server. Fully integrated and transparent in Android account management. <br><br>Open source software.<br>Source code available at https://github.com/gggard/AndroidCaldavSyncAdapater<br>Do not hesitate to contribute (bugs, comments, patches, ...) !<br><br>URIs for the different servers are available on the wiki : https://github.com/gggard/AndroidCaldavSyncAdapater/wiki<br>Do not hesitate to complete or comment !<br><br>For owncloud, use url : http(s)://server/owncloud base/remote.php/caldav/principals/user_name<br>For baikal, use url : http(s)://server/baikal base/cal.php/principals/user_name<br><br>For bug reporting, please use the bug tracking system https://github.com/gggard/AndroidCaldavSyncAdapater/issues', 'summary': '', 'summaryHTML': '', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.2191782, 'ratings': 1484, 'reviews': 712, 'histogram': [447, 81, 223, 162, 569], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '778k', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'gege', 'developerId': 'gege', 'developerEmail': 'gege.org@gmail.com', 'developerWebsite': 'https://github.com/gggard/AndroidCaldavSyncAdapater', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '7569719162581070964', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/ygUkN1oCx0FHoEMGE1cxVxe1YPd8xt9m3eeG3IpgAH-ZJN4jycxl3l92Yu3OE6LwrXlG', 'headerImage': None, 'screenshots': ['https://lh3.googleusercontent.com/5bonUjzu5tuUPa-aqKbXcDsK1egAS4nk29baFsXtv_kqYjsgLgZV7pFTSY_kShGK9A', 'https://lh3.googleusercontent.com/hrS0yPLwBSejQBTzPis3Ey7sozbc7wpp2JI2jnB3XNmC4TF-mDVByY23SKRvRLThQg', 'https://lh3.googleusercontent.com/o_yVkd7U9SC-l4yofgBAV2cvwjFlF-Q0Dx14kpUki5zAg-PEQZayj0wNjXy5kFK2SSM', 'https://lh3.googleusercontent.com/PkxyzPVCLJrlBjy2zkGzwG_Qtr1bh4jnEzd7-PysBwDeAH-Qt0rwxpkazJactNCwibA'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 27, 2013', 'updated': 1385991337, 'version': '1.8.1', 'recentChanges': 'V1.8 - The main change within this release is the ability of 2 way sync. Events created/updated/deleted on client side are getting synchronized to the server.\r\nThese are some of the changes for this release:\r\n- 2 way sync\r\n- google calendar supported\r\n- calendars are deleted on client side when deleted on server side\r\n- incorrect use of content-type text/plain for XML requests\r\n- URL without trailing slash\r\n- Every request is doubled\r\n- many more\r\n\r\nthanks to all alpha tester for their patience.', 'recentChangesHTML': 'V1.8 - The main change within this release is the ability of 2 way sync. Events created/updated/deleted on client side are getting synchronized to the server.<br>These are some of the changes for this release:<br>- 2 way sync<br>- google calendar supported<br>- calendars are deleted on client side when deleted on server side<br>- incorrect use of content-type text/plain for XML requests<br>- URL without trailing slash<br>- Every request is doubled<br>- many more<br><br>thanks to all alpha tester for their patience.', 'comments': ["It's actually great when it works. However, as many people noted, it works at the start and then just stops working properly. For instance, I downloaded it the first time and it worked for a bit then stopped.I came back after some time and downloaded again, this time it still works but one way only. I can perfectly sync from my phone to the server, but for some reason it doesn't sync (download) from the server to the phone, which is the whole point of having this app, hence it becomes useless.", "Looks decent, but does not work fully.  I'm connecting to a Kronolith calendar server.  Events are picked up on the initial sync.  Events added on the phone show up on Kronolith.  However, subsequent syncs don't pickup new events entered on Kronolith.", "First seemed to work. But then get error msg in notifications. but ... cannot open the app anywhere to look at config. not even from play store, where normally there is a button 'open'.", "Keeps saying the server url is invalid. It's not. I copy pasted and have setup other caldav clients just fine. Worthless.", 'Does not work. Too many error messages', 'only sync randomly. not working', "Doesn't sync all the events. Useless.", 'Could not find in my apps so had no access. Galaxy S9', "Doesn't work, and no decent feedback to tell you why", "simply didn't work", 'I downloaded this app and followed the installation instructions on the wiki. Everything was super smooth and within a few seconds, I was able to view my self-hosted calendar, which uses the Radicale server. Two way sync also seems to work properly. UPDATE: Dropping a star because it ate up 20% of my battery for the initial sync and then continued to be the highest battery consumer.. even more than the screen!!', 'I use this app to sync my cakendar with my RaspberryPi running a Baikal server. In most cases that works fine. But sometimes the app does not sync anything and remains in that state until the CalDAV-Account has been removed and created again (a bit anoying). An other issue is that sometimes the app keeps showing the "Cancel Sync" button although thr sync is already completed. Hitting the button does not do anything at all - but by that you cannot sync manually as the needed second button is disabled.', 'Too unreliable. Stops synchronizing with no reason given. Found last sync date days or weeks in the past several times without even telling me there is a problem. UPDATE: found out it was caused by Android battery optimization. 5 stars for logging and notifications.', "Did get it setup relatively pain free, but once my source account changed password there's just no way to change it in caldev without setting up a brand new account and waiting for it to sync everything again.  With that change implemented it'd be worth an extra point or two.", "@developers: Problems with android 7.0 After I updated my phone to android 7.0 there is a big problem. After a short time of using this app, the synchronization doesn't work  automatically and when I want to do it manually, it doesn't work too.", 'Thank you for this great app. Now I can synchronize my owncloud calendar on my raspberry with my smartphone. But I found a little Bug: if there is a "%"-sign in the URL, the upload to server doesn\'t work. If I remember correctly, the app responded with Error 51.', "I love this app, it works great with my owncloud setup after a long learning process.  I've been using it for many weeks without any issues EXCEPT, i had to go through and re-configure all of my owncloud user passwords.  The App doesn't like using passwords with special characters (I didn't do any research to figure out if it accepts a select few special characters).  Making a dozen users change their passwords after the fact is a real PAIN.  Bottom line, great app.", 'Takes half an hour to sync calendar, of which 10 minutes without any network traffic whatsoever. You can never be sure that everything has been synced. UI only allows to add and remove accounts, but not to edit (or even view) existing accounts (such as for changing passwords). Leaves log entries on server... "... client set content-type to "application/xml;charset="UTF-8"". Assuming they meant XML!"', "Not able to see yahoo calendar events created from other devices. Only able to see events created from the phone. This app hasn't been updated in over 6 months. Does the developer have a fix for this issue?", "The sync with Zimbra 8 works and it's the only free app that does this that I've found so far. However, there is a problem with recurrent events. If one of them is changed (but not all of them), the change will have no effect on the events imported :/", 'Works very well maybe too well... Can we have a way of turning down the sync... Every minute it synchronized .. Little bit excessive? Nothing has changed .. Maybe have a option to change the frequency? But apart from that loving it and well bloody done mate ;)', "Don't know if an app update fixed it or simply the time (our company servers were not touched)", "11/26/2013 - I tried many configurations and couldn't get any of them to work. I did a little research on how to configure this and it works perfectly. Now I can update the calendar from any device, IOS or Android, and all other devices that connect to iCloud are in sync.  12/3/2013 - Not sure what has happened but I went to set an appointment today on my iPhone and it will not get through to my Samsung Note tablet. I do see the event in the iCloud calendar and it goes to the other IOS devices just fine. The only resolve is to delete the Caldav account and recreate it. Once I do that it will sync everything in the iCloud calendar to the tablet but the same problem occurs if I try to create a new event in my iPhone. I am running v 1.8.1. I will check if another release is available but I have to downgrade this rating to 3 stars until some progress is made.", 'Works like a charm! But what is the frequency of the sync? Is it 20 minutes? I see that manual sync works well. But is there a way to sync more frequently (automatically)? Reduced one star since I am unable to tell the frequency of sync.  Seems to have a mind of its own.', "I was able to connect to my company calendar. That's all i need. I also can sync two ways (but i don't need it, only syncing from company) Great!", "It works as advertised. Much better than earlier version. (I had uninstalled earlier version out of frustration) The only issue I see now is it can't detect an exception to series invites. viz I got an appointment, which repeats every Friday. Due to some reason only today's event is rescheduled but I can't see that change in my calender even after repeated syncs. Looks like some bug with this app which needs a fix.", "For me App is not working in 2G mode. And on WiFi or 3G, whenever sync happens AppStore gets crashed, always. If I disable auto sync on this app, then appstore won't crash.", 'Great app. Works fine on my Samsung Galaxy S4 mini. Thank you. Request for enhancement: If the account password changes, then I need to remove the old account, re-create a new account, perform a full sync.', 'I was looking for similar app since a very long time, finally i got it. One issue though - it does not sync updated or deleted events. It only syncs new events.', 'Keep getting error "Caldav sync error (general)" on my HTC Desire S Android 4.0.4, HTC Sense 3.6 Connecting is successful, and it says new calendar found : MyCalendar. Immediately after that it throws the above error.', 'Installed fine, easy to set up, found my calendars on the server, said syncing then said synced… and nothing showed up! Nothing, no calendar entries at all! Jellybean 4.2.2.', 'Great free way to sync CalDav servers. Although one thing that would make it better is the ability to set sync intervals. Right now it syncs once a day', 'It used to work.  Now, it just stops working without warning.  This becomes a problem when you depend on your calendar.', 'Works well with Zimbra 8.0 community - two way. One star down for the ui or the lack there of but for all intents and purposes it does an excellent job!!!', 'This used to be excellent but when Motorola forced my phone to version 7.0 of Android, it stopped. Re-installing made it work again for a few days but has now stopped working again. Such a shame.', "I don't know why its rating is so low. Only free Caldav app on play store,completely working. Don't know what else anyone want.", 'Works good with zimbra. Brings down my calendar and shared company \ncalendars. I would add the ability to change the sync time. I would like it \nto sync or have the option to sync every 15mins.', "Previously. .. Worked fine so far and meant I didn't need to download Touchdown bloat ware.", "I wasn't keen to use IMAP to connect to my work account because it enforced device lockscreen policies. This sync adapter is perfect because I just needed my calendar when I'm mobile and don't need to check e-mail as often. The calendar was picked up by Google Calendar and my calendar widget.", "The only difficulty I have is with account removal: once I set multiple accounts I'm not able to remove them"], 'appId': 'org.gege.caldavsyncadapter', 'url': 'https://play.google.com/store/apps/details?id=org.gege.caldavsyncadapter&hl=en&gl=us'}
