{'title': 'Hash It!', 'description': 'Hash It! eases using unique passwords per web site without overloading your brain by generating site-specific passwords derived from a secret master key.\r\n\r\nIt maintains compatibility with the popular Password Hasher extension for Firefox and supports the "Private Key" extension of Password Hasher Plus for Google Chrome.\r\n\r\nFor further details, refer to the web page.\r\n\r\nLicense: GPLv3\r\n\r\nIf you spot any bugs or have a feature request, please drop me an e-mail (I can\'t reply to comments).', 'descriptionHTML': 'Hash It! eases using unique passwords per web site without overloading your brain by generating site-specific passwords derived from a secret master key.<br><br>It maintains compatibility with the popular Password Hasher extension for Firefox and supports the &quot;Private Key&quot; extension of Password Hasher Plus for Google Chrome.<br><br>For further details, refer to the web page.<br><br>License: GPLv3<br><br>If you spot any bugs or have a feature request, please drop me an e-mail (I can&#39;t reply to comments).', 'summary': 'Hash It! - Stop busting your brain trying to remember complex passwords.', 'summaryHTML': 'Hash It! - Stop busting your brain trying to remember complex passwords.', 'installs': '5,000+', 'minInstalls': 5000, 'score': 4.481818, 'ratings': 110, 'reviews': 40, 'histogram': [7, 0, 5, 19, 79], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'TG Byte Software GmbH', 'developerId': 'TG+Byte+Software+GmbH', 'developerEmail': 'android@ginkel.com', 'developerWebsite': 'http://android.ginkel.com/', 'developerAddress': 'Isestr. 6\n20144 Hamburg\nGermany', 'privacyPolicy': None, 'developerInternalID': '7700481507149997492', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/409m42Z7lcE5i2JKBD8pzEaKFwU3d--oYYMHCe2JekzN0-Bsh1KDn-bL_ByGTN2xnw', 'headerImage': 'https://lh3.googleusercontent.com/MKJdqzqqgc-a2fa5DsHEkRn3WPj6QSFYtV86uZK2Y0H5KeVPLeemB5KDyOgOpE7xWgk', 'screenshots': ['https://lh3.googleusercontent.com/em1EMTY1mYWV__AA6FKCY574Wh50wPDS348fVs4nt0_JZaKZtFLP3o-mt2Z1JcJY1Q', 'https://lh3.googleusercontent.com/gDz-WQWnu-TpilIAKJ2fHqneIxb4U9yzCI2t_PIhSu8I1CXA0PGXcZNVUtxfLEy1C2c', 'https://lh3.googleusercontent.com/DD-QqAjlCLVlPXtFYTKJhNM0PD2mYwD2EvbF5MxcIs54zpzs7cUrD2zmcSvGWApVKw'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': None, 'updated': 1412162016, 'version': 'Varies with device', 'recentChanges': None, 'recentChangesHTML': None, 'comments': ['Great app!  Please consider publishing it in F-Droid repo.', 'Would be awesome to see a Material Design update.', 'I had actually started to write my own version of this very app because my initial searching did not turn up an app compatible with the chrome extension with the private key.  This one works.', 'Simple to use and secure method for creating and retrieving truly strong passwords. 5 stars are not enough!', 'Simple and easy to use. Fantastic app.  Thank you!', 'Awesome!  Works fantastic!', "Wouldn't change hashers... This is the best. Exact as firefox plugin.", 'Would give more stars if there are more features!', 'Works as advertised. Lovely!', '5/5 Stars I love this app already.  Working great on g2!  Exactly what I was looking for. Amazing job. :)', 'Please keep developing!', 'Excellent application. However, the nag screen is annoying, and it should remember the master password.', 'This thing is awesome. No more remembering several passwords. Remember just one and it will generate and keep up with the rest. Firefox plugin too!', 'FCs on myTouch 3G', 'Performs its function well. Wishlist: remember the master password; map the custom tokens I use to the domains I use them for when using share page.', "Excellent app! I can finally access all of my password hasher sites. Now all I need is an extension for Chrome and I'm set!", 'Absolutely the same PW generator as the Firefox plugin. Used it for years and extremely glad to see it here. One passphrase to remember!', 'I reported a suspected bug, the developer responded quickly and we found out the bug was already fixed by him. Great app and great support!', 'Fantastic! I was worried that i was going to have to code a version of this myself. You did a much better job than i would have.', 'I could not do anything on my phone because i was missing the hasher plugin for Firefox until now thanks again', 'I dnt get it', 'Love it'], 'appId': 'com.ginkel.hashit', 'url': 'https://play.google.com/store/apps/details?id=com.ginkel.hashit&hl=en&gl=us'}
