{'title': 'Fon for Members', 'description': 'Log in to Fon Wi-Fi hotspots all over the world automatically.\r\n\r\n• Free Wi-Fi access for members of Fon and its partners\r\n• Automatically connect to the Fon network whenever a Fon Wi-Fi hotspot is detected\r\n• Test the speed of the network you are connected to.\r\n• Save hotspots areas for offline navigation\r\n• Check your usage statistics  \r\n• Choose to be alerted so you know when you are logged in\r\n\r\n\r\nINSTRUCTIONS:\r\n1. Install the app\r\n2. Enter your username and password\r\n3. Save your settings\r\n4. Enjoy Wi-Fi with Fon!\r\n\r\n\r\n*** If you are a BT Broadband customer, please download the official BT Wi-fi app to get the best user experience ***', 'descriptionHTML': 'Log in to Fon Wi-Fi hotspots all over the world automatically.<br><br>• Free Wi-Fi access for members of Fon and its partners<br>• Automatically connect to the Fon network whenever a Fon Wi-Fi hotspot is detected<br>• Test the speed of the network you are connected to.<br>• Save hotspots areas for offline navigation<br>• Check your usage statistics  <br>• Choose to be alerted so you know when you are logged in<br><br><br>INSTRUCTIONS:<br>1. Install the app<br>2. Enter your username and password<br>3. Save your settings<br>4. Enjoy Wi-Fi with Fon!<br><br><br>*** If you are a BT Broadband customer, please download the official BT Wi-fi app to get the best user experience ***', 'summary': 'Connect to 14 Million Fon Wi-Fi hotspots all over the world automatically.', 'summaryHTML': 'Connect to 14 Million Fon Wi-Fi hotspots all over the world automatically.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.4357543, 'ratings': 2645, 'reviews': 1074, 'histogram': [842, 103, 132, 192, 1374], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '13M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'Fon Wireless', 'developerId': 'Fon+Wireless', 'developerEmail': 'appsmanagement@fon.com', 'developerWebsite': 'http://www.fon.com', 'developerAddress': 'Clifford St 8\nW1S 2LQ\nLondon', 'privacyPolicy': 'https://corp.fon.com/en/legal/privacy-policy', 'developerInternalID': '6331369745606203165', 'genre': 'Communication', 'genreId': 'COMMUNICATION', 'icon': 'https://lh3.googleusercontent.com/d42m5Tw50BHzdDktsLcmYf09juQ7ixrZmIIFKouNyg8Cl6F0I8E3NAfmti0gKVRCCZ8', 'headerImage': 'https://lh3.googleusercontent.com/bGf1oReHJ3hg3QUA_qBbK30mCYbsMcyZDCboM8FBUGCUwYV-zhxBp97_vbq_VWz9EHY', 'screenshots': ['https://lh3.googleusercontent.com/_J_wREonFkdWBDqAG4P1sC_tVYp01DLELO0cgGGxNF2wRCdDhqe38O2ECcKq-0U34jc', 'https://lh3.googleusercontent.com/eA8SOSF6nJj2b63Il4fvpnB01TarK4FR6RaCSC-0VOSCZgBefTxPHNBsuQBYXGFXYiU', 'https://lh3.googleusercontent.com/mt8MRJmnWx3pY2TwPjL-weJ5h_xpm6WSU7US7JgPOzm_0Y20Uc1VmMIPwyHOpmgXqe8', 'https://lh3.googleusercontent.com/AzWacBm6NrJA0tqTMZa6gTGGF6swIxBP8sYsOK1JOr2aJVsGs8Zvi1qd0oBCJGnAJ2uy', 'https://lh3.googleusercontent.com/KnkJcqXlKUI1eq60TJSQI_NFcpSopwAofP5vyKQFFY5vuwppWwCU7Vi38wL44K3eZjke', 'https://lh3.googleusercontent.com/a-tcGmGOCfUZk07y57YmgW7rbx09QoWbP6qX9mRklZhSaCQ_HtnKkASb2S7uf5MtVgg', 'https://lh3.googleusercontent.com/fugW1aVwGLo-KafO70jyz9qxdDXgsmfhalKqFm_tVR60AIlR7Pz2vSa4skFcovEQ-Q8'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 16, 2011', 'updated': 1566815009, 'version': '3.6.1', 'recentChanges': 'Android 8 & 9 support', 'recentChangesHTML': 'Android 8 &amp; 9 support', 'comments': ['An embarassment to the app store. Honestly this app is laughable. You would think a 10 yr old with no skills built this app. And to think it is affiliated with a multi billion brand like BT is beyond belief. Nothing works. Interface is terrible. Does not connect to wifi spots, shows a tick button for log off? You try to untick it, the app closes?? Wierd. You need access to the internet to find a hot spot??? Shocking. Google you allowed this app on the app store? Really google? Wow!', 'If like me you own a Fon router to obtain membership to the Fon network it would appear that you are no longer able to connect to BT wifi with Fon hotspots and as most of the Fon hotspots on the map are BT it makes the whole concept pretty useless, used to be great but now almost a pointless app and network.', "Tells me Connected to Fon but doesn't log me in. Background service is running. Auto Connect is checked.", 'It actually displays some of the hotspots. It would be ok if it actually connected in the way it used to a few years ago.', 'No longer automatically connects to BTWifi-with-FON hospots, so basically useless. Uninstalling.', 'Great app, but keeps crashing since my phone updated to Android 9', 'since android pie update on Moto g6, app keeps stopping.', 'Does not log me in :/ I have a valid account.', 'Very bad', 'Rubbish', 'I dont know why people or I cant believe people creates this type of apps \nand then they know is not working and them carry on making people download \nit for waste their time, once you open the app it closes on its own.. how \nthis is allowed? Why police is not behind this people and arrest them for \nyeaaaaaars just because of the intention of scam people? I dont get it , \nthis world is full of this and still and it will cus no one cares.... sad', 'Earlier versions used to automatically login. Now practically useless.', "9 out of 10 times it doesn't log me in and now I get an e-mail telling me to install your new app which is incompatible with every device I have.....", "I can't even buy a fon pass, what a buggy mess", 'İ pay around $50 for a month i cant open You Tube or anything like that dislike and no good', 'Fresh install, App constantly crashes after a few seconds.', 'does not have any wifi spots in my area', "can't pay, payment screen doesn't work. hardest Wi-Fi to try and buy.", 'awesome worked perfectly for me 👍', "Problematic in Android 7 Nougat. Can't select networks manually as the device drops the connection and connects, usually, to the previous network. Behavior stops on uninstalling the app.", 'Their billing link - like most clever con tricks - works a treat, shame I cannot connect. Thieving bastards!', 'No  signal, poor signal. always connect broken, need sing in again. cost more 50% money than local internet provider. weste money, waste time.', "doesn't work. It used to work fine, but now it crashes before you put in your password. Useless. Shame, it was good before they messed it up.", "Version 3.5.0 worked well.  3.5.1 broken again. Previous versions haven't worked properly for a while.  Seems to do a better job in Portugal and Spain.", "I use to love this app.  But now I'm not sure. As I'm having lots of problems with app.  I can't connect & I can't Buy any parsses to connect? It won't connect at all to anything?.", 'Work great in rhodes sydney australua, good speed in my building. But only in my building, can not find good wifi signal anywhere else. Lucky me.', 'Back in my country they said that if you have an Fon username you can access for free Fon hotspot all over the world. A BIG LIE.', "After I paid with card, I got 9 emails about it. Charge me twice, After I can't connect anymore. I can't get IP. There's no support. So it is a theif service!!!!", 'APP KEEPS ON OPENING EVEN THOUGH I FORCED STOPPED IT!', "Horrible. I can't even connect to the Internet. It says something like time out. Horrible as.", "This wifi app very bad. I paid for30 days $44.5. But the connection very bad and i can't connected to the wifi no more than 4 days!!!!! 😠😠😠😠", 'Cannot purchase more credit via app', "Unfortunately this app drains the battery of a Pixel in about half a day without even using it. Seems to be something about the wifi. It doesn't show up in the battery overview.", 'I cannot connect anymore after paying for a month. Con app and con service.', "It gives an option to purchase credit but this feature doesn't work. Also subscription payments should be allowed via google play & isn't. I'm not giving my cc details over to that kind of thing. Not very user friendly at all :(", 'Cant make a purchase via credit card. Why?', 'Latest version works well and connects quickly.', "The app works fine, and the fact that it logs you in automatically when you connect to a hotspot is very convenient. There's one issue though: what's the use of an app which requires internet to tell you where you can find internet when you don't have it?! It would be great if you could save hotspot locations so you can look them up when you're offline.", "Since the recent update (January 2016), keeps saying I need to buy credit, even though I am a linus (and I can still access the Internet if I login via the webpage). It used to work great, now it's useless.", 'App functions OK but repeated connection issues and inability to connect at all between 5pm and midnight... Frustrating to not be able to use a service for large chunks of time (particularly when allowance is awarded in 24hr chunks).'], 'appId': 'com.oakley.fon', 'url': 'https://play.google.com/store/apps/details?id=com.oakley.fon&hl=en&gl=us'}
