{'title': 'Scid on the go', 'description': "Features\r\n* Browse Scid (Shane's Chess Information Database) files, optimized for databases with millions of games\r\n* Header search using player names, sites, events, dates, results, ECO, ELO ratings,…\r\n* Search games by material and position\r\n* Favorites\r\n* Copy/paste games and positions to/from clipboard\r\n* Edit board\r\n* Support for variations\r\n* Replay the game with a configurable delay between moves (autoplay)\r\n* PGN import (also includes import from Internet)\r\n* Analysis with included chess engine: Stockfish 10; you can add additional UCI engines for analysis\r\n* Study mode\r\n* Experimental write support and marking of games for deletion (needs Scid for PC to compact database after marking games for deletion)\r\n* Retrieve positions from external programs, such as https://play.google.com/store/apps/details?id=com.kgroth.chessocr (ChessOcr, non-free)\r\n\r\nLicense\r\n* GNU GPL v2\r\n* Source: https://github.com/gkalab/scidonthego\r\n\r\nDevelopers\r\n* Most of the GUI code was taken from Peter Österlunds DroidFish and re-released under GPL v2 by the authors permission.\r\n* Scid integration by Gerhard Kalab.\r\n* Various enhancements by Alexander Klimov.\r\n* Manage UCI engines by Larry Isaacs.\r\n\r\nPermissions\r\n* Storage for accessing databases stored on the SD card\r\n* Internet access for downloading PGN files from The Week in Chess (http://www.theweekinchess.com/twic/)", 'descriptionHTML': 'Features<br>* Browse Scid (Shane&#39;s Chess Information Database) files, optimized for databases with millions of games<br>* Header search using player names, sites, events, dates, results, ECO, ELO ratings,…<br>* Search games by material and position<br>* Favorites<br>* Copy/paste games and positions to/from clipboard<br>* Edit board<br>* Support for variations<br>* Replay the game with a configurable delay between moves (autoplay)<br>* PGN import (also includes import from Internet)<br>* Analysis with included chess engine: Stockfish 10; you can add additional UCI engines for analysis<br>* Study mode<br>* Experimental write support and marking of games for deletion (needs Scid for PC to compact database after marking games for deletion)<br>* Retrieve positions from external programs, such as https://play.google.com/store/apps/details?id=com.kgroth.chessocr (ChessOcr, non-free)<br><br>License<br>* GNU GPL v2<br>* Source: https://github.com/gkalab/scidonthego<br><br>Developers<br>* Most of the GUI code was taken from Peter Österlunds DroidFish and re-released under GPL v2 by the authors permission.<br>* Scid integration by Gerhard Kalab.<br>* Various enhancements by Alexander Klimov.<br>* Manage UCI engines by Larry Isaacs.<br><br>Permissions<br>* Storage for accessing databases stored on the SD card<br>* Internet access for downloading PGN files from The Week in Chess (http://www.theweekinchess.com/twic/)', 'summary': 'Scid on the go is a viewer for Scid chess database files.', 'summaryHTML': 'Scid on the go is a viewer for Scid chess database files.', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.37, 'ratings': 957, 'reviews': 335, 'histogram': [47, 19, 105, 143, 641], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Gerhard Kalab', 'developerId': 'Gerhard+Kalab', 'developerEmail': 'gkalab3@gmx-topmail.de', 'developerWebsite': 'https://github.com/gkalab/scidonthego', 'developerAddress': 'Feldgasse 40b\n3423 Wördern\nAustria', 'privacyPolicy': None, 'developerInternalID': '5839306378714834354', 'genre': 'Board', 'genreId': 'GAME_BOARD', 'icon': 'https://lh3.googleusercontent.com/gZeEMRm9s9VHVjTH5npfV86AOvUFb2_Ly-TWVeun_ladleSDusMQfzCfjwaioJsHHZo', 'headerImage': 'https://lh3.googleusercontent.com/e3UzEtqszC9rsRgk9886MV7ukE0t-Ul0gUd3p28PWsCOjPXZ6zgFyChG1_GuIr6PtzM', 'screenshots': ['https://lh3.googleusercontent.com/QzI7l_gEUY11wiO2m8ZleUpEtatTb45RKDsjgcPg2b8yO0LJr5plR35YHy3HxyLWdkSH', 'https://lh3.googleusercontent.com/x9XIgGYiUNmh5-CoYhKN-oLJUVww11HRkTnqypYtccTjw01lG7kElxf_dfJ9F92FcnA', 'https://lh3.googleusercontent.com/ZO7Tee_jNl_wPX4NvK1UYCjyVOo1W2V7lNrMO501Opta8QSoiH_Ax9FeFTv0RtNQXiE', 'https://lh3.googleusercontent.com/1ICaeY4YVKqvDDClU3ODqNX99R7-BnvLv5fxCUylEEqSZYGFfdPqSuKJiNSSyjkSxA', 'https://lh3.googleusercontent.com/WOT0sNz62noM-D8SbTl6IMIfJUBqFKpUmH0g8-07pNjtcExHOk1r1ERSyj_jAKoB3g', 'https://lh3.googleusercontent.com/l8iSiHkcHQJ2gDefhPVbk7HJKtmyFafbMogd43HWBC_QXWIxY_O8ZJloBBImna8g6g4'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 14, 2010', 'updated': 1584227075, 'version': 'Varies with device', 'recentChanges': '* Updated internal engine to Stockfish 11\r\n* Fixed sharing games', 'recentChangesHTML': '* Updated internal engine to Stockfish 11<br>* Fixed sharing games', 'comments': ["I used it on several devices and it is very good application. However, on my HTC Desire 816g, the import does not work for both pgn (it says couldn't open log file) and twic which can't be downloaded.Yes it is true it can only read from the main acid directory on phone storage. Please resolve this bug. But I can't download from twice as well.", "Can't search dates if there is only a year in the pgn file (1956.??.?? Doesn't work for example. The latest update says it updated to SF 11 but it did not and the engine isn't in the folder. Understand now. Maybe some better instructions in the help?", 'Only one thing missing in this app..there is no "arrow line" to show possible move in analysis mode. Everyone cant read it by notations only. Pls develop it.', 'Display Arrows for Variations And Add Number of Variation', "I would like autoplay to be even faster, let us say, 0,5s per move. 1s seems too slow, and I never use it although I like this feature. Also the font of the players' names is too big, gigantic, they have not enough space on the screen. Please, make the font much smaller on order for the White and the Black's names be properly displayed on the screen of a smartphone.", 'Scid on the go is really a great app, especially after I managed to convert (using scidb on linux) my chessbase databases to the scid format si4. ;) But I cannot success in finding how to search an opened database according to a given pawn structure, up to color switching or not. The best available is "search current board" and then the closest to what Iook is "same material, all pawns on same squares" but is not the criterion I am looking for.', 'Perfect ever app and a pgn tool for android platform, i highly recommend it to all chess lovers. If three options are more added, will be a brilliant app, (example) 1.Seperate autoplay button 2. An engine evaluiton bar, 3. And an arrow for analyzing best move... Thanks and regards', "I love this app, but in order to give it a 5 star i would like this app to go to the next variation automatically when I am in study mode practicing an opening that I've downloaded in pgn format. Also many time when I am review mode it keeps jumping to study mode by itself. If these to things would change in the next update i will give it a 5 star.", 'I wanted to use this to access my opening repertoire on mobile. Unfortunately, this app does not support SCID tree mask files so this is not possible. If you just want to use it to look up games on your phone, it should work nicely though.', 'Love this app, but now when I try and import PGN files I get a message that it was unable to open the log file and it does not import. This is not an issue for the built in TWIC downloads.', 'Nice Android implementation. Works without problems for me. Thank you!', 'Scid on the go is an excellent chess app for feeding various chess openings and save them to review and learn one by one.90/100 marks. I request EDIT/CLEAR BOARD FUNCTION may be added to enable us put in puzzles as well.', 'Incredibly painful to set up positions, save/load games. Extremely annoying option menu. Pratically unusable.', 'when I save resigned game then result of game is not saved it is saved as * that is result awaited please fix it', "All I can say : it don't disearve any less then 5 stars =An Amazing App", 'i wish if we have a tree view for the database it will be wonderful', 'it is good app but we need updates for new android 9. thank you in advance.', 'VERY GOOD BUT I HAD A BAD EXPERIENCE RECENTLY THAT INSPITE OF MY HAVING INTERNET CONNECTION I COULD NOT IMPORT GAMES FROM FILE TO DOWNLOAD PLZ CLARIFY', 'Keep improving guys Nice app to create and save pgn files', 'It is a wonderful app Its takes your eyes away', 'We can not delete a game it is so hard to not play the game', 'The best app for pgn viewer so far! Two thumbs up👍👍', 'Good for memorizing opening', 'Great app to review games', 'The best, simple as that', "Hi, I have any doubts... What's difference between study and review modes? Can I play against engine? How? Thanks for attention!", 'good to go , everything is', 'Vary good i like app thanks', 'Best app to view master games', 'super', 'Nice App', 'great', 'Too many modes!  Analysis mode? waste of time.  would be better to have a button on the main display to quickly start/stop engine in game review mode and game study mode.  This will allow user to quickly start/stop engine, save battery power and analyse game without the long procedure to keep going in and out of analysis mode.  Also option in setting to show arrow on display for engine move when analysing would be nice.', "It's really clunky when it comes to checking variations/candidate moves. It would be so much better if review and analysis modes where merged; and the engine on/off put on a toggle on the top line.  It has a long way to go to get close to the PC version; ok for a free app, but the dev has done better work before.", 'It\'s the greatest app for chess lovers.I love it so much. How can I extract my favourit games from downloaded TWIC files to a separate pgm file?? And,please give sufficient instructions for "export filtered games" feature.Thanks in Advance :)', 'Thanks for this great app.  Deserves five stars. But I restrained myself in awarding it as I could not find an option to turn off the last move highlight which is bit annoying. Kindly let me know if there is a way out to do this.', "Excellent app. There is a slight possibility for improvements and this will undoubtly be the best app on any platform. 1. Simple touch controls on the board for nevigation instead of buttons would have been better. Would be much useful for left handed people too. 2. While user is Guessing the move, in case of wrong move correct move and the best move from engines perspective would make it extremely useful. Also, the score of user's actual move compared to engine and the grandmaster would be awesome.  Still the app stands second to none even if compared to paid apps.", 'Non user friendly interface too many questions are raised when you try to use this app .', 'Only wish study mode would also choose variations, not only mainline. Would make it perfect for learning openings. Also would be great if you could play the entire database, and not just one game. Scid vs Pc lets you do that, and its an excellent tool.', 'Why no tree window? The most important feature is not available. Mediocre.'], 'appId': 'org.scid.android', 'url': 'https://play.google.com/store/apps/details?id=org.scid.android&hl=en&gl=us'}
