{'title': 'Bluetooth Chat', 'description': "Bluetooth Chat will help you to send short messages and images using Bluetooth technology. You can chat with your friends if you are in the Bluetooth range and don't have access to the Internet. \r\n\r\nIt will be helpful for students if there is no Wi-Fi in your school, for travelers to chat between tents in mountains, and in many others cases.\r\n\r\nYour friends don't have an Internet connection to install this app? You can easily share an .apk file of the app via Bluetooth!\r\n\r\nBluetooth Chat is fully open-source: https://github.com/glodanif/BluetoothChat\r\n\r\nYou can help to localize Bluetooth Chat to your language: https://crowdin.com/project/bluetoothchat", 'descriptionHTML': 'Bluetooth Chat will help you to send short messages and images using Bluetooth technology. You can chat with your friends if you are in the Bluetooth range and don&#39;t have access to the Internet. <br><br>It will be helpful for students if there is no Wi-Fi in your school, for travelers to chat between tents in mountains, and in many others cases.<br><br>Your friends don&#39;t have an Internet connection to install this app? You can easily share an .apk file of the app via Bluetooth!<br><br>Bluetooth Chat is fully open-source: https://github.com/glodanif/BluetoothChat<br><br>You can help to localize Bluetooth Chat to your language: https://crowdin.com/project/bluetoothchat', 'summary': '1-to-1 Bluetooth chatting app', 'summaryHTML': '1-to-1 Bluetooth chatting app', 'installs': '500,000+', 'minInstalls': 500000, 'score': 4.0333333, 'ratings': 2179, 'reviews': 1049, 'histogram': [259, 155, 145, 311, 1307], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.4M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'Glodanif', 'developerId': 'Glodanif', 'developerEmail': 'glodanif@gmail.com', 'developerWebsite': 'https://github.com/glodanif/BluetoothChat', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '7308203356687008223', 'genre': 'Communication', 'genreId': 'COMMUNICATION', 'icon': 'https://lh3.googleusercontent.com/bYvu0-U2bfycqcHMDRq3u67ob-pB4qPf_a5xauWPBflq6RZ1iApsPXQOPdDgzDGoYRU', 'headerImage': 'https://lh3.googleusercontent.com/mxdE4o2ozQR4zc9XvpbAHIo2nkHLotIRSFoe5-jb9GKopTpJfuYNI3-ikKQl5NywzZoZ', 'screenshots': ['https://lh3.googleusercontent.com/6aqGeWFBC0hN5sS9SyMuxoMKSz17FrNVWf2LZ7vX3Mz46f6DBDy4BTKuzM0CXf7v5D4', 'https://lh3.googleusercontent.com/IEAUuH1GKHo7mbupXcQgZx3p7hn1KyH4jszlnu71wEwZELjT2XItZZFcPchONuLwvA', 'https://lh3.googleusercontent.com/6nbfiidWgA5BFmmlfB9g71ka4rWLozLaiLE_OT5o7-ApZfdgvAuMCTjJTi7eYE_q4Yg', 'https://lh3.googleusercontent.com/rMoc7c0eFzPIa7L4d5-XSKaX6a8Xn1KG3Fb6fBj8v32ZHEi_0Gtgs-DUsoppLV5dQg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Aug 2, 2017', 'updated': 1557386729, 'version': '1.3.2', 'recentChanges': 'Night mode\r\nPortuguese translation', 'recentChangesHTML': 'Night mode<br>Portuguese translation', 'comments': ['Nice app to use in short range distances seeing that its working via bluetooth connection. One thing that bugs me is that even though i am connected to the specific bluetooth chat while actuay sitting next to each other it keeps on throwing of the connection and also the messages takes quiet a good time to come through at some times but other than that enjoying this app allot', 'great app, tested with two phones , upstairs and downstairs 25 feets apart, send images fine, this app is great for emergency or during in flight or go camping , although having trouble to connect the phones at first', "This can be very useful for it's offline messaging. I can see it's use for parents wanting their kids to have a phone but not have service but still need to message their kids, IF they are within 50ft of each other.   I have been testing this app and it does what it says. I see this more useful within the family household more than any other use for it.", "Work perfect for what I needed at the time although no longer installed shouldn't need ever arise will be happy to come back", "It nice but the one thing i don't like is that it is dose not do voice note", "Good idea; poor execution. Would be a lot more useful if, when an authorized connection drops due to being out of range, it would simply rejoin when back in range. Similarly, it should queue messages when a connection drops. Absent these features, it's not a terribly useful alternative comms app.", 'Great app to put on your kids phone so they can "message" you without giving them Internet or mobile access.', "One missing thing. Can't view images in the gallery.", 'Great way to get messages without buying pbone service.', "This app is perfect for what i need it for. it's reliable, easy 5 min set up. haven't seen an ad yet. great app, first time I've ever given a five star review. thank you guys for this lifesaving app.", "Looks like this is the only Bluetooth chat app on Google Play that have no ads or purchases, is well designed and easy to use. I've scrolled through all of them untill my finger started to hurt, but haven't found anything better.", 'It tried but the problem is that, ypu cant chat with people in long distance coz no connection, there is a range the Bluetooth connection can take u too.', "I love the fact that I can share the Apk with friends via Bluetooth in case they do not have this installed and there's no internet connection to download the app via the playstore. My only wish is that I could chat with many users without disconnecting the other chat.", 'Works good dont see a whole big use in this but love the actual support in the app eith good half decently frequent updates to improve it with bluetooth 4 dont see it to useful seeing majority people have it but will be alot better once bluetooth 5 is the norm brcause then atleast there would be some pretty good distance where the point of tents would wok or like rvs rn bluetooth has the same rangee as my vouce but calling in this app would be a really amart feature to add, maybe a secure texts', 'simply love this offline possibility of chating... even greater is that there is option to send pictures.... but it would be perfect if there could be short video and other files sending or rudimentary voice transfer.... but, not sure Bluetooth speed can support it.', "Best free App ever...... I called Amebo App! Looking for free Bluetooth chat? Please download you wouldn't regret it...... Developers thanks.....", "Extreamly useful in times where there is no internet connection and you need a quick way to chat with those near to you. I've used this in airplanes before to communicate with family, great success", "This is a nice and organised app; but in this era of communication, I can't find the use of an app like this.. maybe adding more functionalities and probably introduce WiFi as the main communication feature with Bluetooth as an option.", "Very nice app but you can't use voice chat", 'It is a great app. I like it because you can easily chat up with friends without the use of internet. It will have been better if there can be a group chat.', 'Its awesome and works perfectly but I think they should update it with voice note so you can send recordings', 'Wow many thanx to the developer. I was stuck hard creating a Bluetooth chat app. Your code js awesome bro. Champ! God bless you :)', 'This d best app but the problem is that it only share photos. Please try to make it better by letting it try to share other files such as apps,music, documents etc .. i would give it 5 stars but due to this proble. I am giving 4', 'Это офигенное приложение для школы просто тупо экзамены друг другу скидываешь это если честно топ))) For developer: If fork app, and add wifi-direct and wifi-direct support multi-connect it so good for group chat and on next updete please enable support for horizontal view)))', "Unusable without granting access to all data on the phone. How come people can't just use it to chat without saving images (and without granting access to the phone's data storage)?", 'this app is great, i can actually chat with my co-workers without internet connection or data. just needs more upgrade by adding voice chat and profile pictures', 'Super handy in places with poor or no connection.', 'We had to manually reconnect every time we went out of range from each other.', 'Hmm u really work good to make this app. I get confused in this app in connectivity of devices so i taken one star.', 'You should be able to create group chats(one device with bluetooth 5 can act as a hub). In rest, it is ok for areas with no coverage.', 'pretty good, but still messes some important stuff. For instance the ability to send voice messages', 'Very simple and straightforward application out of complications Very minimal size and free from ads What is more is this app is open-source Very nice work - hope you add more feature like peer-to-peer messenger and group chat', "Worked well...problem is that Bluetooth can't go a far distance and you have to connect first,but it is pretty effective for chatting in a close space", 'This was great. My wife and I used it on our flight when we had separate seats. It allowed us to stay in touch over the 5 hours.', 'why are long messages incomplete when sent to the recieving device? at least have a text limit. also why cant we send videos at least and hopefully general files.', 'Keeps disconnecting every few seconds on all three of my phones. Great concept... Poor execution.', "Extremely easy to set up, and worked well. Very useful when there's no internet.", "It's great on cruises when you don't have any cell service. It's like having walkie talkies except you can text back and forth send photos...", 'GREAT FOR WHEN NETWORK IS DOWN! i love the fact that you can send sms via Bluetooth after the network isnt on great app for the apocalypse 😉😎', 'Fantastic. Pls developer try to add voice feature in other to make it more fun. I really love it'], 'appId': 'com.glodanif.bluetoothchat', 'url': 'https://play.google.com/store/apps/details?id=com.glodanif.bluetoothchat&hl=en&gl=us'}
