{'title': 'Minimalist Pomodoro Timer (Goodtime)', 'description': 'Goodtime is designed to keep you focused and free of distractions.\r\nAlternate between focused work sessions and short breaks handled by the app.\r\nGet rid of procrastination and improve your time management!\r\n\r\n⏳ split your work into sessions of focus followed by short breaks\r\n☕ after a configurable number of work sessions, take a longer break\r\n\r\n<b>Features</b>\r\n• No ads\r\n• No tracking or personal data collection\r\n• Open-source\r\n• Lightweight\r\n• Battery friendly\r\n• Configurable timer\r\n• Pause, skip or add 60 seconds\r\n• Long breaks after a number of completed work sessions\r\n• Detailed statistics\r\n• Daily reminder\r\n• Timer styles\r\n• AMOLED-friendly user interface\r\n• Immersive fullscreen mode\r\n• Keep the screen on\r\n• Custom notification sounds\r\n• Auto start work or break without user interaction\r\n• Android Wear support for notifications\r\n• Disable sound and Wi-Fi connection(until Android 10) during the work sessions\r\n• Translated in 40 languages\r\n\r\n<b>Pro features</b>\r\n• Colored labels\r\n• Manually add sessions\r\n• Edit completed sessions\r\n• Backup export and import\r\n• Export statistics to CSV\r\n• Screensaver mode\r\n• Themes\r\n• Separate notification sound for work and break\r\n• Insistent notifications\r\n• One time purchase and all future features for free\r\n\r\nTranslate or improve the translation on <a href="https://www.google.com/url?q=https%3A%2F%2Fcrowdin.com%2Fproject%2Fgoodtime%2F&sa=D&sntz=1&usg=AFQjCNFMG2i-55XPtLMQ-T0uicaLTEz1nQ" target="_blank">www.crowdin.com/project/goodtime</a>.\r\n\r\nDifferent phone OEMs have an aggressive take towards apps that rely on background work and alarms, such as pomodoro timers, to save some battery life.\r\nIt is recommended that you disable the battery optimization for this app in order to get accurate alarms.\r\nIn the worst case, if you still have issues, try to keep the phone plugged in and/or the screen on while working.\r\nRead more about this topic on <a href="https://www.google.com/url?q=https%3A%2F%2Fdontkillmyapp.com%2F&sa=D&sntz=1&usg=AFQjCNHWrj_MKctzA-W25ok4pXsjojmYEA" target="_blank">www.dontkillmyapp.com</a>.\r\n\r\nFor any suggestions or questions, please contact me and I\'ll be glad to help!', 'descriptionHTML': 'Goodtime is designed to keep you focused and free of distractions.<br>Alternate between focused work sessions and short breaks handled by the app.<br>Get rid of procrastination and improve your time management!<br><br>⏳ split your work into sessions of focus followed by short breaks<br>☕ after a configurable number of work sessions, take a longer break<br><br><b>Features</b><br>• No ads<br>• No tracking or personal data collection<br>• Open-source<br>• Lightweight<br>• Battery friendly<br>• Configurable timer<br>• Pause, skip or add 60 seconds<br>• Long breaks after a number of completed work sessions<br>• Detailed statistics<br>• Daily reminder<br>• Timer styles<br>• AMOLED-friendly user interface<br>• Immersive fullscreen mode<br>• Keep the screen on<br>• Custom notification sounds<br>• Auto start work or break without user interaction<br>• Android Wear support for notifications<br>• Disable sound and Wi-Fi connection(until Android 10) during the work sessions<br>• Translated in 40 languages<br><br><b>Pro features</b><br>• Colored labels<br>• Manually add sessions<br>• Edit completed sessions<br>• Backup export and import<br>• Export statistics to CSV<br>• Screensaver mode<br>• Themes<br>• Separate notification sound for work and break<br>• Insistent notifications<br>• One time purchase and all future features for free<br><br>Translate or improve the translation on <a href="https://www.google.com/url?q=https%3A%2F%2Fcrowdin.com%2Fproject%2Fgoodtime%2F&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNFMG2i-55XPtLMQ-T0uicaLTEz1nQ" target="_blank">www.crowdin.com/project/goodtime</a>.<br><br>Different phone OEMs have an aggressive take towards apps that rely on background work and alarms, such as pomodoro timers, to save some battery life.<br>It is recommended that you disable the battery optimization for this app in order to get accurate alarms.<br>In the worst case, if you still have issues, try to keep the phone plugged in and/or the screen on while working.<br>Read more about this topic on <a href="https://www.google.com/url?q=https%3A%2F%2Fdontkillmyapp.com%2F&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNHWrj_MKctzA-W25ok4pXsjojmYEA" target="_blank">www.dontkillmyapp.com</a>.<br><br>For any suggestions or questions, please contact me and I&#39;ll be glad to help!', 'summary': 'A minimalist but powerful pomodoro timer to keep you focused. Study and log.', 'summaryHTML': 'A minimalist but powerful pomodoro timer to keep you focused. Study and log.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.5591397, 'ratings': 6547, 'reviews': 2596, 'histogram': [281, 110, 351, 724, 5078], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '3.1M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Adrian Cotfas', 'developerId': 'Adrian+Cotfas', 'developerEmail': 'goodtime-app@googlegroups.com', 'developerWebsite': 'https://github.com/adrcotfas/Goodtime/', 'developerAddress': 'Brasov, Romania', 'privacyPolicy': None, 'developerInternalID': '8401747129284940974', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/q7VTLOb4GHdHqdQjtKBXdRdsHKVUF4YjvAc995Ef9fscOWaDF4_mXlERYTWcfW80ng', 'headerImage': 'https://lh3.googleusercontent.com/6n3uvODLAu6tCMYxqjy3jO-ZzgNP0jTApjiZF3o-xWP6prsak3cdi4jVJukLzjOcLA', 'screenshots': ['https://lh3.googleusercontent.com/r4bNYLr3AsD3YwXIyCoI0kDO1MqAvX8tugnMzsA0t9mBAt8OiODhdDNlK1CdjgeI6A', 'https://lh3.googleusercontent.com/jyA4ZdZIPFKzDkh5qufsRO0kphiygeYuhUS6PxeaGl-jKRG3m8nK1R8rxCEsNAWVlZ4', 'https://lh3.googleusercontent.com/w_fl1cojS6Sk1XaDXahFiu5Pi1VT-VvaD2WlmLGerYKEIdge7ey_j-QklvR14KhiIA', 'https://lh3.googleusercontent.com/ZJ4sKrpoTFyPJ9KnDFdltGjQB0p0ZYngDA0tEG0YrVW11Z7F1pcDBEpTCsOOMOglgw0', 'https://lh3.googleusercontent.com/OC0_Nh4B3DSWv9DOT0kr329Y_PVvE5VIftNlxmOJT72T2hh9cgZskl1pzIgtxPXd2A', 'https://lh3.googleusercontent.com/YKzzysJeV0kr30T4WGI-Fc04eF1qm7dqwpCmDja_t9Uq4PPSHSQJK5cWUzZ4i5fGnG8', 'https://lh3.googleusercontent.com/z0Y8eIjgA0b0tLKxSBnV4ZPNGJFC_7gmz4cbFh09YlNHLVYFq1fWvHc7N_shdAAheg', 'https://lh3.googleusercontent.com/XtdDEEKQBAbFWhgQa7L92RRSc00E1LJDipKO3PVzLQXNCNaOwvQ7iFZnWbu_iAYgQA', 'https://lh3.googleusercontent.com/0wAsjl6709140QGPoDgqIQhdaygXOVkcGx-CSCcxCe9HMdhiuhDIFCEv_c1HzlL88Q', 'https://lh3.googleusercontent.com/5yRVLcPs4ZLmMx7o85b_3ng3kXriosIwGkt2mg2XZ-uQCroT4GIMgJXy9rWzR4GEhAdC', 'https://lh3.googleusercontent.com/1rsU8IyzxrUdM887Xa0pJaW6SKiI6D_UiQkNFu6HmcZsrhKYdKx-nTy2A0rK7KXDaD0', 'https://lh3.googleusercontent.com/lHuJiZsbyijZLlgGN52ym12bMasuhPvd87a9Tk5JErt32DPej74rwu-3LxOEgj9gxA', 'https://lh3.googleusercontent.com/Eza2H_ay8hi8DS86OpSeKGIrOwybLAxW-pxmK_FwyMp0YodNbjz2HYX6pb-9jk1MIQ', 'https://lh3.googleusercontent.com/yBlybeXq9301I0CqCa0aNbfRsd7OfhuMNn2ZACnw0FOBXCsc-BLyjkGgMMZnM7BTxxc', 'https://lh3.googleusercontent.com/OsUdH96JIA8h8bGRUzqQkkssnE_HTrBikpdMujvHeX9_J8KrgoPYn3P-cuQpA0mLnQM', 'https://lh3.googleusercontent.com/Jyk3A5l5gz_HJ3VLv6-0tx_kxlMSAtGSbsZC3-aBOZlGwqd-cXS2dkvQCF5bvLsFAA', 'https://lh3.googleusercontent.com/6BMqXl-VcZs-sFQtA0WNuzgD8Nw9xXP5ISKbIcyA7VoORu-iiVgp7shxgI0cj1l_8Q'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 12, 2016', 'updated': 1589572923, 'version': '2.1.14', 'recentChanges': "2.1.14\r\n• Bugfix for reappearing finished session dialog\r\n• Updated translations\r\n• Updated dependencies' version", 'recentChangesHTML': '2.1.14<br>• Bugfix for reappearing finished session dialog<br>• Updated translations<br>• Updated dependencies&#39; version', 'comments': ['Love this app. Been using for a while during high school and now during work and university. Clean app and interface and perfect for AMOLED phones. Just a small recommendation is to add some integration for Google Assistant and Google home as this would be a perfect app to use to trigger the break and work notifications on a speaker', "Used this for two days as trial period, honestly it was just amazing, very simple and minimalist unlike all the other apps. Some even want a monthly subscription which is just nonsense. AMOLED-friendly as a cherry on top. Bought the pro after trying it out for only two days. EDIT: would be nice if there's a ticking sound playing during the countdown", 'Perfect app, just the one I was looking for, only one feature missing from my dream app and that would be flashing the screen with a particular colour for start of a break and start of another block and also for the long break for making it completely silent app. Great work!', "Simple interface which greatly minimized distractive visuals (effective when glancing how much time is left lol) and no annoying ads! Paid for the pro version already to maximize the features and so far, it's worth it for me. :)", "I really like how simplistic it is. I don't like that I can't remove time from the current session (either break or work). Also I needed to check something in another app and I had to start my pomodoro Session all over again.", "The app does what it says. Though some features are limited or don't work such as the swiping mechanics, it would be nice if there were buttons in the place of it or the option to have buttons or use swiping.", 'Pretty good. You can show the clock in full screen mode, it shows you how many pomodoros you have done during the day. It vibrates when a pomodoro ends. Fulfills all of my needs. Thanks', 'I am in love with this app. Light, simple, and very useful. When I get sidetracked this app bring me back to the trenches. May God bless Adrian for building this app. Bought the paid version to support the app.', 'It is exactly what a minimalist pomodoro needs to do, no more no less. It also has a few adjustment options which helps a lot when we want a change of studying patterns.', "The app keeps stopping when I click finished work notification option from setting. Edit: I can't change the default notification sound for work and break. When I click the option to change it, the app keeps coming back to main screen (timer). I'm on Android 10 btw.", '1 star. The basic features which were free earlier now made paid. This app used to be good but now it has became more business centric than the feature and usefulness. Used to love this app but now the developer has became only money minded.', "I've been looking for a Pomodoro app to use for a while, and this one finally has all the features I wanted. The gestures are intuitive, and the interface is simple and effective.", "For minimalist people! the app doesn't distract you with ads, colours and poluted layout, on the contrary, it has a clean design and nice features.", 'Does exactly what advertised. Fullscreen mode looks very nice. Highly recommend this app! Fully functional even if you use the free version.', 'any chance having a tracking with no countdown like in the "boosted" app? and showing total time for a tag somewhere in the timer screen. also could be nice to have an option to make the labels screen as the default one with autostart by tapping and summary time. how about long tap for countdown and fast tap for an infinite adding up? upd: please, add an ability to check multiple tags at the same time. maybe it could work as lables/subl-lables etc like guitar/scales/dorian to see detailed stats', "App works, sound doesn't. I want to like it, but I encounter the same problem others have noted: it doesn't play an audible notification or vibrate at the end of a session if you have your phone on silent (as an alarm would). Should prompt for an exception, or explain that limitation. Who doesn't have their phone on silent all the time. Pixel XL, Android 10", "I think I'll put 5 stars here first and see how it goes. My review is based on the following two points: - the minimalist interface that I really love - there are some useful functions and features to choose from to personalize the app, without making it too confusing. Trust me there are apps that claim to be simple but offer tons of redundant functions. I've purchased the pro version to support the development team. Keep up the good work!", "I love the minimal design and intuitive ui. Had trouble at first because my phone kept killing the app when it had to run in the background, even though I disabled the power-save mode. But then I figured if I put it under 'protected apps' it wouldn't be automatically closed, and now it works like a charm.", 'So far I learnt that swiping up is restarting the session, left/right is switching to/from break, and down is adding 60 seconds. But how do you skip 60 seconds as listed in the description? It also used to be that long pressing the time allowed you to prematurely end the session and I miss that feature, all it does is bring me to settings now. We should be able to customize gestures. Also, the app keeps force closing when trying to change notification sounds for either work/break (OnePlus 7t).', 'This app helped improve my productivity. I admire the simple and elegant design. Love it!', "Simple best It does exactly what you need to do. - provide a timer at different intervals - track how your time was spent - allows you to change the intervals - label each session differently (I track my time by subject) - provide simple stats on how you've spent your time; time of day, length of time, total time - custom tones for start/stop of sessions - disable notifications Things it does NOT have or do that make it great! - distracting rewards - it is not subscription based", "'break finished' showing up the screen when shouldn't. This bug comes and goes with no main explanation.", 'Best minimalist option. A Hourglass animation and nature sounds would be a cool update.', "Exactly what I was looking for. The defaults are perfect for me but you can change a lot of settings (e.g. notification, durations, whether to continue automatically) if needed. It continues working while the phone is locked and doesn't seem to use much battery.", "Hello Adrian, Can you make an option for coloring the pause time independent from the applied label? It would help me a lot, since I use the auto-pause option and full screen mode and it's hard to tell wheather the pause started or not. Mersi, Mircea LE: Feature has been added. Thanks a lot!", "Clean interface, just the right amount of functionality, no fuss. If it's reliable too, I'll be happy to pay despite not needing the extra bits. Edit: I bought it!", 'Simple and effective. It does what it claims without any hassles.', "Shaving app, can't import custom notifications though. Fielding notifications (not ringtones) from zedge and its not importing them. The error message is so vague I have no idea as to why. Please pipe system error message under hard coded message do users can problem solve their own issues.", 'Main reasons, why I like this app: 1. It is lightweight, simple and just works. 2. It has beautiful dark theme. 3. It shows timer and gives ability to pause it without need to unlock phone.', "Simple, powerful, exceptional. This app is no-nonsense and has greatly improved my work life and time I spend on personal projects. I really just couldn't be happier with this app!", 'Tried all of such apps out there, but this one is by far the best. One suggestion: pls allow 2 labels so that we can understand what difference can labels make and maybe buy premium if we want more. Superb app! Dont change anythinh please! Love the stats to bits!', 'Very simple interface, this timer allows you to stay focused on your task, having all features needed to be a perfect pomodoro timer. I downloaded it in every device I have! Highly recommended', 'Simple effective and difficult to cheat against. Will defintely be upgrading.', "Best among all pomodoro apps I've tried. I've been searching for this kind of simplicity for a long time. Minimalistic, elegant, intuitive and extra helpful. Love it! Big thanks to the developer 😍", "The stats don't show exact hours total I worked ....I worked for 2 months and the total only shows for this month's.", "Time customisation feature used to be free, this is no longer the case. Mr. developer, if you thought things had not worked for you well, changing the time customisation feature to a paid one wasn't a wise decision. Uninstalled.", 'Nice and simple, does exactly what I need and no more', 'Beautiful, works great, minimalist, and source code available on GitHub. What else do you need? Thanks for developing this!', "Minimalist. Plus I like having gestures or taps where you don't need to be accurate instead of buttons you have to find and press.", "Easily one of my favorite apps. It's appealing, intuitive, simple, and great. If you need a pomodoro timer, use this one."], 'appId': 'com.apps.adrcotfas.goodtime', 'url': 'https://play.google.com/store/apps/details?id=com.apps.adrcotfas.goodtime&hl=en&gl=us'}
