{'title': 'Gotify', 'description': 'Gotify is a server for sending and receiving messages in real-time per web socket. This app subscribes to the web socket and creates push notifications on new messages.\r\n \r\nGotify and this app are open source. You can view the source code on GitHub https://github.com/gotify \r\n\r\nNote: A self-hosted Gotify-server is needed for this app to work, an explanation on "how to set up Gotify server" is displayed on https://gotify.net/docs/install', 'descriptionHTML': 'Gotify is a server for sending and receiving messages in real-time per web socket. This app subscribes to the web socket and creates push notifications on new messages.<br> <br>Gotify and this app are open source. You can view the source code on GitHub https://github.com/gotify <br><br>Note: A self-hosted Gotify-server is needed for this app to work, an explanation on &quot;how to set up Gotify server&quot; is displayed on https://gotify.net/docs/install', 'summary': 'A client for gotify/server.', 'summaryHTML': 'A client for gotify/server.', 'installs': '1,000+', 'minInstalls': 1000, 'score': 4.690909, 'ratings': 55, 'reviews': 25, 'histogram': [1, 0, 3, 7, 44], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.5M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'Gotify', 'developerId': 'Gotify', 'developerEmail': 'gotify@protonmail.com', 'developerWebsite': 'https://gotify.net/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '6812338113691985045', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/DYbY4De4E1rh5Bv84BH6kXwJJImTxQWSrLGYXAjxISfeugSZLS7Cwj_1z8i7Z2powGa4', 'headerImage': 'https://lh3.googleusercontent.com/QBpMKTWKy-5Q3ZGLQXcQ5ejaCksmZa7HgffePDnSzyMUhekOftBCIZW1sU_xukS4UmPd', 'screenshots': ['https://lh3.googleusercontent.com/Dp8LtIa6n8ozl8lzJaD2nt97CJEupNPOtpfrDJ-rMIGOY9LHNMTGA74cRRyOrIgAlGCg', 'https://lh3.googleusercontent.com/ADv8SRp2so55UhkLkNn_WVuA8bXwfQOTRlferCd0R8ArMcKPdC9WrpK9yGoMi5t13FHQ', 'https://lh3.googleusercontent.com/Mj3ERbfAZjhQ89g-KNsA6RSbMaHamS81GmJvccDmB7N07VE7l5nHkyN3pbKsvle_SEo', 'https://lh3.googleusercontent.com/LEkp51NfuUKmQwiB5ae-pSZ9jT_J2Y2Nt_Ps42rq__rMN39IG_MYY2X2dazJp9fHXbY'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 1, 2018', 'updated': 1589047748, 'version': '2.0.12', 'recentChanges': '* Darkmode', 'recentChangesHTML': '* Darkmode', 'comments': ['hey guys, thank you for fantastic gotify! I am testing it right now, writing to run executable as service on my debian and possibly if the app would not eat my battery I can finally move away from notifications via email from my servers. So far I love this very much! Massive thanks! Update: set as service on my debian server and works perfectly', 'Dead simple, behaves exactly as you would expect it. Fully uses message priorities with the notification system as well, which is definitely awesome. The dark theme is also a very nice bonus, many thanks to the development team!', "I like it. It's good to have a self-hosted alternative but sadly the app only supports adding one account/server. Also the dark theme isn't energy saving (it's not pitch black). 🤔", 'Absolutely great if you are a developer or power-user and require a secure and private notifications channel', 'What\'s the point of this? Only receiving from somewhere else? Can\'t send from my phone to the server? I don\'t see it in my share menu, i don\'t see any "send" from right within the app... Kinda lame if looking to replace something like pushbullet.', "Great if you want private push notifications for your programs. Super simple to deploy, I got it working in three minutes. The only downside is that it uses a persistent notification because it doesn't use GCM (which is good), but you can hide it, so it's not too bad. If you want something that uses GCM, use Pushover or some other alternative. I wanted private notifications and Gotify is ideal, thank you for making it.", "Great notification client and server application. Sometimes the websocket connection disconnects and doesn't reestablish until I manually focus the app and refresh the connection, but it usually works really well. Migrated to this from Pushover and haven't looked back.", 'So happy about this. Extremely simple to set up, and I get to keep control of my data. thank you!', 'Keep going guys! Finally an app giving a hope to a privacy-lovers. Thanks.', 'Great app, really useful in use with my server', 'Perfect functionality. Dark mode for the app too please :D', 'Great apps to send notification', 'Very good, thank you.', 'Thank you for your hard work!', 'AMAZING'], 'appId': 'com.github.gotify', 'url': 'https://play.google.com/store/apps/details?id=com.github.gotify&hl=en&gl=us'}
