{'title': 'Mongo Explorer', 'description': 'OPEN SOURCE: Code is available here https://github.com/grennis/mongoexplorer\r\n\r\nOpen Source Mongo database client UI for Android! Featuring\r\n\r\n* Connect to MongoDB databases (MongoHQ, MongoLab, custom...)\r\n* List, add, and remove collections\r\n* Add, edit and delete documents\r\n* Browse documents\r\n* Write custom queries\r\n\r\nThis free application allows one saved connection. To add more connections purchase the in-app unlock.', 'descriptionHTML': 'OPEN SOURCE: Code is available here https://github.com/grennis/mongoexplorer<br><br>Open Source Mongo database client UI for Android! Featuring<br><br>* Connect to MongoDB databases (MongoHQ, MongoLab, custom...)<br>* List, add, and remove collections<br>* Add, edit and delete documents<br>* Browse documents<br>* Write custom queries<br><br>This free application allows one saved connection. To add more connections purchase the in-app unlock.', 'summary': 'Mongo database client for Android', 'summaryHTML': 'Mongo database client for Android', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.47, 'ratings': 340, 'reviews': 159, 'histogram': [91, 13, 30, 51, 153], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '1.9M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Innodroid', 'developerId': 'Innodroid', 'developerEmail': 'admin@innodroid.com', 'developerWebsite': 'http://innodroid.com', 'developerAddress': '5506 Mt Vernon Hwy\nAtlanta, GA 30338', 'privacyPolicy': None, 'developerInternalID': '5204226383773324543', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/9FXDCwHkILStx9EBK_6f53MZgsEvYf16MXWQF2ovjIO-PXAfEzfJZ3hffUsWAA7o1nI', 'headerImage': 'https://lh3.googleusercontent.com/h3Nw0UrgAmFRmUjJKrsCN-FWgo4DXVxya5EXpqZZC0xpz34DiR6xrZj0Ryt9At4VT58', 'screenshots': ['https://lh3.googleusercontent.com/yOSeAmvhvL1a16b9sUWghd4FI0EjyZXosWfEIBlreiINsxGhcX79CTp5fsXuJkYNdWk', 'https://lh3.googleusercontent.com/q3r2NS_8AHgLKTVUNjg2633gPdNAUPVRCkCsAJdsyktoFuab6-cJNAOQw0bun1qmmZno', 'https://lh3.googleusercontent.com/uUOBsgURPRksXzuPuPjFvD56Xpx8NZvfeGIfIpW6X8hgILEnznDMlX9_uap3dwQjy4A', 'https://lh3.googleusercontent.com/0mdwYhXZoW1B74EBH9xfM0byamR2XvtACdUp5yaSamvcFbjLPscDm7Hxl7jW9G_RD7s', 'https://lh3.googleusercontent.com/4iOfdnKUWL_kcA1rShBCJhvRIsdtRs2QQuu5wnwLgPjvuAlmBdvmQkuxL0znJ7YVDP9W', 'https://lh3.googleusercontent.com/5zVwpS-oD3T12Xh9uJRCVaXX9OBM_7lwlrpv5Ms_P8lRst0XHBG8EF2n6NVv5ggb7g', 'https://lh3.googleusercontent.com/p1PuYBku193T6ZuXAlNWHcNufrx8gxF4P-SUt8-YctK8gF9AHqMS8ySoHc3qLipyORGF', 'https://lh3.googleusercontent.com/ldAmRJYsDYNOUATc8uyFQ78FLEMCtPHzwwc80ubcgX-dmGpa9fUFrDUAsgu_505O8CVD'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Oct 18, 2012', 'updated': 1446659964, 'version': '2.0.1', 'recentChanges': 'Fixed compatibility with MongoLab and others', 'recentChangesHTML': 'Fixed compatibility with MongoLab and others', 'comments': ["Horrible app.. Used for steal info. Don't Install", 'Excellent app. Thanks for making my life smooth. 😊', 'If I could only sort collections by doc count. Maybe even submit some basic queries and projections', 'App crashes just trying to do a simple query', 'Nice and simple , works well', 'App crashes when try to open collection', 'explorer is good but delete/drop functions should not be included directly in overflow menu, keep it discreet to avoid accidental click. Also,  please provide the following feature - sync db every 15 minutes and allow us to set alert notification on a collection for events like new row created, row modified, value of column set above a particular limit, etc.  Notifications are very useful to notify developer of any new important event.  Also, how safe are our db credentials if we use it in your app? you can literally tamper with our data without our knowledge? are we in safe hands?', 'App is awesome. But: 1)Date formating - convert dates to readable format like in robomongo 2)I have some error issues while trying to open collection in which each document contains above 150 000 numbers. Hope this feedback will help you to improve app quality', "Doesn't work with any android mongodb implementation. Runs commands which are unsupported or unknown like buildinfo and fails completely. It should just connect and fetch collections and leave anything else as optional info and data and don't fail on unnecessary stuff. So poor.", 'Perhaps you can embeds mongo shell so we can run more complicated query. Feature to sort query result is also needed', "Couldn't connect to a replica set. Could not drill into collections, crashed each time I tried to access any collection. I must provide a database, why?", 'Nice app. Thanks. One suggestion I would have would be to provide a toggle for the display of dates between epoch seconds as stored in the document, and interpretation of epoch time as human readable UTC timestamps.', "The app doesn't work. It connects fine, but switching databases doesn't work. So if my user is in a different db than the data, I can't view the data.", 'Very good app but unfortunately, there is no ssh connectivity :(', 'The moment I click on collection app is crashing on marshmallow 6.0.1', 'I am unable to connect to my mongoDB from Atlas.', "Cheesy app design and doesn't support ssl connections.", "Doesn't work. Won't connect to DBs that work with mongo shell from other hosts.", 'Needed to drop a collection in a hurry. Found the app, signed in, dropped the collection. That easy.', 'Please add support for queries with aggregate. Without support for complex queries it is of less use for large databases. Sort and limit functions also required.', 'App crashes when I open collection', 'Adding sort and projection would be very helpfull. But thanks anyway', 'There does not seem to be a way to specify an authentication database when connecting with a username and password.', 'The app should support connection over ssh tunnel. Connecting to private cloud is not possible without ssh tunnel using the app.', 'So far, so good! Fast access to my databases. Edited a couple of documents without issues.', 'Very good for watching the data on the go, by keeping it simple the complex actions have been shyed off', 'The first MongoDB viewer that worked for MLab, great app, very easy to use, and open source!', 'No SSH so limited use', '1. Query sort. 2. Display date time in UTC format.', 'This app saved my day. Thanks a ton.', 'Awesome app! A SSH connection would defenetly come in handy.', 'I find this app really useful. I recommend it for a  "pocket mongodb accessor "', 'Would like if developers could include a table view.', 'no ssl support :/', 'Pretty basic functionality, could do a lot more', 'Great for quick db checking', 'No SSH', "It's  productive app", 'Easy, fast, straightforward, clear....', 'Works well'], 'appId': 'com.innodroid.mongobrowser', 'url': 'https://play.google.com/store/apps/details?id=com.innodroid.mongobrowser&hl=en&gl=us'}
