{'title': 'Hacker Live Wallpaper', 'description': 'A live wallpaper of binary sequences streaming down your screen. Should make any hacker feel at home.\r\n\r\nWorried about battery life? This wallpaper is highly optimized so it uses the same amount of battery as any other regular live wallpaper despite the constant animations.\r\n\r\nNow with customizable settings! Now also supports the characters from the Matrix! Try it out by clicking on the "Character set" setting.\r\n\r\nYou can either set the wallpaper in the Android settings, or click the "Set as wallpaper" option in the app itself.\r\n\r\nThis project is open source and available at https://github.com/gsingh93/hacker-live-wallpaper. If you use the code in any of your projects all that I ask is that you let me know by email. \r\n\r\nIf you have any questions, comments, or suggestions, email me. If the app crashes, Android will ask you if you want to report it or do nothing. Please report it, it helps me figure out what\'s wrong. Emailing me after reporting it is the best option.\r\n\r\nChangelog:\r\n- Version 1.7.0\r\n - Switched build system to Gradle\r\n - Removed HoloEverywhere and ActionBarSherlock librares (reduce APK size)\r\n - Added option to set wallpaper from within app\r\n\r\n- Version 1.6.1\r\n - Minor library updates\r\n\r\n- Version 1.6\r\n - Added a bit of depth to the animations and added a setting to enable/disable depth\r\n\r\n- Version 1.5\r\n - Fixed a settings bug that caused the wallpaper to crash\r\n - Fixed a bug with changing the text size\r\n - Memory optimization\r\n - Added a setting to change the background color\r\n\r\n- Version 1.4\r\n - Settings! Finally!\r\n - Fixed a bug that caused a force close after too many screen rotates.\r\n - Memory and performance improvements\r\n\r\n- Version 1.3\r\n - Two bug fixes\r\n\r\n- Version 1.2\r\n - Major performance fixes\r\n - Duplicate bit sequence bug fix\r\n\r\n- Version 1.1\r\n - Fixed for Android 2.2+', 'descriptionHTML': 'A live wallpaper of binary sequences streaming down your screen. Should make any hacker feel at home.<br><br>Worried about battery life? This wallpaper is highly optimized so it uses the same amount of battery as any other regular live wallpaper despite the constant animations.<br><br>Now with customizable settings! Now also supports the characters from the Matrix! Try it out by clicking on the &quot;Character set&quot; setting.<br><br>You can either set the wallpaper in the Android settings, or click the &quot;Set as wallpaper&quot; option in the app itself.<br><br>This project is open source and available at https://github.com/gsingh93/hacker-live-wallpaper. If you use the code in any of your projects all that I ask is that you let me know by email. <br><br>If you have any questions, comments, or suggestions, email me. If the app crashes, Android will ask you if you want to report it or do nothing. Please report it, it helps me figure out what&#39;s wrong. Emailing me after reporting it is the best option.<br><br>Changelog:<br>- Version 1.7.0<br> - Switched build system to Gradle<br> - Removed HoloEverywhere and ActionBarSherlock librares (reduce APK size)<br> - Added option to set wallpaper from within app<br><br>- Version 1.6.1<br> - Minor library updates<br><br>- Version 1.6<br> - Added a bit of depth to the animations and added a setting to enable/disable depth<br><br>- Version 1.5<br> - Fixed a settings bug that caused the wallpaper to crash<br> - Fixed a bug with changing the text size<br> - Memory optimization<br> - Added a setting to change the background color<br><br>- Version 1.4<br> - Settings! Finally!<br> - Fixed a bug that caused a force close after too many screen rotates.<br> - Memory and performance improvements<br><br>- Version 1.3<br> - Two bug fixes<br><br>- Version 1.2<br> - Major performance fixes<br> - Duplicate bit sequence bug fix<br><br>- Version 1.1<br> - Fixed for Android 2.2+', 'summary': 'A live wallpaper of binary sequences streaming down your screen', 'summaryHTML': 'A live wallpaper of binary sequences streaming down your screen', 'installs': '500,000+', 'minInstalls': 500000, 'score': 4.313993, 'ratings': 5936, 'reviews': 1607, 'histogram': [587, 172, 293, 617, 4264], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '579k', 'androidVersion': '2.2', 'androidVersionText': '2.2 and up', 'developer': 'Gulshan Singh', 'developerId': 'Gulshan+Singh', 'developerEmail': 'gsingh2011@gmail.com', 'developerWebsite': 'http://www.gulshansingh.com', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8458420877447255433', 'genre': 'Entertainment', 'genreId': 'ENTERTAINMENT', 'icon': 'https://lh3.googleusercontent.com/maxnLEOGHtINgqd_B7OisImo9t2i9jP1ZDaelrgTF3x0NNi8QAGkqrXS-gyI8leJ1_o', 'headerImage': 'https://lh3.googleusercontent.com/NTsapUW5UZadzQqHrudoc1_B438A6KTu1a70Hc0nFLCdOciw_vHO-ylisSZsPRVzxnQ', 'screenshots': ['https://lh3.googleusercontent.com/qJDKqK3GTSIaxroCamrH8fwfnSgY2yYpbqX2TGt0NUls70rUW-TwmCoIkKlkjROO9eU', 'https://lh3.googleusercontent.com/tbkkfAIl3UxnkOx_b-ev-Z5HvyAMGeMcPsDvaCeoCPr2uNlsW-abkAj0aR3aUAhVIC8', 'https://lh3.googleusercontent.com/7ik4ppxUAYvcXjIDect6lsNQSKXf0IElwcXfbmxMici4SF6PNc4zgy2JQmPcnQjis2fL', 'https://lh3.googleusercontent.com/f240X3PwN5I_fGtEhRGBOKfQwgYnz_o934oPDpgkZAaTcApB008fzH_ahMKZ7Zeexw', 'https://lh3.googleusercontent.com/SaQIFxlyjsoxenw6pctUDwAvK7-OeL8icxGtZEIv3AZ6Dmnch2t-uk-Nxoxh--BER78', 'https://lh3.googleusercontent.com/yQ_sRVRwCXU1eN1WJYaY5OtRDlBEMjvLjU3n7KKvnnatJuYR2ca0M0aMJN_SaNDczJlS', 'https://lh3.googleusercontent.com/pBnbzaCS7jWlSThn2sP35kdC3BN5RU_0PS8eqCqVmLKVZxV6GMhIhyoH1C-4s5V5mfE', 'https://lh3.googleusercontent.com/6f7tjpfeqNTU-2FzjgEo4qvnZ-R352hcf8LsgVD6eqianEFmF4OjX3eKcuxJP11xtg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 2, 2012', 'updated': 1420499722, 'version': '1.8.2', 'recentChanges': 'Fixed some issues with preferences not being saved.\r\nFixed some crashes.\r\n\r\nAdded ability to customize character set, and added Matrix animation!', 'recentChangesHTML': 'Fixed some issues with preferences not being saved.<br>Fixed some crashes.<br><br>Added ability to customize character set, and added Matrix animation!', 'comments': ['LOVE IT! LOVE IT! LOVE IT! Did I mention I think this live wallpaper is AWESOME!? Well it is. Keep up the great work Developer team.', "Yes it bugs out every once in a while. No, it's not perfect, only because there is no option for 16 bits right now. Other than that m, its actually the best live code falling app you can get. At least, the most customizable.", 'No ads, looks great and you can change the lettering. Great customization really good app', "Nice works well but maybe do a stability fix I had to delete because it was forcing my CPU to over heat and I guess in simple terms work to hard to process the app I'm using a Galaxy S7 maybe its cuz the phone is 3 models behind but yea thank you other wise love the wallpaper", 'No ads, not even 1MB of space, and it has customization!', 'Looks good with my Tokyo Goul theme I have going when I made the texts dark red. Good job with the flow too.👍', 'It is a cool app but I gives me a headache after awhile but other than that it is an app for u if u like technology and live wallpaper', 'I like this all bcoz, it is #lightweight #lagless #Non-Ady # Clean ui #low battery drainage #Less ram consumer. So keep up the good work devs.', "Best Matrix live wallpaper yet! Totally nailed it bro😘 Didn't notice any major battery drain Animation is good enough Looks catchy!", "It's really an amazing app I don't rate like ever but this I just gotta because I like it and show every one how cool it is.", "Loved it . It did pretty much exactly what it's supposed too", 'Looks nice, it kinda lags my phone after a few weeks', 'Beautiful wallpaper, I ll give 5 stars if i could be able to set it only as lock screen.', 'small amount of space needed is great for all those phone with alot of thimgs downloaded', "Good thing pop-ups don't come up!😊", "It's fun to look at but had a lot of adds", "It's good not great ate 1rst ate 1rst it took some time for the numbers to a just then when I turned my fine on its all good. It's a great app", 'Very good app. Thank you for creating it.', 'Makes low end phones unusable.', 'did not work at all and would not let me change eny of the setings it would be beter not to get this app at all and find one that will actually work.', "It is really cool but I can't change the color", 'THANK YOU! I thought these were dumb but this one is super awesome!', 'I need more of these that are true, not fake and its one of the true ones', 'THIS WAS SO HORRIBLE!! FIX YOUR STINKIN APP!!', 'I think that this will be a good wallpaper to say, Hey, Spider, Your A Hacker, You Cant Go Back', 'This app is good because it can show your friends', 'Really good and defiantly worth a download', 'Ive only had this app for one day but I already LOVE it!', "This is the best wall paper's aver it moves", 'Its lagging on my phone', 'It was pretty good but, not what I was imagining.', 'Good beautiful and fast i like it', 'Really very good app', "It's ok I mean I like it but it's just a wallpaper", "I like the background because I really am a hacker so my cousin does not believe me that I am a hacker so I'm going to take his battle pass and take all his skins from him then he will believe I am a hacker and then after that I will hack all his friends and then after that he'll be scared to play fortnite with me if he does something bad to be in fortnite so basically I will take all the skins and the battle pass from him and I will just hack it and plus I will get the save the world mode because I don't have it so I'm just going to use a hack to get it", 'I used to have it, it was cool my sister deleted it but she got new phone for Christmas so back to this wall paper', "It is good but i'm not keeping. There isn't anything wrong with it I just don't want. But you should get it", 'Will you update?????', 'I am Neo. This is the wallpaper - Matrix style. #LulzWarfare', 'It wont let me set the wallpaper.'], 'appId': 'com.gulshansingh.hackerlivewallpaper', 'url': 'https://play.google.com/store/apps/details?id=com.gulshansingh.hackerlivewallpaper&hl=en&gl=us'}
