{'title': 'Haven: Keep Watch', 'description': 'Haven is for people who need a way to protect their personal spaces\r\nand possessions without compromising their own privacy. It is an\r\nAndroid application that leverages on-device sensors to provide\r\nmonitoring and protection of physical spaces. Haven turns any Android\r\nphone into a motion, sound, vibration and light detector, watching for\r\nunexpected guests and unwanted intruders. We designed Haven for\r\ninvestigative journalists, human rights defenders, and people at risk\r\nof forced disappearance to create a new kind of herd immunity. By\r\ncombining the array of sensors found in any smartphone, with the\r\nworld’s most secure communications technologies, like Signal and Tor,\r\nHaven prevents the worst kind of people from silencing citizens\r\nwithout getting caught in the act.\r\n\r\n## Project Team\r\n\r\nHaven was developed through a collaboration between Freedom of the\r\nPress Foundation and Guardian Project. Prototype funding was\r\ngenerously provided by FPF, and donations to support continuing work\r\ncan be contributed through their site:\r\nhttps://freedom.press/donate-support-haven-open-source-project\r\n\r\n## Safety through Sensors\r\n\r\nHaven only saves images and sound when triggered by motion or volume,\r\nand stores everything locally on the device. You can position the\r\ndevice’s camera to capture visible motion, or set your phone somewhere\r\ndiscreet to just listen for noises. Get secure notifications of\r\nintrusion events instantly, and access logs remotely or anytime\r\nlater.\r\n\r\nThe following sensors are monitored for measurable change, and then\r\nrecorded to an event log on the device:\r\n\r\n* Accelerometer: Motion and vibration of phone\r\n* Camera: Motion in the phone’s visible surroundings from front or back camera\r\n* Microphone: Noises in the environment\r\n* Light: Change in light from ambient light sensor\r\n* Power: Detect device being unplugged or power loss/shutdown', 'descriptionHTML': 'Haven is for people who need a way to protect their personal spaces<br>and possessions without compromising their own privacy. It is an<br>Android application that leverages on-device sensors to provide<br>monitoring and protection of physical spaces. Haven turns any Android<br>phone into a motion, sound, vibration and light detector, watching for<br>unexpected guests and unwanted intruders. We designed Haven for<br>investigative journalists, human rights defenders, and people at risk<br>of forced disappearance to create a new kind of herd immunity. By<br>combining the array of sensors found in any smartphone, with the<br>world’s most secure communications technologies, like Signal and Tor,<br>Haven prevents the worst kind of people from silencing citizens<br>without getting caught in the act.<br><br>## Project Team<br><br>Haven was developed through a collaboration between Freedom of the<br>Press Foundation and Guardian Project. Prototype funding was<br>generously provided by FPF, and donations to support continuing work<br>can be contributed through their site:<br>https://freedom.press/donate-support-haven-open-source-project<br><br>## Safety through Sensors<br><br>Haven only saves images and sound when triggered by motion or volume,<br>and stores everything locally on the device. You can position the<br>device’s camera to capture visible motion, or set your phone somewhere<br>discreet to just listen for noises. Get secure notifications of<br>intrusion events instantly, and access logs remotely or anytime<br>later.<br><br>The following sensors are monitored for measurable change, and then<br>recorded to an event log on the device:<br><br>* Accelerometer: Motion and vibration of phone<br>* Camera: Motion in the phone’s visible surroundings from front or back camera<br>* Microphone: Noises in the environment<br>* Light: Change in light from ambient light sensor<br>* Power: Detect device being unplugged or power loss/shutdown', 'summary': 'Protect personal spaces and possessions without compromising privacy', 'summaryHTML': 'Protect personal spaces and possessions without compromising privacy', 'installs': '500,000+', 'minInstalls': 500000, 'score': 4.013393, 'ratings': 2267, 'reviews': 1090, 'histogram': [333, 80, 202, 253, 1396], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '14M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Guardian Project: Apps You Can Trust', 'developerId': '6502754515281796553', 'developerEmail': 'support@guardianproject.info', 'developerWebsite': 'https://guardianproject.github.io/haven/', 'developerAddress': 'Guardian Project\nc/oOliver+Coady, Inc\n20 Broadway, Suite 6\nValhalla NY 10595', 'privacyPolicy': 'https://guardianproject.info/home/data-usage-and-protection-policies/', 'developerInternalID': '6502754515281796553', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/eBXVKsqYX9cAWN7UC6h_gjVL9z6Fo7wgGf5V7_7FHu6C-YLGLWTaJTDBY9U-RZC6Tw', 'headerImage': 'https://lh3.googleusercontent.com/H6EibWwlby7HZu-u-uhgvPQnU7CFeZS_gVkYWhZmeBmYEdUGFL-Bc1yZnbTMDkqtAp4', 'screenshots': ['https://lh3.googleusercontent.com/Vf3pOnH2bLWafmnEhI35BtpF3dGVGKxOYfRJZD53PlDZcGdAbuR5zy1C9SAeGQa9kd9y', 'https://lh3.googleusercontent.com/yPts1EGIX09bARB7M70sfI17HOjNohy6tQUVifS_bwqYWjhj_2U7zPilmOiMiRo1rH36', 'https://lh3.googleusercontent.com/zvnArlmIIV3wC53ImpBTVpZw1KzZxz3AX00c3i7_W2aaIWZ4lm6ODZMBNuIjCX4QdA', 'https://lh3.googleusercontent.com/SIzIerHqJssaZ0-iae8Fs-l8ovFWqvjwKsITwZ1RfdrUj_ZWwm-CDJbb79uBiebl2wDj', 'https://lh3.googleusercontent.com/pUiGJWan5IqPWzhBiw1qIYcGm7Qqd-4GOGbp16lkMjgiM35KXY4DrEKCGbLjzF-ib3I', 'https://lh3.googleusercontent.com/VcdrnX706O5nH8NmVDQW0v48AfkfWu5emdfp_W8alWTEHNcRD-5XXzJScqLHJJgBKzw', 'https://lh3.googleusercontent.com/6zL4kj183xf-3k9Svx3bA_2D625hdniAVlYigRZHuWGMcw8jcse47d82Mk0b_y57IYk', 'https://lh3.googleusercontent.com/epPaBOYdevidO_fcKXxoOy2lBVIHpojGlUUY0YGjyVuoZmjJeGNnVcBXKpxMQmhtivdl'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 21, 2017', 'updated': 1555520502, 'version': '0.2.0-beta-5-signed', 'recentChanges': 'WARNING: DUE TO CHANGES IN GOOGLE POLICY, HAVEN CAN NO LONGER SEND SMS TEXT MESSAGES. PLEASE USE SIGNAL NOTIFICATIONS INSTEAD.\r\n\r\nBig thanks to @lukeswitz, @archie94 and @fattire for the excellent trudging and grinding!\r\n\r\n- Removed SMS feature due to Google restrictions #364\r\n- Improved usability and reliability of Signal number registration\r\n- Improved power monitoring #371\r\n- Custom heartbeat status #374\r\n\r\nMore at: https://github.com/guardianproject/haven/releases/tag/0.2.0-beta-5-signed\r\n', 'recentChangesHTML': 'WARNING: DUE TO CHANGES IN GOOGLE POLICY, HAVEN CAN NO LONGER SEND SMS TEXT MESSAGES. PLEASE USE SIGNAL NOTIFICATIONS INSTEAD.<br><br>Big thanks to @lukeswitz, @archie94 and @fattire for the excellent trudging and grinding!<br><br>- Removed SMS feature due to Google restrictions #364<br>- Improved usability and reliability of Signal number registration<br>- Improved power monitoring #371<br>- Custom heartbeat status #374<br><br>More at: https://github.com/guardianproject/haven/releases/tag/0.2.0-beta-5-signed<br>', 'comments': ["Uninstalled within 5 minutes... Adjustment for motion turned me off almost immediately... Its too sensitive and hard to control... Just don't care for the interface... Needs tweaking.", 'All I wanted (and expected from the public hype on this app) is an app that can repurpose my old smartphone into a "security camera" that can send a live feed OVER WIFI to either another WiFi connected smartphone or PC. I did not expect the "old" phone to require an active phone company account to become a "security camera".  Instead, Haven appears to require your repurposed phone STILL have an active phone account, and only sends data/images via messaging services. No continuous live video feed over WiFi is possible...unless I missed it. Also, the initial "configuration" protocol guides you through MANDATORY setups for movement, vibration, and sound, each of which display arbitrary "sensitivity" numbers at you expecting you to know what they mean.as you adjust them. The decibel number is somewhat obvious, but even then as an example of needless complexity...in a quiet room with an "average" decibel reading, according to the app, of about 30 (A or C weighting unknown), the adjustment numbers rapidly change from about 40 to over 90 without explaining why and how it relates to sensitivity. You have no control over the numbers as they appear to constantly and rapidly change randomly.', 'read about this, but it did not work, could not get anything to work, just a out of focus, badly colored mess of a video. too esoteric for general use. Alfred, on the other hand, setup and ran beautifully first time. this is too nerdy.', 'What is the oldest "old phone" that this app will work on? I\'ve tried to find this information, but have not found it so far. It\'s not much good if it only runs on 7.1.1 or later. That\'s my current phone\'s OS. The principle is good though.', "The idea is great but it's so insanely buggy. Developer really needs to put more effort into testing and bug squashing. I wouldn't mind paying for the app if it was a quality product.", 'The app has soo much bug the monitor feature is not working and notification sending feature using number is not working, registration of number is not working, there is no recorded log files .', "Why don't you use f-droid. Such a shame that you talk about privacy and is following Google terms and conditions. What a joke.", 'Maybe a bit confusing for a novice user, but it is very powerful once you understand all the features!', "All is well BUT why don't you add a app locker to this app with a finger print like other apps viz: Google pay, whatsapp?", 'Amazing app. I just keep thoughting to how to use mobile phone as a CCTV camera system. Thanks for your work.', 'Nice apps, need improvement for the average user and keep an eye on battery draining issue. Thank you', 'Just installed and isnt user friendly dosent walk you through the basics also motion detected 4 Times yet wont give feedback also app closed 3 times forcing me to reopen & restart app.', 'There is no any sounds log detected only first time detect sound and later no any log ?!!!!', 'This app innovates towards claiming back or privacy. Enough said, this is there best out there. Been really satisfied so far.', "doesn't record anything but the notifications go off. logs filled with blanks..clear log ineffective", 'Best app in existence to ward against evil maid, et al type situations.', "Does what it says Works great! I hope this app isn't going away they got a text saying Haven was being just stopped", 'Force closed , application is getting crash', 'Thank you Snowden for the app. I wish to know if someone monitors or a govt hacking into my WhatsApp or other apps on my phone. I have recommended this app for my friends and partners.', 'for journalist we need this app. Excellent..!!', 'spyware camera is looking and recording remotely PERVS picture look blury thats because camera remotley recording through your camera WHATS UP SNOWDEN didnt ad that feature google or nsa did.', 'The Perfect Idea which will make users incredible experience with pure logs', 'It a great app...... So much thanks adward snowden...... to create this app...', 'Very Good, does what it says.', 'Hi guys when ever i try to delete all logs. The app crashes what should i do', 'Keep working. Great concept. Open Source!!!', "Everything about this app Spells (NSA) For dummy's!", 'this app erased evrything from phone like pics,audio,videos but why?', "FORCES THE USE OF THE GOOGLE TETHERED, (GSM) SIGNAL APP, AND ACTUALLY PROMOTES GOOGLE IN THIS WAY. THIS APPARENTLY, IS SNOWDEN'S BRIGHT IDEA ON PRIVACY. I USED TO RESPECT SNOWDEN, BUT HE IS SO IGNORANT ABOUT PRIVACY, DUE TO BEING RAISED BY THE GOVERNMENT, THAT HE'S ACTUALLY HELPING THEM MORE THAN US, BY DEFAULT. LESSON 1: DON'T TRUST EX NSA/CIA, UNLESS YOU'VE CHECKED THEIR PULSE 3 TIMES, & THEY ARE PRONOUNCED DEAD...BY HEADSHOT. LESSON 2: COME BACK 3 DAYS LATER, & REPEAT. LESSON 3: ONE MORE TIME", 'Best app of its kind in this century💯💯', "Edward Snowden, I'm from one of the least developed 3rd world countries 🇵🇬 in the world where internet access is a very expensive privilege. BUT I'm your biggest fan and I give you 5 Stars because You're an Inspiration!", 'ok this app is not bill snowdens i contacted developer email and got a 6diget complaint number for receipt (fedral trade commission and other government agency s use that and said my complaint will be sent to support department its icaan or nsa .', 'Wish it was on FDroid...', 'where do we tip this? more ppl like Ed Snowden should exist. i got no respect for nsa,fbi,cia or mi5 etc. we need more devs to commit to security for users', 'If Michael Bazzell approves, i give it 5 stars!', 'Snowden you are a true patriot.', 'WHERE IS THE OPTION FOR STORAGE?', 'Keep the good work guys', 'The first! Awesome', 'Thanks for ur protection'], 'appId': 'org.havenapp.main', 'url': 'https://play.google.com/store/apps/details?id=org.havenapp.main&hl=en&gl=us'}
