{'title': 'PixelKnot: Hidden Messages', 'description': "Have a secret that you want to share? Why not hide it in a picture? With PixelKnot, only your friends with the secret password can unlock your special message. Everyone else just sees a pretty picture. It’s a fun and easy way to share hidden messages without anyone knowing. Take those pixels, twist them in a knot, and see for yourself!\r\n\r\n★ DISGUISE YOUR MESSAGES: Pictures are public, the text is hidden inside. Even a trained eye will think the image is unedited. It’s security through obscurity!\r\n★ FOR YOUR EYES ONLY: Put a password on the secret message to make sure that no one can read it except the person it’s meant for.\r\n★ EASY IMAGE CHOOSER:  You can use the camera to take photos, or just use photos you’ve already taken.\r\n★ INVISIBLE CHANGES: Even a trained analyst analyst shouldn’t be able to detect any message. The image bytes should seem undistorted.\r\n★ SHARE ACROSS PLATFORMS: Want to share the images over email, file sharing tools (like Dropbox & Sparkleshare), social media (like Google+ & Flickr) or directly through Bluetooth or NFC? Not a problem! The messages are still recoverable on the other side. We'll have even more tools (like Facebook) working soon, so stay tuned!\r\n★ AD-FREE: We want your love, not your money.\r\n★ MATHEMATICALLY SECURE: We use the newly developed steganography algorithm F5 which implements matrix encoding to improve the efficiency of embedding and employs permutative straddling to uniformly spread out the changes over the whole steganogram.\r\n★ ATTACK RESISTANT: We’ve launched attacks on images with messages hidden in them using a specialized version of stegdetect, an automated tool for detecting steganographic content in images. In most cases, the pictures have been impervious to attack. We will be including detection in an upcoming version of the application so you can easily test it yourself!\r\nDon’t see your language? Join us and help translate the app:\r\nhttps://hosted.weblate.org/projects/guardianproject/pixelknot\r\nhttps://hosted.weblate.org/projects/guardianproject/pixelknot-metadata\r\n\r\n***Learn More***\r\n★ ABOUT US: Guardian Project is a group of developers that make secure mobile apps and open-source code for a better tomorrow.\r\n★ OUR WEBSITE: https://GuardianProject.info.\r\n★ ON TWITTER: https://twitter.com/guardianproject\r\n★ OPEN-SOURCE: PixelKnot is free software. You can take a look at our source code, or join the community to help make it even better: https://github.com/guardianproject/pixelknot\r\n★ MESSAGE US: Are we missing your favorite feature? Found an annoying bug? Please tell us! We’d love to hear from you. Send us an email: support@guardianproject.info\r\n\r\n***Disclaimer***\r\nThe Guardian Project makes apps that are designed to protect your security and anonymity. The protocols that we use are widely regarded as the state of the art in security technology. While we are constantly upgrading our software to combat the latest threats and eliminate bugs, no technology is 100% foolproof. For maximum security and anonymity users must utilize best practices to keep themselves safe. PixelKnot is still an experimental application and should not be used in real world deployments. You can find a good introductory guide to these topics at https://securityinabox.org", 'descriptionHTML': 'Have a secret that you want to share? Why not hide it in a picture? With PixelKnot, only your friends with the secret password can unlock your special message. Everyone else just sees a pretty picture. It’s a fun and easy way to share hidden messages without anyone knowing. Take those pixels, twist them in a knot, and see for yourself!<br><br>★ DISGUISE YOUR MESSAGES: Pictures are public, the text is hidden inside. Even a trained eye will think the image is unedited. It’s security through obscurity!<br>★ FOR YOUR EYES ONLY: Put a password on the secret message to make sure that no one can read it except the person it’s meant for.<br>★ EASY IMAGE CHOOSER:  You can use the camera to take photos, or just use photos you’ve already taken.<br>★ INVISIBLE CHANGES: Even a trained analyst analyst shouldn’t be able to detect any message. The image bytes should seem undistorted.<br>★ SHARE ACROSS PLATFORMS: Want to share the images over email, file sharing tools (like Dropbox &amp; Sparkleshare), social media (like Google+ &amp; Flickr) or directly through Bluetooth or NFC? Not a problem! The messages are still recoverable on the other side. We&#39;ll have even more tools (like Facebook) working soon, so stay tuned!<br>★ AD-FREE: We want your love, not your money.<br>★ MATHEMATICALLY SECURE: We use the newly developed steganography algorithm F5 which implements matrix encoding to improve the efficiency of embedding and employs permutative straddling to uniformly spread out the changes over the whole steganogram.<br>★ ATTACK RESISTANT: We’ve launched attacks on images with messages hidden in them using a specialized version of stegdetect, an automated tool for detecting steganographic content in images. In most cases, the pictures have been impervious to attack. We will be including detection in an upcoming version of the application so you can easily test it yourself!<br>Don’t see your language? Join us and help translate the app:<br>https://hosted.weblate.org/projects/guardianproject/pixelknot<br>https://hosted.weblate.org/projects/guardianproject/pixelknot-metadata<br><br>***Learn More***<br>★ ABOUT US: Guardian Project is a group of developers that make secure mobile apps and open-source code for a better tomorrow.<br>★ OUR WEBSITE: https://GuardianProject.info.<br>★ ON TWITTER: https://twitter.com/guardianproject<br>★ OPEN-SOURCE: PixelKnot is free software. You can take a look at our source code, or join the community to help make it even better: https://github.com/guardianproject/pixelknot<br>★ MESSAGE US: Are we missing your favorite feature? Found an annoying bug? Please tell us! We’d love to hear from you. Send us an email: support@guardianproject.info<br><br>***Disclaimer***<br>The Guardian Project makes apps that are designed to protect your security and anonymity. The protocols that we use are widely regarded as the state of the art in security technology. While we are constantly upgrading our software to combat the latest threats and eliminate bugs, no technology is 100% foolproof. For maximum security and anonymity users must utilize best practices to keep themselves safe. PixelKnot is still an experimental application and should not be used in real world deployments. You can find a good introductory guide to these topics at https://securityinabox.org', 'summary': 'Have a secret that you want to share? Why not hide it in a picture?', 'summaryHTML': 'Have a secret that you want to share? Why not hide it in a picture?', 'installs': '100,000+', 'minInstalls': 100000, 'score': 2.6330276, 'ratings': 1101, 'reviews': 415, 'histogram': [565, 80, 20, 60, 373], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.9M', 'androidVersion': '4.2', 'androidVersionText': '4.2 and up', 'developer': 'Guardian Project: Apps You Can Trust', 'developerId': '6502754515281796553', 'developerEmail': 'support@guardianproject.info', 'developerWebsite': 'https://guardianproject.info/apps/pixelknot', 'developerAddress': 'Guardian Project\nc/oOliver+Coady, Inc\n20 Broadway, Suite 6\nValhalla NY 10595', 'privacyPolicy': None, 'developerInternalID': '6502754515281796553', 'genre': 'Communication', 'genreId': 'COMMUNICATION', 'icon': 'https://lh3.googleusercontent.com/FvCOcLGQhXF1_4TSvmNOn45Q1hby8V0e6FD1fbG3PuXel2oIGZT1qgTbBl-ij9Efn2lE', 'headerImage': 'https://lh3.googleusercontent.com/6ckKwAwvvrxuFJ5R8YIPrCgNnVCvCAg_lxoQJxCL9MgWiIb-qTQjzfIRoD-vxW5CHvEH', 'screenshots': ['https://lh3.googleusercontent.com/ySXH4n1mV0xB6rsyJlvVKiTFoOxs43k7URxyDen5gAMHGD5RbiZxF23g_FhfctxXccI', 'https://lh3.googleusercontent.com/a64hWFSSrI7KyzVOvtm96HjeduDtawL9AQ3dgxYiXzdygB7M8HuDtnLxigUOPSFW48g', 'https://lh3.googleusercontent.com/6r6ctsYWwtUHqDTu4z5XnarGVCoO6Vh2d6mdTYsz-NTLzydyCZrxO5OIlVRrrs9xLw', 'https://lh3.googleusercontent.com/MZ1uHi08jIf7Ggnhz5pmsbgABJW9g787RK-gap0x37I_cN5-ghYPnUI_24X89dvZ3Y8', 'https://lh3.googleusercontent.com/I60yIKzYV2o9uo2E3HtdwJWFB7jxctq8jHPKEK7fm9SustTYY_Y3s7h1bBJB-w4nLoSQ', 'https://lh3.googleusercontent.com/_lmZO7IrVLV_TRLiv2pxhSq5XeHmM7zlDOofUs4jHXOnB4jJPlnbGaaQDtidXmCrNasv', 'https://lh3.googleusercontent.com/otEJ448K9KgK9FstOgt7ydKGrHVERVhF0fgzRskA0we5C-CnohuQfIloa3maR6bZhZWb', 'https://lh3.googleusercontent.com/ylnejAFDiIRPAakHidY4_zFLwZMZHjy-zlUc72Qgd-XFbphWpHubTkCt9LfycISg3g'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 15, 2013', 'updated': 1487344754, 'version': '1.0.1', 'recentChanges': 'Big update to v1.0.1:\r\n* Fix in JPEG encoding to defend against detection attack\r\n\r\nBig update to v1.0.0:\r\n* A brand new user experience... simple and streamlined!\r\n* Now compatible with the latest Android OS and devices\r\n\r\nNew and improved in v0.3.3:\r\n* Updated F5 steganography library\r\n* Improved password security feature\r\n* Cleaned up user interface for a more modern look\r\n* Added background processing of encode/decode steps (you can do other things while it works!)\r\n* More language support than ever!\r\n', 'recentChangesHTML': 'Big update to v1.0.1:<br>* Fix in JPEG encoding to defend against detection attack<br><br>Big update to v1.0.0:<br>* A brand new user experience... simple and streamlined!<br>* Now compatible with the latest Android OS and devices<br><br>New and improved in v0.3.3:<br>* Updated F5 steganography library<br>* Improved password security feature<br>* Cleaned up user interface for a more modern look<br>* Added background processing of encode/decode steps (you can do other things while it works!)<br>* More language support than ever!<br>', 'comments': ['Worked great... then all of a sudden crashes after entering the text and pw when sending message... no updates in years. Are the developers even paying attention?', "It's not working 😟, it have some bugs and crashes many time please try to repair as soon as possible", 'Was working great until all the latest android updates. Now crashes constantly', "Be careful. I tested by choosing a photo, writing message and sending to myself. The email came with a different photo from my gallery. It was not next to or remotely similar to the photo I put the test message on. Imagine if a personal photo went to whomever you were sending the secret message to. Scary. Also, since first test and then second test the darn app won't work. Also tried retrieving messages from photos with no message or with wrong password and it just spins. Should give a message like no message detected or incorrect password.", 'Crashes constantly when attempting to process text into picture. Pity.', "It looks like this app has been abandoned. No update for nearly 3 years. It should be considered unsafe for its intended purpose. It's a shame really, it was good when it worked.", 'Not working, choose photo,added message, added password,Nothing happened.', 'Bad app..everything disappears all of a sudden.', 'It always crashes when instructed to work. Needs an update.', 'Tried twice, each time the app shut down at the 8 second mark. Nice concept, poor coding', "great concept but app is broken crashes every time and I've been unable to use it so far would love to see a working version", 'Completely useless, as the app always crashes when trying to export anything.', 'The app crashed when it starts encrypting message.', 'keeps crashing at 8% fix before uploading an app to play store that dont work please need better quilaty control', 'when i set a messag then encoding, this app is continuously unfortunately stoped.', 'Works kust as described! will there be an opportunity to open messages from app nit through file managers "open with" function? Is this app still supported?', 'App crashes during the encoding process, after entering the password.', 'Not working. Crashing on starting the process', 'Useless.takes tooo much time ,not retrive hideen massage.', 'App does not work. Crashes on LG Stylo 3.', 'very slow. and didn’t work rightly. need update', 'Keeps crashing at 8% each time', 'App crashes during encoding', 'Wouldent encrypt, crashed 2x.', 'app crashes when encrypting', "Doesn't help you read hidden messages at all!", 'This app does not work', 'Unfortunately becomes stop', 'love it alot', "App not working... I've entered a large section of text and the image came out cropped.  However, that is not as bad as what I seemed to come across when I sent a mail to myself with that image. I discovered that the app also forwards a copy of the image to the developer!! Please explain the rational or you ought to be considered spy app", "I don't want to put less than five stars because it was working absolutely great, but now I tried to use and it crashes when it reaches 8% in the process of hiding the text. I don't know if the problem is my Android version, because I am using it with Android 8.1.0. Please fix this issue, I know you're not a lucrative organisation, bit please make this awesome app work again", 'It does not explain how to open and retrieve msga from pictures. But upon \nreading comments i found a helpful explanation. Basically, once file is \nreceived, save it and open your photo folder. Once found, open it using \nPixelknot. For some folks this part might be difficult to figure out.', "Like what I'm seeing so far with my Droid phone.  Any plans to develop a version for Mac iOS? Additionally, I'd have to echo the comments about an inability to cut & paste from decrypted messages.  You can obviously screen capture but this would not be at all helpful for very lengthy messages nor for further encoded data sent via a PixelKnot image. Thanks.", 'The app works, and it certainly does exactly what it says it can do. However, the big feature that I see missing that I require is the ability to select and copy the received text from a decrypted image. I would like to embed an already encrypted pgp message and receiving without the ability to copy and paste completely breaks it for me.', "Agree with others: if you're gonna give the ability to paste into it, got \nto give the ability to copy from it. If a newbie pastes formatted text that \ncomes out gibberish, could be readable IF able to copy to original \napplication. Currently, impossible. If the message gets lengthy, shifts \nfocus, so you can't see the point where the cursor is. For an app out so \nlong, really lame of the dev to allow so much absent basic functionality \nbugs . If you're gonna offer something so half baked, why even bother \nwriting it at all?", "Crashes after every attempt to mssg a pic. Says give us a minute we'll mssg \nyou when done. I say 'ok' app crashes. Nice idea. Terrible execution.", "Continuously crashes and won't send any pictures. I really wanted to use this and it's such a great idea. To bad it doesn't work.", "Waste of time and data... the ideology is good tho... work on the coding n encryption.. app don't work", "While I love the concept… this app doesn't work on Android P. It just \ncrashes when trying to encode a message.", 'App keeps crashing on Android 8.1. Cannot encrypt, it keeps crashing.'], 'appId': 'info.guardianproject.pixelknot', 'url': 'https://play.google.com/store/apps/details?id=info.guardianproject.pixelknot&hl=en&gl=us'}
