{'title': 'Ripple: respond when panicking', 'description': 'Ripple is a "panic button" that can send it\'s trigger message to any app that is a "panic responder".  Such apps can do things like lock, disguise themselves, delete private data, send an emergency message, and more.  It is meant for situations where there is time to react, but where users need to be sure it is not mistakenly set off.\r\n\r\nThis is a BETA version of this app!  We are working now to add support to as many other apps as possible.  ChatSecure, Orweb, Umbrella, and Zom already have support, these apps are coming soon: Courier, PanicButton, OpenKeychain, Orfox, SMSSecure, StoryMaker.\r\n\r\nHere are two example scenarios:\r\n\r\n* An organization gets regularly raided by the security forces, who search all of the computers and mobile devices on the premises. The organization usually has at least a minute or two of warning before a raid starts. They need a very reliable way to trigger wiping all of the data from the sensitive apps.\r\n\r\n* An aid worker has lots of sensitive data about people on their device.  They regularly sync that data to a secure, central database.  Occasionally, the aid worker has to leave the country on very short notice.  The border guards regularly download the entire contents of mobile devices of people crossing through.  While waiting in line at the border, the aid worker sees the border guards seizing people\'s devices, and then remembers all the data on the device, so she unlocks the phone and hits the wipe trigger, which wipes all sensitive apps from the device. When the aid worker returns to the central office, the device is again synced up with the central database.\r\n\r\nThis project was started as part of the T2 Panic work.  Read more about it here:\r\nhttps://guardianproject.info/tag/panic\r\n\r\nDon’t see your language? Join us and help translate the app:\r\nhttps://hosted.weblate.org/projects/guardianproject/ripple/\r\nhttps://hosted.weblate.org/projects/guardianproject/ripple-metadata/\r\n\r\n\r\n***Learn More***\r\n\r\n★ ABOUT US: Guardian Project is a group of developers that make secure mobile apps and open-source code for a better tomorrow\r\n★ OUR WEBSITE: https://GuardianProject.info\r\n★ ON TWITTER: https://twitter.com/guardianproject\r\n★ FREE SOFTWARE: Ripple is free software. You can take a look at our source code, or contribute to help make Ripple even better:\r\nhttps://github.com/guardianproject/ripple\r\n★ MESSAGE US: Are we missing your favorite feature? Found an annoying bug? Please tell us! We’d love to hear from you. Send us an email: support@guardianproject.info or find us in our chat room https://guardianproject.info/contact', 'descriptionHTML': 'Ripple is a &quot;panic button&quot; that can send it&#39;s trigger message to any app that is a &quot;panic responder&quot;.  Such apps can do things like lock, disguise themselves, delete private data, send an emergency message, and more.  It is meant for situations where there is time to react, but where users need to be sure it is not mistakenly set off.<br><br>This is a BETA version of this app!  We are working now to add support to as many other apps as possible.  ChatSecure, Orweb, Umbrella, and Zom already have support, these apps are coming soon: Courier, PanicButton, OpenKeychain, Orfox, SMSSecure, StoryMaker.<br><br>Here are two example scenarios:<br><br>* An organization gets regularly raided by the security forces, who search all of the computers and mobile devices on the premises. The organization usually has at least a minute or two of warning before a raid starts. They need a very reliable way to trigger wiping all of the data from the sensitive apps.<br><br>* An aid worker has lots of sensitive data about people on their device.  They regularly sync that data to a secure, central database.  Occasionally, the aid worker has to leave the country on very short notice.  The border guards regularly download the entire contents of mobile devices of people crossing through.  While waiting in line at the border, the aid worker sees the border guards seizing people&#39;s devices, and then remembers all the data on the device, so she unlocks the phone and hits the wipe trigger, which wipes all sensitive apps from the device. When the aid worker returns to the central office, the device is again synced up with the central database.<br><br>This project was started as part of the T2 Panic work.  Read more about it here:<br>https://guardianproject.info/tag/panic<br><br>Don’t see your language? Join us and help translate the app:<br>https://hosted.weblate.org/projects/guardianproject/ripple/<br>https://hosted.weblate.org/projects/guardianproject/ripple-metadata/<br><br><br>***Learn More***<br><br>★ ABOUT US: Guardian Project is a group of developers that make secure mobile apps and open-source code for a better tomorrow<br>★ OUR WEBSITE: https://GuardianProject.info<br>★ ON TWITTER: https://twitter.com/guardianproject<br>★ FREE SOFTWARE: Ripple is free software. You can take a look at our source code, or contribute to help make Ripple even better:<br>https://github.com/guardianproject/ripple<br>★ MESSAGE US: Are we missing your favorite feature? Found an annoying bug? Please tell us! We’d love to hear from you. Send us an email: support@guardianproject.info or find us in our chat room https://guardianproject.info/contact', 'summary': 'Trigger apps to protect your privacy when in anxious or panic situations', 'summaryHTML': 'Trigger apps to protect your privacy when in anxious or panic situations', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.83, 'ratings': 128, 'reviews': 67, 'histogram': [19, 11, 11, 15, 70], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.6M', 'androidVersion': '2.3.3', 'androidVersionText': '2.3.3 and up', 'developer': 'Guardian Project: Apps You Can Trust', 'developerId': '6502754515281796553', 'developerEmail': 'support@guardianproject.info', 'developerWebsite': 'https://guardianproject.info/', 'developerAddress': 'Guardian Project\nc/oOliver+Coady, Inc\n20 Broadway, Suite 6\nValhalla NY 10595', 'privacyPolicy': None, 'developerInternalID': '6502754515281796553', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/9ENCgiWhWd6Qq1KjTrI4snfotg07ey_Tki9M_lpGv8bOgo22pI_VnlePVWxQylhHXD_1', 'headerImage': 'https://lh3.googleusercontent.com/UVdqwpSU54CoSIYTFYdSj8IitUnn-GyNJUPrgs7gxVlKsEt8eYxa-AERyHs1_mnQKA', 'screenshots': ['https://lh3.googleusercontent.com/ZmwUfpYuXGMZnWn4A2BnnCgpvhfAedFofa2_80b_kL4ytzzjYGbrfPfoL-CIOPAe8jw', 'https://lh3.googleusercontent.com/CKwK9mMwENW_0-LviFnfd3CRKJxIAfDtL_E0HKU0rNMbR-6m8qgYJ9HprRHJkkoJdnZJ', 'https://lh3.googleusercontent.com/ngsBvtOV195dk5ytIMa26XSRpG5eO00Z4fGIBjTAZ_1aiA-ZMSrOhTSGVCNFNMQMa04', 'https://lh3.googleusercontent.com/LbmqFWk5U2GeMWezIGbVTc_5UdVtCqjbDdDXu8f9FhhAy2NjgNBH0T62MRaPCq4IzEuQ', 'https://lh3.googleusercontent.com/NmUYGCFk-HwCNh0MKlr7b_Rd84jPJzZMITzZ-DhgApUY5eKzI-X23zKVYNZLy2F7pTU', 'https://lh3.googleusercontent.com/lKNLsrdH32deKsu5CC7fiNRkMnLOm7wNmmP5MhUs5zd5XttvYDz3_CnEyLKtkXpZyoA', 'https://lh3.googleusercontent.com/t8nj77fkT-8wu38jbwMBbAyPJAbD_ugi3rjRu5YskJozIho3cAXE0qanfHDsheguYmE', 'https://lh3.googleusercontent.com/eanNWXJcg45nAap4iZqLX5lZy2kp9Ote7Yc7NodE603J6tbSfGlkn8Dih3GA2C9OTFU', 'https://lh3.googleusercontent.com/9LgK1leRRl_pOe_Sp9rhHUsjW731mWFSD6Q43JpYT8FXaTbcCPw4LM7vmgXcE508pbI', 'https://lh3.googleusercontent.com/nAFbHOtalthlcgsCwurOJjrs0ykMudctZCK-uL_nebu4OH4Zbl74V7xdK1dEIBnPmjU', 'https://lh3.googleusercontent.com/I7nzSPrT1ttr9uA89XpF4KxF8RGlVGJXqhFhNBhta9rsDoj8lGfgXLtAjv-qAlx4pY0'], 'video': 'https://www.youtube.com/embed/mS1gstS6YS8\n?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/mS1gstS6YS8/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 18, 2015', 'updated': 1452294241, 'version': '0.2', 'recentChanges': 'Lots of bugfixes and a new Hungarian translation\r\n', 'recentChangesHTML': 'Lots of bugfixes and a new Hungarian translation<br>', 'comments': ["Very less app support. Should add more privacy apps like whatsapp, etc. Overall it's a very good app. I liked the concept And u should add features like auto lock when suspicious activity found and password protection", "Just started using the application but so far this idea is great! And I can't wait to see all the possibilities that are possible with it. Especially these days this is a needed feature no matter where you live or who you are.", "Brilliant idea, I can see huge potential for my growing Guardian Project folder of apps. Because a ripple is something I'd want to initialise suddenly, a widget would be my next preferred feature (maybe pin-protected from accidental press)?", "This really is some Mission Impossible stuff here. Perhaps the most useful app I've ever met. How stupid of me not to have thought about this!", 'The level of friction involved in activating the primary function of this app renders it useless.', 'Pretty great, I wish there were more supported apps', 'Whoever gives this less than 5 stars should be taken out back and shot like the dog you are. The End', 'There is massive room for this in real world applications', 'great security addition 👍', 'I wish more apps supported this.', 'Love this app, though I do believe a particular setting is needed. I like the wind down before any other app settings approve the panic signal, however I would like the option to remove or lower the timer as the tap and swipe seems to be confirmation enough, and possibly integrate a passphrase, be it a particular swipe or fingerprint scan etc etc.', 'There is a lot of real world need for this app particularly for people crossing alot of borders such as frontline NGO teams. But I am surprised you have not yet added even the most simple application of wiping selected data (not resetting the whole phone).', "The app roots from a great idea, but why only have a few apps? I wish you could add more apps. I have to do a button on my home screen and create a task to do the rest of the apps in cases of emergency. It would be convenient to have them all. I really don't know why you have a few more apps associated with the guardian but it would be very useful.", "WHAT AN AMAZING APP!!!! why don't you allow every app on the device to be putt on here ... Firefox, whatsapp, tor, start page, brave, duckduck go, wickr, inbrowzer, email apps text apps, all encryption currency apps, this app has the potential to be amazing.. My phone already has the capability to push wipe the whole phone.. Since I have a blackphone 2 but it factory resets it.. Witch do not want to do... This allows the user to just delete apps uninstall or hide witch is perfect PLEASE PLEASE Fix this amazing app!!!!!!", "I can't seem to be able to set any triggers, or am I missing something?", "I love the idea, but support in enough apps to be really useful has been provides for a long time and failed to materialise. What's up with that?", 'Where to my comment disappeared?! ..... I have no button "edit", so I can\'t add my apps to list. There is just Orfox, was added by itself. Help.', "It's been a while and no progress on Android 5. No apps added and no support featured. If it's only a damn blank app then it's nothing more than a time and space waste.", 'Obviously only one app affected currently which responds perfectly, really good, easy to use, definitely will keep.', 'Needs a little work. Great concept. Always need a safety net and risk-possibility emergency override.', "It only let's me hide them, not wipe them.", "Add a function to allow the addition of responders..   Then maybe it won't be worthless", 'Anything by The Guardian Project is worth using!', 'Only option available is "test run".', 'Just need more mainstream apps to respond :)', 'Device Cleaner', 'No options showing except test run', 'Where is the edit button. Lenovo A536.', 'Add more apps', '⭐⭐⭐⭐♥️', "I don't use this app but I will when it gets out of beta stage...until then, I downloaded purely for support. Good job Guardian team!", "This is great, obviously being early on it needs touch ups but it's on its way to be something great.", 'Really simple to use!', "Hello, how does one set up other apps to respond to ripple? The option didn't seem available.", '... to a big idea!', 'Thanks for the reply.  Already had orweb for while.  Keep up the good work.', 'Great app, great project.  More app support coming soon!', "This app is a great idea and is a potential life saver for people working for NGOs in hostile countries etc. However, it's been in beta for as long as I can remember and hasn't shown any signs of life for that entire period. Hell, even if it was released with the ability to test with a couple of apps (and a disclaimer NOT to rely on it under any circumstances to protect sensitive data), I know there'd be plenty of people happy to test it and report any bugs etc. I know I would. Such a shame", 'You cant add new apps because the maintainers need to write extra code that \nintegrates the app with ripple. If you want an app added, you should \ncontact whoever maintains the app and make a feature request.', "I fortunately haven't had a real world need for this yet, if it works the way that it says it does, it could and someday will be an absolute necessity as well as a lifesaver."], 'appId': 'info.guardianproject.ripple', 'url': 'https://play.google.com/store/apps/details?id=info.guardianproject.ripple&hl=en&gl=us'}
