{'title': 'Location Privacy - BETA', 'description': 'Just click on a link that points to a location, and LocationPrivacy will show up as one of the options. If you select it, then it will use the most private way possible to get the location from that link. It will then forward the location to the map app that you choose. LocationPrivacy is not really app but rather a set of "privacy filters" for all of the various ways of sharing location. When you click on a location link in one app, LocationPrivacy offers itself as an option. It then recognizes insecure methods of sharing location, and then converts them to the most private methods available. For many links, the location can be read without even going online. For others, LocationPrivacy reads the location from the webpage via Tor, so that it cannot be tracked to you. Whenever possible, the connection uses HTTPS.\r\n\r\nOsmAnd is the recommended map app for private location because it works fully offline and we have audited it. LocationPrivacy will work with basically all map apps. LocationPrivacy can also serve as a way to redirect all location links to your favorite mapping app. All map apps in Android can view `geo:` URIs, and LocationPrivacy converts many kinds of links to `geo:` URIs, including: Google Maps, OpenStreetMap, Amap, Baidu Map, QQ Map, Nokia HERE, Yandex Maps.\r\n\r\nThis is still a beta release of a new idea, if you have problems or ideas, please post them on our issue tracker so we can improve this app!\r\nhttps://github.com/guardianproject/locationprivacy/issues\r\n\r\n★ WE SPEAK YOUR LANGUAGE: Location Privacy is available in: Deutsch, español, français, norsk. Don’t see your language? Join us and help translate the app:\r\nhttps://hosted.weblate.org/projects/guardianproject/locationprivacy\r\nhttps://hosted.weblate.org/projects/guardianproject/locationprivacy-metadata\r\n\r\n\r\n***Learn More***\r\n\r\n★ ABOUT US: Guardian Project is a group of developers that make secure mobile apps and open-source code for a better tomorrow\r\n★ OUR WEBSITE: https://GuardianProject.info\r\n★ ON TWITTER: https://twitter.com/guardianproject\r\n★ FREE SOFTWARE: LocationPrivacy is free software. You can take a look at our source code, or contribute to help make LocationPrivacy even better:\r\nhttps://github.com/guardianproject/LocationPrivacy\r\n★ MESSAGE US: Are we missing your favorite feature? Found an annoying bug? Please tell us! We’d love to hear from you. Send us an email: support@guardianproject.info or find us in our chat room https://guardianproject.info/contact', 'descriptionHTML': 'Just click on a link that points to a location, and LocationPrivacy will show up as one of the options. If you select it, then it will use the most private way possible to get the location from that link. It will then forward the location to the map app that you choose. LocationPrivacy is not really app but rather a set of &quot;privacy filters&quot; for all of the various ways of sharing location. When you click on a location link in one app, LocationPrivacy offers itself as an option. It then recognizes insecure methods of sharing location, and then converts them to the most private methods available. For many links, the location can be read without even going online. For others, LocationPrivacy reads the location from the webpage via Tor, so that it cannot be tracked to you. Whenever possible, the connection uses HTTPS.<br><br>OsmAnd is the recommended map app for private location because it works fully offline and we have audited it. LocationPrivacy will work with basically all map apps. LocationPrivacy can also serve as a way to redirect all location links to your favorite mapping app. All map apps in Android can view `geo:` URIs, and LocationPrivacy converts many kinds of links to `geo:` URIs, including: Google Maps, OpenStreetMap, Amap, Baidu Map, QQ Map, Nokia HERE, Yandex Maps.<br><br>This is still a beta release of a new idea, if you have problems or ideas, please post them on our issue tracker so we can improve this app!<br>https://github.com/guardianproject/locationprivacy/issues<br><br>★ WE SPEAK YOUR LANGUAGE: Location Privacy is available in: Deutsch, español, français, norsk. Don’t see your language? Join us and help translate the app:<br>https://hosted.weblate.org/projects/guardianproject/locationprivacy<br>https://hosted.weblate.org/projects/guardianproject/locationprivacy-metadata<br><br><br>***Learn More***<br><br>★ ABOUT US: Guardian Project is a group of developers that make secure mobile apps and open-source code for a better tomorrow<br>★ OUR WEBSITE: https://GuardianProject.info<br>★ ON TWITTER: https://twitter.com/guardianproject<br>★ FREE SOFTWARE: LocationPrivacy is free software. You can take a look at our source code, or contribute to help make LocationPrivacy even better:<br>https://github.com/guardianproject/LocationPrivacy<br>★ MESSAGE US: Are we missing your favorite feature? Found an annoying bug? Please tell us! We’d love to hear from you. Send us an email: support@guardianproject.info or find us in our chat room https://guardianproject.info/contact', 'summary': 'privacy filters for shared location links', 'summaryHTML': 'privacy filters for shared location links', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.27, 'ratings': 238, 'reviews': 47, 'histogram': [16, 16, 16, 23, 164], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.1M', 'androidVersion': '2.3', 'androidVersionText': '2.3 and up', 'developer': 'Guardian Project: Apps You Can Trust', 'developerId': '6502754515281796553', 'developerEmail': 'support@guardianproject.info', 'developerWebsite': 'https://guardianproject.info/', 'developerAddress': 'Guardian Project\nc/oOliver+Coady, Inc\n20 Broadway, Suite 6\nValhalla NY 10595', 'privacyPolicy': None, 'developerInternalID': '6502754515281796553', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/jRsZAHlPYmoOFzHtvLq6iFNSwYKV0OEBXGAe10M9562Ca7W3eAclmZYuIf4Bf6ex88nr', 'headerImage': 'https://lh3.googleusercontent.com/-SLakZOfY8MfmnLR6EKVIzwhxYUqEK1f31UE-ITV1xgBQWqsL3jS_HtCFfCYL3dcJBM', 'screenshots': ['https://lh3.googleusercontent.com/B4Jj6QASTS72bv1lNgAWqjGAXGvH0nuMN59bgzzhvioKCvRHOkRnCvlT8OTHozVg3A0', 'https://lh3.googleusercontent.com/V1lEGE6wpSpiRJ2ge9C5Ax3bMvYCfedwgrnUz6eQ2qJbY-pF1sdfuuGPydovkjZNFBeW'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 29, 2015', 'updated': 1453802182, 'version': '0.3', 'recentChanges': 'now with Tor support for getting location from webpages privately, and translated to Deutsch, español, français, norsk.\r\n', 'recentChangesHTML': 'now with Tor support for getting location from webpages privately, and translated to Deutsch, español, français, norsk.<br>', 'comments': ['Needs an update. Crashing even on the example Google URL in the About dialog.', 'Not very effective or easy to use', '\'Cuz you\'re for the people!  When does privacy matter?  ALL THE FREAKIN\' TIME PEOPLE!!!!!  I\'m always shocked to find out someone believes in the law of safety in numbers, since most people are good and decent folks, that out of the billions of internet users using their cell phones and tablets that they can somehow go unnoticed by the "bad guys"; or 2.  I keep finding more and more people who DO NOT REALIZE THE POTENTIAL threats they face!  Identity theft, scams, blackmail, etc...', "I like the idea, but still uncertain as to when it's likely to be called. I've had it 10 months now and it's never shown as an option.", 'Would be nice if it had an option to globally disabled location data in photos as well, people forget they leek location data that way.', 'Another security app says your export power over users phones makes us more vulnerable to hacks .', 'Please explain with few examples.. unable to understand the purpose clearly.', 'When i not using map softwer why should use this app send me to another app?', "It's good very good", "************************************************************************************* you guys are awesome,in this world where privacy is everything,and most people don't know they are vulnerable,this will help a lot", 'Best app I seen !Even better its private...AND has zero permissions!  I bet alot of people dont even know how much location info. theyvare leaking out!  Privacy is a memory of the past...even with location access off. Thanks! best app...big future.', 'A specific kind of privacy protection that nothing else currently offers.', 'Thanks to guardian project for their constant efforts in helping the people. This is beta version; I hope to see lots of 5 star ratings and a finished product soon.', 'Great Idea, Please Stick With It! Just Needs Some Devoted Development to Become another Guardian first class App. Namaste Mr. MD', "I opened the app, and there's an information about the app, and a link. I opened the link (on chrome), and it just opened a map. I really don't know how to use it please help me out.", 'I don\'t know how it works, there is no "help" button or any other explanation. I thought it\'s useful as it\'s from Guardian.', "This is definitely a good idea in principle.  However, after having it installed for two weeks I didn't get a single request to use it.", "Doesn't stop Facebook from posting location", "Will be useful once it works properly. Don't use this as anything more than a beta test at this point.", 'On need to know bases if you need to know where I am.', 'Great Idea', 'It is possible to fake the location to other apps?', 'Hard to feel "protected" when giving out so much in the way of permissions.', "Doesn't work 95% of the time", '.', 'Awesomo !', 'Uses all the time', 'Does what it says', 'Very needed app', 'Sweat'], 'appId': 'info.guardianproject.locationprivacy', 'url': 'https://play.google.com/store/apps/details?id=info.guardianproject.locationprivacy&hl=en&gl=us'}
