{'title': 'rensim (formerly known as puyosim)', 'description': 'An unofficial Puyo puyo simulator\r\n\r\nMain features:\r\n - Endless mode\r\n - Edit mode\r\n - Undo/Redo\r\n - Color-balance configuration\r\n - Chain animation\r\n - Export a snapshot and moves', 'descriptionHTML': 'An unofficial Puyo puyo simulator<br><br>Main features:<br> - Endless mode<br> - Edit mode<br> - Undo/Redo<br> - Color-balance configuration<br> - Chain animation<br> - Export a snapshot and moves', 'summary': 'The best app for practicing puyopuyo', 'summaryHTML': 'The best app for practicing puyopuyo', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.3, 'ratings': 215, 'reviews': 105, 'histogram': [8, 12, 19, 38, 135], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '33M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'haripo', 'developerId': 'haripo', 'developerEmail': 'uetjkisk@gmail.com', 'developerWebsite': 'http://rens.im', 'developerAddress': None, 'privacyPolicy': 'https://rens.im/privacy_policy.html', 'developerInternalID': '4712830242953332857', 'genre': 'Puzzle', 'genreId': 'GAME_PUZZLE', 'icon': 'https://lh3.googleusercontent.com/xomf19gILEFGe7MmovKr6LKAq4CMe8RSz6WurjtAgeeOMaxENV5MNbj_z1ZUSGjEoPo', 'headerImage': 'https://lh3.googleusercontent.com/WUxfRv_C6ghxIXVBgdyOKDfsaKGwNp-sXEwafi7IaXWlAxk9e9kWQ4CBu8lHEjz4veU', 'screenshots': ['https://lh3.googleusercontent.com/cG8Xr9KWKI9C5zRxvy_2VZXHERDC_rBB4inLom1X9BpYPiTrIYHDwJ9BXSoOeYagkUw', 'https://lh3.googleusercontent.com/hXmVHONzWcviNGlcLQXwy4-BAuyKHm4ae2PNIixiZ3ntOHaRJgFbDGCJv6l57FEfBaA', 'https://lh3.googleusercontent.com/Oics8WtIJ6KQyQZYADcaDU6Y7AkR3oLObOKd_ACSoFqo7Zr0lhKTWeajOwnhMyFVwSF2', 'https://lh3.googleusercontent.com/fQZsX8YjAfriwoOPg-hmBWMpQDyl2x_jts2neZNblbC8mzkrFtcJvHKTSSbLTyFET0P4'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': True, 'containsAds': True, 'released': 'Jun 15, 2017', 'updated': 1568255760, 'version': '2.8.1', 'recentChanges': ' - Supported Puyopuyo-eSports compatible queue generation\r\n - Fixed share bugs', 'recentChangesHTML': ' - Supported Puyopuyo-eSports compatible queue generation<br> - Fixed share bugs', 'comments': ['Basic simulator, includes scoring, includes editing. There could be all the Puyo Puyo characters to make it more realistic and music too.', 'Very good simulator, better than any others I could find. My only recommendation is to add a mode where you actually play, maybe fitted with speed changes and save states to fit the theme. Otherwise very nice', 'This is a wonderful puyo practice app, as well as an entertaining way to pass time. I would gladly pay a dollar or two for a premium or to disable ads, more skins would be cute. overall very good app.', 'I really love Puyo Puyo Tetris, which is weird since I am an 11 yr old ( I am a boy). Since, I sucked at Puyo Puyo mode, this helped me a lot. Thank you for this wonderful app.', "I liked it! It's awesome! Maybe I should edit puyos **EDIT PUYOS** You can build 1-19 chains. That looks fun! **SPEED** I should remember that the speed is slow... Thanks anyways. :)", 'this is a great free way to practice puyo puyo just a simple free simulator the only couple of downsides that could be improved are more refined graphics fir the puyo and the garbage counter and possibly a fail condition', "very simple and effective, the ui could use a bit of work but for what it is it's very good, thank you for creating a puyo app that isn't garbage lol", 'Please add auto drop mode (puyo dropping down periodically). Please add soft drop mode (click down only drop one square, long click down drop faster but not hard drop).', 'If you are looking for an alternative to the Puyo Nexus simulator, this is a good app to check out.', 'An excellent app for improving and advancing Puyo Puyo skills. This app took my max chain from 5 to 9!', "it's good for practice, works well, simple and easy to use.", 'Great app for practicing puyo puyo (its probably the only one designed for actual practice), too bad I suck.', 'Good game, no ads, great for practice.', 'Great app for practice chain for puyo puyo. My minimal chain increased from 5 to 7!', 'I like it but I think you should also make tetris', "great to practice but I'm looking for an online game so i can plan in real time.", 'Why does the game just stop working so often?', 'All this game really needs right about now is some sound', 'Make it so you can place puyos out of bounds', 'Excelent for practice', 'Adds killed this app. Give me a paid version.', 'Dr Robotnics mean bean machine.', 'Its alright', 'Lol gg', 'Amazing', 'awesome!', 'fun', 'perfection', 'Please add something for left handed', "This is one of my favorite smartphone apps. This app let's you easily \npractice Puyo Puyo anywhere. I find it hard to practice Puyo Puyo , because \nyou never get the time to think, but this stops the Puyos from falling, \nwhich gives you a lot more time to think, which helps you in the real game. \nI love to play Puyo Puyo Tetris on my Switch, and this has helped me so \nmuch. The app works perfectly on my Motorola G5s Plus, and it's a shame \nthat this doesn't work well on some other devices. This app deserves a \nmedal. Oh, and its completely free, with no ads. I do think it would be \nnice to be able to make it so the Puyos drop like in the normal game, but I \nunderstand that might result in this being taken off of Google Play. This \nalone is perfect. 10/10, and I mean it.", "This is a great app for this type. The app fits all content on the screen \nas well, either they had a device that couldn't fit the components in. \nOther than that it is great for a practice app. P.S, The Triple Dot gives \nyoua Restart button, if you didn't notice. :)", 'Seems like a great app except that the bottom row is cut off. Tried \neverything to fix it but no luck. Galaxy S8 for the record.', 'helped me completing the story mode in puyo puyo tetris because i was a bad \npuyo player', "This sucked. Doesn't even fit on the screen or give you a game over, \nwhowver gives this 4.3 needs to check if they're autistic", "It's great,but can u put some sound in or maybe music,that would really \nhelp.", 'Great puyo puyo practice', 'Griebddskma', 'Love the app but recently the bottom row of the board is cut off on my \nsamsung galaxy s8+.', 'Simple and light interface. I bought PPT but I suck at Puyo mode so I need \nsomething to practice chaining on the go, and this is exactly what I need. \nThank you!', 'Edit: Thanks for adding the alphabet skin! This really helps with my colorblindness! Thanks for replying that all 5 colors will be supported in a future release.'], 'appId': 'com.puyosimulator', 'url': 'https://play.google.com/store/apps/details?id=com.puyosimulator&hl=en&gl=us'}
