{'title': 'Media Button Router', 'description': "Media Button Router works with your Bluetooth stereo. Gone are the days when you were limited to a single app that would launch and play music when you hit the play button on your stereo. This app lets you, the user, decide what app should play music when you hit the play, previous, or next button on your stereo.  It prompts you with text-to-speech, and lets you select by hitting previous to go back an app, next to go forward an app, and hitting play to select the app that you want to use.  If music is already playing, Media Button Router stays out of the way, and lets whatever app that is playing the music handle media button presses.  You can now have a fully hands-free music experience. \r\n\r\n\r\nPlease note that this app is targeted towards Bluetooth devices that have at least Play/Pause, Previous, and Next buttons.  Also note that this app will not be compatible with all music apps. It has been tested, and works with at least the following apps: MixZing, PowerAMP, ³(Cubed), Android’s default music app, Pandora, and the latest version of Amazon MP3. It works most of the time with Google Listen and Rhapsody. Winamp and Doubletwist are not supported.  In order for your music apps to work, you will likely have to enable a “headset controls” option in each app’s preferences. \r\n\r\n\r\nPlease report any issues at http://code.google.com/p/media-button-router/issues/list\r\n\r\nAlso, please free to submit a patch or contribute to this project, it's all open-source. I no longer use this app daily (my commute has changed), so any progress is going to come from YOU.", 'descriptionHTML': 'Media Button Router works with your Bluetooth stereo. Gone are the days when you were limited to a single app that would launch and play music when you hit the play button on your stereo. This app lets you, the user, decide what app should play music when you hit the play, previous, or next button on your stereo.  It prompts you with text-to-speech, and lets you select by hitting previous to go back an app, next to go forward an app, and hitting play to select the app that you want to use.  If music is already playing, Media Button Router stays out of the way, and lets whatever app that is playing the music handle media button presses.  You can now have a fully hands-free music experience. <br><br><br>Please note that this app is targeted towards Bluetooth devices that have at least Play/Pause, Previous, and Next buttons.  Also note that this app will not be compatible with all music apps. It has been tested, and works with at least the following apps: MixZing, PowerAMP, ³(Cubed), Android’s default music app, Pandora, and the latest version of Amazon MP3. It works most of the time with Google Listen and Rhapsody. Winamp and Doubletwist are not supported.  In order for your music apps to work, you will likely have to enable a “headset controls” option in each app’s preferences. <br><br><br>Please report any issues at http://code.google.com/p/media-button-router/issues/list<br><br>Also, please free to submit a patch or contribute to this project, it&#39;s all open-source. I no longer use this app daily (my commute has changed), so any progress is going to come from YOU.', 'summary': 'Decide what app will respond when you hit play, previous, or next on your stereo', 'summaryHTML': 'Decide what app will respond when you hit play, previous, or next on your stereo', 'installs': '50,000+', 'minInstalls': 50000, 'score': 3.33, 'ratings': 470, 'reviews': 271, 'histogram': [136, 37, 42, 42, 211], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '350k', 'androidVersion': '2.2', 'androidVersionText': '2.2 and up', 'developer': 'Harleen Sahni', 'developerId': 'Harleen+Sahni', 'developerEmail': 'harleenssahni+mbr@gmail.com', 'developerWebsite': 'http://code.google.com/p/media-button-router/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8913385927137643024', 'genre': 'Music & Audio', 'genreId': 'MUSIC_AND_AUDIO', 'icon': 'https://lh3.googleusercontent.com/zAA0Qq4zc2ycm5XOxn9n-7oEJbYPtXvbtVtn8K7_Kt1Y9bs0KbW-MyWDb0i7ivvY0G9K', 'headerImage': 'https://lh3.googleusercontent.com/5IV-Vjz46V_TRvLzOHKSpMNozhei1RWrFqXKTqb5EbGdRkr3bUeYeKgQdK90WvDlCw', 'screenshots': ['https://lh3.googleusercontent.com/Hm_b822LnNezePtJK4Vcl5UOIhZK0TULYNztJ6R5aRxn2Gy7xYjimO6rHKFI_sHfEZ8', 'https://lh3.googleusercontent.com/Dip-O6j8ObUuf7Pl1O4zac_79rZOuMX0FW8A7NRbkr9XfSkxc8o6Xbd4_cy6aOU3YU8'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Apr 19, 2011', 'updated': 1390840624, 'version': '1.5.1', 'recentChanges': "1.5.1:\r\n- Fix config crash\r\n1.5.0:\r\n- Support wired headsets (Issue 21 -- user submitted patch -- thanks!)\r\n- Hopefully fix updated apps being re-enabled bug (Issue 36). I changed the way I'm storing the ids of hidden apps, your apps will all be re-enabled this version.\r\n- Switched to git\r\nAlso, my car stereo got ripped out of my car, and the damage actually totaled my car. I don't have a car anymore, and don't use this app day to day. Most improvements are going to come from users submitting patches.", 'recentChangesHTML': '1.5.1:<br>- Fix config crash<br>1.5.0:<br>- Support wired headsets (Issue 21 -- user submitted patch -- thanks!)<br>- Hopefully fix updated apps being re-enabled bug (Issue 36). I changed the way I&#39;m storing the ids of hidden apps, your apps will all be re-enabled this version.<br>- Switched to git<br>Also, my car stereo got ripped out of my car, and the damage actually totaled my car. I don&#39;t have a car anymore, and don&#39;t use this app day to day. Most improvements are going to come from users submitting patches.', 'comments': ['Did nothing. selected only a single app in the menu, and play signals still routed to a different one', "Sometimes works, sometimes doesn't. Uninstalling.", 'Lets you replace the stock Android music app completely, by launching your favorite player from your headset or headphone buttons instead. I also recommend combining it with AIMP as a music player.', "Doesn't work in Android 9; there is no way to give it media button focus. All media buttons continue to go to whichever media app I used last.", '2019. Still enjoying this after years of use. just works', 'Thank you so much for this easy and great fix! Where can I donate, though?', "didn't work", "My original comments below are still true, but since Kit Kat hit my phone, I can no longer pause audio using headset controls and this app.  Not sure if it's KK or the LG G2, but when I saw another user posting about it here, I figured I'd chime in.    There's only one media app I use headset buttons with. This app makes it possible to direct all input to the media app without worrying about what app has focus, etc", 'The buttons on my Bluetooth headphones (Jabra Revo) were useless with Spotify until I downloaded this app. However now everything works like a charm.  I also love the feature where you can toggle through all your music players with the play/pause button on my headphones.  Thoroughly grateful and massively recommend.  One recommendation for the developer is to allow the user to reshuffle the order of the list of available music players, to reduce button clicks', "Hi y'all.  This app is just what I need, except that it doesn't work for me.  I use Rhapsody almost exclusively.  I see it in the list of choices when I configure the app.  However, when the play command comes in from a bluetooth device, Rhapsody is never in the list of choices.  When I go back to the app, Rhapsody is then un-selected.  I am running this on a rooted HTC One.  I'll happily give the app 5 stars when/if it works.", 'Does exactly what I wanted - stop media players from starting when pressing bluetooth button. I set it to too fast with no voice prompts as I needed to enable A2DP profile for navigation only so it just quietly gets on with it.', 'Allows me to map the Bluetooth pause/play button to launch a voice assistant instead of music. I had to have two items in the selection list and set the default to launch my app, with just one item in the list commands are routed to the app instead of launching it.', 'I swear to god if I have to listen to "over the horizon" one more time I may have had to microwave my cell phone. Thank you for creating this app that just works. Now we just need slightly better Spotify support.', 'This is a great app. It annoys me that whenever my phone pairs with my car, it automatically starts playing my music. Sometimes the songs that play are ones that I downloaded for my daughter and even she is embarrassed about them as well. This app lets you determine which apps should playback instead.  My suggestion is as follows, and I know this can be accomplished with Tasker but I feel this is way easier to use for Joe Schmo. Please allow the user to designate which app should launch. For example, I use Serius XM to listen to Howard Stern during my drive. It would be awesome if I could get Sirius XM app to launch via Media Button Router. Unfortunately, the Sirius XM app is not recognized as a media playback app so I cannot designate it in the Media Button Router UI. If you allow the user to designate which app they wish to launch, that would be a great advantage for people using apps that are also not recognized as media playback apps.  Again, great app. It is a must for anyone wanting full control on their phone.', "It works absolutely great for me.  I don't want my phone to begin playing anything just because I've turned on my car,  so I let this intercept it and prompt me each time.  I just ignore it.  Perfect success at suppressing Autoplay.", 'Tried this to stop my phone from auto playing in 2 new toyotas. Added disable auto play. In media button Router, choose disable auto play, takes care of it. Took me months to find this combo', 'After a lot of research and phone calls to Google, I finally found the right utility app to get the job done.  A+++  I use a Sena SMH10 Bluetooth headset in my motorcycle helmet, and no matter what I did, I could not get past the default Samsung S5 music player - until now.  Install this program.  Select Google Play Now in the list, as well as S-Voice.  You need to say "open app play music" to run Google Play, as opposed to simply saying "Play Music" as a command.  Set Google as the default, and all works as expected.  The other headset buttons allow me to pause, next, previous just like the standard music player does.  Great little app, and I\'d be happy to pay for this if it was not free.  5-stars, and many thanks to the developer!', "I life this a lot, but one little feature would make it perfect. A switch to switch auto adding of updates apps of. What I mean is that every time a app is updated «Media button» automatically recheck the box for that app. I don't want that because then the newly updated app messes with which app is supposed to get the input.", "I got a new lg g4 and my car's Bluetooth audio would autoplay the default media player, even taking over for the currently playing media player. It made it almost unusable. This app seems too have mostly fixed the problem. However, for some reason Amazon mp3 doesn't show up in the list of apps. This app still seems to prevent the default media player from taking over, so I'll take it.", 'Android has a serious problem with determining which music related apps should be controlled by Bluetooth media controls. Just installing this and disabling the speech stuff and reducing the timeout makes it direct the buttons to the media app currently open or active correctly after you press your first media button. Amazing!', "The play button of my Bluetooth headset starts apps at random as if this app wasn't active at all.", "Doesn't do anything. My car auto plays my Google play app everyone I start the engine or complete a phone call. I even set it to conservative. Simply doesn't work.", 'When you hit the "Play" button on your Bluetooth device, Android is very unpredictable in which App it\'s going to choose, if it does anything at all.  This App fills a puzzling design oversight in Android Bluetooth media control, allowing the device to be a lot smarter when handling multiple media Apps.   Now I know that when I put on my headphones or go back to my car, playback will pick up exactly where I left off, with the option of changing it through the pop-up menu. Also, when the signal gets interrupted due to interference, recovery is more predictable.', 'This app is great my itself, but it would have been even greater if it allowed users to set a default player for each Bluetooth device, instead of prompting a list of apps.', 'This app fixes the common but widespread problem of default media apps. It is essential for people who frequently use media players or PTT communications apps like Zello', 'The app appears to be very buggy.  While setting it up Amazon MP3 player did not appear in the list of apps to offer.  I would up going through the setup 10 or more times while trying to get it to work.  Amazon MP3 appeared once out of all the times I was setting it up.  That was the 5th or 6th attempt.  It disappeared from the list after that never to return.  More importantly the app does nothing when I connect to bluetooth in my car.  Prior to install the app I would get a seemingly random music app starting when I entered my car.  I got this app to try to work around this Android bug so I could choose which app, if any to launch.  But the behavior has not changed.  I still get a random music app starting up when I enter the car.  I do not know what, if anything, the app is doing.', "This used to work great for fixing the Android problem of not playing music when I get in my car and my radio gives a BT play AVRCP command. However, at this point it's as though this app isn't installed at all and my stock Nexus 6 almost never plays music when requested. I have to take my phone out of my pocket, unlock it, launch Poweramp and hit Play to get music.", 'This app used to work perfectly but has stopped working for some reason. It no longer appears when my car stereo connects to my phone. Disappointing.', 'With my gear fit watch it always played my podcasts by default. This gives me the option to play Spotify from my watch unless I specify otherwise. Perfect solution.', "Works perfectly as claimed on my gs3, but the phone unlocks in my pocket every time I start playing something with my headphones. Needs at least an option for the screen interface to be deactivated; or to only activate when the screen is already on.   I'll just leave it disabled for now; but I won't uninstall it, in hope of being alerted of an update with this feature. Then I can use it again and will gladly give the full 5 stars it deserves.", "Slick. Works with Shuttle+ and Podcast Republic apps, iClever HB01 hands-free kit.  Makes it dead easy to listen to music or podcasts while I'm driving, without having to fiddle with my phone.  Tap the Play/Pause button, use Next to select the app I want, tap Play again, and my playlist resumes where I left off. Don't even have to take the phone out of my pocket.", 'Just works.  This problem has annoyed me for some time.  Thanks for solving it elegantly!', 'Thanks to this app I can now  control Spotify with my Casio watch via Bluetooth to my Nexus 4.  This app plugs an obvious hole in the OS', 'This app is a fantastic contribution to the open source community.   However would it be possible to allow user selected apps to be opened? I want to use a pressy/mi key dongle to open apps on my phone. I would love to be able to use an app I can trust.', "Under the G4's Android 5.1, the default media player starts over half the time, instead of Media Button Router intercepting the Bluetooth play request.", 'This app used to support an option to not play anything. That choice is gone, or has been for some time.', 'One of the apps that is standard on my phone. Otherwise i will have blaring music at the most inopportune times unexpectedly.', "Doesn't work with Sony Music player, LG tone+ and Pebble watch", "Whenever I add or update an app, it always default checks itself for media play routing, which is annoying because I have it set to only route to Spotify, and that's it. I don't want to keep unchecking every random app I add or update, they should be default un-checked on the list. Please fix!!!", 'The one app that stopped the stupid music player app from starting by default in my car every time I turned on bluetooth!'], 'appId': 'com.harleensahni.android.mbr', 'url': 'https://play.google.com/store/apps/details?id=com.harleensahni.android.mbr&hl=en&gl=us'}
