{'title': 'FreeOTP Authenticator', 'description': 'FreeOTP adds a second layer of security for your online accounts. This works by generating one-time passwords on your mobile devices which can be used in conjunction with your normal password to make your login nearly impossible to hack. These passwords can be generated even when your phone is in airplane mode.\r\n\r\nFreeOTP works with many of the great online services you already use, including Google, Facebook, Evernote, GitHub and many more! FreeOTP also may work for your private corporate security if they implement the standardized TOTP or HOTP protocols. This includes great enterprise solutions like FreeIPA.\r\n\r\nFreeOTP is open source and free software! Licensed under the Apache 2.0 license, you can obtain the source code for FreeOTP at https://fedorahosted.org/freeotp for review or modification. Contributions are welcome!', 'descriptionHTML': 'FreeOTP adds a second layer of security for your online accounts. This works by generating one-time passwords on your mobile devices which can be used in conjunction with your normal password to make your login nearly impossible to hack. These passwords can be generated even when your phone is in airplane mode.<br><br>FreeOTP works with many of the great online services you already use, including Google, Facebook, Evernote, GitHub and many more! FreeOTP also may work for your private corporate security if they implement the standardized TOTP or HOTP protocols. This includes great enterprise solutions like FreeIPA.<br><br>FreeOTP is open source and free software! Licensed under the Apache 2.0 license, you can obtain the source code for FreeOTP at https://fedorahosted.org/freeotp for review or modification. Contributions are welcome!', 'summary': 'FreeOTP secures your online accounts using one-time passwords.', 'summaryHTML': 'FreeOTP secures your online accounts using one-time passwords.', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 3.7881355, 'ratings': 2452, 'reviews': 760, 'histogram': [488, 93, 228, 280, 1361], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '436k', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Red Hat', 'developerId': 'Red+Hat', 'developerEmail': 'freeotp-devel@lists.fedorahosted.org', 'developerWebsite': 'https://fedorahosted.org/freeotp', 'developerAddress': None, 'privacyPolicy': 'https://freeotp.github.io/privacy.html', 'developerInternalID': '5252269533763794098', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/XrHHxpjdFjJ-pAj63VRshglFm8VtCA6S_QxYBufoEmcxU3LGfPHDt6g90g-vYHp6yfU', 'headerImage': 'https://lh3.googleusercontent.com/9Eoqe4lluJXPa8nXtBf2s3i8DrX_vAPD9KehJ2uDYoWtbAgLu97NSz6Nz1gdoNAaSA', 'screenshots': ['https://lh3.googleusercontent.com/mCBlwc-kwUaIQZXJUjLNorwWUhJN37ib_D6iik54cHP3l__YCE65FKSPKioAT-0ljsjn', 'https://lh3.googleusercontent.com/dESxgbNPpaeYck8m_UQgBIrpa8-EouMXTdkcV5597o4aFtYX2JtFoo1zGOWRKUYIjwU', 'https://lh3.googleusercontent.com/pLcrRcoVb_OASOscJtI9qwU54gx0XYXaTiPC0GmVFwqaZBP3qv__BwKz1orKkbCHlWE'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 13, 2013', 'updated': 1453746285, 'version': '1.5', 'recentChanges': 'Version 1.5 - UI overhaul. Image support (requires internet, storage permissions). Fixes.\r\nVersion 1.4 - New menu UI. New TOTP UI. Rename support. Copy/paste support.\r\nVersion 1.3 - Native camera/QR code support (requires camera permissions)\r\nVersion 1.2 - Return of the progress circle\r\nVersion 1.1 - Tablet support', 'recentChangesHTML': 'Version 1.5 - UI overhaul. Image support (requires internet, storage permissions). Fixes.<br>Version 1.4 - New menu UI. New TOTP UI. Rename support. Copy/paste support.<br>Version 1.3 - Native camera/QR code support (requires camera permissions)<br>Version 1.2 - Return of the progress circle<br>Version 1.1 - Tablet support', 'comments': ['No idea how to make this work, no guidance at all. What is the field which is pre-filled with a 64 hex value? I was not allowed to leave it unchanged, so I could never get a single OTP code added. I installed "FreeOTP+ (2FA Authenticator)" instead, a fork which has fixed small things like this.', 'I have 2 cameras on my device, and the app chooses the wide angle one, which cannot focus on the QR code on the paper. There is no way to change this behavior. I cannot therefore scan the QR code', "Well, it used to work fine, but it's stopped giving correct codes and I can't work out how to transfer to another authenticator. Can't believe the number of problems I have with logging in to sites in general, not with this app, but the whole logging in business is a mess.", 'This app kept crashing whenever I tried to scan a code making it useless so I uninstalled it and now use Google Authenticator which works well with no problems.', "A simple, functional OTP manager; much more light-weight than the official Google Authenticator app, and as far as I've been able to tell, just as functional, if not more so. The official Authenticator app is easier to use, but the learning curve for this is actually pretty shallow. Definitely consider it if you value preserving the space on your device.", "small, functional, no ads. I've added Google, Microsoft, CloudFlare and Humble Bundle accounts. I keep using it, but I can't add stream account (it's quite special case), neither look or exports secret keys to transfer the 2FA data to my other phone. Also, app can't use a site's favicon, and doesn't even have dark background mode. +1 star for letting it be FOSS.", "This is simply the default 2-factor authenticator app to get. It is straightforward and easy to use, and perhaps most importantly is one of few (if not the only serious one?) that doesn't either have ads, or require login on various cloud services just to get to your secure tokens.", "It does what it's supposed to, nothing bad to say about that part. But there is no option to export to a new phone so I had to manually disable 2FA in a dozen of sites and re-enable with the new phone, using another app this time. Use another app, to save you the headache in the future.", "App has a bug that causes account icons to no longer work in modern Android versions, and while it's fixed in code, there's no indication that a new version will ever be released on the Play Store. I can no longer recommend this app as it appears to be abandoned. Find an alternative.", "Keep all your tokens in one place! No need to hunt for Code Generators among countless menus nor rely on insecure SMS for two factor authentication. Will read the QR codes that other apps use even if they don't say anythong about FreeOTP. You can also attach icons to each token (do an image search and get them) which makes it visually easy to identify which token is which.", "Safe and simple and easy UI, not relying on SMS (which is unsafe, and country-dependant), works for all countries. And it's open source. No need for export (there are password managers to keep the main code for you). Thanks for deveping this", 'I like the app, though there is a couple of issues images: 1. when I add 6th image the 1st one disappears, it seems like there is a limit on amount of images 2. after application restart all images disappear  Phone: xiaomi mi a2 lite, android 8. Could you please check it out and fix if possible.', 'No way to backup tokens on OnePlus7 Pro and Android 10. Adb backup does not work! Stuck with no way around but to attempt rooting.', 'A simple app that does exacrly what it needs to do!', 'The app works well, exactly as it promises. I only miss the posibility of transfering the codes to another smartphone, and that the images that I asign to each number generator are lost from time to time.', 'Used this for about a year or so. Great app. Unfortunately, development has ceased for about a year and I am now using andOTP.', "Crashes on empty issuer, doesn't handle image, not maintained.", 'Great while it lasted! It appears development has ceased, and it is recommended to migrate to andOTP. Thank you for this app. <3', 'Great app, from the opensource stalwart RH. ðŸ™. if possible please add a pin lock for freeotp app to prevent mistakenly handling.', 'The app worked great until I had to change my phone. No export, migration or anything similar made it a nightmare.', "App lacks of active development and regular updates. What's great about: compared to others like Google Authenticator verz efficient, minimalistic implementation which results in small app size.", 'App not updated since 2016. Not optimized for Android 10', 'Worked great for years. Now it gives me bad codes.', 'Worked fine, but no longer maintained and a pain to migrate to new phone/clean flashed ROM etc. Switching to andOTP works miracles.', 'Good app, works well and good design. Oh, also open source so probably doesnt spy on you like Google does.', 'The one thing about open source is you know what you get. They even have their code on github. Simple, effective, awesome authentication app!', 'Nice and clean fine based two factor app', 'best OTP generator! One request though, can you make it so we can use the front camera to scan in aswell? back camera doesnt work :^\\', 'The app is not actively maintained!! Last commit to source was about 2 years ago. Big thumps down', 'Seems like only this one can support 8 digit and step duration other than 30 seconds.', 'Really good app. No ads and simple interface.', "Otherwise well working app but import/export is missing and it's crucial feature in this kind of application.", "I have a problem the phone that I used to install de app was lost I bought a new one installed the app again bt I'm struggling to add my account to the app for me to receive an authentication code and it's for work purpose please help", 'Good Google auth alternative. Easy to back up.', 'Does not display the OTP - just shows dashes. Uninistalled.', 'Simple does exactly whats needed. Given that fedorahosted is no more, though, where is the project homepage now? Pagure?', 'Supper easy to use App', 'Very light weight and starts in an instant.', "I can't export and backup and this is a big problem because I want to change phone.", 'Awesomeness!!!!!! Make sure you keep updating it. I love it.'], 'appId': 'org.fedorahosted.freeotp', 'url': 'https://play.google.com/store/apps/details?id=org.fedorahosted.freeotp&hl=en&gl=us'}
