{'title': 'tldroid - simplified man pages', 'description': 'Android client for <i>tldr</i>, a simplified and community-driven man pages.\r\n\r\n- Search and view simplified manual for common commands\r\n- Execute commands directly from app (only supported commands by Android, without root permission)\r\n\r\nCommands are provided by https://github.com/tldr-pages/tldr\r\n\r\nThis app is open source at https://github.com/hidroh/tldroid', 'descriptionHTML': 'Android client for <i>tldr</i>, a simplified and community-driven man pages.<br><br>- Search and view simplified manual for common commands<br>- Execute commands directly from app (only supported commands by Android, without root permission)<br><br>Commands are provided by https://github.com/tldr-pages/tldr<br><br>This app is open source at https://github.com/hidroh/tldroid', 'summary': 'Access simplified man pages on the go, because why not!', 'summaryHTML': 'Access simplified man pages on the go, because why not!', 'installs': '10,000+', 'minInstalls': 10000, 'score': 2.91, 'ratings': 254, 'reviews': 104, 'histogram': [111, 20, 5, 12, 104], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.1M', 'androidVersion': '2.3', 'androidVersionText': '2.3 and up', 'developer': 'Ha Duy Trung', 'developerId': 'Ha+Duy+Trung', 'developerEmail': 'haduytrung@gmail.com', 'developerWebsite': 'https://hidroh.github.io/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '6110072571642188592', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/p0k57Es4hkHulnnON6jemKZrFwf1li--W3P4ByXE8K-05oltSGSyQpQfP2MC2J3bghA', 'headerImage': 'https://lh3.googleusercontent.com/pRse_HmnQRKnxWQjjdqtegRVyLNk3BSLdjNIWL747fXSOXneNmkGw2TPBU7yeZnzEBg', 'screenshots': ['https://lh3.googleusercontent.com/gr_dNY45hgAJ0l08XB3SFYPuiMaHBAJx34GDkSNNfF-Zs_PY9zS2Utt4BUyg8JdH8Ik', 'https://lh3.googleusercontent.com/iDA1LmY9YQQVpQdJuct2L8M2yljUPlHuqSX6w2MjRbKEy4q9ATS7WInFpn9IVKscqV0', 'https://lh3.googleusercontent.com/IUXfxwNuDcSBdCiE7qKE4AhIhRI4-8_5htdGaOlU0uczwLfMINRbJjYtJxFLa2V2xcw'], 'video': 'https://www.youtube.com/embed/-fvXeceQyG8?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/-fvXeceQyG8/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 29, 2015', 'updated': 1471741937, 'version': '1.6', 'recentChanges': 'UI improvements', 'recentChangesHTML': 'UI improvements', 'comments': ["Broken. Don't bother installing it. Shame really, very simple designed app but the functionality is broken and it hasn't been updated in a few years.", "There are no commands available and it was last updated in 2016 terrible. Looks cool but not useful at all. Get any other man page helper. I'm uninstalling now.", "Looks very useful, but can confirm that basic commands like tar and ls are shown as not having been written yet when tldr.sh shows them fine. Will rate again once addressed. Edit: Wow, not updated since 2016, I suppose I shouldn't hold my breath.", 'All data is gone now, cannot see any commands. Everything appears as unavailable.', "I think something must be broken or outdated. it's unable to access any commands. As far as I can tell there's no way to refresh the app or anything like that. On the plus side: no ads!", 'A very neat app that is unfortunately missing quite a few, most likely all, pages. It used to be great but currently it serves no purpose.', 'Great app, been using it for as long as I can remember.. but recently it completely stopped working.. all the commands arent found on the TLDR.is list (the backend it uses)', "It does not download any man page. Nothing can be viewed. Maybe latest backend API broke app's calls. An update on this app must be submitted asap.", "Sadly doesn't work. Apparently no longer maintained according to github comments on issue that has caused it to be broken.", 'was a great app but unfortunately broken right now please update, someone even submited a pull request with fix to GitHub just merge it and let this great app work again.', 'Useful, however none of the updated commands from GitHub have been included in this release and are far more current than the app itself.', 'App seems to be broken. Does not load any pages at all.', 'For every command I search, I see the following: "This command is not yet available" with a link to the GitHub repo', 'Not functional. No pages load, no option to refresh.', 'Does not work. Even simple commands are unknown.', 'App is not working, no commands work or update.', 'nice app but no resources are loaded btw. how schould i download the tldr pages?', "This app not maintained and doesn't work.", 'Doesnt work at all! Upset!', 'abandoned, all entries are broken', 'old and not working', 'No commands are listed.', 'Doesnt work anymore.', "doesn't work", 'does not work', "This is wonderful! This app lets me browse common man pages like the dork I am from my phone. I hope someday they'll expand this to include various Linux apps, like inxi, finger, Firefox, etc as these all have man pages as well. Good for now though!", 'The app looks great. I liked the color themes and syntax highlighting. I though found myself looking for more info about any command. I realized that it does not list all the options for all commands. Does it show only the most used options? It would be nice to optionally download the full manpage and then be able to search it. Thanks!', "But there is a problem with the command list, if you pull it down you can't scroll up for previous commands, unless it closes the list. You could fix it by closing the list only if the list title is scrolled down.", "Extremely useful app, simple to use, light, and can run commands on the fly. Love you guys! PS: do you think you could some day include the c programming manual? I'd love being able to look up those libraries just like on a Ubuntu box.", 'it\'s very easy to get the app "stuck" so you can\'t load anything and some pages (git-commit) have names that are not the actual command. i would like if it was a experimental feature instead of just a feature.', 'I can\'t scroll up when um in "All Command" section. Better then man command i guess', 'Had given a nice example of how to commit commands. As for me that would be done by newbies mostly rather than skilled users', "Hey dev it doesn't work anymore. Doesn't download any pages. Please look it up", "App doesn't work. No commands found.", 'Would love to have a random page function, because reading random man pages is fun.', 'A waste of time -- not enough info in the pages', 'Exquisite design and excellent interface to the terminal. Very responsive devs.. Now includes a requested list of commands...', 'Only a reduced version of... Er... No, these are no real man pages.', "Doesn't come preloaded with commands for offline use. syscalls are missing.", 'found commands others did not.'], 'appId': 'io.github.hidroh.tldroid', 'url': 'https://play.google.com/store/apps/details?id=io.github.hidroh.tldroid&hl=en&gl=us'}
