{'title': 'Home Assistant', 'description': 'The official app for Home Assistant. Home Assistant for Android lets you control all your devices in your Home Assistant instance. \r\n\r\nHome Assistant is an open-source home automation platform that focuses on privacy and local control.\r\n\r\nHome Assistant for Android requires that you have access to a Home Assistant instance.', 'descriptionHTML': 'The official app for Home Assistant. Home Assistant for Android lets you control all your devices in your Home Assistant instance. <br><br>Home Assistant is an open-source home automation platform that focuses on privacy and local control.<br><br>Home Assistant for Android requires that you have access to a Home Assistant instance.', 'summary': 'The official app for Home Assistant. Control your home anywhere in the world.', 'summaryHTML': 'The official app for Home Assistant. Control your home anywhere in the world.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.562914, 'ratings': 1514, 'reviews': 556, 'histogram': [60, 10, 70, 250, 1122], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '6.3M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Home Assistant', 'developerId': 'Home+Assistant', 'developerEmail': 'android@home-assistant.io', 'developerWebsite': 'https://www.home-assistant.io', 'developerAddress': None, 'privacyPolicy': 'https://www.home-assistant.io/privacy/', 'developerInternalID': '7486132517590977161', 'genre': 'House & Home', 'genreId': 'HOUSE_AND_HOME', 'icon': 'https://lh3.googleusercontent.com/iS3Wa525QXuFdSkWi-s45GUK4oiPpOgmWQosv81pk0P1dF8Al6opybbofk5v-5hTQhua', 'headerImage': 'https://lh3.googleusercontent.com/2KmJDoR7tQFQvtDOxEsAOWJoGYppvsx56aJql6dIzFcOQa0Eb8OeBMgrdqFCGAt68JDL', 'screenshots': ['https://lh3.googleusercontent.com/4n012QFJ2PH0deJJ8CiYjjOq64EKNe0WdV75iDScgAoIh4mnv3BLxg81U-PGt5gVUQ', 'https://lh3.googleusercontent.com/3LSuFvv2dNa53guIDoqE2QwtBV_Cg7iDLu8puwAYSb5-eFJDn2VZtn8jqv1sQdqcpgc'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 12, 2019', 'updated': 1589041264, 'version': '1.9.0-167', 'recentChanges': 'New Features:\r\n* Support multiple SSIDs for home network\r\n* Biometric lock/unlock of app\r\n* Notification Channels\r\n\r\nBugfixes:\r\n* Full screen video playback\r\n* Sticky notifications\r\n* Random Crashes\r\n\r\nFull patch change log: https://github.com/home-assistant/home-assistant-android/compare/1.8.0...1.9.0', 'recentChangesHTML': 'New Features:<br>* Support multiple SSIDs for home network<br>* Biometric lock/unlock of app<br>* Notification Channels<br><br>Bugfixes:<br>* Full screen video playback<br>* Sticky notifications<br>* Random Crashes<br><br>Full patch change log: https://github.com/home-assistant/home-assistant-android/compare/1.8.0...1.9.0', 'comments': ["Would be nice to just set homeassistant.local:8123 as IP adress to avoid issues with dynamic IPs. It works fine in the browser, so it would be really cool to have it in the app as well. Other than that it's a nice app for Homeassistent for getting notifications and having quick access to the platform.", 'Fantastic. Works flawlessly with my home assistant instance from anywhere, and reports accurate GPS data if wanted, which makes zoning automations and presence detection work really well.', "Amazing responsive app, Thank you very much to the devs for making such a functional product. Has all the functionality of home assistant baked in. And It's just great!!", 'you guys broke something with home wifi detection in the last update. connected with my instance reachable, but the error message shows the nabu casa URL instead of the local IP Update: months later this is happening again', 'Great companion app to control all my smart home gear configured in Home Assistant! UI is really mobile friendly', 'Best home automation there is and the only direct integration with Android there is.', 'Very stable & very functional. The perfect extension to home assistant.', "Sometimes has issues and I don't understand how it works with GOOGLE location sharing.", 'Awesome app for an awesome service. Highly recommended', "The amount of work put into this is staggering. It's an open source success story.", 'Awesome app. Works 90% of the time.', "First release without any bugs. But i feel bit difficult to scroll at custom components. Except this, everything feels smooth. Edit: (Feb 2020) app opens fast, but after using/creating automation editor, the screen getting very very slow and unable to save the automation with save floating button as it's not detecting. Edit: (Mar 20) everything works, except when I'm in local network (specefic router SSID), it's not connecting local IP address. It's still trying to connect public address.", 'I love this app! You are awesome! - Featrure request: I would like to place Weather, Graph, AC widgets on the Android homescreen.', "Works well! As with most of the HA stable, it's a little 'nerdy' and not very well documented (yes, i know i can change the docs myself). 30 minutes after setting it up, i had it working remotely AND generating Zone triggers! Now if i could work out how to get the notifications coming thru Android Auto ...", 'Love the way its coming along so far. My only complaints deal with speed and widgets. I have a nice dark theme but the widgets just ruin it by being so bright. I would love to see an option to change widgets to look either dark or transparent. I would also like the app to load quicker if possible.', "Amazing other than one glaring issue; The location update takes too long. I have made sure it has no battery optimisation, and anything else I can do in the app settings. I moved to this app to get rid of own tracks however it seems I need to reinstall owntracks unless I'm doing something wrong. (One plus 7 pro, homeassistant 0.103.5, app v 1.3.1)", 'Please fix the problem reported by another reviewer. After deleting authentication token, the app says "unable to connect to home assistant" and HA log has "Login attempt or request with invalid authentication from 192.168.1.150" entry which is the IP of the android device. The retry button does not do anything. UPDATE: To fix the problem above, do NOT reinstall the app. it does not help. Instead, keep the app installed and delete it\'s data and cache (android settings). This will effectively reset the app.', 'It just works. Cloud (Nabu Casa) or local URL, it just works as it should. Works like logging into the web page. Notifications and Geofencing is great. This is the best way to use Home Assistant via a UI.', "Like it. Just a small change that would be good. Give the option to refresh your custom panel. I'm creating one in react and I need to uninstall and reinstall the app to get the new updates I make. It must pull in the js when installing the app. Can we refresh the cached js in the app config tab", "Please give me an option to update my gps more frequently! Almost perfect other then too slow to update GPS position. Just need a couple minutes faster. I know it'll use more battery, but just give me a warning when I select it that it's my own risk.", 'Great start to the android app but need location of devices fixing ASAP. The main 2 functions should be to see to see your HA whilst away from your home and also your devices location to let the automations work properly. Currently my phone is not showing on the map but location working in other apps. Often i can leave a location and it wont change for 4 or 5 hours or even days sometimes. Keep up the great work though.', 'Good start for an app. Tracking lacks period configuration and often seems to be killed by phone OS. Information in HA server device tracker lacks last reported time and charging status (Google maps has one). If device removed from HA to add it again need to clear app data and login again. I have configured proprietary port for HA server and it takes time to scan network in the app, would be good to have enter manually option sooner when first start.', "Great app. Love all of the recent improvements. As a note, I've found that disabling battery optimization for the app in my phone's system settings helps the location to report properly in the background. I've also found it helps to install GPS Status & Toolbox to improve the location accuracy while in the background. One feature wishlist item- could the battery level be a separate sensor entity like in the iOS app? I use a template sensor now but wouldn't mind not having the extra config.", 'While the app by itself works fine, the latest update is a bit "temperamental". I notice that it looses connection a lot, even when I\'m on the same network as my Home Assistant is, and suddenly the Battery and WiFi sensors disappeared. I hope truly that this can be fixed, because I think it is a great addition to Home Assistant. Specifically the fact, that it updates location. Please keep up the good work! And I hope that more sensors will be added. In Hass Logs: [homeassistant.components.mobile_app.webhook] Refusing to update non-registered sensor', "Great work so far! I would like to use toggle widgets for lights but they are useless for me as they don't show current status in any way (they work but the widget looks the same with the light on or off).", 'Widgets are broken as of latest update.', "Edit: I've been enjoying using this app, so I'm adding a star. I would still like for the app to recognize when I'm connected to WiFi so that it can connect to the host. This is a good start to a Home Assistant mobile companion app, but one function isn't working properly. Home Assistant doesn't use the local address when I'm on WiFi.", 'Great companion for Home Assistant. Essential if you want to use location tracking without having to set up OwnTracks, Google Location Sharing, or Life360. Simple solution for enabling push notifications in Home Assistant too. Perfectly displays my Lovelace UI.', 'I tried multiple times to get this app to work but no matter what all it says is "unable to connect to home assistant" and the only option available is retry. I can access it just fine on my computer (where I can see "log in attempt failed" notifications with my phone\'s IP address) so I know everything is working from that end. I\'ve uninstalled and reinstalled the app and it still won\'t work.', "Device tracking doesn't seem to handle network transitions well (mobile/WiFi). Widgets only work on WiFi (local network). Would be helpful if widgets displayed current status (for lights). Looking forward to updates", "Great app but please improve gps features with more settings, like update by time frequency or distance and accuracy. A lot of times when app is in background the position is updated after half hour or isn't updated! App ignore battery optimization but on my Huawei P20 when app is in background position didn't never update. To avoid this I suggest a persistent notification.", 'Working reasonably well and now we have easy actionable notifications, which is great. The last update appears to have changed the way the widgets look and not for the better. The smaller round buttons looked good, but now they are large white rectangles that are not as nice to see on the home screen.', 'Works great except for one thing. If you make a convenient widget for toggling a light for example, once you leave your home network the button will spin and become unusable forever, even if you return to your network. Having to open the app to toggle lights makes the whole setup not worth it sadly.', "Worst thing about this app is the fact that if you open a browser with the address of your home assistant is the same thing. When you press back is gonna go back on what you previously had on screen and this is why not using this. With our without this you can use the browser with more success. I'll stick with another app that has the same approach but don't feel like a browser tab. Also no suport for token login.", 'It would be useful for the program to be able to connect the VPN profile installed on the phone. Then HA could establish a secure connection, e.g. with a router.', 'Great and always improving. Best home assistant app for your home assistant server. Home assistant is the best there ever was for home automations and control.', 'Definitely have made many improvements from the last time I tried the app. It used to be utterly useless, now it works just as it does in a regular browser, and it can be integrated with home assistant to receive notifications or used as a device tracker. Well done!', "Works well, noticed 2 things: badge icons are off-center, this is cosmetic, but that the images let's say from currently playing media screenshots, won't show if the server url is https but the resource is http (seems it is the same mixed-media limitation that exists in modern browsers, guessing it is related).", 'What is the unit of measurement for speed with the device tracker entity with this app? Below is what I get when travelling 65 mph. It never displays the accurate speed in MPH. source type - gps battery level - 100 latitude - 41.7352033 longitude - -85.8118285 gps accuracy - 3 altitude - 202 course - 101 speed - 33 vertical accuracy - 4', 'Great App from a great bunch of developers who deserve a lot of credit for their good work. The only slight problem is that the scaling is out on my Samsung Galaxy 10e causing icons to overlap lines on the floor plan, this problem does not occur on the same view in the Firefox App.'], 'appId': 'io.homeassistant.companion.android', 'url': 'https://play.google.com/store/apps/details?id=io.homeassistant.companion.android&hl=en&gl=us'}
