{'title': 'Missed Notifications Reminder', 'description': 'Unfortunately Android doesn\'t have default integrated functionality to notify user periodically about missing calls/messages/other notifications via sound (only LED is blinking). This opensource tool allows to monitor notifications from any applications which are important for You (including missed calls, messangers, SMS, etc) and perform sound reminder periodically \r\n\r\nJust launch app, allow it to receive notification events, select reminder interval and important applications. That\'s it. If there are any unhandled notifications from thet selected apps in the statusbar, app will notify You periodically with the notification sound you choose.\r\n\r\n<b>IMPORTANT:</b> if app doesn\'t work please try to find solution for your phone here <a href="https://www.google.com/url?q=https%3A%2F%2Fdontkillmyapp.com&sa=D&sntz=1&usg=AFQjCNFIyR4Fop8KKQ1Xye2TZ5Vb6IdBDQ">https://dontkillmyapp.com</a>\r\n\r\nThe battery is used only if there are missed notifications which requires periodical reminder. App wakes phone to perform sound notification and then sleep again.\r\n\r\nThe app uses minimum set of required permissions.\r\n\r\nAndroid 4.0-4.2 support is experimental such as these OS versions doesn\'t have a 100% working method to monitor notification removal.\r\n\r\n<b>XIAOMI</b> users should enable application autostart explicitly in the security settings\r\n<b>Huawei</b> users should disable battery automanagement for the Missed Notifications Reminder app: in the  Battery > App Launch -> Manage All Automatically - - >  uncheck MNR app\r\n\r\nSource code is available at github: https://github.com/httpdispatch/MissedNotificationsReminder\r\n\r\nBig thanks to all contributors:\r\nSergiy Byelozyorov (https://github.com/rryk) for limit reminder repeats feature\r\nnaofum (https://github.com/naofum) for Japanese translation\r\nGerasim Panteleev for bulgarian translation\r\nHeimen Stoffels (https://github.com/Vistaus) for Dutch translation', 'descriptionHTML': 'Unfortunately Android doesn&#39;t have default integrated functionality to notify user periodically about missing calls/messages/other notifications via sound (only LED is blinking). This opensource tool allows to monitor notifications from any applications which are important for You (including missed calls, messangers, SMS, etc) and perform sound reminder periodically <br><br>Just launch app, allow it to receive notification events, select reminder interval and important applications. That&#39;s it. If there are any unhandled notifications from thet selected apps in the statusbar, app will notify You periodically with the notification sound you choose.<br><br><b>IMPORTANT:</b> if app doesn&#39;t work please try to find solution for your phone here <a href="https://www.google.com/url?q=https%3A%2F%2Fdontkillmyapp.com&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNFIyR4Fop8KKQ1Xye2TZ5Vb6IdBDQ">https://dontkillmyapp.com</a><br><br>The battery is used only if there are missed notifications which requires periodical reminder. App wakes phone to perform sound notification and then sleep again.<br><br>The app uses minimum set of required permissions.<br><br>Android 4.0-4.2 support is experimental such as these OS versions doesn&#39;t have a 100% working method to monitor notification removal.<br><br><b>XIAOMI</b> users should enable application autostart explicitly in the security settings<br><b>Huawei</b> users should disable battery automanagement for the Missed Notifications Reminder app: in the  Battery &gt; App Launch -&gt; Manage All Automatically - - &gt;  uncheck MNR app<br><br>Source code is available at github: https://github.com/httpdispatch/MissedNotificationsReminder<br><br>Big thanks to all contributors:<br>Sergiy Byelozyorov (https://github.com/rryk) for limit reminder repeats feature<br>naofum (https://github.com/naofum) for Japanese translation<br>Gerasim Panteleev for bulgarian translation<br>Heimen Stoffels (https://github.com/Vistaus) for Dutch translation', 'summary': 'Periodical sound reminder for missed/unread notifications (Calls/SMS/Etc).', 'summaryHTML': 'Periodical sound reminder for missed/unread notifications (Calls/SMS/Etc).', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.04, 'ratings': 907, 'reviews': 639, 'histogram': [145, 9, 54, 154, 544], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Eugene Popovich', 'developerId': 'Eugene+Popovich', 'developerEmail': 'httpdispatch@gmail.com', 'developerWebsite': None, 'developerAddress': None, 'privacyPolicy': 'https://missed-notifications.flycricket.io/privacy.html', 'developerInternalID': '5205450443577126266', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/fi4w5kBNYrRTFwOIMQVa1TbIvixSXpy-qNDadIbX6IkYCQY0dWPGZiXHjUsFBzo6TA', 'headerImage': 'https://lh3.googleusercontent.com/Y1yLeq1WMI0tkcbFRD1xFtKkRF5N0aZ41uHBx-k-wwim7zD1Gix5ItZs0OISXq53DcIu', 'screenshots': ['https://lh3.googleusercontent.com/RIoaCw7uTMCAfMFbgzfdmDBdJMdr5aD3BhrJedO_dM34cMRlcRGKLVSZ0EsKE8gYQxRj', 'https://lh3.googleusercontent.com/Dp0fxZB1dF3Gz2AO4nvdR3pIKxEWsQDLWNtpAGK0U-_RmWUWRS9Kj7PIpM4mMs0JSiVo', 'https://lh3.googleusercontent.com/zJlVsYeALKGMNzMrHfQ-fqKYjkFRJNgQJ3Glijpzqp3Pbf-6KLp7W_Kvt-UlJf6jhPc', 'https://lh3.googleusercontent.com/7xKadq_rmQqtpB-P6B76Sz9oi4pXbWA0z6fnhmwWyjWHcjvc7OxQlT_Iz4P_jm8kjg', 'https://lh3.googleusercontent.com/P8h8ZgmEiCs5WSjZGM_n699m6IHcmfTG1M14sNn_T82M-CvLjbodm3ZF7SCqertI-Q', 'https://lh3.googleusercontent.com/wPulWPLlVtq-PnVQSI39HtX_ORXJoIzTr-SZVhuczbiQk0LM-563lZDKiorJKD65wA', 'https://lh3.googleusercontent.com/1HHPeC_BmLFO17b5K-u_BCUnTQcpzvDg7UrINegZQErx21hgg0i3eDOKxdBYE4xMJ04', 'https://lh3.googleusercontent.com/tcfCf5r2c3eI4M-Z_56IQYhj6VQS-mXDBn7wMNdtXi2h0tiz6iFFaHwxfIMvK6-4qCs'], 'video': 'https://www.youtube.com/embed/5xvi7q1_pmo?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/5xvi7q1_pmo/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 11, 2015', 'updated': 1575269985, 'version': 'Varies with device', 'recentChanges': '- Potential fix for infinite vibration in some cases\r\n- Add create dismiss reminder immediately settings', 'recentChangesHTML': '- Potential fix for infinite vibration in some cases<br>- Add create dismiss reminder immediately settings', 'comments': ['Once the app is setup correctly, it works well. My previous app stopped working on Android 10. My original one had a reminder for calendar appointments which most of the others don’t support. This app has a bonus feature; you can configure it to use other apps that have notifications, which meant I could add my calendar app. It does have a large memory footprint compared to others, 13.46 MBs on my phone. Given that it is free with no ads, you would have to be mean not to give it 5 stars. Thanks.', "Would be perfect, but the notifications are WAY too quiet and there's no volume adjustment available. Android's built-in notifications are 10 times louder, all volume sliders are at maximum yet I have to hold the phone up to my ear to hear them and even then they're still hard to hear. Automatic deal breaker. Otherwise the app would have met all my needs.", "7 months since I last tried this and still I have to choose the applications that I want to be reminded about. This blows. Just have two or three check boxes for applications such as messages and missed calls. Why do I need a notification for anything else? I gave you a second chance and I won't be back. By the way, I'd be more than happy to pay for a proper app", 'Great app! My Moto Z3 Play has no home button, so there was no way to know if I had a message, unless I constantly checked the phone. With this app it lets me know. Have used it on my phones for years.', "I like the options for various auditory ringtones, and for choice of number of minute intervals that you want to be reminded and for number of repetitions and for which applications you want to be notified, BUT I think that after you CLEAR the message it should STOP reminding you with the same ringtone. I think that is a BUG. It does not have to keep alerting you with a ringtone that the NOTIFICATION IS STILL ACTIVE after you've cleared your messages. Please fix that.", "This would be a good App if it wasn't for the fact you can hardly hear it . Very poor audible . Please do something about the volume . I had to uninstall it . I would prefer to have this App but can hardly hear the thing .", "Really useful app to make up for the loss of the flashing led on the oneplus 6t. Only problem I have found is that, when I connect to the car with Bluetooth, I don't get the reminder sound. Otherwise pretty happy with this app.", 'This App is a great Idea. My ZTE Blade 10 reminds me every 13 minutes when set to .25 does not really matter its all the same at any point. Battery optimization is off. In applications all orange squares are ticked. Thanks, any help would be great!', "Sometimes it goes haywire....starts going off whenever it wants. Overrides do not disturb. Power cycle usually fixes it but had to disable it today because it wouldn't stop setting off the notification when there is nothing there so after 6 months I have to find a different app", 'Very useful application and seems to work ok but not flawlessly. Major features that makes it less attractive for me: 1. When in silent mode (as opposed to DND) my phone vibrates on incoming messages. This application keeps quiet - I would expect it to vibrate as well. 2. There is no option to select the type of reminder: sound/vibrate. This could be used to circumvent the previous issue, in this case: switch the phone to Silent, disregard audio profile and use  Vibrate only. Thanks.', "The idea is good, but there is too little customization, I can't even find the options that I was looking for. I wanted to make sure to keep calendar notifications appearing in the notification bar until I would dismiss them. Cause sometimes they are dismissed by mistake (or by themselves). The only that this app does is notify if there are still notifications in the bar.", 'It just remind you that you have missed alerts (will never know which). But does not say which of them!!! Or which App!! Should repeat the original notification from the original App!!!!!', 'Love this app as i dont have an led on my tab like i do my phone this did the trick and it prompts you all the way to install, so easy! Great work!', 'Good but needs a few flaws ironing out before it gets the other star. When I have WhatsApp connected to my laptop, even though there are no messages or calls I need to respond to, it keeps notifying me. Unless I have a message it needs to shut up. Stop being so annoying and alerting me when there are no messages.', 'It does what it says. Not a 5 star yet because it lacks some customization but it is one of a kind! Cant wait for future updates!', 'I love this app. Inwas suffering from the Android 9 no notification bug. This app fixes it flawlessly. You can give it permeation to "remind" you of all apps or select them. Change the time and amount of times it\'s reminds you and a whole lot more. Over all a lovely and VERY helpful app.', 'If phone does not have a reminder system for say text messages or missed emails, this repeats the notification sound, custom time intervals.', "This App is causing my phone to awake from sleep. And it's impossible to turn my phone off and keep it off. When I uninstall this App I can do the two things I've mentioned above. I would really like to use the App though.", 'Missed Notifications Reminder works well and is very useful. No ads, no phoning home. On Xiaomi MIUI needs setting to autostart & not to optimise battery. I reported a "bug" (actually user error), & got a reply with the solution immediately.', "Great app! Can't work out how to filter by channel though - some apps I only want a subset of notifications to repeat.", 'I use this on my Moto E4 and it works great. I\'m a fan of open source software because it\'s typically good quality and doesn\'t have ads, and this is no exception. Simple, no frills but has some useful advanced settings.    I wanted it to notify me of missed text messages and phone calls so I\'m having it monitor "Messages" and "Phone" apps. I think choosing the correct apps to monitor is something some users will have trouble with, but some experimentation and testing to ensure I had the correct ones is all it took.', "Excellent app in all ways. Reliable. Tone comes every 10 minutes I set it for, so I don't fail to get or answer a missed call or email. Hope to find a different tone if available; if not, default tone is fine.", "Pixel 3 user here. I was upset that there was not built in notification reminder in the Pixel 3 (pretty lame on their end). I was glad to see this app. For sure it does miss reminders on text messages (it generally works but is inconsistent) where it won't remind repeatedly, which is my setting. I have it in vibrate mode now (which is most of the time for me) and it hasn't worked for several text messages, which two different people. Eugene perhaps there is an advanced setting I'm missing or just a glitch every now and then?...It's free and generally works, so how could I complain. It does take some testing out as there are lots of settings. Since there was no built in notification reminder in the Pixel 3 it would force me to check my phone often as there is no way to hear the vibrate on the Pixel 3 even when set to strongest. With this reminder I don't have to check rather I get a reminder, which is the way is should have been (and be so reliant and focused on that screen)! However, as stated it is not 100% work with the text messages (which is what I use this app for) but darn near close.", 'User interface can be a bit challenging for new user, a really useful app.', "Liked this app more than another that is more popular.  Generally it works though as with any app, there are hiccups.  I have to pop into the app and reset things as sometimes the notifications just stop working for whatever reason.  Still more reliable and simpler to deal with than the other app.  It's updated quite often as well.  Tonight I did discover Notification Reminder in my S9.  It's under Accessibility in Settings. So notification reminders came with my S9.  Not sure how I missed this when I was googling missed notification reminders.", 'Exactly what I was looking for! Playing sound until the notifications/mesaages are checked', "App doesn't utilise android10 programming. Cannot personalize correctly. And... no flash screen settings = Minus 20 stars", 'This is the best app out there for not only missed calls and text messages, but also calendar reminders. Very useful! Make sure to give it all the permissions necessary to work right. Question for the developer: Advanced settings shows a vibration pattern of 0, 100, 50, 100, 50, 100, 200. Can I use this to adjust the duration of the vibration? I would like to make the vibration shorter. Thanks!', 'No more "you didn\'t get my call?" or "why didn\'t you answer my text?" Perfect for old folks like myself who don\'t keep their phones attached to their hands 24/7! For those having trouble setting it up, you need to figure out which app post the notification you want repeated. There are some tools available (Notification History apps) or, on Oreo+, examining the original notification should help determine its origin.', 'Good, basic app. It would be nice if the reminder intervals could be set in tens of minutes hours and possibly days. My last reminder application did that and it was great', 'It worked for the first few weeks, then it suddenly stopped doing so. I cleared the data and cache, re-entered my specs, and still nothing.', 'Wonderful design. Excellent development. Works great on my Pixel 3a. Would love to see an LED or screen light as an option. Will pay for premium version.', "Installed on my Huawei P20. Didn't work at first, but after a restart it seemed to be ok, but a day later it was erratic. Sometimes it will give a notification, sometimes it won't, sometimes it will give a notification after a minute, then no more, or just give them at random intervals, even though I've set them for every minute and infinite times. The interface/options could be a bit easier to use, but works ok if you take your time and you know what you're looking for. Going to uninstall it as it doesn't do what I wanted. Not sure if it's just because of my phones make or model. ******UPDATED***** Having messed around with the settings I've finally got the app to work. Huawei have a lot of 'hidden' settings, and I'm not really sure what made the difference, but it now seems to be working correctly.", 'Good app. Lack of customization, like ringtone selection.', "This is working well on a Pixel 4. I'd give it five stars if I could set the notification tone and vibration pattern frequency and interval individually by monitored app.", 'I installed the app to get missed Messages and Phone notification reminders. The app works perfectly with Messages, but does not supply any reminders for voicemail and missed call notifications, which are the two phone reminders I most want and have tested. The phone is a Moto G5 Plus running Android 8.1 and the standard Google Messages and Phone apps. I hope there is some fix for this problem. If the phone reminders worked, my rating would be 5 stars.', "Great App- It does what I want and its easy to set up.  What I can't figure though - How do you add a reminder for a missed call?  I have a Samsung Galaxy a5 (2017) phone and have looked through all the apps and given various phone apps access - But cant see any obvious apps that would indicate a missed call.  UPDATE: Eugene suggested adding the Contacts app to the list - This fixed the 'missed calls'. Excellent support - Thanks Eugene.", 'Seems to work well unless "Do Not Disturb" is on. Android version in use is 9. Override to work with DND doesn\'t seem to work. I\'ve been testing it with an app from Wyze that posts notification of camera motion. If DND is off and motion is detected by the camera, both the Wyze app and this one show as being recently used under App notifications. If DND is on and the camera detects motion, the Wyze app shows as being recently used but this one doesn\'t show as being used during the event.', "After I downloaded this I got constant alerts, even without messages. The developer suggested I check, my settings. Not sure exactly what I picked wrong, but I reset things and it works great now. Thanks for this app, it really helps since Android doesn't give a repeated message notification.", 'I find it very useful to have a persistent reminder of unread text messages. It was pretty easy to set up, and I love that it is open source with no advertising!'], 'appId': 'com.app.missednotificationsreminder', 'url': 'https://play.google.com/store/apps/details?id=com.app.missednotificationsreminder&hl=en&gl=us'}
