{'title': "Whitaker's Words", 'description': "This is a port of William Whitaker's words program to android.\r\n\r\nWords has an extensive dictionary of the Latin language as well as the capability to recognize various morphological forms and determine what the root word is as well as the what form it is in. Unlike other apps based on Whitaker's words, this is a port of the original code rather than simply using the dictionary, and therefore essentially feature complete compared to the desktop program.\r\n\r\nThis app is ad-free, open source, and requires no permissions.\r\n\r\nSource code: https://github.com/ids1024/whitakers-words-android\r\nBug tracker: https://github.com/ids1024/whitakers-words-android/issues", 'descriptionHTML': 'This is a port of William Whitaker&#39;s words program to android.<br><br>Words has an extensive dictionary of the Latin language as well as the capability to recognize various morphological forms and determine what the root word is as well as the what form it is in. Unlike other apps based on Whitaker&#39;s words, this is a port of the original code rather than simply using the dictionary, and therefore essentially feature complete compared to the desktop program.<br><br>This app is ad-free, open source, and requires no permissions.<br><br>Source code: https://github.com/ids1024/whitakers-words-android<br>Bug tracker: https://github.com/ids1024/whitakers-words-android/issues', 'summary': 'Latin Morphological Analyzer and Dictionary', 'summaryHTML': 'Latin Morphological Analyzer and Dictionary', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.9, 'ratings': 179, 'reviews': 87, 'histogram': [1, 0, 1, 7, 168], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '6.0M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Ian Douglas Scott', 'developerId': 'Ian+Douglas+Scott', 'developerEmail': 'ian@iandouglasscott.com', 'developerWebsite': 'https://whitakerswords.ids1024.com', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5165865223540213852', 'genre': 'Books & Reference', 'genreId': 'BOOKS_AND_REFERENCE', 'icon': 'https://lh3.googleusercontent.com/wHiZ_DimfLQBdn0-DqmICUhm_ciaRCeVuqCPh-BE6zI2moERelR2TWSRLb1HZfg6mdQh', 'headerImage': 'https://lh3.googleusercontent.com/WZEcq9uxSTaI1vaDrM53hTqHGUcmRPus-z2Fea_j111kMJALsXHHznaWGI2ClaapqMAL', 'screenshots': ['https://lh3.googleusercontent.com/A7OKM_AN-uTSMQoZlIvjU4ZGrOf1jyzsSv39rZpJ6d-0C6X0q4d_u45rr0NT43Gf4Is', 'https://lh3.googleusercontent.com/P6fs3cJVZVpH6fSU0VRaGaRfln8QOo-QiD-bBXhke3q1ORN7rG8jQ7zM9qFUBz_t_153', 'https://lh3.googleusercontent.com/89itflZgUewpgqH2FssqaCOT30lXea_B6L4p47cX4fIRhqvXbBb_fKtl9Ggyx4CTKXlq'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 8, 2015', 'updated': 1533691047, 'version': '2.0.0', 'recentChanges': '- New material UI\r\n- Fix Android 4.0 support', 'recentChangesHTML': '- New material UI<br>- Fix Android 4.0 support', 'comments': ['Straight forward explanations, veeery objective and easy to manage. In short, a must.', "Where would I be without this app? I like to pray the Breviary in Latin. There is plenty of obscure vocabulary from various centuries therein. Whitaker's has all the words, and is swift and easy to use. My only wish is that it would save recent searches or allow starring/highlighting of entries so that one could make a list of vocabulary for review. (Word Reference has this feature.) But it's a fantastic, utterly simple, and incredibly useful app.", "I teach Latin at the middle and high school levels and I use this app every day. The definitions are great and the parsing is very helpful. Figuring out what the abbreviations mean can be difficult but once you do it's not a problem. I recommend this app to my students all the time and I think it would be helpful to anyone interested in translating Latin.", 'Only wish there were a quicker way to switch between English and Latin. Otherwise excellent port!', 'Excellent. Does what it says, works flawless and has absolutely zero ads. What more you could ever want from an app? Thank you author!', 'It is fantastic does exactly as it should, gives all grammar information on words also.', 'Worked perfectly on Android. Very easy to use.', 'Works well, has a plenty of words. I like it', 'Really simple it is really good as well and I recommend it to all who are learning Latin.', "This helps me more than any teacher I've ever had.", 'I am a Latin student and this has never failed me!', 'Best app for Latin dictionary', 'excellent ( no macrons, alas )', "Very good to see this in app form! A great help for learning Latin! Feature Reques: Since this is a program it would be phenomenal if you could click on a word and get all the actual declensions or conjugations. It clearly already has all this information in the program, so would only have to work on the formatting for displaying. If it did this someone could almost learn this Latin just using this app! For an example, in Spanish the website Tomisimo does this conjugation breakdown' very well!", "Good work, but i don't like the update that removed the main typing area and button toggle. The typing area replaces the title area at the top of the screen now, and you have to go to the menu to toggle translation direction. I prefer the old toggle button. Would give 5 stars if not for new update. Also, adding a bookmark feature would be great, but i wouldn't dock a star for not having that.", 'Worst', 'Not complaining...', 'Wonderful', "It is great that finally Whitaker words was ported to a phone. This was a much needed app for us Latin lovers. Kudos to the developer. I'd only suggest that an x be added to the entering field so that one can quickly delete the previous word entered. Udate: Many thanks to the developer for adding X.", "This app tells you the translations of each individual word but, still \nlet's you piece your sentence together. Great app! Congratulations to the \ncreators for this easy to use Latin translator.", 'This is the Latin app. Do not bother with anything else.', 'I love this app so much, but I just wish it would have a more modern design.', "Fantastic simple working port of the Whitaker's Words program. It's great \nto have it in Android form.", 'Most excellent. Works just like the command line version on my desktop.', 'Been looking for this for years!  A fine port of the brilliant original.', 'Amazing translation app for Latin-English or English-Latin.', 'Great Latin to English', "I don't normally do reviews, but this is an excellent app. I have been waiting years for whitakers words in app form. Glad someone did this. It is much easier to use than the mobile site.", "I've been waiting years for a good Whitaker's app. Thank you for making this. No complaints. A black on white or other color scheme would be nice.", 'Excellent. I love the search as you type. Presentation could be improved, e.g. ability to change text size.', 'An absolute essential if interested in the Latin language, and a proper tribute to the work of William Whitaker', "I'm glad someone ported this. I had been running the DOS version in an emulator, but this is a more elegant solution.", 'Perfect! This is what I have longed for. Thank you so much', "I've been using the MS-DOS version for many years and now it is available on my phone. Recommended.", 'Finally in app form!!! So helpful with Latin studies.', 'Got me through my Latin A level', 'A simple and effective app based on a program with a long history of usefulness.', 'It is a live saver.', "Finally, Whitaker's Words on Android with full functionality.", 'Learning latin? Get this app.'], 'appId': 'com.ids1024.whitakerswords', 'url': 'https://play.google.com/store/apps/details?id=com.ids1024.whitakerswords&hl=en&gl=us'}
