{'title': 'Aard 2', 'description': 'Aard 2 is a simple dictionary and offline Wikipedia reader. Aard 2 is a successor to Aard Dictionary. It comes with redesigned user interface, better dictionary storage format, bookmarks, history and other features and improvements. \r\n\r\n<i>The app itself doesn\'t include any dictionaries and doesn\'t provide a way to download dictionaries from within the app. Visit http://aarddict.org to find dictionary downloads - Wikipedia, Wiktionary, Wikiquote , Wikivoyage in many languages, FreeDict dictionaries, WordNet </i>\r\n\r\n<i>Aard 2 uses new dictionary format (dictionary files have .slob file name extension) and cannot use dictionaries in Aard Dictionary\'s .aar format.</i>\r\n\r\n<h1><b>Features</b></h1>\r\n\r\n<b>Lookup</b>\r\n    • Lookup queries are punctuation, diacritics and case insensitive.\r\n\r\n<b>Bookmarks and History</b>\r\n    • Visited articles are automatically added to history and appear in History tab. Articles can also be bookmarked (tap Bookmark icon when viewing article). Bookmarked articles appear in Bookmarks tab. Bookmarks and history can be filtered and sorted by time or article title. Both bookmarks and history are limited to a 100 of most recently used items. To remove bookmark or history record, long tap a list item to enter selection mode, tap items to be removed, tap Trash Can icon and confirm. A bookmark can also be removed by tapping Bookmark icon when viewing article.\r\n\r\n<b>Dictionary Management</b>\r\n    • Dictionaries can be added by scanning device or by manually selecting dictionary files.\r\n\r\n    <i>Note that application itself does not download dictionary files.</i>\r\n\r\n    • Opened dictionaries can be ordered by marking and unmarking them as "favorite" (tap dictionary title). Lookup results of equal match strength from multiple dictionaries are presented in the order of dictionary list. Dictionaries can also be deactivated. Inactive dicts do not participate in word lookup or random article lookup, but are still available when opening bookmarks, history or when following links in other articles. Unwanted dictionaries can also be completely removed from the program (but dictionary files are not deleted).\r\n\r\n<b>Article Appearance</b>\r\n    • Dictionaries may include alternate style sheets. User may also add custom style sheets via Settings tab. Dictionary built-in and user styles appear in the "Style..." menu in article view.\r\n\r\n<b>Math</b>\r\n    • Mathematical articles are rendered as text using MathJax (http://www.mathjax.org/) - scalable, styleable, beautiful on any screen.\r\n\r\n<b>Random Article</b>\r\n    •  Tapping application logo in main activity finds a random title in an active dictionary and opens corresponding articles. User may optionally limit random lookup to only use favorite dictionaries.\r\n\r\n<b>Volume Buttons Navigation</b>\r\n\r\n•  When viewing articles, volume up/down buttons scroll article content or, if at the bottom (top) of the page, move to the next (previous) article. Long press scrolls all the way to the bottom (top). \r\n•  In main view volume buttons cycle through tabs.\r\n\r\n<b>Fullscreen Mode</b>\r\n\r\n•  On Android 4.4 and newer articles can be viewed in fullscreen mode. Pull down the top edge to exit fullscreen mode.\r\n\r\n<b>Requested Permissions</b>\r\n<b><i>android.permission.INTERNET</i></b>\r\n    Aard 2 uses local embedded web server to provide article content. This\r\n    permission is necessary to run the server.\r\n\r\n    Also, articles may reference remote content such as images. This\r\n    permission is necessary to load it.\r\n\r\n<b><i>android.permission.ACCESS_NETWORK_STATE</i></b>\r\n    User chooses when to allow loading remote content: always,\r\n    when on Wi-Fi or never. This permission is necessary to implement\r\n    this.\r\n\r\n<b><i>android.permission.READ_EXTERNAL_STORAGE</i></b>\r\n    This permission is needed to access dictionary files on external storage.\r\n\r\n<b><i>android.permission.WRITE_EXTERNAL_STORAGE</i></b>\r\n    This permission is needed for some devices (such as devices running BlackBerry 10 OS) to access dictionary files on external storage.', 'descriptionHTML': 'Aard 2 is a simple dictionary and offline Wikipedia reader. Aard 2 is a successor to Aard Dictionary. It comes with redesigned user interface, better dictionary storage format, bookmarks, history and other features and improvements. <br><br><i>The app itself doesn&#39;t include any dictionaries and doesn&#39;t provide a way to download dictionaries from within the app. Visit http://aarddict.org to find dictionary downloads - Wikipedia, Wiktionary, Wikiquote , Wikivoyage in many languages, FreeDict dictionaries, WordNet </i><br><br><i>Aard 2 uses new dictionary format (dictionary files have .slob file name extension) and cannot use dictionaries in Aard Dictionary&#39;s .aar format.</i><br><br><h1><b>Features</b></h1><br><br><b>Lookup</b><br>    • Lookup queries are punctuation, diacritics and case insensitive.<br><br><b>Bookmarks and History</b><br>    • Visited articles are automatically added to history and appear in History tab. Articles can also be bookmarked (tap Bookmark icon when viewing article). Bookmarked articles appear in Bookmarks tab. Bookmarks and history can be filtered and sorted by time or article title. Both bookmarks and history are limited to a 100 of most recently used items. To remove bookmark or history record, long tap a list item to enter selection mode, tap items to be removed, tap Trash Can icon and confirm. A bookmark can also be removed by tapping Bookmark icon when viewing article.<br><br><b>Dictionary Management</b><br>    • Dictionaries can be added by scanning device or by manually selecting dictionary files.<br><br>    <i>Note that application itself does not download dictionary files.</i><br><br>    • Opened dictionaries can be ordered by marking and unmarking them as &quot;favorite&quot; (tap dictionary title). Lookup results of equal match strength from multiple dictionaries are presented in the order of dictionary list. Dictionaries can also be deactivated. Inactive dicts do not participate in word lookup or random article lookup, but are still available when opening bookmarks, history or when following links in other articles. Unwanted dictionaries can also be completely removed from the program (but dictionary files are not deleted).<br><br><b>Article Appearance</b><br>    • Dictionaries may include alternate style sheets. User may also add custom style sheets via Settings tab. Dictionary built-in and user styles appear in the &quot;Style...&quot; menu in article view.<br><br><b>Math</b><br>    • Mathematical articles are rendered as text using MathJax (http://www.mathjax.org/) - scalable, styleable, beautiful on any screen.<br><br><b>Random Article</b><br>    •  Tapping application logo in main activity finds a random title in an active dictionary and opens corresponding articles. User may optionally limit random lookup to only use favorite dictionaries.<br><br><b>Volume Buttons Navigation</b><br><br>•  When viewing articles, volume up/down buttons scroll article content or, if at the bottom (top) of the page, move to the next (previous) article. Long press scrolls all the way to the bottom (top). <br>•  In main view volume buttons cycle through tabs.<br><br><b>Fullscreen Mode</b><br><br>•  On Android 4.4 and newer articles can be viewed in fullscreen mode. Pull down the top edge to exit fullscreen mode.<br><br><b>Requested Permissions</b><br><b><i>android.permission.INTERNET</i></b><br>    Aard 2 uses local embedded web server to provide article content. This<br>    permission is necessary to run the server.<br><br>    Also, articles may reference remote content such as images. This<br>    permission is necessary to load it.<br><br><b><i>android.permission.ACCESS_NETWORK_STATE</i></b><br>    User chooses when to allow loading remote content: always,<br>    when on Wi-Fi or never. This permission is necessary to implement<br>    this.<br><br><b><i>android.permission.READ_EXTERNAL_STORAGE</i></b><br>    This permission is needed to access dictionary files on external storage.<br><br><b><i>android.permission.WRITE_EXTERNAL_STORAGE</i></b><br>    This permission is needed for some devices (such as devices running BlackBerry 10 OS) to access dictionary files on external storage.', 'summary': 'Simple dictionary and offline Wikipedia reader', 'summaryHTML': 'Simple dictionary and offline Wikipedia reader', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.61, 'ratings': 336, 'reviews': 143, 'histogram': [16, 10, 6, 20, 282], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.1M', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'Igor Tkach', 'developerId': 'Igor+Tkach', 'developerEmail': 'itkach@aarddict.org', 'developerWebsite': 'http://aarddict.org', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '6146463993170112943', 'genre': 'Books & Reference', 'genreId': 'BOOKS_AND_REFERENCE', 'icon': 'https://lh3.googleusercontent.com/uHQETstrk4Cipuu7TZuDus72agzYm800l8OfNf6IsfAEGqRq18H52wnuazIf8UU4Dao', 'headerImage': 'https://lh3.googleusercontent.com/5i0vHz9jl6KnA6DE7RD6AN4GSi6T2Kr9Xbfn5KHUK-b77wovnvp7IPBwyLqUazqnX34', 'screenshots': ['https://lh3.googleusercontent.com/Uf9NQk5XIB2LHScHOXJalX4BuTQSM78dTmYHU4g_H40W2krb7GsCon_ZdcNaLg6opA', 'https://lh3.googleusercontent.com/biwBeoEJP93FMF1yzRKZr_rO99YFGkKnAkEBFy_biJjxz2tfN88VvJ2ah_0sO694TmXL', 'https://lh3.googleusercontent.com/cV64y9HNpi94v4wsS1VM-P9QKrHzW2wVJn6rODkxzjXeF6Na4HqFXRnBRtwVDvTxlA', 'https://lh3.googleusercontent.com/8UtcRNe6OW0lUoXhxzUN48FAoLyb0S1QibsEw2WPn7gLQK8A-qECHN2SgPLbc33-0bM', 'https://lh3.googleusercontent.com/9l_89nppA155idnE86Kz0JidcB1erPeMhaCnCE2anwfKRWMeramraJgNvp0a91HDf-4', 'https://lh3.googleusercontent.com/Pqiz6DaCcPhSdepQyP9iKuLbwPt5K92r1JM_zrgGJS_kWTav5zyJ9LMU8SvyN6crg_E', 'https://lh3.googleusercontent.com/rKD0wOo0vwMAQlOxDuj-WgMpY4d6jgkfq0H-Aj-xoKVMzEHFaB2vLF1XOlhurhmODZt-', 'https://lh3.googleusercontent.com/yqAd7Eo543X1-3fsgY4rxq3kCRXbYNKtshaoCgC1eRfP-ATGqS_SWJkJmieSAcvMexR-'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 17, 2015', 'updated': 1587322533, 'version': '0.44', 'recentChanges': '- Fixed crash on trying to use "Find in Page"', 'recentChangesHTML': '- Fixed crash on trying to use &quot;Find in Page&quot;', 'comments': ['Now my favourite offline dictionary. Figured out how to use pyglossary to convert my dictionaries to slob, then all was well. Custom css is a surprisingly useful feature. Cheers.', "Best dictionary app if u know how to use it. The database can be space consuimng. but considering the the memory of the phones release now it won't be a problem at all. and for an open source application it does the job and better than other apps which are paid. And for those who don't know about this app, it contains dictionary and even wikipedia pages, Offline! All you have to do is download the dictionary database and keep that in your storage. (Honest Review)", 'Pointless, unable to download any dictionary. Uninstalling. This is sad.', 'Best free open source dictionary. I need to find thesaurus and synonym filed for it. Thanks 6*', 'Best dictionary app on Android.', 'best offline wiki app.', 'Black splashscreen please!', 'Надо исправить ошибку. Если уже вызвана какая-либо статья для чтения, и используется функция "Поиск внутри статьи", то вводимое для поиска слово отображается очень тёмным на очень тёмном фоне. Читать то, что вводишь практически невозможно. Зато губы сами шепчут слова в адрес создателя такого интерфейса. Обычно такие слова в словарях не публикуют.', 'I loved it, the design, the layout, and particularly, the search feature in Aard. The searching is fast and seamless. If there\'s anything that could be improved on, in my opinion, that would be to allow user to easily cancel out from the "scanning" for dictionaries part during the initial first run.', 'very good', 'Good dictionary', 'The best free offline dictionary app. I am using english to english dictionary from its website. Lightweight and good features.', 'Great', 'This was already the only app that gave offline access to all Wikipedia articles, including tables. Tables are important because you lose a lot of information if they are stripped out, like they are in other offline Wikipedia readers. With this update, it adds an online feature as well, the ability to show the article images. It also adds bookmarking and a more normal gesture-based zoom feature, both of which have long been on my wishlist.', 'Excellent offline Reader. Blazingly fast. Updated dictionaries. Downloads article Pictures only to Save Storage space. Can handle extremely large Data Sets like the English Wikipedia. Very easy to use.', 'Great application useful for everyday use as well as information collecting Thank You', "A worthy successor to the aard dictionary not only use one line but if she was the space you can download dictionaries as well. I'm dyslexic and find definitions to be very useful when reading complex documents. It's only flaw and this is a big one is an over complicated way of making text Baker and if I know your own fonts display. If we could skip the CSS complexity and just show a menu increase the font size and trees a font of external memory this would be a 5", 'It awesome. It works fast and extremely clean. It is open source. Much better then multi-million competitors. Author, keep up the good work!', 'Open Source, fast. Better than the web ;-)', 'Need pop-up window', 'Faster search and loading, and UI improvements would be good... add a popup feature to use this app from other third party apps, also add a search button when in "text selection mode" to quickly search for a word... add the ability to show/hide parts of "definitions" by expanding/collapsing them as the definition pages of wikitionary is too big... also release an edition of English wikitionary without the "translations" part', 'I use it as a pop-up dictionary for Cool Reader and FBReader. Does a good job as such. For a stand-alone dictionary there are better app choices, though. I also remember Aard 2 being difficult to set up: took a while to find decent dictionary archives.', 'I particularly like searching in multiple dictionaries at once and how it seamlessly integrates online content. Do you plan to add indexing for multi word keys or even better for content?', "Why.. in the name of God.. isn't this listed on F-Droid. I HATE the Play Store!", 'its a big star😍😘', "I am using both Aard and Aard2 but I need more dictionary and encyclopedia like: 1. enwikibooks 2. enwikisource 3. kmwiki 4. Eng-Khmer and Khmer-Eng dictionary  Many thanks if I have these and I'll donate it. And if you sell them online, it is OK.", 'Excellent offline dictionary I have ever used. It is worth giving 5 star but I have limited my rating to 4 for non implementation of text to speech feature. I will come back and give five star when you implement the text to speech feature...', 'Altogether a great app, whose flexibility saved me much trouble and let me reimplement some dictionaries easily that I would not have gotten without distracting ads otherwise.', 'best app for offline wikipedia and dictionaries. also avaikable are open source tools to make your own dicts for thjs app! fantastic', 'can you find the reason why it freeze?', 'Black theme, bold characters. . . . 5+', 'Useful for keeping popular articles in handy without Internet connection.', 'It works great with my Moon-Reader+', "Can't live without it!  Thanks.", 'Great just need more updated dictionarys', 'Very good', 'عالیه', 'Ok', 'Excellent', 'Everyone should have this app, it is very useful , just download the slob files  and enjoy wikibidia offline on your phone. This app helped me alot specially in my studying career.'], 'appId': 'itkach.aard2', 'url': 'https://play.google.com/store/apps/details?id=itkach.aard2&hl=en&gl=us'}
