{'title': 'Fontster (Root)', 'description': "Please note that your device <b>MUST BE ROOTED</b> to use Fontster.\r\nIf you your device is not rooted, or if you don't know what that is, DO NOT INSTALL this app.\r\n\r\nFontster allows you to easily change the system wide fonts on your Android device within a well designed Material UI. In order to use this app, <b>your device must be rooted</b>. What makes Fontster special is that it will replace all font styles used by the operating system. Unlike other font installers that only replace a few of the font styles, Fontster will change all styles resulting in a consistent look across all text. This means that practically all of the typed elements throughout your devices UI will be changed to your desired font, including the keyboard, digital clock widget, web pages etc.\r\n\r\n\r\n<b>Features</b>\r\n• Font installation\r\n• About 150 full font families to choose from (more are constantly being added)\r\n• Font previewing\r\n• Backup and restore fonts\r\n\r\n\r\n<b>Compatibility</b>\r\nFontster works best with devices running close to stock (AOSP) builds. Therefore Nexus devices work great with this app. Although the app has been tested and confirmed to be working on some other non-AOSP devices (Samsung Touchwiz, etc.), it is highly recommended to use caution (make backups) and be prepared for things to go wrong if you are using a non-AOSP device.\r\n\r\n<b>Open Source</b>\r\nFontster is completely open source! Check out the code on GitHub via the link below, and feel free to make contributions by sending a pull request.\r\nhttps://github.com/ItsPriyesh/Fontster", 'descriptionHTML': 'Please note that your device <b>MUST BE ROOTED</b> to use Fontster.<br>If you your device is not rooted, or if you don&#39;t know what that is, DO NOT INSTALL this app.<br><br>Fontster allows you to easily change the system wide fonts on your Android device within a well designed Material UI. In order to use this app, <b>your device must be rooted</b>. What makes Fontster special is that it will replace all font styles used by the operating system. Unlike other font installers that only replace a few of the font styles, Fontster will change all styles resulting in a consistent look across all text. This means that practically all of the typed elements throughout your devices UI will be changed to your desired font, including the keyboard, digital clock widget, web pages etc.<br><br><br><b>Features</b><br>• Font installation<br>• About 150 full font families to choose from (more are constantly being added)<br>• Font previewing<br>• Backup and restore fonts<br><br><br><b>Compatibility</b><br>Fontster works best with devices running close to stock (AOSP) builds. Therefore Nexus devices work great with this app. Although the app has been tested and confirmed to be working on some other non-AOSP devices (Samsung Touchwiz, etc.), it is highly recommended to use caution (make backups) and be prepared for things to go wrong if you are using a non-AOSP device.<br><br><b>Open Source</b><br>Fontster is completely open source! Check out the code on GitHub via the link below, and feel free to make contributions by sending a pull request.<br>https://github.com/ItsPriyesh/Fontster', 'summary': 'Font installation made easy! For rooted devices only.', 'summaryHTML': 'Font installation made easy! For rooted devices only.', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 2.9733124, 'ratings': 6405, 'reviews': 2476, 'histogram': [2714, 321, 392, 372, 2604], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '3.3M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'PriyeshPatel', 'developerId': 'PriyeshPatel', 'developerEmail': 'priyeshpatel.96@gmail.com', 'developerWebsite': 'http://github.com/ItsPriyesh/Fontster', 'developerAddress': 'N2J 4Z2', 'privacyPolicy': None, 'developerInternalID': '6242821686462874829', 'genre': 'Personalization', 'genreId': 'PERSONALIZATION', 'icon': 'https://lh3.googleusercontent.com/ejOPmHHSp4dh4AuUJlFH4lnGnr0lhkOuzQgtnJZTqXu58Oy1lheIKMjaRDjch_Wm0Lo', 'headerImage': 'https://lh3.googleusercontent.com/D_qnBD3dtWaE1RaWuUGIvLFONxamTQ9YmARE0bUg08PDQsEzQ36l_qST4Ug3DJCMDg', 'screenshots': ['https://lh3.googleusercontent.com/wH9Zt_EEqGHO2IO0l9vR4yXWSO28wWuNkT2QXRXOknOCRlxX0n7FIcPeNR6qxNLf_Vw', 'https://lh3.googleusercontent.com/q1eljTMVK9rFfnQHrO_kdA--IyGmK-BaSPUGirowvyQ8Nh-ut_ZwYJYGTHt4zT_bTQ', 'https://lh3.googleusercontent.com/voQSVjS9XSFoAp0MhSp1Z9OJnmlgE48NEchJXfFlCEMnzUTFo6GX9MT1qwavZZxlBUk', 'https://lh3.googleusercontent.com/iZHHtL25E7SBnX4WsH6fqKpUvjT2_wyVz0k6aBtpM2u8iFbZF0rJejPM4XzYS-aDrQ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': True, 'containsAds': True, 'released': 'May 17, 2014', 'updated': 1454253093, 'version': '3.4', 'recentChanges': '- Performance and reliability improvements\r\n- Bug fixes', 'recentChangesHTML': '- Performance and reliability improvements<br>- Bug fixes', 'comments': ["The app is great but please add more fonts. Other fonts in this app doesn't support some characters. Like ⅔, etc. Some characters are not supported by some fonts. Please fix it. But all in all, it is a great app especially for the rooted android phones please fix this. Hopefully, fix it in the next update.", "Thus is, in my opinion the BEST root font changer. The selection is small but it's changes are complete as I believe can be attained. I have tried many others root & nonroot, and most of the others wont change a small strip towards the top of the screen. I'm sure some of you have noticed it. Calugraphy is my choice. It is Old English, yet streamlined. A nice balance. The best hands down.", "10/10 app, this app offers a lot of beautiful looking fonts. One advantage it has over other apps I use is that it can apply font systemwide. If there's something to improve, then it should be the number of unicode character support font (I have some issues with displaying Vietnamese texts, but they are acceptable).", 'Great app. Simple and unique fonts. Not too many options, but still a great collection. Keep adding good fonts. Just one thing. Can you guys please write font names (main menu) in their own font styles? That way, we will not have to open each font to check how it look.', 'Changes nothing, just reboots the phone. [Rooted Xperia M2]', 'This is the best font app for rooted phone it changes the whole font on my phone i really recommend this app if your phone is rooted.', "So far so good. To others it may be a joke but trust me when I say it's extremely proficient.. With all this qualifications I still rate it at 4stars cos it's got limited fonts. Outside that you'll get all your well deserved 5 starts. Kudos Dev.", 'This app would not work on my rooted LG V20. Please refund my purchase. App froze on initial screen and stopped. Tried reinstalling twice. Still would not work. Thanks.', 'Best app and nice font..if you want to see style just go setting and switch on the first button..it will easy', "I think this font app is good i want to try it since 2017 but it doesn't work on my oppo A37 i don't know how to root it please someone answer me? Thanks.", 'Best font changer app ever. Thank you so much for the app., strive to develop it further to change font even in other apps in the next upgrade. THANK YOU', "Didn't work on my rooted Lenovo k8 note(Nougat). I backed up previous font then installed new font and after rebooting the font is unchanged. I tried same many times with different fonts.", 'It could have option to add a custom font. Also it does not support MultiLanguage Fonts!!!...', 'On Lineageos the hour/minute separator is a square box, in the lockscreen after applying a new font :(', 'the only one that works for nougat. just add custom font support and font for keyboard and then this is 10/10', 'excellent but need to add more fonts style.', 'It would definitely be better if it worked with non-rooted phones.', "It does exactly what's needed of it in a perfect way, changes the regular bold and italic also, i'm here wondering why it as such a low rating...... Ild give it a 100 💯", 'Finnaly, an app that do what it claims to do, no fuss', 'Only font changer that works on my phone! Thanks so much!', 'ui font changed but Browser not loading pages . plz fix.', "Add fonts ! Why i can't restore font system", 'I rated it 5 star cuz it work only for rooted devices... Most of people jugde low 2star cuz they didnt know how or what is root ... Well this app should have 5 star rate', 'Just add more fonts and i will give 5 star. Nice app !', 'Stupid app lacks good fonts and cant install custom fonts', "I have found the best app out there couldn't be happier. Great job guys", 'Just works! (rooted OnePlus 5T)', "Can't change my font..infact root my phone.", 'nice app i want only one font. i.e chocko cooky.. thats why i intall this app', 'Amazing and beautiful application.', 'Efficient app. Works very well', 'preview made difficult :(', "It works 100%..... It's the best...", 'Great very nice app', 'Required superuser access', 'its really amazing app. i really need this. thanx.', 'no stylish fonts', 'Please how can I get my phone rooted without been crash', 'Thanks for the update and for the record I am in', 'Does what it says it does.'], 'appId': 'com.chromium.fontinstaller', 'url': 'https://play.google.com/store/apps/details?id=com.chromium.fontinstaller&hl=en&gl=us'}
