{'title': 'WiFi Automatic', 'description': 'This simple app can help you increase the standby time of your device: <b>WiFi Automatic</b> automatically disable your WiFi radio when you don\'t need it and thereby lowers the battery consumption.\r\n\r\nYou can also specify to automatically turn on WiFi again, if you turn on your device or when you enter a specified location (requires a cell radio and therefore does not work on WiFi-only tablets!). Also, the app can regularly scan for available networks to connect to and re-disable WiFi if no suitable network is found. This way, you are always connected to your WiFi network when using the device.\r\n\r\n<i>WiFi Automatic</i> is open source: https://github.com/j4velin/WiFi-Automatic\r\n\r\nA WiFi connection generally uses less power than a mobile data connection, so on your phone, it makes sense to keep the WiFi radio active, whenever a WiFi network is in range\r\n\r\n\r\n--------------------\r\nPermissions: \r\nRECEIVE_BOOT_COMPLETED - is required to start the service again when rebooting your device\r\n\r\nThe following permissions are required to observe and change the WiFi state:\r\nCHANGE_WIFI_STATE\r\nACCESS_NETWORK_STATE\r\nACCESS_WIFI_STATE\r\n\r\nThe following permissions are required to the "turn on WiFi when entering these locations" feature:\r\nINTERNET\r\nWRITE_EXTERNAL_STORAGE\r\nACCESS_COARSE_LOCATION\r\nACCESS_FINE_LOCATION\r\nBILLING', 'descriptionHTML': 'This simple app can help you increase the standby time of your device: <b>WiFi Automatic</b> automatically disable your WiFi radio when you don&#39;t need it and thereby lowers the battery consumption.<br><br>You can also specify to automatically turn on WiFi again, if you turn on your device or when you enter a specified location (requires a cell radio and therefore does not work on WiFi-only tablets!). Also, the app can regularly scan for available networks to connect to and re-disable WiFi if no suitable network is found. This way, you are always connected to your WiFi network when using the device.<br><br><i>WiFi Automatic</i> is open source: https://github.com/j4velin/WiFi-Automatic<br><br>A WiFi connection generally uses less power than a mobile data connection, so on your phone, it makes sense to keep the WiFi radio active, whenever a WiFi network is in range<br><br><br>--------------------<br>Permissions: <br>RECEIVE_BOOT_COMPLETED - is required to start the service again when rebooting your device<br><br>The following permissions are required to observe and change the WiFi state:<br>CHANGE_WIFI_STATE<br>ACCESS_NETWORK_STATE<br>ACCESS_WIFI_STATE<br><br>The following permissions are required to the &quot;turn on WiFi when entering these locations&quot; feature:<br>INTERNET<br>WRITE_EXTERNAL_STORAGE<br>ACCESS_COARSE_LOCATION<br>ACCESS_FINE_LOCATION<br>BILLING', 'summary': 'Automatically turn WiFi on and off to save battery', 'summaryHTML': 'Automatically turn WiFi on and off to save battery', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 4.232984, 'ratings': 15960, 'reviews': 4980, 'histogram': [1702, 543, 1148, 1504, 11061], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'j4velin', 'developerId': '6602470455848506235', 'developerEmail': 'j4velin.development+play@gmail.com', 'developerWebsite': 'http://www.j4velin.de', 'developerAddress': 'Thomas Hoffmann\nSchwanhäußerstr. 5\n90408 Nürnberg', 'privacyPolicy': 'https://j4velin.de/?action=privacy', 'developerInternalID': '6602470455848506235', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/DPdO0Zc2ixNIRrO6abSoc1TE7mu7NUjNdsSWCgecrN2iJs4ylYZ4cFO52T5RBzOLg30', 'headerImage': 'https://lh3.googleusercontent.com/5XqScOU-xDVrFji491AIl2kAHXAqwFJNrgnzlQdElVtd09lzshIBl5hWycH3dWTUnA', 'screenshots': ['https://lh3.googleusercontent.com/tBCttTo9bvuchlWzBpwvFxwS5XYZ2OUZE1zw2BTvDGYc1eShEOLiU1dWM2NH-ifO-Fo', 'https://lh3.googleusercontent.com/OiylxikwzrMGgHKqDEuNvKQpDCNZjB8vGyryRgse-oqcl2brf5iegqQM0Qb-YO6E', 'https://lh3.googleusercontent.com/3q91zl8y_ISQiruA2UGShKMCd92NIF6syrsweAzQP8Csd0_gBzIXblsrVasO1IiTWQM', 'https://lh3.googleusercontent.com/ggoJner6eFwkNmUd_tr1zPlwtuitA2P3v83JweqcTCkpgdo0Ba4WzCTNzOBdvoRo7o8'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 11, 2013', 'updated': 1572385294, 'version': 'Varies with device', 'recentChanges': '- decrease target SDK to be able to still toggle WiFi on Android 10', 'recentChangesHTML': '- decrease target SDK to be able to still toggle WiFi on Android 10', 'comments': ['Thanks a lot. This is the only one the the job on my Nokia 4.2. however, sometimes the "Not Connected to any Network" option sometimes wouldn\'t work. I have now Android 10. Please if if can be fixed, we will appreciate it.', 'To be able to turn WiFi on at specified times WITHOUT the need for internet via mobile data (as per some!) I find EXTREMELY useful. Many other options available e.g. location or unlock. Would have been a bonus to be able to specify days of the week as well.', "Google Chrome Enterprise Help Sign in Help CenterCommunity Understand Chrome policy management For administrators who manage Chrome Browser or Chrome devices for a business or school. To deploy enterprise features to Chrome users, you push policies and settings to their devices or their managed Google Account (Chrome profile). Use policies to set your users' homepage, pre-install their apps, control what sites they can visit, and much more. Options for enforcing Chrome policies You have sever", "Wld give more * but Google ruined it, doesn't work anymore due to Droid 9.0 screwing ur ability 2 make UR app work. Ev app has this issue besides major 1s; 3rd-party apps that give us needed customization/features can't work anymore. Google's turning Android into iOS clone w/no freedom-they control it all. Disgusting. Claim it's for privacy but we can easily sign waivers2 make them unliable, & let us do as we wish w/OUR phone. They want2 control us, take our data & then not get sued 4 it leaking", 'Very useful app, would be perfect for me if there is a setting for days, weekdays and weekend included. Thank you for this.', 'App not working properly in location setting .... I enterned location and i go out then back to same location at 12 am without turning my screen on and i left my phone to connect at 12 am but i found it connect at 4 am ...4 hours my phone detecting the location ?? Doesnt make sense i thought it will connect fast as i turned on my location', 'Wifi cannot be set to turn off when mobile hotspot is turned on.', "Didn't work, set times to switch wifi on and off and... nothing, had to disable wifi manually as usual.", "The app is one of the best I ever usedalso need to use it without a password I have paralysis and I miss type it and in my device will be locked and I can't unlock it so can you make a vision that I can work it without a password it would be absolutely", "The one feature that I really wanted, doesn't work.  The option to turn WiFi on in 5, 15, 30... minutes just turns WiFi in 20 seconds every time!  I tried to report the bug, bug I got an email back telling me to put in on the Bug Tracker page, which is impossible to do because this WiFi Automatic app is not even an option on that page.  So, I have to once again contact the Dev to tell him to fix the bug on his Bug Tracker page, so that I can tel him to fix the bug in his WiFi app.  8-)", "great app but after upgrading to Pie there is a bug. If one has the option selected to connect to WiFi while charging, the app does not switch WiFi off when screen goes off (if that option is selected), even when not charging. If i check the log it says that the device is connected to external power source, which it isn't.", "Seems to work better than most of these apps, although I'm not sure why it's so hard to make one that works perfectly. This needs a home screen widget to turn it off and on. If I have a weak WI fi signal and turn Wi-Fi off manually, I don't need you turning it right back on.", "Auto launch glitches started to happen after a dozen hours, where the notification panel would freeze for a few seconds. Please support auto launch based actions, as the constant notification is ugly (wish there was a hidden dark theme - where the phone doesn't have a persistant notification saying too much battery is being used)...", "Set video ringtone on your phone! Video ringtone. Show video on incoming call. Allows you to use your own incoming call screen with cool full-screen videos instead of a boring little photo. However, in addition to the video, it is possible to set a full-screen photo in HD quality. FEATURES: ★ Set an individual video ringtone for: contact, group, other contacts (unknown, 'not found' and default). ★ Personal settings for each video contact: sound volume, style of an incoming call, text color and", 'It seems that the "Turn wifi off when screen is off" feature only works when I have turned off the screen myself and not when the phone goes to sleep on its own. I\'m not sure if that\'s a bug or intentional, but what I need is to have the wifi turn off any time the phone is asleep.', 'good but missing 2 things and so quite annoying. 1. should have option to enable wifi upon screen on, not unlock e.g. whatsapp incoming call uses mobile data unless i turn on wifi manually. 2. wifi turns off if screen off for specified time, but again, after that specified time WhatsApp eats my mobile data if screen off... maybe basic check on in/out traffic before switch off? thanks!', "It's helpfully when I need to go to Google map when I'm lost.", "Perfect! Wifi would disconnect at random intervals for no reason. This app is small and efficient. Completely unobtrusive and keeps my wifi on constantly. Couldn't find any other app like it, but even if I do at this point it can't beat this one. Thank you!", 'This app brings back wifi sleeping policy (keep wifi on only during charging) back to Android 9 and makes phone smarter again while saving a lot of battery. Bravo!!! Hope that developer will keep it updated because on latest update for Android 9 app sometimes hangs and needs to be closed and started again.', "Is it me or the app does not work on SS Note FE? Because it doesn't change any thing. I set to turn on wifi everyday at 7:00, but I wake up at 10 AM, and nothing. At all. Tried to test several times but it still doesn't work. Please help!!!", "This app doesn't know what to do when it runs into 5GHz on the latest Android 9 of the most newest phone made in 2019. It just has no idea what 5GHz is and simply shuts down for good in panic. 5GHz is WiFi's frequency, it's not mobile connection. (mobile is 4G).", "When I installed this, it was working well but after that It didn't work properly", "Works alright, there's the persistant notification that kind of bothers me and the fact that it doesn't make a difference beween when i tur off the wifi or when it's on, so even if it's off before putting the phone to sleep, the app will turn it back on", 'App lacks clear "how to" setup steps. Would be great to enhance such that when wi-fi is disconnected, the data plan would auto turn on. Then when wi-fi is turned back on ( either scheduled or proximity to router ) - the data plan would auto shut off.', "great app, but too bad, it doesn't turn wifi off when you set it at a certain time to turn off wifi, when you already set it to turn wifi on every 2 hours, so i guess its either set the time to turn wifi off, then then the time to turn wifi on or set it turn on every few hours when not connected to any network", "The only app that I have found that actually turns off the wifi like it's supposed to. I just wanted something that turned off the wifi automatically when out of range. Lots of apps claiming this, this one delivers!", "Absolutely awesome app. I have an older phone that won't take Oreo and hence I lose the location wifi changing options. This gives me that ability and will save my data. Very well done; I especially applaud the clearly written log.", 'just installed into my samsung s10 plus that has dropped its wifi since i got it march 8th 2019 the day it came out i will update stars once its seen to stay connected not going off everytime my screen goes black 😭💔 its annoying when im waiting for an email and using ny wifi because my phone internets to slow to use in my flat 🤞 this will sort that problem 😁', "I live in the middle of nowhere and have limited wifi after 5am so this app helps me make sure whatever I'm downloading stops by that time", "Turn on based on location only turns on wifi if I navigate to the location page of the app. How is that automatic. Doesn't work", 'This app will reduce youe time spending on waiting on the wifi signals.', "I don't know why but this application turns on my Wi Fi almost 3 minutes later the specified time. For example, I set the On timer for 17:00 but the Wi Fi was turned on at 17:02:53.", 'my wifi stopped auto connecting when i arrived either at home or work. installed this app and i have no more issues with auto connecting to known wifi networks. this app is great!', "Doesn't work. Disconnected from WiFi 3 hours ago with this app set to switch off after 15 minutes. It's still on. Huawei Mate 10 Pro, but never worked on my Nexus 6P either.", 'Nice app. Works flawlessly so far. I wanted a way for my wifi to automatically connect when I get home and this does that nicely.', 'The app worked well for around 2 weeks but then stopped turning my wifi off or back on with the schedule turned on, would have gave it 5 stars if continued to work.', 'Awesome...........this app is very helpful But pls make the same kind of app for switching on-off Mobile Data too', 'Pretty nice, but timer is running when i turn screen again, and boom - wifi disconnected. Please make timer stop if screen is on before timer runs out. thanks.', 'Finally.. an app that turns the wifi off during device sleep..', 'Works pretty well. You can have periodic restart of the wifi at defined intervals. Interface is very easy to understand'], 'appId': 'de.j4velin.wifiAutoOff', 'url': 'https://play.google.com/store/apps/details?id=de.j4velin.wifiAutoOff&hl=en&gl=us'}
