{'title': 'Pedometer', 'description': "Lightweight pedometer app using the <b>hardware step-sensor</b> for minimal battery consumption.\r\nThis app is designed to be running all the time without having any impact on your battery life! It uses the hardware step detection sensor of devices like the Nexus 5, which is already running even when not using any pedometer app. Therefore the app does not consume any additional battery drain. Unlike other pedometer apps, this app does <b>not</b> track your movement or your location so it doesn't need to turn on your GPS sensor (again: <b>no impact on your battery</b>).\r\n\r\nSign in with your Google account to unlock <b>achievements</b> and compete with others in the <b>leaderboards</b>! \r\nThe app also provides a <b>DashClock extension</b>, a widget and a notification to show your progress.\r\n\r\n<b>FAQ:</b>\r\n• Do not use any task killer if you want the app to work\r\n• Achievements are granted the day <u>after</u> meeting the requirements\r\n\r\n\r\nPedometer is open source: https://github.com/j4velin/Pedometer\r\nPedometer uses the 'EazeGraph' library by Paul Cech and 'ColorPickerPreference' by Sergey Margaritov\r\nIcon provided by https://utopian.io/@tobaloidee", 'descriptionHTML': 'Lightweight pedometer app using the <b>hardware step-sensor</b> for minimal battery consumption.<br>This app is designed to be running all the time without having any impact on your battery life! It uses the hardware step detection sensor of devices like the Nexus 5, which is already running even when not using any pedometer app. Therefore the app does not consume any additional battery drain. Unlike other pedometer apps, this app does <b>not</b> track your movement or your location so it doesn&#39;t need to turn on your GPS sensor (again: <b>no impact on your battery</b>).<br><br>Sign in with your Google account to unlock <b>achievements</b> and compete with others in the <b>leaderboards</b>! <br>The app also provides a <b>DashClock extension</b>, a widget and a notification to show your progress.<br><br><b>FAQ:</b><br>• Do not use any task killer if you want the app to work<br>• Achievements are granted the day <u>after</u> meeting the requirements<br><br><br>Pedometer is open source: https://github.com/j4velin/Pedometer<br>Pedometer uses the &#39;EazeGraph&#39; library by Paul Cech and &#39;ColorPickerPreference&#39; by Sergey Margaritov<br>Icon provided by https://utopian.io/@tobaloidee', 'summary': 'Lightweight pedometer which uses the step-sensor for minimal battery consumption', 'summaryHTML': 'Lightweight pedometer which uses the step-sensor for minimal battery consumption', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.7785978, 'ratings': 2759, 'reviews': 869, 'histogram': [325, 305, 305, 539, 1282], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.4M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'j4velin', 'developerId': '6602470455848506235', 'developerEmail': 'j4velin.development+play@gmail.com', 'developerWebsite': 'http://www.j4velin.de', 'developerAddress': 'Thomas Hoffmann\nSchwanhäußerstr. 5\n90408 Nürnberg', 'privacyPolicy': 'https://j4velin.de/?action=privacy', 'developerInternalID': '6602470455848506235', 'genre': 'Health & Fitness', 'genreId': 'HEALTH_AND_FITNESS', 'icon': 'https://lh3.googleusercontent.com/KyKq8eL0RpcLQkyZj_qhTW-u6Jvjg-0EwiSw7zrobg4cpm8CCjrB8C3Ivr8Ie0PzDg', 'headerImage': 'https://lh3.googleusercontent.com/QoyTWC0ke2Xqcygj3IG7Z4ewEN8R7KnzsK7T5RdG3ES4PEpQsu-CaT6qzc7MfPtUS6Id', 'screenshots': ['https://lh3.googleusercontent.com/LvIHF45qV4HpXP2EERDj7_uquJ9jzZyKes0QF2MoSsVN1gvOlfuM9241kB63vJ722Mym', 'https://lh3.googleusercontent.com/FILbtxHCIo9ArHhrzjkJq6TcxCUQUrtyFn3qEVb0qBcFInwNn8c24IADtlREn8BVA91d', 'https://lh3.googleusercontent.com/uruk1xd672OuxXsIlHF5iSd0thiF8SeJFzlvITo-U6OpYftL1BIXK6n0xt3-4MxMIMs'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 15, 2013', 'updated': 1562045596, 'version': '1.5.11', 'recentChanges': '- fixed crashes for Android P\r\n- collapsed notification now shows the number of steps in the title', 'recentChangesHTML': '- fixed crashes for Android P<br>- collapsed notification now shows the number of steps in the title', 'comments': ['Good pedometer. It offers integration with g-games for achievements to gamify and help motivate you. I wish this app had a history view to see my week, monthly , yearly progress. Also that it calculated the total burned energy.', "I really like this app.  Simple, uncluttered,does what I want and doesn't get in the way. But on Friday it recorded 63k steps.  Now, I was traveling that day (UK to Norway including two ferries) but I've done that twice before without it counting such a high number.  I'm not concerned, just curious about the mechanism.", 'Its the most efficient among all available apps. Love it because its foss and there are no stupid permissions. One star less because it does not show calories burned and its not 100% accurate.', "The best pedometer so out there. Sadly with Android pie and the aggressive closing of background apps, dosent work now. Can't see how to get Android to stop closing it.", 'Does not work on Nokia 6.1 (Android 9). Counted 5 steps since I installed it 2 days ago. Even went for a 20 minute walk.', 'Was using it with different phone, LG Astoria 2. Since buying a Nokia 6.1 a week ago, the app is not working. Will not add steps to the count.', 'The Nov 5 2018 update seems to have fixed the problems I was having on 2 phones with Android 8.', 'No ads, no nagging, no invasive permissions. missing a rate-me link in the about tab. 😀 How about a step size calculator?', 'Worked for awhile then stopped counting and gave completely erroneous results, e.g. negative average for the month.', 'Count is completely inaccurate, counts random amounts of steps.', 'Was good, latest update crashes constantly on android 8', 'Yet another pedometer that resets my counter at midnight in the middle of my work shift with no option to stop it.', 'Please add a goal like footsteps per day, per week and per month ..!', 'It is simple but too good I like this app very well', 'Best app for fitness Pro without ads Simple to use Open source Without gps Cons Non', 'simple, small, easy to use', "Doesn't count steps.", 'stop working in android 9', 'Good', 'Not bad as pedometer app. I liked that it has an extremely low battery \nusage compared to most other similar apps. Lacks unfortunately of long-term \nstatistics (month, year... ). I switched now to the app of my phone \nmanufacurer as it has more features.', "This was my must-have app till the last update.. and now it simply stopped working all together. Even when notification is on, it only counts steps when it's main screen is open and stops counting as soon as I minimise it. Even when it's open, it makes increments of two for each step I take. It's so sad.. I wish I could get the original app back.. I am on Xiaomi Mi Max 2.", "I like the concept of the app with its minimalistic design but it somehow fails to store data for the current day correctly. Therefore, if you have to reboot your device for some reason, you will find that the app will afterwards report a much higher number of steps for the current day than it did before. Sometimes this issue will go away if you put the app into the background for a minute and then open it again, but usually the wrong value persists, messing up the statistics. If this is fixed, I'll gladly give the app five stars.", "First installed it and loved it but the past few weeks the app has been \npractically broken. It tells me I'm 27000 steps away from my goal of 10000 \nsteps. Other times it'll randomly reset my steps in the middle of using it. \nI'll go from 9000 steps to 0 and it won't count any more steps after that \ntill the next day.", "It was a good app for not using much power and counting steps in the \nbackground. Yet for approximately the last 2-3 months it's been acting \nstrange. It has shown that I've taken 27,000 steps on a Wednesday. Turns \nout that it wasn't a one time error. Keeps showing such an unrealistic \nnumber of steps on each Wednesday.", "App is good until you reboot the phone then it adds a random amount of \nsteps to the counter. I just rebooted and the counter went from 23'326 \nbefore to 131'212 after!", "Don't think it works. Because it claims I have completed 176 steps, and I \nhaven't moved all day 😒", "Widget doesn't seem to be updating steps for me. (Note 4 cm13)", "Best pedometer app I've had. Been using it for years.", 'Such a small app and soo powerful, should be on every mobile', 'By far the best app of its category!', "The best minimal pedometer. I tried at least 10 other apps including paid ones.  This is the best for those who want a clean interface and simplicity. I love using the widget to always know how many steps I have taken that day.  The widget is a 1x1 size, so doesn't take up much space.", "Update: I have knocked down couple stars for the ugly icon change. Why \nwould you change app's icon after so many years, when user already got used \nto it? Terrible idea, not to mention the ugliness of this new icon... \nOriginal review; I have been using it since I had Nexus 5, so it's been \nawhile through 3 phones by now... and it just works. No fuss no muss, this \nis just one of very few perfect apps out there and Im writing about it just \nbecause I wanted to thank developer for his work.", "Works fine most of the time, but randomly stops counting steps every once in a while. Rebooting the device fixes the issue. Might be a problem with my phone's hardware.", "I was going to give it 5*, however I note that yesterday a bug crept in. It changed overnight from 14800 to 40200. I don't see a way to reset the value.", 'Widget display does not show current count of steps... Do not know why. However opening app shows the correct count.', 'There is a huge count difference between the app and widget. App is showing 5360 and widget displays only 5000. Correct this and rest is OK.', 'Does not count steps even after walking for 1 hour. FAKE APP!! BEWARE!!!!', 'Works as advertised on Galaxy S7 Egde (exynos), but I would appreciate, if you can add detailed history. Thank you', 'Light, simple, effective. I just wonder how my daily step count triples sometimes when I think it might have doubled.', 'Count doesnt match with google fit'], 'appId': 'de.j4velin.pedometer', 'url': 'https://play.google.com/store/apps/details?id=de.j4velin.pedometer&hl=en&gl=us'}
