{'title': 'Hearing Saver', 'description': "--> You need to open this app at least once after first installing or upgrading it for it to work! <--\r\n\r\n--> I am currently unable to maintain this application, as I no longer own an Android device for testing and the events I use to trigger the volume changes are not present in emulators. If you're interested in taking over maintenance, please contact me. <--\r\n\r\nHearing Saver is the simple way to avoid accidentally hurting your ears when plugging in or unplugging your Android device's wired or Bluetooth headset. Hearing Saver operates in the background to protect your ears automatically. It uses very little resources, and simply waits for the signal that your headset has been unplugged or plugged in.\r\n\r\nAfter initial setup, Hearing Saver should work without further input from you. To setup the app, open it. You will be presented with the Setup screen. It contains a number of controls, and they each interact to allow you to customize Hearing Saver's operation. From top to bottom:\r\n\r\n- Media/Ringer Selector Buttons - These allow you to select what the two sliders, described below, control. If you have not enabled Ringer volume control, the Ringer radio button will be disabled.\r\n\r\n- Plugged/Unplugged Sliders - These control the volume that will be set when the headset is plugged in or unplugged, respectively. The volume that these refer to is indicated by the Radio buttons at the top.\r\n\r\n- Enable Ringer Volume Control Checkbox - This enabled/disables Hearing Saver's ability to set your device's Ringer/Notification volume. It is off by default so you don't miss a call!\r\n\r\n- Save Last Unplugged Volume Checkbox - If this is checked, the bottom slider will be disabled and Hearing Saver will remember the last volume you manually set while the headset was unplugged, and reset to that volume when the headset is unplugged again.\r\n\r\n- Bluetooth Detection - Enabled by default, this tells Hearing Saver to set your volume when a Bluetooth audio device is connected/disconnected.\r\n\r\nThis app is licensed under the Apache License. More information available at https://gitlab.com/jakebasile/hearing-saver\r\n\r\n-- Known Issues --\r\n- Bluetooth Disconnect happens after a long delay. This is beyond my control, as it is a delay in my code receiving the broadcast.\r\n- Only works on Unplug on the HTC Incredible. This is because HTC broke the standard method that I hook into in order to change the volume.\r\n- Sometimes doesn't upgrade very well. If you are having problems, please try uninstalling and reinstalling.", 'descriptionHTML': '--&gt; You need to open this app at least once after first installing or upgrading it for it to work! &lt;--<br><br>--&gt; I am currently unable to maintain this application, as I no longer own an Android device for testing and the events I use to trigger the volume changes are not present in emulators. If you&#39;re interested in taking over maintenance, please contact me. &lt;--<br><br>Hearing Saver is the simple way to avoid accidentally hurting your ears when plugging in or unplugging your Android device&#39;s wired or Bluetooth headset. Hearing Saver operates in the background to protect your ears automatically. It uses very little resources, and simply waits for the signal that your headset has been unplugged or plugged in.<br><br>After initial setup, Hearing Saver should work without further input from you. To setup the app, open it. You will be presented with the Setup screen. It contains a number of controls, and they each interact to allow you to customize Hearing Saver&#39;s operation. From top to bottom:<br><br>- Media/Ringer Selector Buttons - These allow you to select what the two sliders, described below, control. If you have not enabled Ringer volume control, the Ringer radio button will be disabled.<br><br>- Plugged/Unplugged Sliders - These control the volume that will be set when the headset is plugged in or unplugged, respectively. The volume that these refer to is indicated by the Radio buttons at the top.<br><br>- Enable Ringer Volume Control Checkbox - This enabled/disables Hearing Saver&#39;s ability to set your device&#39;s Ringer/Notification volume. It is off by default so you don&#39;t miss a call!<br><br>- Save Last Unplugged Volume Checkbox - If this is checked, the bottom slider will be disabled and Hearing Saver will remember the last volume you manually set while the headset was unplugged, and reset to that volume when the headset is unplugged again.<br><br>- Bluetooth Detection - Enabled by default, this tells Hearing Saver to set your volume when a Bluetooth audio device is connected/disconnected.<br><br>This app is licensed under the Apache License. More information available at https://gitlab.com/jakebasile/hearing-saver<br><br>-- Known Issues --<br>- Bluetooth Disconnect happens after a long delay. This is beyond my control, as it is a delay in my code receiving the broadcast.<br>- Only works on Unplug on the HTC Incredible. This is because HTC broke the standard method that I hook into in order to change the volume.<br>- Sometimes doesn&#39;t upgrade very well. If you are having problems, please try uninstalling and reinstalling.', 'summary': 'Save Your Ears', 'summaryHTML': 'Save Your Ears', 'installs': '50,000+', 'minInstalls': 50000, 'score': 2.71, 'ratings': 765, 'reviews': 390, 'histogram': [397, 38, 7, 30, 290], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '26k', 'androidVersion': '2.0.1', 'androidVersionText': '2.0.1 and up', 'developer': 'Jake Basile', 'developerId': 'Jake+Basile', 'developerEmail': 'web@jakebasile.com', 'developerWebsite': 'https://github.com/jakebasile/hearing-saver', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '7646106562042268443', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/SOMY5SpNpLWgsZJ8cASJRJE1U_SqQaJLifH8olgnosyHBXkM_J8hF9bVrxTBzffQ6gS-', 'headerImage': 'https://lh3.googleusercontent.com/XQZSLJoD59Ym_7lPy7gADb29ZYFF6LrSmJVkphdi32T__0o-Qpc24or3Y6c5d6YhKyNV', 'screenshots': ['https://lh3.googleusercontent.com/FizIgp7bdI90zaczhGStkWSODNlwDI6Cen_XP0559nUcVGCYFNIwguzjgpQ9fnLa7TRs', 'https://lh3.googleusercontent.com/3d9wO_ttjkts-pvpO9bOUA21ekrwB2VI5JizLzAEojUc8C6dubrA1_5kLoHDyhSxNZE'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 4, 2010', 'updated': 1359027239, 'version': '3.1', 'recentChanges': '- Better Support for Low Resolution Screens (Thanks bhm!)\r\n- Happy Thoughts', 'recentChangesHTML': '- Better Support for Low Resolution Screens (Thanks bhm!)<br>- Happy Thoughts', 'comments': ["Seems to work great on my xiaomi mi9t pro, although the old Android api pop up was shown, it worked on the first try. I'm surprised it got to such a low rating", "This app keeps my hair in my head instead of pulled out. I hate HATE having my music interrupted for anything less than a phone call. This helps with that. Lately, it's been switching the ringer off and on every minute or two causing my phone to lag. I also use LLAMA, but it isn't set to change any media or ringer volumes right meow. Not sure why it's doing this when it didn't 6 months ago.", 'Very nice app! Thanks to the developer for fixing my issue, I always use audio cord in my car and it always has the volume lowered so i have to go into my phone and turn it up.', 'Installed the program opened it up and made my desired setting. I then clicked on the enable button and a popup informed me that hearing saver is now running. I plugged in my headphones and the high volume warning immediately popped up.', 'It just works!!!!!! Set both volume controls to max and you defeat the auto reduction in volume for audio jack plug in!!!!!!', 'works perfect on my s10. After I nearly blew out my speakers and ear drums this app is great to have', "Doesn't work on J7 Prime. As soon as I open app and touch it it disappears back to main screen.", 'Does not remove annoying Volume Warning. complete waste of time and research. Going to try Xposed instead.', "Doesn't work, app closes if I try to adjust any settings.", "Doesn't work on Android 9.", 'Best app for mia1. You are a lifesaver for stock android.', "This App doesn't always work. Do not download this", 'totally satisfied, with this free treat', 'just downloaded it so far so good 👍', "I used this on my Galaxy Note 3 because Samsung's good intentions meant always having to reset my volume.   Now I'm on a GalaxyJ7(2017) and the app comes up, but no changes can be made to the settings and it doesn't work.   3 stars since it worked for the last 4 years amazingly.", "Installed the app. Set it up to the desired volume levels. Rebooted the phone. Plugged my headphones in and started playing some music. No warning of VOLUME TOO HIGH blah blah blah. And the volume was at the set level. So that worked good. But the second I touched the volume control to raise or lower the volume, that annoying pop up VOLUME TOO HIGH came up. So it didn't completely eliminate the annoying pop up, just kind of masked it temporarily.", 'I have been looking for something to bypass the Samsung volume warning for years and this app finally did the trick! My only gripe is that the app automatically closes itself everytime I change a setting, meaning I have to open the app over and over if I want to change more than one setting. I would happily update my review to 5 stars if this can be fixed.', "Works great on my Samsung Galaxy S6 - with the usual Android app Gotcha: Android kills the app after some time. So, the app is very useful if you use it all the time. It is close to useless, if you just use it once in a while: It needs to be restarted each time you want to use it, and that takes longer than pressing Android's warning button.", "Ever since I updated my OS to 5.1.1, Hearing Saver no longer does it's job as it's supposed to. I have to manually Enable it everyday or a few times a day in order to have it work. When I unplug the headphones jack and open a different app that needs volume, it goes back to neutral volume setting. This never happened before. Please fix!", 'After slightly hitting my headphones jack,  whether in my pocket, bag or in hand, my music would just turn off - and an error message would read "media volume lowered to protect hearing" - but instead of being lowered, it would turn off my music completely.   I Google the problem and found no solution.  Luckily, I found this app 5 minutes ago,  installed it and that problem was immediately solved. No more audio issues.', 'I have this functionality built into my LG G2 with no way to turn it off. If I plug in to headphone jack it is usually to car stereo or speakers and rarely ever heaphones (I use Bluetooth for that). So I am using it for the opposite reason to max volume when plugging into the headphone jack to counteract the built in software that wants to turn it down.', "I found your app looking for a solution to the volume hijack on my Samsung tablet when I plug in my portable speaker for my sleep sounds and every so often thereafter. Been waking up poorly because it turns my sounds down so far I can't hear them over my fan. Bye bye nanny! Now if it were only possible to port this app to fix the same issue on Windows phone (even on bluetooth speakers). I would even pay for it. Hey phone OS makers, we don't all use headphones (I hate them) and we aren't all idiots. Stop playing nanny to save them from themselves and giving us half functional devices. At least if they make themselves deaf, we won't have to hear their stupidity. Win-win.", "I really like this app. I've used it since I had my previous phone (both \nprevious and current phones are from Motorola). I just wish it would not \ndeactivate the do not disturb status. I don't know if it is possible, but I \nleave it as a suggestion. Thanks a lot!", 'As well as being a pretty useful app for not exploding your eardrums unexpectedly when plugging in headphones it also gets rid of the annoying "are you sure you want to raise the volume, you might damage your frail delicate hearing" warning. Simple and effective app.', "My Nexus 7 and N 5 phone didn't work before ,the sound with external speakers had  very low volume,this great app has solved the issue Thanks to the talented soul for sharing it", 'App works fine sand gets rid of stupid volume Nanny, bit when I reboot my phone I need to enable it again.  Please add a feature to run on reboot or keep running after reboot', "I don't understand how this feature isn't already part of the Android system. It helps me enjoy my music without messing up my ears with notifications. I have noticed that recently, my phone freezes (sometimes crashing) when I plug in or pull out my headphones, and when I change the volume manually. I uninstalled this program for a while to test, and it seems like the one causing the problem. I still use it since it's a great program, but I wish that could be fixed.", 'I love that this app keeps my volume set how I like it in spite of the "nanny" settings built into phones these days. I\'m half deaf - I don\'t need a company turning my music down so I can\'t hear it just because someone decided that they weren\'t responsible enough to control their own volume...', "I love this! It works wonderfully. I rarely use my headphone jack for headphones, instead I plug my phone into my car's radio. My hearing is not at risk by having my phone at full volume, but my phone insists on automatically turning down the volume and giving me a popup warning anyway. I could just turn up my car's volume to compensate without having to adjust my phone's, but then when I switch over to FM radio, I get the crap scared out of me and blasted with crazy loud radio because I have the car volume so high. Now THAT is dangerous to my hearing, and my stress levels. This app does it's job and saves me a big annoyance.", 'Having tested after a reboot, the volume warning message still displays (kitkat Galaxy Nore 3) and only restores the volume after the message is cleared. Shame.', 'It\'s very difficult to set the ringer volume to the lowest audible setting. I\'m on stock 4.2.1 and my system volumes have a slider where the lowest value is vibrate. In Hearing Saver, a large chunk of the lowest part of the slider is vibrate and it took a lot of trial and error to set the lowest volume that hasn\'t disabled the ringer. It would be great if all the way down was vibrate and anything slightly above it was audible -- or if the sliders were the same as the system ones (not sure if that\'s possible).  Or it could be nice to just apply the "Save last volume" to all plugged. (So I can use the phone\'s media and ringtone volume control to set the plugged and unplugged volumes.)  Aside from that, it\'s great to stop the deafening notification sounds when I use headphones. The "Save last pluggedvolume" feature is awesome.', "Can't stress enough how annoying the automatic volume decreaser built into the phone. This app fixed that. Thanks for creating!", 'Thank you for creating an app that does this. Without it I would not be able to use my phone properly. My volume key broke and I was unable to increase the volume sufficiently without this app.', 'The only method I know of for getting rid of volume warning. I use my phone through my car stereo through Bluetooth so it needs to be at the highest level (I adjust via car stereo knob). I hated having to hit ok every time I want to raise it. This app finally solved the problem after trying several fixes from the forums.', "My phone had a volume limiter for headphones, and listening to music was like listening to a quiet conversation. High priced headphones are useless when you can't go past 30% volume. This app solved it in one fell swoop.", "This app has been installed on every phone I've had since it was decided that we can't make our own decisions regarding our listening volumes. It doesn't work on my att LG G4 or GS6 active though. I'd love to rate it 5 stars as soon as it works again.", 'I have tried, and failed to find any benefit at all from anything this thing "does." It actually *adds* to the steps necessary to get volume where you need it. Baffling.', 'Nothing more annoying than somebody giving me features then making them inconvenient to use. This program solved the mommy settings of volume reducing when plugging into the DAC output. Happy my docking works without extra taping and sliding.', "Tried this on my Verizon G4 and it works perfectly (another review said it  doesn't on the Verizon model, so who knows). I haven't had to deal with the annoying nanny volume change in the week that I've been using this app. Great for people that plug into stereos and other systems with independent volume control and want to keep the phone at full volume when connected.", "This app is amazing! I can no longer use Xposed because Samsung had to make a custom library for ART. This is a good non-root workaround for the annoying high volume nag! You're awesome!"], 'appId': 'com.jakebasile.android.hearingsaver', 'url': 'https://play.google.com/store/apps/details?id=com.jakebasile.android.hearingsaver&hl=en&gl=us'}
