{'title': 'KEGS IIgs Emulator', 'description': 'Includes a System 6 disk with shareware games (Based on a WhatIsThe2GS image).  Also includes a favorite of mine, FTA\'s X-MAS Demo.\r\n\r\nIf it doesn\'t work right on your device please let me know!\r\n\r\nUsability tips:\r\n- Put your own images directly on your SD Card, or in a new folder called "KEGS", or in "Android/data/com.froop.app.kegs/files/images"\r\n- In fullscreen mode without action icons visible, you can tap in the upper right corner to make the action bar visible.\r\n\r\nSource code available at https://github.com/jamessanford/kegs/', 'descriptionHTML': 'Includes a System 6 disk with shareware games (Based on a WhatIsThe2GS image).  Also includes a favorite of mine, FTA&#39;s X-MAS Demo.<br><br>If it doesn&#39;t work right on your device please let me know!<br><br>Usability tips:<br>- Put your own images directly on your SD Card, or in a new folder called &quot;KEGS&quot;, or in &quot;Android/data/com.froop.app.kegs/files/images&quot;<br>- In fullscreen mode without action icons visible, you can tap in the upper right corner to make the action bar visible.<br><br>Source code available at https://github.com/jamessanford/kegs/', 'summary': 'Port of the KEGS Apple IIgs emulator to Android', 'summaryHTML': 'Port of the KEGS Apple IIgs emulator to Android', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.4206347, 'ratings': 1288, 'reviews': 702, 'histogram': [81, 61, 81, 71, 991], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '15M', 'androidVersion': '2.3.3', 'androidVersionText': '2.3.3 and up', 'developer': 'James Sanford', 'developerId': 'James+Sanford', 'developerEmail': 'jsandroid@froop.com', 'developerWebsite': 'http://www.froop.com/', 'developerAddress': None, 'privacyPolicy': 'http://www.froop.com/app/kegs/privacy/', 'developerInternalID': '8714809014352297685', 'genre': 'Libraries & Demo', 'genreId': 'LIBRARIES_AND_DEMO', 'icon': 'https://lh3.googleusercontent.com/KBAlvR76qzy43IdOO5oRcpuC0dlw5dX9Gd6IldIy1-tBQPICWOAJgsJXi7JrPMYhdl8', 'headerImage': 'https://lh3.googleusercontent.com/KadUDo1WR8nQJ6efeW27rbqG4B5yd_rk-8OpFsgOmjFWzZQpn8ZsNQluKsYNLjsK9g', 'screenshots': ['https://lh3.googleusercontent.com/ESnmj9keeSmlMPBZJbFoNAzJj74m-JrHQz3jVtrXRorgJ4Vh7wRu13kZVr1oMZE8sLNR', 'https://lh3.googleusercontent.com/yhVUQoUj7_6s0TZ-1T0iGv1e_7tmy46kaf1SH7YnD7paBKj1rHkfipEteXbGNavnSA', 'https://lh3.googleusercontent.com/9w56gsk4pnlj7yApHv4mVn81ldFNYaTtVrpkNJPBEo7ickPFUIbEqC1TzekAzcJWNGc'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Oct 23, 2012', 'updated': 1361404454, 'version': '0.71beta', 'recentChanges': '0.71beta:\r\nFix startup crash on devices when no external storage is available.', 'recentChangesHTML': '0.71beta:<br>Fix startup crash on devices when no external storage is available.', 'comments': ["Thanks for James Sandford for building such a great app!! that makes you feel like you came to your old days of 90's :)", "The additional keys gui goes away after 1 second and isn't really usable. Still, this app is very good and works well.", "Not as useful as the version for desktops and laptops. It doesn't support some disk image formats, and it doesn't commit changes to the provided System 6 hard drive image. If you're just looking for an Apple II emulator, skip this and use Apple2ix instead; but if for some crazy reason you have a IIGS game or app you want to run. this app ought to do the trick -- bearing in mind the above limitations.", 'Its awesome. I managed to crash it by erasing the system files then clicking proDos. it was funny', 'Awesome Emulator! So much fun to crash the system!', 'I LUV IT BUT PLS FIX THE GAMES. SOME GAMES ARE LAGGY AND FREEZES THE PLAYER AND CANT CONTROL LIKE F1 RACE AND DUELTRIS', 'Very fascinating emulator! Such memorable Apple IIGS they had in America and lots of games for that computer.', 'A "hard reset" needs to be added if you screw something up but otherwise its a great app!', 'Great App! Also there should be a Reset Emulator type option.', 'The best IIGS emulator and a good substitute to limbo pc emulator.', 'Awsome app. Please make pc emulator for android to run pc exe file.....', 'I think its really cute for some reason and I enjoyed it :3', 'its cool but just kinda a waste of space :/', 'Why does it not load?!', 'this is a good. 5 stars because i like the silentness in the app. (*^▽^*)', "This is a great up, please don't abandoned it.", 'Crashes at startups', 'I HATE IT I HATE IT BECAUSE THERE IS NO Windows. WHAT ABOUT WINDOWS?!', "It's better than minivmac", 'Wow! Thi is so cool!', 'BEST APPLE KEGS EVER!!!!!!!!', 'What a blast to the Past', 'I love it!!!', 'Just like it', 'best of all time', 'How do you get games?', 'WHAT ABOUT WINDOWS?!', 'I HATE IIIIITTTTTT GETRID OF IT NOBODY WANTS IT', 'Awsome and cool', 'I Love KEGS Apple IIgs', "This app is great for all of us who love our old apple computer's but on my Samsung NOTE2 the tab button doesn't work and I have one app that needs that key to function, so please try to fix that!  But other than that it runs flawlessly!", 'App is very well made, I like how freeware programs are preloaded. However \nI did run into a problem when trying to run Wasteland. Game will not start, \nevery time I go to start a game it says "insert side 1 (return)". Any \nchance you could help out with this?', 'So old school very interesting.  Wish my two fav old school games were on there or made some how havent played them in years and dont know how. Jill of the jungle and cosmos cosmic adventure. Those were classics i loved :)', "Mouse control is a bit laggy and annoying, but otherwise everything works nice. Not sure about anyone else, but the menu at the top of the screen inside the emulator doesn't work unless I tap and hold and let go on what I want to select", "Been enjoying playing games from my misspent youth like Roadwar 2000 and Defender of the Crown on my Asus tablet. With the keyboard dock, it's like having the laptop IIGS I always wanted and Apple would never build...", "Great app but wish you could search for disk images through the app, other \nthan that it works OK. EDIT: Just got a new phone, the VkWorld T2 Plus and \nI only get 1 speaker sound so I only hear half the stuff (not sure if \nthat's just my phone or how to change that?) Also the app randomly closes \nand then when I go back it crashes the Mac", "A thing that bothers me is that the first word or number of each line that I PRINT out. Doesn't show up", 'This App Is Awesome! I like the desktop part and all the games it brings! (FREE CELL DOES NOT WORK IT FREEZES THE MAC)', 'Crashes on startup on Asus TF700T when started with screen in landscape mode, but starts and runs OK when started in portrait mode... Works fine on HP Touchpad... otherwise nice EMU', 'This is the thing that I want! But 1 problem, it cannot show the full screen of the computer'], 'appId': 'com.froop.app.kegs', 'url': 'https://play.google.com/store/apps/details?id=com.froop.app.kegs&hl=en&gl=us'}
