{'title': 'Pdf Viewer Plus', 'description': 'Pdf Viewer Plus is an open source PDF viewer.\r\n\r\nFeatures\r\n--------------\r\n<> Ability to open a PDF from anywhere\r\n<> Ability to share a PDF\r\n<> Many themes', 'descriptionHTML': 'Pdf Viewer Plus is an open source PDF viewer.<br><br>Features<br>--------------<br>&lt;&gt; Ability to open a PDF from anywhere<br>&lt;&gt; Ability to share a PDF<br>&lt;&gt; Many themes', 'summary': 'A simple PDF document viewer.', 'summaryHTML': 'A simple PDF document viewer.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.49, 'ratings': 634, 'reviews': 334, 'histogram': [25, 12, 38, 107, 450], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'GSnathan', 'developerId': 'GSnathan', 'developerEmail': 'gokulswamilive@gmail.com', 'developerWebsite': 'https://github.com/JavaCafe01/PdfViewer', 'developerAddress': None, 'privacyPolicy': 'https://github.com/JavaCafe01/PdfViewer/blob/master/privacy_policy.md', 'developerInternalID': '5805673271527276095', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/ze4ZvemOuafNYgcIPw0tdhq7HcFtvIGq3GGL2e3iumncff8WE5nwcyGsqlNgkTNHc9o', 'headerImage': 'https://lh3.googleusercontent.com/s0IE1eq62eJK2Jph_62Q3pymzYDfchz2rEoHfCKklciDhlc0jpSs6yc7WwB-jZWAJxw', 'screenshots': ['https://lh3.googleusercontent.com/XyWjbtPX5BPsa_Bxft9vIb1OsX7XbvgITJYxGeGJ5lbEBfAckxHKfTr_1IHMv9nYgi_t', 'https://lh3.googleusercontent.com/wpI5Tb-nDj4XojOwV11GmITcHNY2h3F9YjP9xblO3PsVYY9rwnV9U3ACjB70SNqecg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Feb 23, 2018', 'updated': 1583191079, 'version': 'Varies with device', 'recentChanges': '-> Enabled file manager on start of the app\r\n-> Changed zoom from 3x to 5x', 'recentChangesHTML': '-&gt; Enabled file manager on start of the app<br>-&gt; Changed zoom from 3x to 5x', 'comments': ['Recommendations: 1) Hide the bottom and top bar such that the pdf is shown in full screen mode. 2) Remove bottom bar completely. Move the buttons from the bottom bar to the 3 dotted menu. 3) Add search functionality. 4) Add option to invert colors (white letters on black background) for reading at night.', 'Problems when opening PDFs directly from other apps (browser or messenger), otherwise great.', 'Simple and effective app. Supports opening of password protected pdf documents', 'Not perfect, but very good... Magnify works well, page rendering good.', 'A straightforward app, easy to use and does what it says on the tin.', 'Good app. Please add search and page rotate feature :)', 'Excellent. Fast, good quality rendering of pages', 'simple, easy to use', 'I suppose this app is O.K. It does what I want, which is to allow me to look at pdf files of local transit schedules on my phone. The worst part of it is the CONSTANT NAG SCREEN wanting me to rate the app. In a hurry and need the bus? NAG SCREEN. Trying to manage several things at once and plan for your transportation? NAG SCREEN. Want to visit a friend on his day off work? NAG SCREEN. So, now that I have come here and given my rating, hopefully it will stop.', "This is what I wanted - an app to view my PDF files in that is open source and light on permissions. I don't know what bells and whistles might be available on other PDF viewers, but so far this has worked perfectly for my simple purposes. Just tap on the file you want to view, and this app opens and does the rest.", "Excellent app - everything a mobile pdf viewer should be. No ads, no tracking, no bloat, just a beautiful PDF viewer with a couple of nice options. I do wish that you could select text, though, but that's the only thing holding me back from giving it five stars.", 'Simply the best PDF viewer around. Intuitive, clear UI, minimal permissions, no ads. EDIT Unfortunately now has Network permission, so I will not be updating this app.', "Love the open source ethos. I'll keep it on my phone. But I want an open source pdf reader that works with pCloud. If you fix this I'll rate it 5 starts. When I click on a pdf in pCloud and use this app to open it, I am greeted by a blank screen. I used the default 'welcome to pCloud pdf'", 'Great app. Works exactly as described - views PDFs without a load of unecessary clutter. Highly recommended.', 'perfect! I love the page snap which gently centres the page. Excellent basic pdf reader. No permissions, no ads and no fuss. Does what it says- nothing more for me to add here! Except its Perfect for my needs!', 'not much of a zoom. why 30+ megs for a simple reader? nice, but not nice enough.', "*almost excellent, it doesn't have a feature for encrypted files. Is it something that can be fixed ? Thank you . Fantastic app, simple but with all features, open source and ads free", 'Excellent PDF reader. Simple, clean and open source. The simplicity of this app makes it a work of art. Simply beautiful. Nexus 9/14.1 lOS', 'Open and view PDF files does exactly what you need, no ads no gimmicks and it has many built-in themes, My experience, I think it is excellent. Thank you developer.', "Very nice, super simple reader, wish it had a few extras like a night mode, but ... Great as it is, so I'm happy.", 'Plain and simple. Does what its meant to do without annoying ads or disruptive features or too many permissions. Highly recommended.', 'This a PDF viewer and nothing else. No ads, no questionable permissions. HOWEVER, after the latest update it is arbitrarily limiting my ability to zoom in. Not useful at all...', 'only thing i disslike is inability to go full screen, which is a reason for me to uninstall it, even though the appnis perfect! but no full screen? what where you thinking??', 'Great FOSS app, no bloat/spyware, no unnecessary permissions or ads. It would be nice if the plus at the bottom right could be hidden or moved.', 'Simple, free, no ads. Add a night-mode option and it would be perfect.', 'Fast, functional, open source, and with an uncluttered interface.', '+ quick, scrolls through pages rapidly - still flashes lowres bitmaps during rendering, bad user experience - should prerender at least current page at current or good resolution. - double click zoom should focus in on clicked column', 'It opens PDF files for viewing, it works perfectly without any extra ads or unused addons. Many thanks to the developer.', 'Wow very nice, much PDF very good. I could feel the PDF come to life in my hands through the app, revolutionary technology 20/10 ign', "Simple, works and doesn't contain ads, trackers or other unwanted stuff.", 'Ecellent. Simple and does the job. Does not auto start too, so it only runs when I want it to ☺.', 'Fast, works great, no ads. Best PDF viewer on the market imo.', 'Simple PDF viewer. Fast. Works perfectly for my needs. No extraneous bloat', 'Brilliant. simple, easy no fuss. open source. Just how i like it.', 'Great privacy policy! Sadly only three stars - no "print" option, can only PDFs.', "Great App, clean simple face. BUT doesn't seen to cope with password protected files. Shame.", 'It works, has a distraction-free interface and is open-source.', 'Exactly what I expect from a PDF viewer. Thank you for this app :-)', 'Nice app ,but it will be much better when it has some tools within it.', 'Great, quick, simple - but I really need a copy-text function :('], 'appId': 'com.gsnathan.pdfviewer', 'url': 'https://play.google.com/store/apps/details?id=com.gsnathan.pdfviewer&hl=en&gl=us'}
