{'title': 'Chess', 'description': 'Chess\r\n\r\nChess, chess 960, practice mate positions, solve puzzles, play online (FICS), chromecast.\r\nOne of the most versatile free chess apps without ads.\r\nOpen sourced.\r\n\r\nPLAYHUBSUPPORTED', 'descriptionHTML': 'Chess<br><br>Chess, chess 960, practice mate positions, solve puzzles, play online (FICS), chromecast.<br>One of the most versatile free chess apps without ads.<br>Open sourced.<br><br>PLAYHUBSUPPORTED', 'summary': 'Chess. Practice, puzzle, play online and many more features. Enjoy chess.', 'summaryHTML': 'Chess. Practice, puzzle, play online and many more features. Enjoy chess.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.0780144, 'ratings': 3900, 'reviews': 948, 'histogram': [525, 221, 193, 442, 2517], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.2M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Jeroen Carolus', 'developerId': 'Jeroen+Carolus', 'developerEmail': 'info@jwtc.nl', 'developerWebsite': 'http://www.jwtc.nl', 'developerAddress': 'Panamalaan 128\n1019 AZ Amsterdam\nNetherlands', 'privacyPolicy': 'http://www.jwtc.nl/privacy', 'developerInternalID': '7823957146172581277', 'genre': 'Puzzle', 'genreId': 'GAME_PUZZLE', 'icon': 'https://lh3.googleusercontent.com/mRrdiUs1YQj_Ry3r79rrjEdw40-FCAMPaUmLn7vxeQTafpYd0B1V0ARGeZABc3z1Nto', 'headerImage': 'https://lh3.googleusercontent.com/HUg8ElQ-bE1uvTZ_H4Q5ne7eNiewHKJEhKsuJMyPrPsk75OdB6mmvlDD08lL6w0c87m2', 'screenshots': ['https://lh3.googleusercontent.com/MhtAhLm1m6MICqoB5099A0pfuRvZXS3wgPqb_A8GBlFXNUC_n08Jq5FJZ1SEPEpJCEc', 'https://lh3.googleusercontent.com/QO5j0a-bHDd9yDux0Z4jKj6uo56dJFuzSNtYcra63N__rzrukfmdPbeijzFyproBTQ', 'https://lh3.googleusercontent.com/_cHio4qADQpIOwvoyHkAMB3ddQLUYVL4iXCGeR1MA67mb7jzOHy5wnihhj6LZ1yUGpwO', 'https://lh3.googleusercontent.com/w7KB5iPttOjWu74J0RJz4kQO-VkkcQoC6cOjcpsT62KPnq44olYQR8am7zbWXP3Dvyj6', 'https://lh3.googleusercontent.com/CWNka7dyCU4GA_C4QwTsV5WQB8USCsEtItAShv8mIXNDk4dlMcAfRPIkvOzliWxPcOk', 'https://lh3.googleusercontent.com/wiMVd1zZPNx_nCyOO4ZlAM9oxi5VvbbdS5BR3g78quNnt4EVdi7nPwLNmfmlVK0SXPs', 'https://lh3.googleusercontent.com/Q96NV9Sc-YTum8kzpvF5XMVOeLrY1gpFXhvpv5PNrJzSxcLJXnhLzpH7bQgVwMxDWtRZ', 'https://lh3.googleusercontent.com/t8K0G0Z5nEjbHwYVFCIyxm4pVCfpQf0-IMuc43EZzoIhB6zNau-Wam_oEeloJLkvxYU', 'https://lh3.googleusercontent.com/I2_Ep6HNiAhlCCk0xeCY9rKJ27uOBZGPzQdfnGJY-jGoHJiWh0se3ji6ScRf0OCVlhEH', 'https://lh3.googleusercontent.com/q_bb992rxhBKJO9lSijZr8ifGyerJ6hBAQgRhQ6C9GIzK0La4Nvt5f8BWsli6E7Zsg', 'https://lh3.googleusercontent.com/gNuQ0gDiXHFMjfe87gqE8UuNZcL9k0-XDW9_3KUe5uN5ym6Z3yTeDRcdtacbpwxwd8wP', 'https://lh3.googleusercontent.com/0Ez8VifEvEMDkaNb5SiytmtkxXts4lGPiGKDR273GxX2lRKcNLYc_9UsjQgMxC7qC1w', 'https://lh3.googleusercontent.com/DSsskuKJEGoN1eK-Vj-oP-dmCFVD0QpF4OFVqd8ZbQ7PXaUonr3SCotPfKxXyd-o6QM', 'https://lh3.googleusercontent.com/mWe2VwWTes0TyxhYXC0ypbiTOPzv0_p1Ue3KRuI5YkbgzdHtsXdIYegbch8zSdaBUuU', 'https://lh3.googleusercontent.com/1wLWdSICmmuKvPuorVzGMlZW4VpNZbwEAT65lVesjtCVR22iEzsnC8iOTwU03m7G3eA', 'https://lh3.googleusercontent.com/UOu8tXowtkC1bV4cNI1tuIDKFBGvKkzOZ-bQRVSstaNeDKca1GN7zwm36LKu7SdGfA', 'https://lh3.googleusercontent.com/S9rHcwRvv6KD1Pf1PjkFcjDbRxQSat7oZdIfLiRVbH6-0Z811sPOboyvS8LGW8NDSxM', 'https://lh3.googleusercontent.com/yPiZ1jcXsLXS12kSxsABlH9_IymLobcP_5EONC8c66kTa_p1EMkRv2v9OFzaCxMjX2E'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': None, 'updated': 1569999406, 'version': '8.9.5', 'recentChanges': 'New build with updated libraries', 'recentChangesHTML': 'New build with updated libraries', 'comments': ['This is a fun Chess game. No adds or in app purchases. I like it. Thank you:)', 'This is one of the most lightweight chess app I\'ve ever seen, but full of all the bells and whistles one might ever need. Appreciate the developer for creating one of the most complete chess app around. Just two suggestions : 1) enable drag-n-drop move. 2) funnily enough, this app supports pre-moves, but on the other hand screams "illegal move". If you know what a pre-move is, you\'d remove that "illegal move" alert.', 'Best Chess App! No fancy graphics or distracting ads to interrupt my game and waste battery power means many relaxing hours of playing chess! Includes save/load features, chess puzzles, and training modes for beginners! Online and offline play modes available. UCI support makes its easy to play against various chess engines. Import or export game databases from other devices and play chess everywhere! Last but not least this app is FREE! Download Chess by Jeroen Carolus, and start playing today!', "great on the smartphone. really nice work, kudos!  BUT on the chromecast, why oh why Black and white??!!  premoves also not visible there? Also the lag* is half to one second which i find kinda slow.   *Lag i mean the time from move on the phone to appear on TV.  I'd be glad to pay for this app!! if fixed the chromecast issues. it be great for my chess neophyte nephews ;-)", 'Good start, but need a lots of fix, First of all it does not recognize path to any folder, means when you want to import pgn games....', 'Awesome ad free and playing with android is cool. Also it has casting to tv, which makes it good in multi player', "I've lost countless games because it told me that I was making an illegal move which was a completely valid move.", 'Great chess app, especially since it is free of charge with no ads', 'Good game and I found out a bug in the app which is occurred in the soldier moves I have proof also BTW.. PLEASE FIX THE BUG', 'best FICS client for android. one suggestion that: player should move piece by drag and drop not only clicking.', "No ada or purchases or anything, so grwat in that regards, however the AI seems too good, and you can't adjust it.", "Way to hard. Can't even beat one game. Maybe I'm just that bad but... No .. I think it's made to be way too hard.", 'no evaluation meter to know which side is better, does not plays all opening and all positions repeats same response if same opening plays repeatedly', 'No ads, pvp and PVC modes, puzzles too.', 'best app for chess problems regarding mate in two moves, works offline', "Super hard AI BUT It's freeeee no ads no in game purchase awesome", 'Very basic game and graphics.', 'very hard and challengingin game it is dfficult to win in this game ,this can be for proffesionals and not brgginers', 'The practice end games are great.', 'love this app. this is the first app I install after getting a new phone', 'Almost all feature in this application', 'Great no ads', 'Good chess apps', "I can't download any apk. It's shown as ''You have no any devices''. Please instruct me how to cope it.", 'Wow, intuitive as hell', "won't install......EDIT: installs OK now.", 'This app is my inspiration and secret weapon as reference to learn android development I need for my job.', 'how do you quit a game and start over!!?', "You're not allowed to castle in this game", 'All you need', 'No bs just chess', 'Great app!', 'Best', 'The program is almost perfect. However, the time-based levels are device-dependent and even 1sec/move is too strong on my new phone. The ply-based levels are too coarse: the strengh difference between sd=1 and sd=2 is huge! How about node-based levels: the search breaks after the desired number of nodes (evaluated positions) is reached? There are other ways to gradually weaken your engine emulating a weak player: add a random number N to the position value; blunder (reduce the depth) every N move; ignore the opening book after N moves; combining these methods. Another way is to let us to use the options of UCI engines: some of them have Elo levels or personalities.', "I'm totally amateur, but I really enjoy the Chromecast compatibility. I will enjoy adding some serious polish to my chess game.", 'best chess app , if it has engine tournament then it will be better . i find many copies of these apk in playstore renaming others name', 'Simply Superb !!!', 'cheater', 'Fischer Random, yay! Clicking Install UCI Engine without any engines will delete all games. And then I found the export games to SD card, boo! Option to resize board', "It is really good. Needs some improvements with GUI. it's a bit confusing specially when I hit the back button then I can't find my FICS account and I reconnect."], 'appId': 'jwtc.android.chess', 'url': 'https://play.google.com/store/apps/details?id=jwtc.android.chess&hl=en&gl=us'}
