{'title': 'aGrep', 'description': 'aGrep is a open-source text search program like a "grep".\r\n\r\naGrep can ...\r\n-search text from text files in the SDcard.\r\n-supports Regular Expression.\r\n-be started by SEARCH-intent.\r\n-view the result by filename,line-number and content.\r\n-have a internal text viewer.\r\n-auto-detect multi char-code.\r\n\r\nThis application is not for searching in System Directoies.\r\n\r\nIf you found something mail me or tweet me @jiro_aqua', 'descriptionHTML': 'aGrep is a open-source text search program like a &quot;grep&quot;.<br><br>aGrep can ...<br>-search text from text files in the SDcard.<br>-supports Regular Expression.<br>-be started by SEARCH-intent.<br>-view the result by filename,line-number and content.<br>-have a internal text viewer.<br>-auto-detect multi char-code.<br><br>This application is not for searching in System Directoies.<br><br>If you found something mail me or tweet me @jiro_aqua', 'summary': 'aGrep is a open-source text search program like a "grep".', 'summaryHTML': 'aGrep is a open-source text search program like a &quot;grep&quot;.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.3, 'ratings': 449, 'reviews': 227, 'histogram': [31, 8, 49, 62, 296], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Aquamarine Networks.', 'developerId': 'Aquamarine+Networks.', 'developerEmail': 'jotaplus.aqua@gmail.com', 'developerWebsite': 'http://sites.google.com/site/aquamarinepandora/home/agrep', 'developerAddress': 'Megurita 1-19-35\nHigashi-Murayama Tokyo\nJAPAN\n\nc/o Asia Electronics Corporation\nAquamarine Networks.', 'privacyPolicy': None, 'developerInternalID': '7970854397000729874', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/wE1Qc1gHytN0TMq6duv-JS6Pr9X2qH5nU6c31Px1KuHx_-up9-8-Hz2nE9q4_wmjyX0', 'headerImage': 'https://lh3.googleusercontent.com/eNB9pHuibUdgikhc9Kq3EHPH0BZbeGmDPgL5oyTqkcLEC6kzjU48ZE4dxmGBQ3ZaxEI', 'screenshots': ['https://lh3.googleusercontent.com/1uDaW8bZL0cVzwd1PaAlfPpc6M3vIH4lXkCuC5qwa8bojuatKHGv_E4bz0HWW2U7qc0', 'https://lh3.googleusercontent.com/5rI890tXmID5Peqw1MbCgQRGgMdXxapGtcWbEcYb_NIRsw9zNecdtXx4KRr_ZMyRYTs', 'https://lh3.googleusercontent.com/iX_reoLQDMGES00dbx1yGRBYk59iR4V1EBqeJReq7sKGDxyF99_uZ2EEbPNsjfyt9ZHZ', 'https://lh3.googleusercontent.com/DhievUtfpgRKw9jmm7ggrM55mNewgrPyI14F-Heh-lA56MwBWkYJJbq_lWkIUvaHt6I', 'https://lh3.googleusercontent.com/5X7jhoQj4A5V51M35sfj9L9GzdPEuwRCjA-jEp9sPKxstrR29Q8cdAqmKuk29T4wTDo', 'https://lh3.googleusercontent.com/61gy0XiG8AgbuaTMkpArfVVM65w2tpkphsjqzLHFVUAteizbgpBUNqQM2dzFZ4y62g'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 11, 2010', 'updated': 1416043970, 'version': 'Varies with device', 'recentChanges': None, 'recentChangesHTML': None, 'comments': ['Wonderful search through all files with wildcards amd regexp for advanced searches. Been using for years, no problems at all. Thanks for a great tool. (Author also wrote & maintains Jota, a very versatile text editor - check it out!)', 'aGrep v 2014.03 on Android 8.1.0 works if you read ALL the reviews, some of which have helpful instructions such as Tap & HOLD target directory name to select it.', 'Eventually. This is it. Wonderful, cool, simple, fast, free, no ad and completely useful. And definitely better than similar apps (you know those ugly apps). Please add donate button.', 'Good software. It searches quickly through thousands of files', 'Performs as described (finds text within file content), and does so very fast; but app navigation is non, selecting target directories is non-intuitive, results list does not show the path to the found files, and results list is difficult to see boundaries between each found file.', 'Excellent app, which sucessfully searches for and displays occurrences of target words in text files within a folder or folders. In effect, a port of grep or fgrep from Unix.', "Files location is shown. Clear text preview. Limit between files clear enough. No add. Doesn't seems to abuse of your data. Fast. @jotaplus - Thanks for working on it and sharing opensource", "Omg .. it did just what I needed, and fast.. haven't used it long enough to see if the bugs identified elswhere are a serious problem, but in the meantime, thanks dev...", 'if i find for a sentence, using or noy using double quotes, the app will look for a single word conyained in the string. In other words, it only searches for single words', '😊 Although it is not real intuitive, I selected the folder to search in and I found the bit of text I was looking for on the 1st try.', 'great and extremely useful app. could use a wiget though!! just a basic entry field with a saved scope and setting, or last used (i dont vary the scope much)', "Tiny but very useful to find files by it's content. Supports regular expressions. But there's no help on regex.", "was 5 stars for lower versions of Android, where it actually works. doesn't seem to anymore.", 'problem solved. Unix Grep with vim editor. found the words and the lines. thank you!', 'UI could be improved, other than that, the app works as expected.', 'Excellent app. Especially for people with command line experience', 'Congratulation for creating such a wonderful great fast free app. Highly appreciated. 5 star.', "There are no instrucciones. I can't figure out how to do simple word search: hello world.", 'regex search! awesome!', 'no root support... cant search in root files', "doesn't utilize the power of high end phones", 'the best app in the store', 'Very good app', 'thanks a lot for the app.', 'Very nice application', "First used on Jellybean. Had use for now on my P2XL. Still working after all these years👏🏻 aGrep finds hits AND if you press on a hit will open the input file and position to the highlighted string. Can find phrases without squotes,dquotes, just enable regular expression (with or without using a regex) And it's hold press target directory to select; not tap.", "Because it finds stuff :)  ――  1_Set a base path to start the search [+] (Necessary, long-press on the folder name (browse up […] to get to other Storage)), 2_Add file extensions to the list [+] (Necessary ( * here means NoExtension )(AnyExtension I can't figure...)), & 3_Check at least one item of both to use for a given search. ―― If you learn the most basic RegEx you'll be miles ahead. (Try e.*t after checking 'Regular Exp...') ―― A few Settings. If the screen labels get wacky, just exit & relaunch the app. Despite the minor flaws, I like the one-screen setup & go. [me:KitKat]", 'Alhamdulillah,  Its a great app ever, I found all thee things in this app what I needed, thanks the developer team.  It searches the word even utf-8 in few seconds and no case sensitive, and then press any search line and go to the original file view,  GREAT! or press short tap to copy - the feature is also great. I found at last what I was looking for. Can I get the projects codes?', "This application has a major problem: it does not find the word you are searching for, if that word is in the file-name..!!! Example:  suppose you have a folder containing hundreds of text files. you are searching for some word, say:  xyz. If xyz is in the body of some file, it will be found and displayed correctly. But if xyz is in the file-name of that  file, it will not be shown..!! I understand a search tool should find all occurrences of the target word, both in the file-body and in the file-name.. Please adjust and I'll give you five stars.. Thanks", 'Not working on huawei p9 lite nougat, "unable access" all directory and not even found a simple text file but it\'s here. I dont give 1 star because the app latest update is 2014 and I believe it cause by runtime permission required since Android 6.', 'Searching for some characters (such as \\)  causes the app to instantly crash. Little buggy,  but appears to work OK.', "I used the app to search for names in a directory with 20 text files (from 247KB up to 3927KB). The search uses regular expressions and ignores case. This app can really search for what I need to look for in the document. On my mobile phone (2 Cores 1.2GHz), the search process takes about 30 seconds, maybe up to 40 seconds to check the result for all the files. The same search process takes about 15 to 20 seconds On a tablet pc (4 Cores 1.3GHz). My default document viewer is having trouble opening these moderately big sized txt files  but with aGrep, opening and viewing the text within the search results is amazingly fast. It is also easy to cancel the searching so you can quickly change the search parameters if you made a mistake on your input. (Doing all this search process on a mainstream desktop PC will display the results instantaneously)  I don't know if it is about my Phone's processing power that the search result takes some time. From the apps that I have tried out so far, this is the only one that can do the task. Now, I'm just checking if there are other apps that can do it faster.", 'I can no longer add folders to search. It initially worked. Presume no longer updated to support latest annoying android security changes, although from reviews other users must be managing.', 'Pretty impressive app,allows me to grep files on the bus without having to break out the laptop. (Yes I have to do this more then any body believes) :)', "I searched for 'search text' apps. They searched whole disk to find a string. Finally this app searches spcicific directory and extension provided. Also this Android 5.0 update seems to work well.", 'Running Android 6 and your app cannot find anything, or at least never displays anything; just "Now Searching" popup, then "Finished." toast ... EDIT: reinstalled app and now it works perfectly!', "Very fast, very useful for me. I'm using a lot of large text files from different languages. This is very precious to me, thanx. Wish i can have more options for the display", 'Thank you for such great applications. No issues so far from side. App does what it should do by intention. Keep it up devs!', 'Awesome devs. Best for programming and modding. I have suggestions, add Replace words feature. It would be great. Btw, 5★ rates', 'it does not allow you to simply write the search path,  you need to browse to it,  and i could not browse to the whole device including the external sd card.'], 'appId': 'jp.sblo.pandora.aGrep', 'url': 'https://play.google.com/store/apps/details?id=jp.sblo.pandora.aGrep&hl=en&gl=us'}
