{'title': 'Simple ToDo — Task List & Planner & Reminder ✔️', 'description': "Simple ToDo will help manage your daily tasks and don't forget about important things! 🚀\r\n\r\n<b>KEY FEATURES:</b>\r\n\r\n⭐ <b>COMPLETELY FREE AND NO ADS.</b> \r\nSimple ToDo is completely free, doesn't contain built-in purchases and annoying advertising.\r\n\r\n👓 <b>MODERN DESIGN.</b> \r\nThe application is made in the style of material design by Google with smooth and pleasant animations.\r\n\r\n⏰ <b>REMINDER FEATURE.</b> \r\nThis app has a reminder feature which helps you never forget important things.\r\n\r\n👔 <b>THEMES SUPPORT.</b> \r\nChoose one of the three available themes: light, dark or black.\r\n\r\n🔎 <b>SEARCH FEATURE.</b> \r\nWith built-in search, you can easily find any task you need in a couple of seconds.\r\n\r\n📱 <b>BUILT-IN WIDGET.</b> \r\nThanks to the built-in widget, a list of all the current tasks is always available directly from your smartphone's home screen.\r\n\r\n📁 <b>BACKUP & RESTORE FEATURE.</b> \r\nNow you have the ability to save your task list to the internal storage of your phone.\r\n\r\n🔓 <b>OPEN SOURCE.</b> \r\nThe app source code is freely available on GitHub: https://github.com/Jizzu/SimpleToDo\r\n\r\n🛡️ <b>NO SUSPICIOUS PERMISSIONS REQUIRED.</b> \r\nThe application doesn't require any suspicious permission, whether it be permission to access the camera or to your current geolocation.\r\n<b>• Permission to access the storage is needed to tasks backup & restore feature.\r\n• Permission to access the Internet is needed to receive reports of crashes and errors in the app.\r\n• Permission to access the microphone is needed to add tasks using voice.</b>\r\n\r\n<b>Simple ToDo is still in active development, so if you have some problems, bugs or suggestions — please, contact me by Email. Any feedback is appreciated!</b>", 'descriptionHTML': 'Simple ToDo will help manage your daily tasks and don&#39;t forget about important things! 🚀<br><br><b>KEY FEATURES:</b><br><br>⭐ <b>COMPLETELY FREE AND NO ADS.</b> <br>Simple ToDo is completely free, doesn&#39;t contain built-in purchases and annoying advertising.<br><br>👓 <b>MODERN DESIGN.</b> <br>The application is made in the style of material design by Google with smooth and pleasant animations.<br><br>⏰ <b>REMINDER FEATURE.</b> <br>This app has a reminder feature which helps you never forget important things.<br><br>👔 <b>THEMES SUPPORT.</b> <br>Choose one of the three available themes: light, dark or black.<br><br>🔎 <b>SEARCH FEATURE.</b> <br>With built-in search, you can easily find any task you need in a couple of seconds.<br><br>📱 <b>BUILT-IN WIDGET.</b> <br>Thanks to the built-in widget, a list of all the current tasks is always available directly from your smartphone&#39;s home screen.<br><br>📁 <b>BACKUP &amp; RESTORE FEATURE.</b> <br>Now you have the ability to save your task list to the internal storage of your phone.<br><br>🔓 <b>OPEN SOURCE.</b> <br>The app source code is freely available on GitHub: https://github.com/Jizzu/SimpleToDo<br><br>🛡️ <b>NO SUSPICIOUS PERMISSIONS REQUIRED.</b> <br>The application doesn&#39;t require any suspicious permission, whether it be permission to access the camera or to your current geolocation.<br><b>• Permission to access the storage is needed to tasks backup &amp; restore feature.<br>• Permission to access the Internet is needed to receive reports of crashes and errors in the app.<br>• Permission to access the microphone is needed to add tasks using voice.</b><br><br><b>Simple ToDo is still in active development, so if you have some problems, bugs or suggestions — please, contact me by Email. Any feedback is appreciated!</b>', 'summary': 'Free To-Do / Task list with beautiful minimalistic design and reminders.', 'summaryHTML': 'Free To-Do / Task list with beautiful minimalistic design and reminders.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.59, 'ratings': 932, 'reviews': 480, 'histogram': [27, 9, 27, 186, 680], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.8M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Ilya Ponomarenko', 'developerId': 'Ilya+Ponomarenko', 'developerEmail': 'ilya.ponomarenko.dev@gmail.com', 'developerWebsite': None, 'developerAddress': 'Russian Federation, Novosibirsk region, Novosibirsk, Selezneva street, 24', 'privacyPolicy': 'https://github.com/Jizzu/SimpleToDo/blob/master/PRIVACY_POLICY.md', 'developerInternalID': '8012431241245108973', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/9AguJBN2XF7GJg5sOF6uZMsxhWaqIxGrMZcKee4OReL83ZraLM-25Wzk6SX3THP5NuXF', 'headerImage': 'https://lh3.googleusercontent.com/wSmntfJV1sEvZK1PEkg3jzxcdk01DpaAvTqMvjGYOefLRkSrn9AlVreacm9twWDwLg', 'screenshots': ['https://lh3.googleusercontent.com/UH_kXo4PcOBnTqO3ILlNJ013S5bw7R2rfOZ-oQI9orhpJBj2fkGUbXBS1fXTV8S_iF0t', 'https://lh3.googleusercontent.com/_NjPx3WtRgg8JTzG1D8Gsb_SbFkVhqOFS919mLMWqduaFPqan0jclHjmsjm9SyhnUITq', 'https://lh3.googleusercontent.com/WXSWV7ZOdQ5x_0xe6bgwGeN1KKno7IlYDzIlKsAx1N7FuqBnVqkToaAq0i160J44FA', 'https://lh3.googleusercontent.com/cqTUKtYn5xK9olDIo7jxBwiYE8bk0xoonTT1jrWhJUPWXLolCU5hEpADh9sEs-2xVGt8', 'https://lh3.googleusercontent.com/Cxi3HrSDYYnGTzfdN_vC-ChR-ebYDk0BI56AOD7DgEy4Ft-KWJBzdq9H1W5H3iw1jUJ6'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 10, 2018', 'updated': 1558236089, 'version': '1.8.7', 'recentChanges': '📱 Added app intro\r\n👔 Minor UI improvements', 'recentChangesHTML': '📱 Added app intro<br>👔 Minor UI improvements', 'comments': ["hi. I have been using this app for almost a year now and it is very versatile. I write everything I need to do in the list and it's a great tool. However, I noticed there is a limit of number of characters in the notes section and I did not like that. otherwise, it is a great app.", "It's good and easy to use... But the notification option doesn't really work. There was a constant notification telling me that I had items in my to-list... Instead of being notified about each item on the day and time I selected. I had to disable this notification and just look through the list without a reminder.", 'Excellent app. Easy to use and update to do list. Gentle reminder on time. I have used several, but I found this app the best so far.', 'Very straight forward. No bells and whistles. Really straight forward.', "It is great to keep track on schoolworks and assignments, but one minor problem. There's this bug that whenever the phone restarts, the widget would not show the current task. As I said, it is a minor problem and is resolved upon opening the app. And could you please add a description feature where we will write little notes regarding the tasks we currently doing. This is to avoid confusion as well to keep me reminded what is actually needed to be done.", "EDIT: Yeah I know all the problems caused by EMUI, it's really annoying but I've already tried everything :/ I love the app but it closes very often, leading to missing notifications... Pretty sad for a to-do list. I've done everything I could in the settings to prevent android from closing it but it doesn't work. I still give 3 stars because of the potential!", "good simple app, would like for it not to show in notification area until it was time. easy to overlook even with sound if it's always been sitting there. just pop up when it's time. I turned off the badge notification within the app. didn't do anything. do still like simplicity and minimum permissions.", 'This app sometimes deletes the wrong Task. The 1st couple times it happened I just figured that I must have accidentally hit the wrong task, but after a few of those I double checked when it would ask me if I was sure I wanted to delete that task. Sure enough, it deleted the wrong task a couple more times. Fortunately, I took a screenshot of my list before I tried to delete a task.', 'Simple. Only the task in order I want. Easy to change order. Add and delete tasks. Other apps like this want to do too much.', 'super simple, no frills. add an item, delete it when you\'re done. Good reminders. Exactly what I was looking for. Went through 6 apps before finding this gem. Edited to say: would be fantastic if there was a way to set up recurring "to-do" items.', "Amazing! I'm using it fir my daily schedule. I do wish it had an option to repeat tasks daily! Then with notifications available for every daily task every day it would be AMAZING!! Besides that it's great, dimple abd has dark themes. Love it!", "This is a beautiful and amazingly simple app. The only thing I find missing is an option of adding recurring reminders which are very useful, especially for pills or bill payments. If we get that, it's a 5 star app!", 'Looks and works great. Particularly like the offline Backup and Restore feature. Keeping one star back because you cannot view completed tasks nor recover tasks swipe deleted by mistake unless you do so immediately. Love the app otherwise.', "Excellent, sometimes simple is better! Update: the app is so fast I don't even need the widget (which is great). I am afraid to ask for more function for fear it will slow down the app, it's great as is.", 'Finally! After downloading a few similar apps that were incomprehesible and unnecessarily fancy, I came across this one. Simple, clear, super user friendly! Happy to find it. Thank you!', 'Light weight application but simple and effective. It will be better if the check box is available in front of the task so as to mark finished after the task is completed.', "Nice, useful and simple app. It does exactly what it's described. Easy to use and offers a useful backup function to ensure nothing will be lost. I strongly reccommend it", 'Lacking basic checklist features, such as tick boxes to check off completed items, and the ability to reset the checklist every day (or as often as needed).', 'this app is great! so easy to use...not crazy busy...simple tabs...excellent ! i checked out about 15-20 different apps ...and this one sorts my needs perfectly fine! absolutely love it!!6', 'Simple and to the point app. Organised list. Only thing missing is a loud and clear notification (best if it comes up on lock screen the way alarms work)', "Its good in that it displays on the lockscreen but the alarm some times doesn't ring.", 'I like the simplicity of this app.. I also like that you can have a reminder for each to do and they can have different dates and times.. To the make of this app well done well done I like it..', "Great simple app. Would love to see an option for smaller text. Jumbo text provides lower information density and while my eyes work...I'd love more info on my screen.", "Really like this app so far, in it's early development. If it had repeat functionality, it would be PERFECT! Please implement this functionality.", 'Please add the possibility of automatically add a task in order to create a routine (for example: every Monday and Tuesday the task of going to the gym appears)', 'When I click the plus (+) icon the app gets closed and returns to mobile desktop. And also when opening again it asks to press the same to add a new task and then the same thing happens again.', "a great to do app. not a lot of stuff I don't need. very simple and easy to use. works with my voice activation.", 'Sweet and simple. Easy to set a to do, even set a date & time easily, and easy to delete a completed task. Just what I wanted.', 'Neat and clean interface, notifications and gestures make this app perfect for the list of personal tasks I need to do in the short term.', 'Could do with a tick box to show task done or colour code task background colour green to show task completed. Or even a percentage indicator as some tasks have multiple parts before being completed.', "Minimalist and straightforward - does a good job. I agree, 'Repeat' function would be very useful.", 'Absolutely fantastic, must to have and pleasure to use. It does the job so well, the best productivity software ever created. Thank you so much for this amazing app.', 'Excellent. Best to do app in the play store. Hands down. Best detail- hold the button for input with your voice. Dev, bravo!', 'Thanks, useful app, please give in setting option not to delete task by sliding, although have undo button for a few seconds but sometimes it problematic.', 'Great App...just a small suggestion..if you could add small shortcut on status bar so that we can directly add reminders...that really would be helpful...bt overall appreciated work', 'simple and easy to use. it is good for me. you need to be fast when you record your tasks', 'Great simple and fast interface, could use a few more features such as sorting tasks and repeating reminders', "Simple to do with changing task position by draging....that's what i wanted, a simple one with not to many menus...great.", 'Very nice update add an option for backup and restore on google drive.Add a folder in menu for done tasks for those who deleted an task accidently and about black theme why it is white around tasks it must same as background.I see a good future for this keep working.Good Luck Bro ;)', 'OK just like most apps. Would be better if it has text to speech. Alarm does not work. No AM or PM.'], 'appId': 'apps.jizzu.simpletodo', 'url': 'https://play.google.com/store/apps/details?id=apps.jizzu.simpletodo&hl=en&gl=us'}
