{'title': 'Titan Companion', 'description': "The Titan Companion is an app that combines stat sheet and rules engine for all Fighting Fantasy gamebooks. \r\n\r\nFeatures:\r\n\r\n•  Stat sheets for all Fighting Fantasy gamebooks\r\n•  Generic dice rolls \r\n•  Skill, Luck and other gamebook specific tests\r\n•  Combat engine for standard and gamebook specific rules\r\n•  Equipment and Note list\r\n•  Save and Load feature with current gamebook paragraph\r\n\r\nThe main objective of this app is to allow the reader to fully immerse himself into the story and even to give some portability to the gamebooks. You can read in the coffee shop, in the bus or at the beach, and save your progress at any moment to resume later on.\r\n\r\nThis app and it's developer are not affiliated with Puffin Books, Wizard Books or the Fighting Fantasy brand. This is a labor of love that began as a personal project for my use only and that I decided to share with the community. \r\n\r\n<b>There is absolutely no content of the books themselves in the app.</b> You need the books to use it properly. I intend no copyright infringement whatsoever.\r\n\r\nThis is still in beta phase as I wasn't able to implement the rules/sheets for all the books. \r\n\r\n<b>As of now, only the first 24 books are supported by the app.</b> You can still use it for other gamebooks but with the obvious limits.\r\n\r\nYou can report any bug issue here in the store comments or preferably in the project website https://gitlab.com/joao.m.neto/FFCompanion/.\r\n\r\nThanks to Sebastien Haezebrouck for providing the french translation for this app.", 'descriptionHTML': 'The Titan Companion is an app that combines stat sheet and rules engine for all Fighting Fantasy gamebooks. <br><br>Features:<br><br>•  Stat sheets for all Fighting Fantasy gamebooks<br>•  Generic dice rolls <br>•  Skill, Luck and other gamebook specific tests<br>•  Combat engine for standard and gamebook specific rules<br>•  Equipment and Note list<br>•  Save and Load feature with current gamebook paragraph<br><br>The main objective of this app is to allow the reader to fully immerse himself into the story and even to give some portability to the gamebooks. You can read in the coffee shop, in the bus or at the beach, and save your progress at any moment to resume later on.<br><br>This app and it&#39;s developer are not affiliated with Puffin Books, Wizard Books or the Fighting Fantasy brand. This is a labor of love that began as a personal project for my use only and that I decided to share with the community. <br><br><b>There is absolutely no content of the books themselves in the app.</b> You need the books to use it properly. I intend no copyright infringement whatsoever.<br><br>This is still in beta phase as I wasn&#39;t able to implement the rules/sheets for all the books. <br><br><b>As of now, only the first 24 books are supported by the app.</b> You can still use it for other gamebooks but with the obvious limits.<br><br>You can report any bug issue here in the store comments or preferably in the project website https://gitlab.com/joao.m.neto/FFCompanion/.<br><br>Thanks to Sebastien Haezebrouck for providing the french translation for this app.', 'summary': 'Fighting Fantasy helper (stat sheets, dice rolls, combat engine, save/load)', 'summaryHTML': 'Fighting Fantasy helper (stat sheets, dice rolls, combat engine, save/load)', 'installs': '1,000+', 'minInstalls': 1000, 'score': 4.31, 'ratings': 130, 'reviews': 79, 'histogram': [10, 3, 9, 18, 88], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '12M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'Joao Neto', 'developerId': 'Joao+Neto', 'developerEmail': 'joao.m.neto@gmail.com', 'developerWebsite': 'https://github.com/joaomneto/TitanCompanion', 'developerAddress': None, 'privacyPolicy': 'https://joaomneto.github.io/TitanCompanion/PRIVACY.html', 'developerInternalID': '6802195518378680914', 'genre': 'Entertainment', 'genreId': 'ENTERTAINMENT', 'icon': 'https://lh3.googleusercontent.com/rbrVq5WVkPL2WhWECArOdfcUSCVn93R5wgyupknHyREUoSP-QoyOxCJlPsA-XoiJFyI', 'headerImage': 'https://lh3.googleusercontent.com/HSLW4ksOhheTNIzYkc6DthqkyeaacB1scGlu498LGeLGz-YZ5yV6h9OVF9-AxLGzAQDk', 'screenshots': ['https://lh3.googleusercontent.com/4d4RpeZtNvfUZEl-ORKUszJ93QEMPLhRABdqCwRfKI2Xo3PIsO_8ReB4wKlCTlM7ZT8', 'https://lh3.googleusercontent.com/fMIfAR04VoPQLngxFSdp33HLN0Ti838lMmFKp3Io-tUNfcy3XEpY--2cP8FD1cHGJKFt', 'https://lh3.googleusercontent.com/rBn5mINVP5Y61XPSV99hX3TZECj3j-pGvwjx8ewTpdBDQ-m3uetHSNlybf4grO72Cg0w', 'https://lh3.googleusercontent.com/NXB-mTXH-VF7v1dito9Qzo1wtcZurkgT-FIC70pAvDGc2tRsYynj6LRWNnmYqyikm9Y', 'https://lh3.googleusercontent.com/I3SaaijZpCvvqUa4wF0yZNsYxAdZN61QFvgAtf2-nRFGoitcVitX3I4f_nNf9NiWuZwz', 'https://lh3.googleusercontent.com/f87FehcLHasmXmvwoa3eXvCLh5oJssP3iAqqD4JLGS5uxEqTogSCbiE_g12gXDXUwQ', 'https://lh3.googleusercontent.com/wc9tY1eic-xKasNP0h9zCBsToUeNbfHKkDQ4MQCihrHlL3X9KuGA_ozA80ouQH1VPGQ', 'https://lh3.googleusercontent.com/05mWu8oGekWzfI15jhiMLw--qamGUjz7MnE1-MTR9FBC_xvLbRgnLGc_-yY6gB3uW3E'], 'video': None, 'videoImage': None, 'contentRating': 'Teen', 'contentRatingDescription': 'Violence', 'adSupported': None, 'containsAds': None, 'released': 'May 19, 2017', 'updated': 1572621301, 'version': 'v67-beta', 'recentChanges': '- Adjusted layouts for bigger font sizes', 'recentChangesHTML': '- Adjusted layouts for bigger font sizes', 'comments': ["Beautifully designed app. Has everything needed to play all the different books and even links to the wiki for info on the books. The UI is very well thought out and it's set up to allow swiping from screen to screen for different activities such as combat or inventory or taking notes etc. If you're a lover of these books then this is all you'll ever need to play. Very highly recommended.", 'An invaluable tool to play FF gamebooks. Really nicely designed with the different screens that you can swipe through, and great that it matches the different gamebook setups. The only thing that could improve it is to allow you to edit existing notes rather than post new ones, but this is minor. Enjoying reading FF again using this!', "First of all this damn thing will crash back to the book cover screen where you click start new adventure nearly every single time on the galaxy TAB A meaning you have to fill in the start up stats at least twice sometimes THREE times. When it finally does work MOST books you can play properly with REAL dice since you can alter the in game dice rolls and also do battles manually. However there are some books you CANNOT play with real dice starship traveler being one it's impossible to alter the stats of your crew if you want to use real dice rolls. It's all well and good to have everything digital but using real dice keeps the spirit and fun of these books. There needs to be options in ALL books for manually dice rolls.", 'Missing 4 books (Blood of the Zombies, Stormslayer, Night of the Necromancer, Assassins of Allansia), but still an invaluable help!', 'i do not onow how i ppayed as a kid in the 80s and 90s without something like this. I do remember lots of papers being used to scratch down notes and the like. does everything i uaed to do on my notes so well!!!! playing is a breeze with the app. just died about 13 times in Deathtrap Dungeon... now for another playthrough.', "Works well. Deathtrap Dungeon has a flaw in the initial stats display. It only shows 1 digit instead of 2. So if your stamina is 21 it only displays the 2. If it's 19 it only displays the 1.", "Love that you have options for other languages in the settings. Several of my FF books are in French and it's easier to be able to have the app and book in the same language.", "It's great for the books that are supported. Would like to see more from vault of the vampire onwards", "Think it needs auto save ability and/or a warning when you are going back to the menu to prevent lost progress if you've forgotten to save.", "Brilliant app, it saves me writing in my game books and writing out my own adventure sheets. Can't recommend it enough", 'Great app, but it would be really good if you could see your own stats in the combat tab', "Played Forest of Doom for an hour, saving my adventure as i went, but it says there's nothing there to load.", 'Does what it says...and for free it deserves 5 stars', 'Is the must nuts', 'Rubbish dont instal', 'This app has made me pick back up my fighting fantasy books, now if I die I can restart at a checkpoint or if I start again I can have a new game up and running in seconds. The automated combat makes fighting so much faster. The only thing I miss is a mapping function but with all this offers I can live with that. The look of it could do with being a like the books theme wise but the interface is so clean and easy to use. Top marks to this app, I would have happily paid money for this.', "Fantastic! Thanks so much for doing this, maybe now after all these years \nI'll finish one :)", 'enjoy this app very helpfull only thing stopping 5 star is there is no Night of the Necromancer sheet', 'De 1 estrela a 5 estrelas. Esta é A app para as Aventuras Fantásticas. \nObrigado pelo update relâmpago.', 'Just what is needed for paperback book. Very pleased this links to the \nTitan wiki for information & solutions to the books', 'Can you help put some guidance?  I can\'t  pass the title screen. When I click "save adventure" it says "Current reference" which I need to fill with number. What is that for? How to play?   (will change the review when get replied)', 'Perfect!', "Excellent app especially if like me I am going through all my old books from many years back. As I have played the oldest ones so many times,  I am looking forward to trying the 'newer' titles that I have no real memory of playing. Also this has given me a new imports to finally collect the whole set. Do you have any idea of the time line of book to app? Also how far do you anticipate taking the app? I mean do you intend covering all of the books? Thanks for a great app.", 'EDIT: So, the app is still in development which means that not all the books are playable at the time. Which is fair. But that information could be available somewhere.  Fire top mountain is working a charm. Cheers', 'Awesome little app to aid with the fighting fantasy series. One addition I would love is a simple d6 roller, but its free with no ads so gets a full 5 stars :)', 'Hope you get thousands of downloads!', 'Otimo aplicativo, facil de usar, excelente trabalho.', 'I think the App is great. Thank you for it. It really helps with my Fighting Fantasy Game Books. Top notch', 'Great app! I would appreciate a French translation - and I am even willing to do it if you welcome contributions !', 'Really well done, I hope you add the rest of the books at some point.', 'Excellent APP!', 'Excellent app, very useful and well made!'], 'appId': 'pt.joaomneto.titancompanion', 'url': 'https://play.google.com/store/apps/details?id=pt.joaomneto.titancompanion&hl=en&gl=us'}
