{'title': 'Offline Survival Manual', 'description': 'This is a <b>Survival Manual</b> which is fully <b>working offline</b> (which is important to survive in a case of some extreme situation)\r\nIt contains info on <b>how to make fire, build a shelter, find food, heal and other useful content</b> in a case of emergency.\r\n\r\nBut it does not have to be used in emergency situations only - it can be also useful for trips to the outdoors, hiking, camping, learning about nature and yourself truly. This is not only fun, but you can also train skills (make fire, build shelter, ..) you might need in a catastrophy. Some things work best with practice in a relaxed environment - then you also have time for some experiments.\r\n\r\n<b>Refugees</b> are also <b>welcome</b> to use this app to prepare and guide them for their dangerous journey. Although I hope we as humans come to sense and stop the wars so that people do not have to flee and be afraid.\r\n\r\n<b>Background:</b>\r\n\r\nIn the midst of the current political situation (A dangerous man as president of a big nuclear power nation) I had to prepare for doomsday scenarios and was searching for a good Survival Guide that I can use offline. \r\nThere where some but none of them where really good & fitting. Also there was none <b>free software ( FOSS )</b> on FDroid. Hence I was writing this Software. You can find the source-code on github: https://github.com/ligi/SurvivalManual  \r\nPull requests are welcome!\r\nIf you have improvements regarding the content or want to help translate you can use the wiki: https://github.com/ligi/SurvivalManual/wiki\r\n\r\nYou will find this content:\r\n\r\n<b>PSYCHOLOGY</b>\r\n- A Look at Stress\r\n- Natural Reactions\r\n- Preparing Yourself\r\n\r\n<b>PLANNING AND KITS</b>\r\n- Importance of Planning\r\n- Survival Kits\r\n\r\n<b>BASIC MEDICINE</b>\r\n- Requirements for Maintenance of Health\r\n- Medical Emergencies\r\n- Lifesaving Steps\r\n- Bone and Joint Injury\r\n- Bites and Stings\r\n- Wounds\r\n- Environmental Injuries\r\n- Herbal Medicines\r\n\r\n<b>SHELTER</b>\r\n- Primary Shelter—Uniform\r\n- Shelter Site Selection\r\n- Types of Shelters\r\n\r\n<b>WATER PROCUREMENT</b>\r\n- Water Sources\r\n- Still Construction\r\n- Water Purification\r\n- Water Filtration Devices\r\n\r\n<b>FIRE</b>\r\n- Basic Fire Principles\r\n- Site Selection and Preparation\r\n- Fire Material Selection\r\n- How to Build a Fire\r\n- How to Light a Fire\r\n\r\n<b>FOOD PROCUREMENT</b>\r\n- Animals for Food\r\n- Traps and Snares\r\n- Killing Devices\r\n- Fishing Devices\r\n- Cooking and Storage of Fish and Game\r\n\r\n<b>SURVIVAL USE OF PLANTS</b>\r\n- Edibility of Plants\r\n- Plants for Medicine\r\n- Miscellaneous Uses of Plants\r\n\r\n<b>POISONOUS PLANTS</b>\r\n- How Plants Poison\r\n- All About Plants\r\n- Rules for Avoiding Poisonous Plants\r\n- Contact Dermatitis\r\n- Ingestion Poisoning\r\n\r\n<b>DANGEROUS ANIMALS</b>\r\n- Insects and Arachnids\r\n- Leeches\r\n- Bats\r\n- Venomous Snakes\r\n- Snake-Free Areas\r\n- Dangerous Lizards\r\n- Dangers in Rivers\r\n- Dangers in Bays and Estuaries\r\n- Saltwater Dangers\r\n- Other Dangerous Sea Creatures\r\n\r\n<b>FIELD-EXPEDIENT WEAPONS, TOOLS, AND EQUIPMENT</b>\r\n- Staffs\r\n- Clubs\r\n- Edged Weapons\r\n- Other Expedient Weapons\r\n- Cordage and Lashing\r\n- Rucksack Construction\r\n- Clothing and Insulation\r\n- Cooking and Eating Utensils\r\n\r\n<b>DESERT</b>\r\n- Terrain\r\n- Environmental Factors\r\n- Need for Water\r\n- Heat Casualties\r\n- Precautions\r\n- Desert Hazards\r\n\r\n<b>TROPICAL</b>\r\n- Tropical Weather\r\n- Jungle Types\r\n- Travel Through Jungle Areas\r\n- Immediate Considerations\r\n- Water Procurement\r\n- Food\r\n- Poisonous Plants\r\n\r\n<b>COLD WEATHER</b>\r\n- Cold Regions and Locations\r\n- Windchill\r\n- Basic Principles of Cold Weather Survival\r\n- Hygiene\r\n- Medical Aspects\r\n- Cold Injuries\r\n- Shelters\r\n- Fire\r\n- Water\r\n- Food\r\n- Travel\r\n- Weather Signs\r\n\r\n<b>SEA</b>\r\n- The Open Sea\r\n- Seashores\r\n\r\n<b>EXPEDIENT WATER CROSSING</b>\r\n- Rivers and Streams\r\n- Rapids\r\n- Rafts\r\n- Flotation Devices\r\n- Other Water Obstacles\r\n- Vegetation Obstacles\r\n\r\n<b>FIELD-EXPEDIENT DIRECTION FINDING</b>\r\n- Using the Sun and Shadows\r\n- Using the Moon\r\n- Using the Stars\r\n- Making Improvised Compasses\r\n- Other Means of Determining Direction', 'descriptionHTML': 'This is a <b>Survival Manual</b> which is fully <b>working offline</b> (which is important to survive in a case of some extreme situation)<br>It contains info on <b>how to make fire, build a shelter, find food, heal and other useful content</b> in a case of emergency.<br><br>But it does not have to be used in emergency situations only - it can be also useful for trips to the outdoors, hiking, camping, learning about nature and yourself truly. This is not only fun, but you can also train skills (make fire, build shelter, ..) you might need in a catastrophy. Some things work best with practice in a relaxed environment - then you also have time for some experiments.<br><br><b>Refugees</b> are also <b>welcome</b> to use this app to prepare and guide them for their dangerous journey. Although I hope we as humans come to sense and stop the wars so that people do not have to flee and be afraid.<br><br><b>Background:</b><br><br>In the midst of the current political situation (A dangerous man as president of a big nuclear power nation) I had to prepare for doomsday scenarios and was searching for a good Survival Guide that I can use offline. <br>There where some but none of them where really good &amp; fitting. Also there was none <b>free software ( FOSS )</b> on FDroid. Hence I was writing this Software. You can find the source-code on github: https://github.com/ligi/SurvivalManual  <br>Pull requests are welcome!<br>If you have improvements regarding the content or want to help translate you can use the wiki: https://github.com/ligi/SurvivalManual/wiki<br><br>You will find this content:<br><br><b>PSYCHOLOGY</b><br>- A Look at Stress<br>- Natural Reactions<br>- Preparing Yourself<br><br><b>PLANNING AND KITS</b><br>- Importance of Planning<br>- Survival Kits<br><br><b>BASIC MEDICINE</b><br>- Requirements for Maintenance of Health<br>- Medical Emergencies<br>- Lifesaving Steps<br>- Bone and Joint Injury<br>- Bites and Stings<br>- Wounds<br>- Environmental Injuries<br>- Herbal Medicines<br><br><b>SHELTER</b><br>- Primary Shelter—Uniform<br>- Shelter Site Selection<br>- Types of Shelters<br><br><b>WATER PROCUREMENT</b><br>- Water Sources<br>- Still Construction<br>- Water Purification<br>- Water Filtration Devices<br><br><b>FIRE</b><br>- Basic Fire Principles<br>- Site Selection and Preparation<br>- Fire Material Selection<br>- How to Build a Fire<br>- How to Light a Fire<br><br><b>FOOD PROCUREMENT</b><br>- Animals for Food<br>- Traps and Snares<br>- Killing Devices<br>- Fishing Devices<br>- Cooking and Storage of Fish and Game<br><br><b>SURVIVAL USE OF PLANTS</b><br>- Edibility of Plants<br>- Plants for Medicine<br>- Miscellaneous Uses of Plants<br><br><b>POISONOUS PLANTS</b><br>- How Plants Poison<br>- All About Plants<br>- Rules for Avoiding Poisonous Plants<br>- Contact Dermatitis<br>- Ingestion Poisoning<br><br><b>DANGEROUS ANIMALS</b><br>- Insects and Arachnids<br>- Leeches<br>- Bats<br>- Venomous Snakes<br>- Snake-Free Areas<br>- Dangerous Lizards<br>- Dangers in Rivers<br>- Dangers in Bays and Estuaries<br>- Saltwater Dangers<br>- Other Dangerous Sea Creatures<br><br><b>FIELD-EXPEDIENT WEAPONS, TOOLS, AND EQUIPMENT</b><br>- Staffs<br>- Clubs<br>- Edged Weapons<br>- Other Expedient Weapons<br>- Cordage and Lashing<br>- Rucksack Construction<br>- Clothing and Insulation<br>- Cooking and Eating Utensils<br><br><b>DESERT</b><br>- Terrain<br>- Environmental Factors<br>- Need for Water<br>- Heat Casualties<br>- Precautions<br>- Desert Hazards<br><br><b>TROPICAL</b><br>- Tropical Weather<br>- Jungle Types<br>- Travel Through Jungle Areas<br>- Immediate Considerations<br>- Water Procurement<br>- Food<br>- Poisonous Plants<br><br><b>COLD WEATHER</b><br>- Cold Regions and Locations<br>- Windchill<br>- Basic Principles of Cold Weather Survival<br>- Hygiene<br>- Medical Aspects<br>- Cold Injuries<br>- Shelters<br>- Fire<br>- Water<br>- Food<br>- Travel<br>- Weather Signs<br><br><b>SEA</b><br>- The Open Sea<br>- Seashores<br><br><b>EXPEDIENT WATER CROSSING</b><br>- Rivers and Streams<br>- Rapids<br>- Rafts<br>- Flotation Devices<br>- Other Water Obstacles<br>- Vegetation Obstacles<br><br><b>FIELD-EXPEDIENT DIRECTION FINDING</b><br>- Using the Sun and Shadows<br>- Using the Moon<br>- Using the Stars<br>- Making Improvised Compasses<br>- Other Means of Determining Direction', 'summary': 'Survival Manual to help you overcome hard situations without internet (offline)', 'summaryHTML': 'Survival Manual to help you overcome hard situations without internet (offline)', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 4.576597, 'ratings': 26129, 'reviews': 10188, 'histogram': [794, 472, 1347, 3771, 19742], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '5.9M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'ligi', 'developerId': '5229070112536767347', 'developerEmail': 'ligi+survival@ligi.de', 'developerWebsite': 'https://ligi.de', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5229070112536767347', 'genre': 'Books & Reference', 'genreId': 'BOOKS_AND_REFERENCE', 'icon': 'https://lh3.googleusercontent.com/AFNFTK0dlm_OHAeFjJzMRpvzFTI3CJLhjipFWhRJ6lErXYaz4lVqATpkuVRwkiXfCA', 'headerImage': 'https://lh3.googleusercontent.com/XvBfopE0FOXLQ2KUVv_CgIeUCJ1PQTx5sR3QXmp-Hh4T_3BlEJqGn5vSbskCCLWuWDw', 'screenshots': ['https://lh3.googleusercontent.com/Nvy1i9JaIHP5D62uZ2ry_ThWBfRkFF_XoadvUfbSHnX0tbXkCxUXeukyW0EEjbjz9es', 'https://lh3.googleusercontent.com/-ht7cnUJu0oBu9xBDMWjkqDWnpyTofr9it7hy5AMEQtZLqXorN9CZq5ubuj0TYiQXqE', 'https://lh3.googleusercontent.com/IYFxzCYDiOCnkeHHNw6_ILrfSgOPP1ejENwIRnA3sfl1Q2K4s3wE4bQAAA2OdKyCp2bm', 'https://lh3.googleusercontent.com/-QlEX-NVTobl9ZZHe6LQodSVU6HhX7lzxJvhlEK0j6zgiyPITO0_HWBLglot4jse8x0', 'https://lh3.googleusercontent.com/jeq6UZpUuPTWjDslWU89KYjC9qFRRW2KZukIQSVPf_azkR40bsJBsPOmF8uRFKyiQFs', 'https://lh3.googleusercontent.com/o2zaIcOHDLsZT6pWE3qRGkRlnXdStr6pIBVufm0R23_KoZ_Dctk45GcHhuI2--fv13Q'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 16, 2016', 'updated': 1587583823, 'version': '4.2.6', 'recentChanges': ' - Content update\r\n - Remove edit and copy/paste for now', 'recentChangesHTML': ' - Content update<br> - Remove edit and copy/paste for now', 'comments': ['I have been reading this manual and have found it to contain an abundance of factual and good information on preparing for as well as handling various situations that you may come across in your life. The reading is good and the drawings are a great visual aid when describing various scenarios. It is like having a Boy Scout guide as well as a First Aid manual plus other guides at your finger tips. It is free. I highly recommend this book.', 'The layout is easily navigated, the writing informative, articulate and doesn\'t lend to making the reader overwhelmed. As I read the sections I found myself thinking the old ways are buried with the underappreciated seniors that built the land we stand on and they did with blood, sweat , tears and a strong back! Never giving up,there was no "I\'ll try" , DO or DONT DO! If you chose " dont do" then you would be a statistic', "Useful app, but a lot of the information has been copy and pasted from the US Army Survival Manual. The reason I'm not giving this app a negative rating is because it's easier to navigate, and feels less like a pain to read than the 277 pages the US Army version has.", 'The amount of life saving information at your fingertips is phenomenal. The best part; you can access it anywhere, anytime as long as your phone has a charge. No cell service or wifi necessary. Just keep that solar charger handy.', "It's very helpful. Quick and easy to use I love the idea of being outdoors but not sure what tools to use. This app is helpful for almost any situation, not just surviving in the woodlands but also out stranded in the ocean or in fights. Very helpful app", 'Informing, the first aid section covers a lot of material. It is comforting to have this much information at your fingertips when cell service is spotty or nonexistent. A couple of other sections are interesting too, like navigation and sheltering.', 'You know, since a lot of children end up with smatphones as a substitute for "nanny" or "parental" guidance, I believe that this app should be part of the android preinstalled apps. It\'s a very good source of information for basic survival. The idea, efficiency and thoughtfulness that was put into this app is wonderfull.', "Great app, I read it when I'm bored to learn about it and I have it if I need it. Has great information and describes it in detail, while also adding pictures to show how to do it or what it looks like.", 'App is wonderful but it would be very useful if it worked in Ultra/Maximum Power Saving Mode. In a moment of crisis, battery life is essential, being able to read this and have a long battery life is a must have feature.', 'It is the most great manual after the special defiant operation venezuelan manual of ever! Even if you r not a soldier,you can survive almost in everyone all sutuation. Only need the aerial operations bonus track. Usmc r the best.', 'This is a convenient manual for those of us who enjoy outdoor adventures such as boating, camping, trekking. I have not gone through most of the sections but it seems like it is well written and complete. Best of all, there are no ads or IAP.', 'Very informative and tells you to double-check all information beforehand because things are sometimes different. But it tells you alot and will help you survive!', 'I like the app very much on of the best i have ever used, but sometimes difficult to understand ecspesialy when they refer to shelters but it is easy to use and talks about a broad specter of survival techniques', "I didn't expect this survival manual to be so informative. Downloading it was a very wise choice on my part. There are many aspects of the manual that can be used in every day life.", "This app is really helpful, and it's great for my friends and I and how we always make shelters, but I agree there needs to be a Ultra Battery Savung mode", 'It does not take storage space too much and offers various ways of survival in a compact space however would recommend options to survive in case we have no tools or electronic equipment otherwise it is great app.', 'Good information with wide variety of topics covered. I stocked up on few tools mentioned in the manual and I can definitely see how useful these thing can be.', 'Cool app. It can save your life. I miss some diy drawings or explicative graphics because i think visuals are best way to tech.thanks for the effort of making the app without ads or buy ins...', 'Great app, well written and easy to use. The developer also keeps it updated. The information is accurate and very easy to follow.', 'Best and most honest app n developer..please allow the text copy feature coz many users like my grandparents and financially weaker buddies cannot afford internet .....atleast i could copy the useful tips n sms them across in case of problems n emergencies', 'I have no complaints for the manual. Credit to the developer, for making such a quality app.', 'Such a good app. Feel like it should of been pre-installed. You never know what type of situation youll get into so its good to be on the safe side just incase.', 'Very well written. It grabbed my attention from introduction and kept it throughout!', 'Tons of info. Really useful and easy to navigate. Best survival manual on the wall store', "Informative but doesn't get in to detail on most things. It would also be nice to have some pictures or side bar notes", 'If this app is made to work in Ultra Battery saving mode. That would be just... amazing. Even for paying.', 'quite well made. missing more sustainability topics, such as agroforestry and sintropy.', "It's a good app for surviving methods but the guy who made keeps self promoting his apps and in some cases it gets frustrating that's all", 'have had this app on all my computers great info, all in one place, super for beginners, or more experienced everyone should have it you never know when you may need it...', 'Absolutely amazing, great info and easy to understand!!!', 'This app is excellent! So much info in here that us invaluable! Highly highly recommend it', "Pretty descriptive, and I find it interesting reading how you would survive in a natural environment. I will never actually need it, but I'm.l sure it would be useful for Bear Grylls.", 'It is super useful and has photos to help understand', 'The absolute, most useful app that anyone can install.', 'Much appreciated that this is free and full of life saving info.', "Good app of survival manual and it's free!", 'i love it period. Hey anyone wants to get more ideas visit unique wilderness, primitive skills, primitive skill builder ect. on YouTube The results are shocking Their experts on stuff like THIS!', 'Very easy to understand. Useful information', 'Really convenient & densely packed with useful info', 'This is very helpful and thanks for making it an offline app'], 'appId': 'org.ligi.survivalmanual', 'url': 'https://play.google.com/store/apps/details?id=org.ligi.survivalmanual&hl=en&gl=us'}
