{'title': 'PinDroid', 'description': 'A client app for the Pinboard bookmarking service.\r\n\r\nFeatures\r\n- Tablet optimized\r\n- Add, edit, view, and delete bookmarks\r\n- View notes\r\n- Sync bookmarks, tags, and notes\r\n- Home screen widgets\r\n- Dashclock widget extension\r\n- Muliple accounts supported\r\n- Search titles, tags, and notes\r\n- Open source: https://github.com/maxpower47/PinDroid\r\n- Bug reports: http://code.google.com/p/pindroid\r\n\r\nKnown issues\r\n- HTC Sense 4+ (Jelly Bean) devices have a bug that causes them to only display one share target per app in the stock HTC apps (Internet, Messages, etc). As a workaround, there is a standalone app (PinDroid Read Later) to add the share target and forward it to the main PinDroid app. Note that the main PinDroid app must be installed for this to work.\r\n- PinDroid can be moved to an sd card, however this will cause you to have to re-login every time you reboot your device. Doing this may also cause widgets to not work in some cases.\r\n\r\nTranslations\r\n- English\r\n- Finnish\r\n- Spanish\r\n- German\r\n- Korean\r\n\r\nComing soon (waiting on API support from Pinboard):\r\n\r\n-Notes support (add, edit, delete)\r\n-More efficient syncing (all syncs are full replacement currently)\r\n-Support for bookmark stars\r\n-Support for viewing and syncing your network contacts\r\n\r\nFollow PinDroid on Twitter: @PinDroid', 'descriptionHTML': 'A client app for the Pinboard bookmarking service.<br><br>Features<br>- Tablet optimized<br>- Add, edit, view, and delete bookmarks<br>- View notes<br>- Sync bookmarks, tags, and notes<br>- Home screen widgets<br>- Dashclock widget extension<br>- Muliple accounts supported<br>- Search titles, tags, and notes<br>- Open source: https://github.com/maxpower47/PinDroid<br>- Bug reports: http://code.google.com/p/pindroid<br><br>Known issues<br>- HTC Sense 4+ (Jelly Bean) devices have a bug that causes them to only display one share target per app in the stock HTC apps (Internet, Messages, etc). As a workaround, there is a standalone app (PinDroid Read Later) to add the share target and forward it to the main PinDroid app. Note that the main PinDroid app must be installed for this to work.<br>- PinDroid can be moved to an sd card, however this will cause you to have to re-login every time you reboot your device. Doing this may also cause widgets to not work in some cases.<br><br>Translations<br>- English<br>- Finnish<br>- Spanish<br>- German<br>- Korean<br><br>Coming soon (waiting on API support from Pinboard):<br><br>-Notes support (add, edit, delete)<br>-More efficient syncing (all syncs are full replacement currently)<br>-Support for bookmark stars<br>-Support for viewing and syncing your network contacts<br><br>Follow PinDroid on Twitter: @PinDroid', 'summary': 'A client app for the Pinboard bookmarking service.', 'summaryHTML': 'A client app for the Pinboard bookmarking service.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.84, 'ratings': 572, 'reviews': 219, 'histogram': [85, 34, 68, 80, 303], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.2M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Matt Schmidt', 'developerId': 'Matt+Schmidt', 'developerEmail': 'matthewrschmidt@gmail.com', 'developerWebsite': 'http://maxpower47.github.io/PinDroid/', 'developerAddress': None, 'privacyPolicy': 'https://github.com/maxpower47/PinDroid/wiki/Privacy-Policy', 'developerInternalID': '7868666571792475954', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/9nyodWb2guxh0UJ4HPGEtZc_O61-FJQg2DQgaPKDjKC6kJZ7stQn1SC4f0M2SuqHutc', 'headerImage': 'https://lh3.googleusercontent.com/-HAQAFgB8aLV1KUiRuV3MhRfJSL9ZFzyaLxJ_1J408-KCuBfUq9U2NaOa60Vd2CgRPI', 'screenshots': ['https://lh3.googleusercontent.com/nIwODz7ac6Q9eLRW740m4PZ1cci1cRieDx-1DC92dyA46p2SgRvNBl8ToiCGuRxNX-vv', 'https://lh3.googleusercontent.com/feGvvVOw74BA4K9rIqXkEchWJFidS7qJBUKbwEPTE7QrMCxYnQTR5_kkflt4_mDiWg', 'https://lh3.googleusercontent.com/I-qz14jpEq1XsZBv7IEuAivsSepETaOfVbQHxCbYFxAkOiNgbcHNua_8L5LRS4rubw', 'https://lh3.googleusercontent.com/gyg88jVgvnQiBXimp7XJg352XuJGmd0DAzDSlU-OFdJt__ZKbze0M_IzC-Lmuo1PNHs', 'https://lh3.googleusercontent.com/Z2CWo6IpXhMWYjnc3Ioo3e_U0cxDl0Q_sm5Wl740e4lMJskm_oKNh1RuIKb-k1yZPg', 'https://lh3.googleusercontent.com/LWyQjnbp6H-gcRfA6rQRBbUExtwHfrW2PSfQ4MeQa572WsDQkceZj3tqD0fmb-SOfGPE', 'https://lh3.googleusercontent.com/RnkFNxjAL6ciZCZJQxnrCixPuLGcbcA_Fu9KcpfIGcJIyHxvSd5JxZfl9H6vWm7Eev4', 'https://lh3.googleusercontent.com/_-my1CW92dUJ-bnvjPYuKGm0znQYcjAxwpkD87sqKkvVKdpxT8nkt5nHycvhOphxdZ0', 'https://lh3.googleusercontent.com/r_Cb2yIePQLqw99Df3t7-fHp3MAOvO5Up04FyZ65okEuZbQb4sAr4ZZERvIaL2AdKaI', 'https://lh3.googleusercontent.com/Mfc28gAkhG_fAQcOVBijP1-8aw0xSfjZBqFyGZzKfoRSOlJDYKNPw7kHDENTjGGwLQ', 'https://lh3.googleusercontent.com/EHEHEuf6hAlPy_01wzKH8kFQs_Btt5EVDmhonWsn6Tk-pR_jaJcfIloVy212lUijVtMO', 'https://lh3.googleusercontent.com/YvRQqBPN4j3IMcr9F98MoJmE3kiIp5W7pL_Lgc9vm4iKKyr1kqQSIHDloDFBxUdY3jM', 'https://lh3.googleusercontent.com/tFyboEooKxrfPN5SD_gA80-p1x0UPm2FbTRaMlau2TLs5s3BHh1KkH7Q_2D_0rhz1UI', 'https://lh3.googleusercontent.com/EiTLFSSVMxvxotbXMCv8x35yoWLuERxLO5_d252yjays6DKi2B4llMDcZsv5VlBgniI'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 20, 2010', 'updated': 1486474971, 'version': '3.3.2', 'recentChanges': '3.3.2 - Add privacy policy link\r\n\r\n3.3.1 - Fix crash on pre-lollipop devices\r\n\r\n3.3.0 - Pull to refresh, total bookmarks, new icon\r\n\r\n- Add pull to refresh (finally!) - thanks karlicoss\r\n- Show total number of bookmarks - thanks mrleolink\r\n- New icon, with distinct version for read later share target\r\n- Bugfixes, performance improvements, translations - thanks marco', 'recentChangesHTML': '3.3.2 - Add privacy policy link<br><br>3.3.1 - Fix crash on pre-lollipop devices<br><br>3.3.0 - Pull to refresh, total bookmarks, new icon<br><br>- Add pull to refresh (finally!) - thanks karlicoss<br>- Show total number of bookmarks - thanks mrleolink<br>- New icon, with distinct version for read later share target<br>- Bugfixes, performance improvements, translations - thanks marco', 'comments': ['Works well, but the "add a pin" activity doesn\'t save any state. If you switch apps while you\'re creating a bookmark or even close your phone for a second you\'ll lose the description you were writing and all the tags you added. This happens more often than I expected.', "It makes it really easy to save a bookmark, but every so often it stops being able to sync and has to be uninstalled and reinstalled. I don't totally love the interface for viewing bookmarks but it's easy to use and functional.", 'This app works well with Pinboard. I also had a problem with syncing and the app not logging in but I e-mailed the developer and in less than a day it was fixed.', 'very nice but not perfect: no easy search by multiple tags, sometimes bookmarks get added twice or get lost', "Doesn't sync, hasn't been updated since early 2017.  Looks abandoned.", 'Wonderful useful app for social bookmarking! Love it!', 'Just what I was looking for!', 'this qpp needs a update', 'I love this app and have been using it regularly for... well, a loooooong time. Unfortunately just today, the app can no longer log in (my credentials are accepted, then boom! It just crashes). Anyone seeing the same? Any suggestions, as I really would like to continue using the app asap :)', "Used to be very useful.   But today,  I'm unable to get it to sync on my Samsung  Galaxy Tab S3 Tablet.  It indicates that syncing is done when I pull down. However, I can see that the item I shared with Pinboard in my Tablet is not synced as the sync icon is not shown.  It used to work but strangely, it has stopped being able to sync.  However, Pindroid continues to sync correctly on my Samsung Galaxy Note 4.", "This app seems to be unsupported by the developer at this point. Still works well for saving and syncing to Pinboard but usability on a tablet is bad: screen is almost all white space, and the bookmark titles are obscured. Guessing that won't ever be fixed, sadly. Works fine on a phone for me still.", "Across multiple devices, I've just never been able to make this work. Bookmarks never seem to stay synced. Bookmarks I create on a device will mysteriously decide not to update to Pinboard. I don't even really know if it's fair to blame the app, but I've never had these problems on my iOS devices.", 'Used to work perfectly for me, but I recently upgraded to a Galaxy Note 8 and now it will not allow me to log in. Authentication fails every time even though I specifically logged out and logged back in (on mobile Chrome) to confirm my password. Very sad day for me.', "Suddenly stopped syncing today. The bookmarks added with the app appear in the app but not on my pinboard account and the bookmarks added on my computer aren't appearing in the app... Never had a problem with it until now...", "This is a good app and works well for me on both iOS and Android.  However, the search function does not go through all my bookmarks giving me only results for the most recent ones.  This may be due to the fact that I have more than 25,000 bookmarks on Pinboard so I guess I shouldn't be surprised.  Other than that, I am glad that it is there.", 'Have to login almost every time I want to share a link. It is quite annoying.', "This crashes very often (a small notification box in the center of screen appears, stating that pindroid unfortunately stopped. This happens even when I'm not using it; in fact, it happened as I was writing this review too! I like that I can just save a website I'm viewing in my browser right to pinboard though.", "I like this app - I think I've been using it for as long as I've had a pinboard account But lately it won't sync. In settings-&gt; accounts, it says it last synced on Oct 29, which is a whole week ago", 'Really wish it would follow 301/302s in order to prevent me from bookmarking shortlinks that might die in the future, otherwise a great app.', "It won't sync to pinboard. It says synced but it is not. Looks nice though, I would give this 5 stars if it worked.", 'Used to work perfectly, does not start up anymore', "Log in doesn't work😡", "It's a great mobile interface to my pinboard!", 'Installed Pinkt via F-droid ... That works for now.', 'Does exactly what I want, been using it for years now.', 'Uncluttered, fast, easy to use', "I can't trust this.", 'Looks abandoned', 'I was a big user of del.icio.us and suffered through its declining Yahoo and Hurley/Chen days. It always had to be something more than simply a "cloud stored" bookmark that you could optionally share. Pinboard is the best of that and dead simple. It\'s like a twitter feed for yourself. I save bookmarks while browsing on desktop computers, tablets and phones. Then when I have time to read I catch up. I especially enjoy doing so on my phone from this app', "Downside: tags are not uploaded as hints onto mobile device, but only stored locally as you use them, and the local ones also get lost if the device is switched off, which is very inconvenient if your tags count in the hundreds like mine. Still, the best app for pinboard I've used so far, it has everything else, hence the 4 star rating.", 'This is a great app, though with the current version for some reason I can no longer sign in on my stock android Nexus 5X device.  Entering my credentials simply errors with "The username or password isn\'t valid. A Pinboard account is required. Please try again.\'', 'Save your money on other expensive Pinboard apps for Android. This is the definitive app: well supported, great features & material design. Thank you!', "Every time I try to login it tells me my user and PW are invalid. I do have a pinboard account, I changed password thrice because I thought I misspelled it or something, I tested the account from both mobile and laptop -it exists and it has all my bookmarks uploaded. What's wrong with the app? Please help", 'This is a great app.  I wish it would retain the authentication token after reboot, but I can see that is also a security risk.    ________________________________________________________________________     I occasionally have trouble authenticating with my moto G 2nd gen running Marshmallow.   The app seems to record the check mark key as part of your password when logging in.  I have to hit the back key, hiding the keyboard then tap the done button.  The app also retains your password for about an hour.  edit: It is 90 percent user error, not the app. I reboot my phone each evening and have to log back in.  When I hit the check mark,  the pinboard client makes the keyboard disappear and then I hit "submit".  Everything else was me being an idiot.', 'Think I found a bug: for some reason, bookmark list takes only half of the screen, showing a webpage view on the right hand side. Perhaps this was intended, but without being able to zoom/swipe to either of them, the list becomes unusable :(', 'Only missing a dark theme for the main view. Otherwise absolutely seamless and without peer in this space.', 'Use this app on my everyday commute', 'Thanks a ton!', 'Thanks!', 'Nice app for an excellent service (Pinboard). Would be nice if you added a "Sync" button or menu item. I often want to send something from my desktop to phone with PinDroid, but I have to go into the Settings to force a sync or wait at least 5 minutes. Not a huge deal, but a nice simple thing to add.'], 'appId': 'com.pindroid', 'url': 'https://play.google.com/store/apps/details?id=com.pindroid&hl=en&gl=us'}
