{'title': 'Speed of Sound', 'description': '<b>Warning:</b> This is heavy on the battery! Please use a car charger.\r\n\r\nSpeed of Sound automatically adjusts your music player\'s volume while you\'re driving about with your GPS, lowering the volume while driving slowly or at a stoplight, and cranking it up on the highway. This is a feature available in some more expensive cars and sound systems. We\'re giving it to you for free to use on your phone. Just start up your music player, plug your phone into your car stereo, and open Speed of Sound.\r\n\r\nWhen you\'re done with your drive, you can take a look at a map of what songs you listened to and where. Don\'t worry about tagging that one song-you-can\'t-remember-the-name-of, just check the map afterwards.\r\n\r\n<b>Features</b>\r\n\r\n• Customizable volume levels and speeds\r\n• Map of songs you listened to on your drive, compatible with Google Music, HTC/Samsung music players, WinAmp, and any player that supports Last.fm scrobbling\r\n• Smooth volume adjustment\r\n• Smart speed filter that avoids random GPS jumps\r\n• Options to auto-activate when plugged into headphones, charger, selected Bluetooth devices, and when the app starts\r\n• Tasker integration as an action\r\n\r\n<b>Disclaimer</b>\r\n\r\nWhile this app is great to use while driving, it\'s designed to keep your eyes on the road and not your phone/radio. So don\'t mess with this app or your phone at all while driving.\r\n\r\n<b>Feedback</b>\r\n\r\nWe\'d love to hear your feedback. Submit an issue on GitHub, or send us an email with your thoughts.\r\n\r\n<b>Help Translate</b>\r\n\r\nWant to translate Speed of Sound into another language? Check us out on Transifex:\r\n\r\nhttps://www.transifex.com/projects/p/speedofsound/\r\n\r\n<b>FAQ</b>\r\n\r\n• Can I use this with my car radio?\r\nThat\'s what it\'s for -- as long as you have an aux input and a decent cable to plug into your phone and radio, you\'re all set. If you don\'t have that, this won\'t be of much use unless you want to listen to music on your phone\'s awful speaker.\r\n\r\n• What are some recommended settings?\r\nThe defaults that come with the application have been tested in the wild and have shown to work well. That said, everyone\'s tastes are different. We recommend choosing a slow and fast speed that aren\'t too far apart, because the effect is greater than you might think. Also, many phones get really quiet below a volume of 60, so pick volumes that are not too far apart.\r\n\r\n• This drains my battery!\r\nYes, yes it does. Plug your phone into a charger while you drive.\r\n\r\n• Why does my phone seem to "jump" between volume levels?\r\nUnfortunately, this behavior shows up on many phones. We do our best to make volume changes smooth, but a lot of phones will only change the volume in increments of 5% or so. Not a whole lot we can do here, sorry.\r\n\r\n• Where\'s the source?\r\nThe code is available under the GPLv2 on GitHub: https://github.com/jpeddicord/speedofsound\r\nFeel free to fork, file bugs, or stare in awe.\r\n\r\n<b>Permissions</b>\r\n\r\n• Position & GPS - We sorta need this to know how fast you\'re going.\r\n• Bluetooth - Used to auto-activate when you connect to a Bluetooth music player.\r\n• Internet, Accounts, Network, External storage - All for Google Maps alone.\r\n\r\nFeature banner photo CC-BY davebloggs007: https://flic.kr/p/fdhBPP', 'descriptionHTML': '<b>Warning:</b> This is heavy on the battery! Please use a car charger.<br><br>Speed of Sound automatically adjusts your music player&#39;s volume while you&#39;re driving about with your GPS, lowering the volume while driving slowly or at a stoplight, and cranking it up on the highway. This is a feature available in some more expensive cars and sound systems. We&#39;re giving it to you for free to use on your phone. Just start up your music player, plug your phone into your car stereo, and open Speed of Sound.<br><br>When you&#39;re done with your drive, you can take a look at a map of what songs you listened to and where. Don&#39;t worry about tagging that one song-you-can&#39;t-remember-the-name-of, just check the map afterwards.<br><br><b>Features</b><br><br>• Customizable volume levels and speeds<br>• Map of songs you listened to on your drive, compatible with Google Music, HTC/Samsung music players, WinAmp, and any player that supports Last.fm scrobbling<br>• Smooth volume adjustment<br>• Smart speed filter that avoids random GPS jumps<br>• Options to auto-activate when plugged into headphones, charger, selected Bluetooth devices, and when the app starts<br>• Tasker integration as an action<br><br><b>Disclaimer</b><br><br>While this app is great to use while driving, it&#39;s designed to keep your eyes on the road and not your phone/radio. So don&#39;t mess with this app or your phone at all while driving.<br><br><b>Feedback</b><br><br>We&#39;d love to hear your feedback. Submit an issue on GitHub, or send us an email with your thoughts.<br><br><b>Help Translate</b><br><br>Want to translate Speed of Sound into another language? Check us out on Transifex:<br><br>https://www.transifex.com/projects/p/speedofsound/<br><br><b>FAQ</b><br><br>• Can I use this with my car radio?<br>That&#39;s what it&#39;s for -- as long as you have an aux input and a decent cable to plug into your phone and radio, you&#39;re all set. If you don&#39;t have that, this won&#39;t be of much use unless you want to listen to music on your phone&#39;s awful speaker.<br><br>• What are some recommended settings?<br>The defaults that come with the application have been tested in the wild and have shown to work well. That said, everyone&#39;s tastes are different. We recommend choosing a slow and fast speed that aren&#39;t too far apart, because the effect is greater than you might think. Also, many phones get really quiet below a volume of 60, so pick volumes that are not too far apart.<br><br>• This drains my battery!<br>Yes, yes it does. Plug your phone into a charger while you drive.<br><br>• Why does my phone seem to &quot;jump&quot; between volume levels?<br>Unfortunately, this behavior shows up on many phones. We do our best to make volume changes smooth, but a lot of phones will only change the volume in increments of 5% or so. Not a whole lot we can do here, sorry.<br><br>• Where&#39;s the source?<br>The code is available under the GPLv2 on GitHub: https://github.com/jpeddicord/speedofsound<br>Feel free to fork, file bugs, or stare in awe.<br><br><b>Permissions</b><br><br>• Position &amp; GPS - We sorta need this to know how fast you&#39;re going.<br>• Bluetooth - Used to auto-activate when you connect to a Bluetooth music player.<br>• Internet, Accounts, Network, External storage - All for Google Maps alone.<br><br>Feature banner photo CC-BY davebloggs007: https://flic.kr/p/fdhBPP', 'summary': 'Keep your eyes on the road! Let Speed of Sound adjust your volume.', 'summaryHTML': 'Keep your eyes on the road! Let Speed of Sound adjust your volume.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.14, 'ratings': 160, 'reviews': 91, 'histogram': [17, 8, 9, 24, 100], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.2M', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'Octet', 'developerId': 'Octet', 'developerEmail': 'mobile@octet.cc', 'developerWebsite': 'https://github.com/jpeddicord/speedofsound', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5057704373748593435', 'genre': 'Music & Audio', 'genreId': 'MUSIC_AND_AUDIO', 'icon': 'https://lh3.googleusercontent.com/zWMv5Btp7eAG6REtSNPWlh97tPLBDcBlZY5OBzf7EFp86pebyWt8s7MflqXJH5j9CEAn', 'headerImage': 'https://lh3.googleusercontent.com/nuJWBcngm1hkkKh_J6NWzQMMFsjMigBEoepoMbLLJBc3a0YEvwlR-_r4AH2iuCXeWyE', 'screenshots': ['https://lh3.googleusercontent.com/-C-rRhwRT5UCrmoa751FbaY3Aja5fRolICaielGJCqDy3JSdYOCOPV7PUrw9yKi8AiU', 'https://lh3.googleusercontent.com/VqCe7sEMbPPGuru-fLZ5bstx2xQFvZe7cu-dre-d7YVmoS8SopD_srvgY59jNSXRKw', 'https://lh3.googleusercontent.com/U_oempp_2RB27pu4fPnOzdbSqCJ607RkXdJQ9kfSyNhON_myLpYlRNEcyGmryvKVcQM'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'May 30, 2012', 'updated': 1588444603, 'version': '1.2.3', 'recentChanges': 'Updated for newer Android versions, which may resolve issues with tracking while the screen is off.', 'recentChangesHTML': 'Updated for newer Android versions, which may resolve issues with tracking while the screen is off.', 'comments': ["Used to be good. But now with Android 10, and this apps latest update, it will only work if the screen is turned on and the current app on the screen. It won't work in the background like it used to.", 'The volume would go down when I was riding. Then the volume would up when I came to a stop. The GPS said I was traveling at 122 mph while at a stoplight. The GPS would say I was going 2mph when I was doing 60mph.', "Great concept, but doesn't work on Galaxy S10 running Android 10 :( I tried both with selecting my Bluetooth device and without, but no luck either way - my music remains at full volume. Help!", 'What an awesome app! I use it on my Motocycle which works beyond great! Having the ability to set your min/max speed and % of volume is beyond great! Also having the ability to have it activate only on specfic BlueTooth is unreal! I love this Application!', "Fully Automatic and Flawless. I drive a cargo van which is fairly noisy on the road. This app automatically enables when my phone connects to my car stereo, stops when it disconnects, and the app simply does what it's supposed to do. It did take a little tweaking of the min/max speed/volume to get the volume changes to not be too obvious. I didn't notice any change in battery consumption when I started using this app.", "I drive a loud Humvee, usually with the doors off. Stream my music through my phone to a bose speaker. I was tired of turning the volume up at highway speed then turning it back down at traffic lights. Typically my phone already went into sleep mode, so it means typing in my passcode to change volume.Pain in the butt. This app works perfectly!!!! I have a samsung galaxy s9note. I hear the app uses a lot of battery to keep it plugged into charger, easy to do, but I haven't noticed a huge drain.", "works great when connected. my only issue is it doesn't stop on disconnection.", 'Please find another way to connect in stead of BT', 'Possibly the best app ever! Sensational for our wakeboard boat. So happy', 'Works as advertised.. exceptional app!!', 'great job, love this app! works well', 'This is a very very good app', "Doesn't work on Android Head Uinits", 'This app works perfectly', "This app used to work perfectly on xiaomi mi 5 with their own ROM, but after switching to Lineage OS 16.0, it's does everything the app supposed to do but it also makes soft beep sound every few seconds while I am moving (not while I am halt).  When I turn off the app it stops.  I am using BT to connect to my car but I don't know if that has anything to do with it.", "Works exactly how it says. It would be nice to be able to adjust the \nspeed/volume curve. The adjustments are linear with the speed and, since I \nuse this for biking, there's the odd downhill stretch where the music just \ngets way too loud. Something line V~sqrt(S) would be great... I'd \ndefinitely pay if this was a premium feature. Another thing that would be \ngreat is for there to be profiles attached to Bluetooth devices,so the \nadjustments are different if I'm biking and driving. Overall good app.", "I rarely leave comments.. but I use this app for motorcycling. I bought a nice loud ihome waterproof bluetooth speaker, it's too loud for being stopped at a light at full volume, however at 80+ kmph the volume is great.  This app keeps it at a reasonable volume when awaiting the greens and while driving around at speeds! THANKS!  Note: Battery usage (on my original battery) using a galaxy s4 was about 20% an hour with music, bluetooth and gps going.", 'This app comes in very handy with my hybrid. Thank you!', 'Great app', "Brilliant app, works perfectly for me on Bluetooth.  It takes some tweaking of the upper and lower speeds and volumes, but I'm glad the options are there for fine-tuning.", "How about support for JBL Charge 3? It is not shown in list of available devices, so it can't be selected. Because I would rather this app not affect another BT device connecting to both at the same time. But like it otherwise.", "It's a great and a very handy app just what I was looking for , but if I could make profiles for each device  ( BT car , BT headset , wired, ... etc) it'll make the app more than perfect👍", 'Developer not answering', 'Thank you for the great app. Simply functional! Highly recommended.', 'Works exactly as i had hoped.', "Works pretty well, but it would be great if we could set the increments that the volume changes, rather than it being linear.   The minimum volume while you're barely moving is too loud when you're totally stopped, and if you adjust it the other way you can't hear anything until you're at whatever speed equates to 75% of the maximum.   More granular controls in the next version, please!", 'Great for motorcycles. Glad to see updates.', 'After the Mar 6, 2016 update (allowing us to pick specific Bluetooth devices for activation) this app has become truly useful. It works exactly as expected.', "If you could specify when it activates according to the  bluetooth device it is connected, it would be a 5 star app. The plug in is a great idea, but it tends to close when launched via tasker. I'm running Marshmallow, so it may work on older versions of android.", "Works great. The only issue which is not really a problem with the application but a limitation of Android is that volume increases in big steps, instead of gradually. To work around this, if you're phone is rooted, install xposed module VolumeSteps+ and set volume for music to 50.", 'I listen to music and podcasts everyday while driving and this app saves me from constantly adjusting my volume while traveling at different speeds. With a little tweaking, the app is nearly flawless!', '5 stars for adding a Tasker plugin. I use it when I turn on my driving mode profile.', 'Great app that automatically adjusts volume based on speed.', 'Great app.', "The app needs a persistent service. It disables itself anytime my phone sleeps or when it isn't in the foreground.  And even sometimes when it's in the fg, screen on, and charging.  I'm thinking the auto off function hasn't been fully explained? I'll be happy with a locale plug-in and a consistent user experience.", "I travel to Sunnyvale, CA for my work so there is plenty of stop and go traffic along the way where a song doesn't need to be as loud as it was at 70mph. The problem is that this app doesn't seem to work well when it's not running in the foreground. Often I found that while it's resting on the dashboard mount that's out in the open for all satellites to reach it, I'd go to the app and see it's waiting for gps signal... and waiting.. and waiting.. Ended up uninstalling until it. I'll try again if I seen it gets updated. T-mobile HTC One, 4.3", "I still wish I could set the speed-volume zones manually but the increase of max speed made the volume more consistent in my case. I don't have to set volume louder at 100 km/h so that it's loud enough at 140. It works great using automateit pro so I just have to turn on music and the rest works magically without any more setting up.", 'Music Volume gets louder when I slow down. It also causes my music to skip.', 'Just wish it had an auto start setting 4 when app 1st starts.', 'Too heavy on the battery.'], 'appId': 'net.codechunk.speedofsound', 'url': 'https://play.google.com/store/apps/details?id=net.codechunk.speedofsound&hl=en&gl=us'}
