{'title': 'Birthday Reminder', 'description': 'Remembering birthdays has never been so simple! \r\n\r\n- See upcoming birthdays, each with the date, age and a countdown.\r\n- Sign in with Google to back up your birthdays\r\n- Quickly import any contacts from your device which already have birthday info\r\n- Simple to use, easy to see who is next and how long remains until each birthday.\r\n- Material design with many themes and colors to choose from.\r\n- Receive a reminder up to two weeks before the date, at the time of your choosing.\r\n- No adverts!\r\n\r\nIf you have any questions, feedback or suggestions for improvements please email me at julianrosser91@gmail.com\r\n\r\nPlease note this app does not allow you to import birthdays from Facebook, they have recently made it impossible to do so.\r\n\r\nPermissions needed:\r\n- File access: This is needed so that Birthday information can be saved and retrieved\r\n- Start at boot: Reminders need to be set again when the device is restarted.\r\n- Read contacts: To be able to import contacts with birthdays', 'descriptionHTML': 'Remembering birthdays has never been so simple! <br><br>- See upcoming birthdays, each with the date, age and a countdown.<br>- Sign in with Google to back up your birthdays<br>- Quickly import any contacts from your device which already have birthday info<br>- Simple to use, easy to see who is next and how long remains until each birthday.<br>- Material design with many themes and colors to choose from.<br>- Receive a reminder up to two weeks before the date, at the time of your choosing.<br>- No adverts!<br><br>If you have any questions, feedback or suggestions for improvements please email me at julianrosser91@gmail.com<br><br>Please note this app does not allow you to import birthdays from Facebook, they have recently made it impossible to do so.<br><br>Permissions needed:<br>- File access: This is needed so that Birthday information can be saved and retrieved<br>- Start at boot: Reminders need to be set again when the device is restarted.<br>- Read contacts: To be able to import contacts with birthdays', 'summary': 'Simple reminders for loved ones birthdays. Beautiful design. No adverts!', 'summaryHTML': 'Simple reminders for loved ones birthdays. Beautiful design. No adverts!', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.37, 'ratings': 107, 'reviews': 52, 'histogram': [27, 8, 9, 18, 42], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.4M', 'androidVersion': '3.0', 'androidVersionText': '3.0 and up', 'developer': 'Jules Rosser', 'developerId': 'Jules+Rosser', 'developerEmail': 'julianrosser91@gmail.com', 'developerWebsite': 'http://jules1991.github.io/BirthdayReminder/', 'developerAddress': '1 Canon Way,\nAlphington,\nExeter\nEX28FP', 'privacyPolicy': 'http://jules1991.github.io/BirthdayReminder/', 'developerInternalID': '8821275124346523833', 'genre': 'Events', 'genreId': 'EVENTS', 'icon': 'https://lh3.googleusercontent.com/e274jPwtrVbvWh5DFGsBsNMp4NkImkV9Oxtv-aWJRI7I6na5BTsJDNiVol-DYLhw3WU', 'headerImage': 'https://lh3.googleusercontent.com/akexlxmRnbUhXxJybVh0gzkQH3tPG1r3p9vPemn__IqntQKIPVPqzKkf_CjG5nI9sQ', 'screenshots': ['https://lh3.googleusercontent.com/GBOakdcycwTO96y0OJR-8hhfA2rgoju-BtGf37fRZxmDjiyDIoNxqqrtREnLB3gGLwk', 'https://lh3.googleusercontent.com/xsMb-6pQYaivaEulbmqieubFj74pDL4fcA0l8N6CucD2uHrXgaxdWMLuueGOpYEmRQ', 'https://lh3.googleusercontent.com/Nvl2wRqbOfRiZ16a0gpSvbxctqd2wtZYB6r-gpeod2P2pow2vcweOzYRo5tJi613urg', 'https://lh3.googleusercontent.com/902PmMGHRXzEhF4tGYNEGszfPiHAKIp4VZx7evGjBI1JOnRCvL1g_qAUaC6lrabmYRcZ', 'https://lh3.googleusercontent.com/O2NSgVylyaYSkhq7X3GAcrCXngSy_h6gMBIhcM2_GjmHXjAsSBKIZHq41Oj8uIOvDw', 'https://lh3.googleusercontent.com/9-4DqfhqqK5nZgMD-FiRzE4qoMoHb97EOzuHcrzdRTg-xXMkI3rsv7gAY8h1o9Dpb9E', 'https://lh3.googleusercontent.com/QH5d1ROkusdwR61uZQLUJ9OYFWAw7iZlZDK9f6CLCGaZy_oBRuZwzpLBe5o1px4TUe3X', 'https://lh3.googleusercontent.com/nnEpIUtVnn_sB341Wd9oAjfzMSmt5QNg4bHEe3rTkf1c9b1nUXcnqm3IZ65eBEkk2lfD', 'https://lh3.googleusercontent.com/WsYmwRzphGr1pM9sEX5dGXmAswSxa1-qJRn-2-JLmchttdUU3O8Ymj4DZD_MxDlPpN8', 'https://lh3.googleusercontent.com/mCp9Bxz8rqrcUE38Z46FdA2DWaJrGqEpT2_yNBtjNKZDBGHLMMHvAto8sc5lrWKtoA', 'https://lh3.googleusercontent.com/BUof0dhCVeCmTGkTQHUcamU1sSa77NE_pFnjRfDx_9qTgIPN9sa4QaV9sa-JVGWYtKIv'], 'video': 'https://www.youtube.com/embed/QK8zr4L5iVk?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/QK8zr4L5iVk/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Apr 2, 2015', 'updated': 1522237388, 'version': '3.0.1', 'recentChanges': 'You can now sign in with Google to back-up your birthdays!', 'recentChangesHTML': 'You can now sign in with Google to back-up your birthdays!', 'comments': ["Terrible app, used to be great. Not enough reminders & when i finally realised it dropped (deleted?) many of the Birthdays i had listed it was months too late & i missed many birthday's already. Going back to manual calendar stuck on my wall. More reliable than this", 'Every time I hit "submit" it doesn\'t save. I\'ve tried adding birthdays for 10 minutes and it still says I have none saved', 'It erased all the dates I stored...and after this update I cannot add any birthdays as well', 'No reminding. Worst', "Very nice and good looking app. But not working well, I can not add all birthdays from contacts at once (only one by one), and dates are wrong, it shows the same date on all contacts that have birthday in contact info. Update: when I changed birthday date in contact and save it, app shows good date. I don't know why but it's working. And please add all hours of the day for time of reminder, there are only 3 options: 8am, 12am and 5pm, but I wish to set reminder for example at 12pm.", "Really love this app but I once lost all data. Need to be able to backup. It would be very useful to know where in my phone all the data is stored. I have used several file managers and can't find data file anywhere. Can anyone help?", "I'm not able to sign in 😶 I lost all my data", 'Exactly what I needed: a simple app to create birthday reminders from my Google contacts because Google Calendar somehow failed to add that feature. A suggestion, though, please let me customize the alarm time more (with a time picker maybe) instead of just three options.', 'Super simple, super cute, and handy if you forget birthdays like I do.', 'The app would not save Birthdays.', "It won't save birthdays or sync.", 'Its not syncing.', "It's simple, cute, easy and no ads. Good job!!!", "It's good, but it would be useful to be able to do a backup, since not all the birthdays have a phone contact. The importing from contacts is a bit slow, because you have to do it one by one, and then I realised I had to select the year option one by one. Still, it's far better than most of other apps :)           EDIT: the notifications don't always work :/", "The app is really good...it has no ads too. I like it's simplicity. The only problem I had was that my phone has a 24hr clock format i.e. it shows 00:00 at midnight and when I set the reminder at 12am time given in the app.....it gives me notification at 12 o'clock noon..... please fix it in the next update...", "Thank you for this app. I really love the look of this app and that it has no adds. But it only sync'ed a handful of my contacts and 2 or 3 of the birthdays were incorrect.  When I opened the app a few mins later, some birth dates had changed.", "My only issue with the app is that some of the instructions could have been clearer. Upon attempting to add my grandmother's birthday as a reminder, I somehow ended up with my private parts lodged firmly in an exhaust pipe. I don't know whether this is my own fault, or an in app issue. EDIT: Turns out it was a problem with myself as attempting to make pasta for dinner lead to the same issue.", "I love the simplicity and user friendliness of the app. It looks nice too. It would be helpful if the months were different colors or under headings to differentiate easier but that's a very small concern. Love the import contacts feature", "This app is pretty cool. I love the simplicity and ease of use. It would be nice if I could choose the time of the reminder (I'm at work during the times we are able to select and will forget about it by the time I'm home) and could have a black background color. The colors currently are quite bright.", 'We could use multiple selection or "import all contacts" button to make it even easier (and same tools for birthdays screen) and liberty to choose time of reminder. Anyway, thanks for the app. It\'s simply great. It\'s great because it\'s simple.', 'I love this app and I wish it has these features: back up and restore, search for names, and personalise theme that I can choose the colours', "There is no reminder alarm for any of the important dates i feeded. Notification don't  work..  Please resolve.", "Hi Julian, I installed your app is pretty good but it doesn't import all of my contacts.. Only 10 15 are synced..", 'An OK app', 'Very good app', "After a messy divorce with my wife, I am no longer allowed to see my son, poor little Billy has been fatherless for 4 years now. Due to my alcoholism and fetish for ebony bukkake porn my wife did not think I was fit to be a parent, what does she know, she's a Caucasian female, I made poor life choices to fulfill my sexual fantasies, what's a guy to do! Anyway, I am a loving, caring father and with this app I remembered Billy's birthday, he was more than happy with his 10 pack of B&H and £2.50 scratchy.", 'A simple birthday reminder. This simple birthday reminder app simply reminds you of any upcoming birthdays! The best apps are simple and this simple birthday reminder certainly is. Simples.', 'Has no import feature. Does not even remind me of upcoming birthdays anymore. Dont even bother downloading it.', "Best bday app I like it it's ad free n give proper notification at time so now I m not miss single bady of my love ones", 'Very easy to use and really helpful.', 'This is an excellent app. I use it for wedding anniversary reminders as well as birthdays.  It is easy and fun to add new dates.  The colour scheme is attractive and it has been extremely well designed.', 'This app is amazing. They fixed the problem I was having so quickly. 😀😀😀', 'Easy to handle', "Nice and simple design and gets the job done. What's missing however is a backup and restore function. I reached out to the developer and received a fast and friendly reply, so perhaps there's a possibility of this feature eventually.", "Without widget, it makes no sense. I need to know at least one weak before \nsomeones birthday. Sadly this one can't do it for me.", "It's too long time to installing", "I LOVE the look of this app, but I can't seem to add any birthdays. I click \nthe cake and put in the info and click save, but nothing happens.", "Why doesn't it work in my phone", 'Have it on my amazon tablet and i absolutely love it. Nice job.', 'good app'], 'appId': 'website.julianrosser.birthdays', 'url': 'https://play.google.com/store/apps/details?id=website.julianrosser.birthdays&hl=en&gl=us'}
