{'title': 'NWS Weather Alerts Widget', 'description': "NOTE: Based on the advertised API Changes regarding background services in Android Oreo, I'm almost positive this app will have gotten broken by and probably won't work correctly on Oreo (symptoms will be that the widget never updates).  I hope to make a version that works on Oreo soon, but as long as this message is still here, I haven't yet.\r\n\r\nThis is an Android home screen widget to display current weather alerts from the US National Weather Service.\r\n\r\nYou can choose a county or state within the US (or the entire US) and it will display a list of all of the current weather alerts for that area on the widget. If there's more than fits, the list scrolls, and you can tap on an alert to open the full text of the alert. There is an accompanying app which can be used to configure what area you want and shows the raw feed data if you're really curious (though that part was mostly there for debugging, and might go away one of these days now that it all works). It does not currently do audible alerts (or any alerts), but that's probably coming soon.\r\n\r\nI created this because I wanted a tablet on the wall in my kitchen to display weather alerts on the screen, and for all the plethora of weather apps out there, I couldn't find one that showed anything more than a (!) icon on their widgets for alerts, and you had to click through to find out what they were. Some of them would put the alerts into the notification bar, but that wasn't much better. So this one displays a list of the current alerts right on the widget, and that is the only purpose of the widget.\r\n\r\nThis application is open source. To report bugs, request new features, or If you'd like to help make it better, please visit the project page on GitHub at http://justdave.github.io/nwsweatheralertswidget/\r\n\r\nThis application is not officially authorized by the National Weather Service, it merely makes use of the information they provide via their public data APIs.\r\n\r\nThe full changelog can be found at https://github.com/justdave/nwsweatheralertswidget/releases", 'descriptionHTML': 'NOTE: Based on the advertised API Changes regarding background services in Android Oreo, I&#39;m almost positive this app will have gotten broken by and probably won&#39;t work correctly on Oreo (symptoms will be that the widget never updates).  I hope to make a version that works on Oreo soon, but as long as this message is still here, I haven&#39;t yet.<br><br>This is an Android home screen widget to display current weather alerts from the US National Weather Service.<br><br>You can choose a county or state within the US (or the entire US) and it will display a list of all of the current weather alerts for that area on the widget. If there&#39;s more than fits, the list scrolls, and you can tap on an alert to open the full text of the alert. There is an accompanying app which can be used to configure what area you want and shows the raw feed data if you&#39;re really curious (though that part was mostly there for debugging, and might go away one of these days now that it all works). It does not currently do audible alerts (or any alerts), but that&#39;s probably coming soon.<br><br>I created this because I wanted a tablet on the wall in my kitchen to display weather alerts on the screen, and for all the plethora of weather apps out there, I couldn&#39;t find one that showed anything more than a (!) icon on their widgets for alerts, and you had to click through to find out what they were. Some of them would put the alerts into the notification bar, but that wasn&#39;t much better. So this one displays a list of the current alerts right on the widget, and that is the only purpose of the widget.<br><br>This application is open source. To report bugs, request new features, or If you&#39;d like to help make it better, please visit the project page on GitHub at http://justdave.github.io/nwsweatheralertswidget/<br><br>This application is not officially authorized by the National Weather Service, it merely makes use of the information they provide via their public data APIs.<br><br>The full changelog can be found at https://github.com/justdave/nwsweatheralertswidget/releases', 'summary': 'Home screen widget: displays weather alerts from the US National Weather Service', 'summaryHTML': 'Home screen widget: displays weather alerts from the US National Weather Service', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.8021977, 'ratings': 91, 'reviews': 30, 'histogram': [18, 6, 4, 11, 52], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.2M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Justdave', 'developerId': 'Justdave', 'developerEmail': 'playstoresupport@justdave.net', 'developerWebsite': 'http://justdave.github.io/nwsweatheralertswidget/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8484954921809401311', 'genre': 'Weather', 'genreId': 'WEATHER', 'icon': 'https://lh3.googleusercontent.com/8pr8rCiI1XflLL1y7x367m0go_9qtSgzCP-sS84qwEl_GDdniyeXfcqKGZn-YHfnFM87', 'headerImage': 'https://lh3.googleusercontent.com/LzQmooO-8HKM4sOIwG0hfG0VMxpYHUAk0ek-uoVckuNbeL7hh14YEQ3N3gAvceHrej8', 'screenshots': ['https://lh3.googleusercontent.com/OVXWmw0ZS0j0wRs_h8ydqdJvTMJWFkjwNZ9VuMFtvCn6rdbkGD8ua03likl69_77Yw', 'https://lh3.googleusercontent.com/XHbkUj4YwCRR-l45yrCvb2WJsBE5HYWLal2ngY7pJHlaXrZmCjVKXHOYAuFSxhV1VQ', 'https://lh3.googleusercontent.com/3YBQYXmjinv19ofgEXFOZSOBhV1OFVFbd7EF5YReiQYgZsazOP8NLWQuT-DzGu0to9M', 'https://lh3.googleusercontent.com/kXxssUqLGtUToF0GG3UsWCcakSTfFj5ZKpggE5BxNCWVPo4eBV3-8hVSZxrB8Mx-i9E', 'https://lh3.googleusercontent.com/QCZPJYd9Jg8ckocN45qDcENQdqXri9CY23n9Sw8LjsKJ0SHWN-HuxDm4uVk57TwGEo4'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Feb 27, 2014', 'updated': 1466294793, 'version': '1.1.3', 'recentChanges': 'version 1.1.3:\r\n- NWS started requiring HTTPS to retrieve alert feeds. The app has been updated accordingly. This should fix the "Waiting for feed download" that never goes away.\r\n\r\nversion 1.1.2:\r\n- fixes a crash when trying to retrieve an expired alert\r\n\r\nversion 1.1.1:\r\n- The main app now tells you when there are no alerts to display instead of just showing a blank white screen', 'recentChangesHTML': 'version 1.1.3:<br>- NWS started requiring HTTPS to retrieve alert feeds. The app has been updated accordingly. This should fix the &quot;Waiting for feed download&quot; that never goes away.<br><br>version 1.1.2:<br>- fixes a crash when trying to retrieve an expired alert<br><br>version 1.1.1:<br>- The main app now tells you when there are no alerts to display instead of just showing a blank white screen', 'comments': ["i like the concept, i wanted a widget that would actively show warnings. but, it doesn't work that well. i will get a warning on another system, and then i could wait up to an hour before this thing shows that warning.   if i do have something, such as an advisory, and it turns into a warning, it won't update itself. sometimes i have to go into the program to see if the warning is even there, and right now it is, but the widget still shows the expired warning.   it doesn't prioritize the importance of the warning either. it does it by date order. so if you have the 3x1 widget, it shows the last message and not the main one. so like it could say - there is a slippery ice advisory, but hide the warning of a blizzard on the way.   more so, it takes a lot of space on the desktop. there is no reason to take up that much space, the text at the top can be smaller. they can fit more warnings if the tabs were half the height.  -- i'm bumping this to a 4 since the creator did write back, and it might be an issue with my phone. since it does work at least some of the time. i still think it should be a bit smaller looking.", 'app can not be moved to external SD memory', "EDIT: I'm kicking this up to 5 stars, because after an immediate reply from the author and a quick explanation, it does work as intended. It just requires a little configuration to get around the OS's Doze feature. In Nougat, -Settings > Battery > Unmonitored Apps > Add apps- find this widget, and add it.   This prevents the Doze feature from turning off the app's monitoring, and it works fine after that. It isn't a battery hog either, as it's averaging 0% usage per hour over the last 24 hours, so nothing to worry about on that front.  It'd be nice not to have to jump through hoops like that, but I think this is more a case of an over aggressive OS rather than the app itself.  ORIGINAL REVIEW: Decent. Looks good and should be exactly what I want, but the widget won't seem to update in real time. Widget showed no alerts despite knowing there are several in effect. Deleted the widget and put back on my home page, viola, several flood alerts.", "Severe line of storms, damaging high winds, lightening. Where's widget shown ? Ugh another one deleted ...", 'Only thing I would love is being able to see where alerts were on a map but I do like being able to keep up on current weather events.', 'Works great after the https fix. Had to fix my weather website as well. Great app.', 'Cant set location, added to home screen and still claims no alerts when ones are out', 'Not showing severve thunder storm alerts for some reason needs fixed but shows everything else', 'The best weather app to warn of severe weather watches or warnings from the \nnational weather service', 'I wish this had a share option.', "I like the fact it doesn't need special permissions", 'Awesome gadget that shows active weather alerts on my home screen.', 'Easy to use. Needs a share option though', 'I live in the corner of two states and three counties, only able to choose one state and one county. No option for it to follow via GPS. App is antiquated. One star is being generous', "They said that a severe thunderstorm is going to happen on June 10th at like four something and right now it's 6:10!!!! I didn't even see a thunderstorm .What a lie", 'Awesome job here , 2 suggestions #1 the ability to filter warning types and the ability to set an alert tone for those warnings, this is exactly what I was looking for :)', 'This is OK 4 stars because it does not give a notification if that could be added I would love it', 'Only getting white screen when I select a state....', 'Awesome cuz if there was a tornado this would be helpful so I give you 5 stars', 'Like to read alert details', 'WEATHER ALERTS', "Its an okay app but I cant seem to figure out why its not letting me view example of problems or sending me notifications about the alerts I'm getting. Just an idea, for entire state you should put the county next to it for easier viewing.", "I'm writing to tell you the new version doesn't work eather. Click open nothing but a white blank screen.  The widget all it says is widget loading. Has really done anything.", 'IF THE WONES THAT MADE THIS APP I WISH YOU CLOUD AD ON THIS APP A WEATHER RADIO BY THE STATE OF THAT CLANLEN AS A NEW UPDAET TO THIS APP I LOVE THE APP BUT IT DO NOT TLALL THE CITY OR THE NAME OF TOWN THAT ARE ONDER THE BALD WEATHER JUST THE CLANLEN THAT IS IN THE STATE THAT IS IN U.S.A. AND I LOVE IT BE COLES IT IS 100% FREE TO GET THIS APP AND I LOVE WEATHER ALOLET', 'First time usa', "Doesn't even work", 'Sonic weather claus', 'Weather radio'], 'appId': 'net.justdave.nwsweatheralertswidget', 'url': 'https://play.google.com/store/apps/details?id=net.justdave.nwsweatheralertswidget&hl=en&gl=us'}
