{'title': 'PilferShush Jammer', 'description': 'PilferShush Jammer blocks other apps attempting to utilise the microphone without your knowledge. Some apps use hidden processes to record tracking audio in the background that is either generated by nearby beacons, television commercials, streamed music services or websites. This tracking audio is transmitted between 18 kHz and 22 kHz (near ultra high frequency) which is beyond the range of typical human hearing but within the recording range of a typical Android phone.\r\n\r\nTo block unwanted use of the microphone by hidden app processes, PilferShush Jammer requests use of the hardware microphone from the Android system and holds it. This technique locks up the microphone from any other apps attempting to gain access to it. This technique has been tested only on user apps, not system apps. The Android system should halt PilferShush Jammer from blocking the microphone whenever a phone call is received or made.\r\n\r\nWhen the jamming technique is running and the microphone is locked up, PilferShush Jammer posts a notification to keep the user informed that it is running. Tests have shown that it uses 0% CPU, 0% network and 43.6mb RAM when running for over an hour.\r\n\r\nThis is an experimental app made as part of research into audio counter-surveillance methods within the Android and IoT world.\r\n\r\nIt requires RECORD_AUDIO permission so that it may access and lock up the microphone.\r\n\r\nIt does NOT record or listen to any audio. \r\nIt does NOT connect to the internet.\r\n\r\nVersion 2.0 Active Jammer addition:\r\n\r\nTones can be emitted with a carrier frequency and a drift limit with rate all constrained to NUHF  of 18 kHz to 24 kHz depending on the device capabilities. For instance 20000 Hz carrier, drift limit 1000 Hz and rate slow - will output random frequency between 19 kHz and 21 kHz approximately every second.\r\n\r\nVersion 3.0 Jammers run as a service:\r\n\r\nBoth the active and passive jammers now run as a (foreground) service that should accurately indicate whether they are running or not. This is dependent on both the Android OS (power management) and any App Managers that may destroy running services. \r\n\r\nAs this app seeks to block microphone use it is important to NOT dismiss or hide the notification otherwise you may forget it is running.\r\n\r\nAlso includes a scanner to check user installed apps for NUHF and Audio Content Recognition (ACR) SDKs as well as any services or receivers.\r\n\r\nVersion 4.0 Redesign\r\nMajor overhaul of the design to make information clearer and to simplify typical uses of the app\r\n\r\nNotes:\r\nThe next release will investigate removing the audible artifacts (popping and clicking)  present during the active jamming tones.\r\n\r\nWhite noise output may not be very effective at blocking and is a somewhat annoying sound. \r\n\r\nThe speaker output may not have enough amplitude to block unwanted NUHF signals - testing will determine.\r\n\r\n\r\nSource code is available here: https://github.com/kaputnikGo/PilferShushJammer\r\nResearch and Project webpage : https://www.cityfreqs.com.au/pilfer.php', 'descriptionHTML': 'PilferShush Jammer blocks other apps attempting to utilise the microphone without your knowledge. Some apps use hidden processes to record tracking audio in the background that is either generated by nearby beacons, television commercials, streamed music services or websites. This tracking audio is transmitted between 18 kHz and 22 kHz (near ultra high frequency) which is beyond the range of typical human hearing but within the recording range of a typical Android phone.<br><br>To block unwanted use of the microphone by hidden app processes, PilferShush Jammer requests use of the hardware microphone from the Android system and holds it. This technique locks up the microphone from any other apps attempting to gain access to it. This technique has been tested only on user apps, not system apps. The Android system should halt PilferShush Jammer from blocking the microphone whenever a phone call is received or made.<br><br>When the jamming technique is running and the microphone is locked up, PilferShush Jammer posts a notification to keep the user informed that it is running. Tests have shown that it uses 0% CPU, 0% network and 43.6mb RAM when running for over an hour.<br><br>This is an experimental app made as part of research into audio counter-surveillance methods within the Android and IoT world.<br><br>It requires RECORD_AUDIO permission so that it may access and lock up the microphone.<br><br>It does NOT record or listen to any audio. <br>It does NOT connect to the internet.<br><br>Version 2.0 Active Jammer addition:<br><br>Tones can be emitted with a carrier frequency and a drift limit with rate all constrained to NUHF  of 18 kHz to 24 kHz depending on the device capabilities. For instance 20000 Hz carrier, drift limit 1000 Hz and rate slow - will output random frequency between 19 kHz and 21 kHz approximately every second.<br><br>Version 3.0 Jammers run as a service:<br><br>Both the active and passive jammers now run as a (foreground) service that should accurately indicate whether they are running or not. This is dependent on both the Android OS (power management) and any App Managers that may destroy running services. <br><br>As this app seeks to block microphone use it is important to NOT dismiss or hide the notification otherwise you may forget it is running.<br><br>Also includes a scanner to check user installed apps for NUHF and Audio Content Recognition (ACR) SDKs as well as any services or receivers.<br><br>Version 4.0 Redesign<br>Major overhaul of the design to make information clearer and to simplify typical uses of the app<br><br>Notes:<br>The next release will investigate removing the audible artifacts (popping and clicking)  present during the active jamming tones.<br><br>White noise output may not be very effective at blocking and is a somewhat annoying sound. <br><br>The speaker output may not have enough amplitude to block unwanted NUHF signals - testing will determine.<br><br><br>Source code is available here: https://github.com/kaputnikGo/PilferShushJammer<br>Research and Project webpage : https://www.cityfreqs.com.au/pilfer.php', 'summary': 'Block unwanted use of microphone by tracking apps', 'summaryHTML': 'Block unwanted use of microphone by tracking apps', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.212121, 'ratings': 99, 'reviews': 38, 'histogram': [11, 3, 6, 13, 66], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.4M', 'androidVersion': '4.3', 'androidVersionText': '4.3 and up', 'developer': 'Cityfreqs', 'developerId': 'Cityfreqs', 'developerEmail': 'kaputnikgo@gmail.com', 'developerWebsite': 'https://github.com/kaputnikGo/PilferShushJammer', 'developerAddress': None, 'privacyPolicy': 'https://github.com/kaputnikGo/PilferShushJammer/blob/master/PRIVACY_POLICY.md', 'developerInternalID': '8635281086397567971', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/kqyimcVSI4b5I_M9P4GU-KF5jnCQM_AYa6Q8URQ2e5Hm_jbaaEA4RDFG_utvdGgzUR0', 'headerImage': 'https://lh3.googleusercontent.com/CrqA4erMySdSGMxv9O7qW0l4zpJ5e2HJepqtexd1k9hnprgfoLKzuwyL6ftMjNbXZMk', 'screenshots': ['https://lh3.googleusercontent.com/7DF3FYL1LWnPqaRQ1kmWd4GTLiw304wQ8KT2qyjdiZPH09Vfg1RsB-mMC9rW3mR_Ses', 'https://lh3.googleusercontent.com/lzb7owpIMDE2NItg2OovdRxAvuopqi0Qeac9TGn2WdWcDvIO3acHvqFNC7W1bkJNCQ', 'https://lh3.googleusercontent.com/TXR4-GBU-rMW1tsndvu0YjFGkOuIH-alBPeEhlKYA_-4keFO9a0yr3l6Y0k1JH82jA'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Apr 26, 2018', 'updated': 1582248478, 'version': '4.2.0', 'recentChanges': '- MediaRecorder placebo function for passive jammer as service in API28+\r\n- remove deprecated LocalBroadcastManager\r\n- update dev device to Android 9\r\n- new SDK names', 'recentChangesHTML': '- MediaRecorder placebo function for passive jammer as service in API28+<br>- remove deprecated LocalBroadcastManager<br>- update dev device to Android 9<br>- new SDK names', 'comments': ['When i turn on active jammer i can hear the noise non stop am i supposed to be able to hear that?', "Why does passive keep shutting off as soon as i turn it on. I will give a true star rating later, but I need to fully understand how this works and if it's doing what I hope I think it's supposed to do. Please help me with another issue,. Someone is targeting me with ultrasonic and or infrasonic frequency (i do NOT know what frequency) how can I get to stop, i don't know who they are. Only that they are lowlife with nothing better to do. Can't catch them.", "This is really a super amazing app, thank you so much for the developer. I'd love to give more stars, but someone who hacking my phone sometimes successfully remotely turn off this app. Would you please fix this? Thank you!", "This app is great for privacy but can effect your pets. It states it's a research app and it's very important research that's being done. I'm waiting to find out a little more about the project as a whole because I believe this could be extremely important research. It appears to work really well so far, if nothing else it will give you a list of bad apps that use NUHF to listen in on group conversations. My only concern is the effect it could potentially pose to animals but they'll tell you.", 'if your peeps have made you feel as though you are actually cracking up because YOU -- KNOW-- that things have been altered in your phone ... This is the app you need to once and for all show all of them in writing or rather typeprint.. every single listener and remote shared to local devices like your camera. yep your camera', 'Does what it says on the tin and more. You can choose white noise or tone generation; passively engage the mic, preventing other apps or processes from accessing it; and look for malicious apps trying to surveil you. The only permission it asks for is to access the microphone. So far, so excellent.', "Junk doesn't work passive scanning keep turning off just junk all the way around.check all apps none in use.", "It's good but we want more act.", 'it was great off and pm but stopped working', 'Thank works well but got disabled need adviser', 'Awesome! Actually works great so far!', 'very informative... so many apps need to get a life and get out of mine.', 'Great app. Captain Jesus.', "What's good", "Puts the pill in pilfer exactly like my gangstalking Asian friends I've got on my heels something like incessant dogs.... Or my not so secret admirers / fulltime hackers I wonder how many of them actually work for like Google gosh it doesn't take much around here anyways I don't know if this makes sense but obviously the star writing can sum it up if you can't make what of it that it is...", "!!!!THIS APP MISS LEADS YOU!!!! IT SAYS IT EMITS A FREQUENCY OF 440 Hrz !!!!WITCH IS A DAMAGING FREQUENCY THAT DAMAGES YOUR DNA!!!! WHICH IS A THING. THE MUSIC INDUSTRY BACK IN THE 40'S AND 50' CHANGED THE TUNING OF MUSIC FROM 432 Hrz TO 440 Hrz.", 'This app has helped me identify local people who use this methood to listen track my whereabouts in order to vandalize,rob my home.', 'Great app. CaptainJesus', 'Works like a charm', 'stays all the time', 'O Yeah', '😎👍 ⭐⭐⭐⭐⭐', 'Good', 'works!!!', 'kind', 'good mamank', 'g FG gg', 'Waste ...'], 'appId': 'cityfreqs.com.pilfershushjammer', 'url': 'https://play.google.com/store/apps/details?id=cityfreqs.com.pilfershushjammer&hl=en&gl=us'}
