{'title': 'Daily Words of Buddha', 'description': "This app provides access to one week's worth of verses from Pariyatti's Daily Words of the Buddha. You can also listen to the Pāli in each verse. Translations of the Pāli verses are available in English, Spanish, French, Italian, Portuguese, Chinese, and Serbo-Croatian.\r\n\r\nYou can also read the current Pāli Word of the Day and Daily Dhamma Verses by S.N. Goenka (English only).", 'descriptionHTML': 'This app provides access to one week&#39;s worth of verses from Pariyatti&#39;s Daily Words of the Buddha. You can also listen to the Pāli in each verse. Translations of the Pāli verses are available in English, Spanish, French, Italian, Portuguese, Chinese, and Serbo-Croatian.<br><br>You can also read the current Pāli Word of the Day and Daily Dhamma Verses by S.N. Goenka (English only).', 'summary': 'The words of the Buddha and their timeless teaching of truth and compassion', 'summaryHTML': 'The words of the Buddha and their timeless teaching of truth and compassion', 'installs': '50,000+', 'minInstalls': 50000, 'score': 3.83, 'ratings': 413, 'reviews': 130, 'histogram': [74, 33, 28, 28, 247], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '6.7M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'Pariyatti', 'developerId': 'Pariyatti', 'developerEmail': 'webmaster@pariyatti.org', 'developerWebsite': 'https://www.pariyatti.org/', 'developerAddress': '867 Larmon Road\nOnalaska, WA\n98570\nUSA', 'privacyPolicy': 'https://pariyatti.org/SecurityPrivacy/tabid/123/Default.aspx', 'developerInternalID': '8569119826935383053', 'genre': 'Books & Reference', 'genreId': 'BOOKS_AND_REFERENCE', 'icon': 'https://lh3.googleusercontent.com/ixompvpdnTdV4MMOvsX9S1GWeyAyhrRvjRp8j-WkX_ST74AHZGQELwNVv8mnmAx-K-0', 'headerImage': 'https://lh3.googleusercontent.com/KuY9l5G70H02TBx1Snx96-auhvfj_MXD9_QlPz2okJQegirLPgDnK-a4_YLLw-lkX-r_', 'screenshots': ['https://lh3.googleusercontent.com/-CT-VdEKhtbtB8oHgdLGZ82Ut2ux0eKOentuzlwEFOiBINtKOEzP6AHCMf9D5wZ2A3w', 'https://lh3.googleusercontent.com/YOST7a80zndf62fdD2q7ytuM8NbdXWAIsoQsXylzLz87vz5ZEtdob0i2vZd_t2UTfTU', 'https://lh3.googleusercontent.com/W237NNboW_NPqN9-RXrTSI0FYSRyj6Xn09G7BYAq3q-mFHFnCe2U199oc6ue7yBvug', 'https://lh3.googleusercontent.com/ita1-wuwOX4XTlIeThE4WaBxLXhgznXHD7-vkDQ8Q8rYbv26QEpVg1yBd4w4hHDjk_U', 'https://lh3.googleusercontent.com/BOfdZ_OmKUBy4CeLdPDhBUUuGlRVU8eXCmSXgfQXIm6mhm1UDt_pInkWnptGEBbdOe8'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Oct 24, 2012', 'updated': 1576753138, 'version': '2.5.5', 'recentChanges': 'Minor bug fixes', 'recentChangesHTML': 'Minor bug fixes', 'comments': ['love it. New update. It seems to now be stuck in a endless load. The application on start just remains in an endless loop of loading. Uninstalling and reinstalling only allows the app to load once and it works fine. However, if you close it and reopen it will just go into an endless load loop. Further, if you just leave thr application running eventually it will do the samething; an endless uodate loop. It is such an amazing application. The spoken Pali has such a crisp pronoucation.', "❤Thank you so much for your wonderful app! I keep the widget on my phone's home screen and the daily quote keeps me at all times connected to the Dhamma. It often changes everything in an instant, when I am feeling angry or sad, or having any type of afflictive emotion, to be reminded of the Path and where Truth and Joy really come from. Thank you for only using quotes from the Pali Canon also. Big issue, new version won't update 😮😭. Old version works though! Is a roll back possible? ❤️Metta❤", "i would love to use this but right now it's very buggy and is stuck on a buffering page. also the widget doesnt show anything.", 'As noted by all please fix!!! buffering issue. I love this app', 'My widget is stuck and is continuously on buffer mode. Please help.', "Doesn't work completely once clicked the translate button.", "Forever stuck buffering since I updated my phone's OS. Please fix, I love this app", 'Stuck loading forever after the next day. Need to keep reinstalling', "Doesn't show anything in Android 9. Just a blank widget.", 'Stuck on loading page, it cannot be used.', 'Really enjoy this app. Thanks for all.', 'Suggestion * Need black Theme * Needed Material Design with Black Background and teal Accent Colour *Change the Icons', 'unusable, infinite loading', 'very helpful for meditation', 'not working any more', 'No Longer Works...', 'Cảm ơn, thật tốt đẹp. May all be happy', 'lovat.', 'Outstanding', 'My widget is stuck on 2/4/18. Tried force stopping, no luck. Help?', 'Vey nice app! Also the best app for vipassana followers.', 'Simply Awesome for all those who want to grow in Dhamma.', 'Come and see ...', 'Good App. Well concept of daily update. Liked it.', 'The previous version was lighter and easier to use', 'Thanks... for daily connection with Buddha vani... Metta', 'I really like that you have added additional resources for even more study', 'Love the app.', 'Please can some one help this non profit organisation to make a better app to help spread Buddhist Teachings. Thank You', 'To Webmasters of all Vipassana Pariyatti and Related websites of VRI,  As Present world and Society is more dependant on internet and social media, Most of the students and people spend time Online with Mobiles.  For Spread of Saddhamma Dohe written by Guruji S N Goenka is most inspirational source as equivalent to khudaknikaya.  Daily Doha is good one effort by Pariyatti.  I felt, If some software technicians develops Mobile app and all Dohe could be Presented in it will be great source for vipassana stude', 'Not superficial feel good catch phrases. Quotes you can actually think about and contemplate', 'Good to read the words of the Buddha on a daily basis. App gives Pali written and audio and English translation.', 'Wish I could make the background transparent and the text white. Very good though.', 'Perfect. An invaluable addition to ones contemplations in the Path.', 'Its best app. Sadhu Sadhu Sadhu', 'Peace if mind for a peaceful life', 'Just great and highly appreciated recommended', 'Very nice app. It inspires me to be on right path.', 'I love this widget.. Any chance of making it transparent???', 'Amazing and very useful app'], 'appId': 'lv.kasparsj.android.dwob', 'url': 'https://play.google.com/store/apps/details?id=lv.kasparsj.android.dwob&hl=en&gl=us'}
