{'title': 'Barcode Scanner', 'description': 'Scan barcodes on products, or Data Matrix and QR Codes containing URLs, contact info, etc.\r\n\r\nNote that this app can no longer be updated on Google Play, and there will be no further releases.\r\n\r\nAlmost every question and negative review comment is addressed by one of the following. Please save everyone time by reading these first:\r\n\r\nNobody is stealing your information. The app allows you to share contacts, apps, and bookmarks in a QR Code. This is why contacts permissions are needed. See "Visit Developer Website" below ( https://github.com/zxing/zxing/wiki/Frequently-Asked-Questions ).\r\n\r\nIf your device is not scanning, first try workarounds for device bugs in Settings. Enable all of them, and then try disabling one at a time to determine which is necessary. If this does not help, try clearing the device cache and settings from Android settings.', 'descriptionHTML': 'Scan barcodes on products, or Data Matrix and QR Codes containing URLs, contact info, etc.<br><br>Note that this app can no longer be updated on Google Play, and there will be no further releases.<br><br>Almost every question and negative review comment is addressed by one of the following. Please save everyone time by reading these first:<br><br>Nobody is stealing your information. The app allows you to share contacts, apps, and bookmarks in a QR Code. This is why contacts permissions are needed. See &quot;Visit Developer Website&quot; below ( https://github.com/zxing/zxing/wiki/Frequently-Asked-Questions ).<br><br>If your device is not scanning, first try workarounds for device bugs in Settings. Enable all of them, and then try disabling one at a time to determine which is necessary. If this does not help, try clearing the device cache and settings from Android settings.', 'summary': 'Scan barcodes on products, or barcodes containing URLs, contact info, and so on', 'summaryHTML': 'Scan barcodes on products, or barcodes containing URLs, contact info, and so on', 'installs': '100,000,000+', 'minInstalls': 100000000, 'score': 4.108453, 'ratings': 633769, 'reviews': 103490, 'histogram': [85509, 19155, 42706, 80116, 406280], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'ZXing Team', 'developerId': 'ZXing+Team', 'developerEmail': 'srowen@gmail.com', 'developerWebsite': 'https://github.com/zxing/zxing/wiki/Frequently-Asked-Questions', 'developerAddress': None, 'privacyPolicy': 'https://github.com/zxing/zxing/wiki/Frequently-Asked-Questions', 'developerInternalID': '4723502637904706667', 'genre': 'Shopping', 'genreId': 'SHOPPING', 'icon': 'https://lh3.googleusercontent.com/os72icmFlDtbxpYbZCP-v6kOereSLGDmlKsBl1ISTPdgbcpoc4rSIuXDuoDECvgcvoFJ', 'headerImage': 'https://lh3.googleusercontent.com/fgfwfgpqU8DvBR86lpEin7mOHPHX_DTAVKWrQEiiv-MJal01gzhw-qN45XebZSp94Og8', 'screenshots': ['https://lh3.googleusercontent.com/Ax3eaBtJt0CVdY_lfFlGYg2RKdovXNVNzr91n_u22OKZu1WqIW-iQ44WR0Nmn5PkyKY', 'https://lh3.googleusercontent.com/MDM8vB-T14E_LiULH12APQzBXaKkxJsSot7wVLCU8dENfFt5A49XyK0RLfja7tWXIag', 'https://lh3.googleusercontent.com/SA5ZOuUbiNxtfcrp3FTIBXSJFTV-Gy4ZHMXh3cGBO9VaOnz65rglBFtSNJCMyAJf63A', 'https://lh3.googleusercontent.com/K3-RVzAMeRymNmt7QE6UeEOnPOejm-RrSFEOjlz_TE1AuWn14TOjNaVHpno0-0zVMP8Y', 'https://lh3.googleusercontent.com/LbLHQTWByvJA4_-9n4eCjZdkpC2vQRy-8gX2XnoxzO5iaBQ91c3m_kaxFG0NKBXiPBk'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': None, 'updated': 1551131393, 'version': 'Varies with device', 'recentChanges': 'Bug fixes', 'recentChangesHTML': 'Bug fixes', 'comments': ['Simply the best barcode scanner. Users scanning random suspicious codes and blaming the scanner is ridiculous! You F up, you own it. Do not blame app for your mistakes! This scanner does exactly its job and it is one, if not the best in its area. Thumbs up for the ZXing Team from me!', "I've Had A Contract, For 5 Or 6 Years, For Online Banking, & Stores. For Online Legal Transfers, Transactions, & Electronic Signatures, Or Equivalent. So I Had Used The BarCode Scanner, & The QR Reader A Few Times. They Seemed To Work Good, & At The Time, I Knew Nothing About AnyKind Of Computer Technology's. So It Interested Me. I've Been Chasing The Dream Ever Since! I Hope Life Is Turned, For The Good For Once. God Has Put-Me_In-My_Place, So-To_Speak. It Seems I Was Set Down, & Made TDT!!!", 'I have been using this app for many years, and it has always performed flawlessly. Never had a single ad or misbehavior. There are, unfortunately, apps with the exact same name (different developer) that are malware as recently reported by Ars Technica. I urge caution when choosing these types of apps. This one is solid.', "I've scanned numerous items ranging from old diaries to newly bought things. The app picks up the barcode quickly and gives you a web search option. Comes up with relevant information. Nice!", "The app works well, but... for some reason this application only identifies about 50% of all the barcodes that I pass in front of it. The app itself works fine it always comes up, it's always ready to go, but when you really need to scan, it often comes up with unknown barcode.", 'I have been using this app for at least 7 years! It just works! No adverts. Never missed a barcode I wanted. 👌', "Uninstalled after this app hijacked my phone and started popping ads up during everything I was doing. It would pop up ads after unlocking my phone with a timer I had to wait through. It hid it's hijacking very well also. Took much digging to figure out what ap was causing this but I finally figured out it was this scanner. I haven't had any pop up ads since I've uninstalled this app.", 'App will turn to portrait mode but upside down. Which is unable to scan. Need to force close the app and open agn', 'I haven\'t used these apps except for once. It is not on my phone now for the same reason Jason. I. Can almost assure the hijacking may have come THRU the app, but I have been hijacked for 2 1/2 yes, by the same group, tracking still. The reason you couldn\'t find the source is bkz a Linux PC is used, once access to your device all info like IMEI, ICCID, etc is mirrored and your device is monitored always. It is by the way, AOSP. I was hijacked 2 yes to the month befor google"s article was release', "No ads, fast, it beeps when you scan, though it is a bit loud but as if I'm using a real barcode scanning device, brilliant!", 'not very useful I suggest adding a webhook in the settings to send individual scans (requests every scan) or if bulk is active send the data as a CSV e.g. %s=Barcode1,Barcode2,Barcode3,Barcode1 (scanned again)', 'Excellent app. Works on most barcodes, not buggy and no ads.', 'Seems it is working, but wants so many permissions. Why the hell it needs contacts?', 'It kind of worked but it always out of focus when i try to scanned the barcode when i take a photo of it if i move closer when i stay my position still out of focus and will not focus still like a actual camera, kind oc work only problem is not stay in focus when i try to move closer and stay my position wothout moveing still out focus because he has too many lines the wonder will out of focus, what can i do?', 'Scans for my data processing app, used several years. Works fine on my best performance phone, pretty good in good light on my basic phone.', 'My husband has used shopsavy for forever so I downloaded it and could never get it to work. The first thing I tried to scan on this app worked gave me no issues!', 'Scanned the code fine, copy, paste into other app... Then crashed my camera going back into the app, restarting phone to fix takes a min but not something you want to keep doing.', "It's worked not of the time but some QR codes weren't read and at times it can be slow to detect that there's a barcode in it's view.", '10 years of use and it is still the best, but sharing from history gives incomplete information (at least for Wi-Fi, gives only the network name as text)', 'It\'s ugly but it does the job, and most other barcode scanners are based on its code. I recommend disabling the "retrieve more info" option in settings as this will "visit" every URL you scan in the background whether you end up clicking the link or not. This can break one-time-use URLs, or leak info you thought was private. That option should be disabled by default, IMHO.', 'Scans most barcodes with ease. Great for checking those promo QR codes without having to visit the web links.', 'Works as intended, and can batch process codes into a text file! 👌', "Worked fine, except the constant rotating to landscape, then back. I use the app in conjuction with another package delivery app. Problem developed after trying to stop one of those I-must-update-myself-right-now-even-though-you're-out-of-cell-data things from Google play. I turned something off to try to stop the update, can't remember exactly what I turned off maybe because it's icon isn't visible. I've un- and reinstalled both apps, no avail. Help?", 'Pretty sure this app was causing my web browsing to redirect to incredibly sketchy ads, the type that take over the screen in the middle of reading something. Has not happened once since I uninstalled this app.', 'This app is not going to provide you all the information you want. Normal barcodes, and even QR codes, may be just regular text or a number that is only understood one way. Yet remember that this lets you read a URL, etc. BEFORE you go to it, thus is why it is great. I have no device I can test with, but if it is still true, it may have issues with devices that have no camera focus.', "I use this as the primary scanner on my phone, and have found out to be accurate. My only complaint is that it often takes a VERY long time to focus up close, and instead focusses out no matter how close I'm holding the code. I think it should either default to a closer focus setting, or make better use of the cameras focal length sensors.", 'Requesting access to a whole lot more information than they need. 1 star. Did the same thing with Netflix app.', 'This use to be the best and fastest barcode scanner by far. Lately it is struggling to scan normal 2D barcodes. In the past it scanned codes even before the camera was done focusing. Now you will be lucky if it scans at all. I am really disappointed to see such a great, simple and easy app failing behind. I now use different apps that also uses zxing interface/code and it works.', 'Do NOT download this app at any cost!! It will silently kill your battery without it showing up as an active application in the battery management menu. Uninstalling this app has made my phone last 2 days on a single charge!', "It dosen't scan anything can you remake the barcode scanner like the one in my movies pro", 'This is one of those essential apps. Works as as expected without failing, which is great. Just have an issue with focusing the camera when being close to a barcode, the auto focus button seems to be a bit useless on my device. I get passed this by blocking the camera and the opening it, then it refocusses and on most cases works good.', 'best barcode and qrcode scanner. very light weight, no fuss, does what its supposed to do. i have it installed in all my different Android devices.', 'Norton reports a high backgound battery use which unacceptable for an application I rarely run', 'I downloaded it and went to scan a barcode in great condition and it would not work. I tried being pro app because I hate leaving bad reviews but this scanner needs checked. Maybe its the quality of my phone?? who knows! I have tried other bar code scanner apps and they worked just fine . please fix ....thanks!!!!: )', 'Best QR Scanner app! I like that it is fast, stable and could focus with tap on the screen. I missed that it not using flashlight at night, but can set it in settings after you open the app. Thank you for develop this and make it free! It is very valuable for the whole Android community as other apps using it as a bridge for scanning QR codes!', "This app used to work, but they have crippled it. It used to read any barcode, but now does not recognise this that it doesn't think are valid. Guess what (big surprise), the developers have failed to imagine every different use of barcodes and now there are barcodes in use which it doesn't recognise. Works fine for done barcodes, but unfortunately is of zero use to me .", 'I love this app by using this app when scanning wifi qr code i know password also by going in history so i will like to rate it 5 stars', 'Developers, stop shooting yourselves in the foot! Why? Simply because of your silly decision in disabling, as a standard, those which are essential features for any barcode scanner: AUTO EXPOSURE and AUTO FOCUS!! I mean, why having those disabled from the moment this app is installed for crissake?? For you new user who might be already driven to dispair (as I was) as to why this "crappy" app won\'t just scan anything, there you have it. Just go to "settings" and enable those ASAP and "voilá": you have a fully-working barcode scanner! Some bad decision!', "In the last few months I've had random ads as I turn on my phone or am using my phone. Found out by long clicking the ad that it was from this app. I'm not even using the app and it puts invasive ads. Will never use this or anything from this company ever again. Highly disgusted by this company's behavior.", 'Would not recognise the code, focused out and up close and both within the reticule'], 'appId': 'com.google.zxing.client.android', 'url': 'https://play.google.com/store/apps/details?id=com.google.zxing.client.android&hl=en&gl=us'}
