{'title': 'ArchWiki Viewer', 'description': 'A simple viewer for the ArchLinux Wiki online. Page content is formatted for optimal mobile viewing.\r\n\r\n\r\nhttps://github.com/jtmcn/archwiki-viewer/', 'descriptionHTML': 'A simple viewer for the ArchLinux Wiki online. Page content is formatted for optimal mobile viewing.<br><br><br>https://github.com/jtmcn/archwiki-viewer/', 'summary': 'A simple viewer for the ArchLinux Wiki online.', 'summaryHTML': 'A simple viewer for the ArchLinux Wiki online.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.6, 'ratings': 1022, 'reviews': 283, 'histogram': [20, 40, 40, 122, 797], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.1M', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'kevinhinterlong', 'developerId': 'kevinhinterlong', 'developerEmail': 'kevinhinterlong+archwiki@gmail.com', 'developerWebsite': 'https://github.com/kevinhinterlong/archwiki-viewer', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8656255973602379633', 'genre': 'Books & Reference', 'genreId': 'BOOKS_AND_REFERENCE', 'icon': 'https://lh3.googleusercontent.com/7mfFYCglUbS2nu9wFnJhkIedu1wBNEvsRMlQ5WRejzVa45E8da74fYYE2fYgtDFcRA', 'headerImage': 'https://lh3.googleusercontent.com/xz64YQ9NdtQ5_RO22csDGl5RejJyri95tIcEN9a3q5O5OAk-zui61Zk3BuzNw7MPHxyd', 'screenshots': ['https://lh3.googleusercontent.com/QZu-8FaYsAH_eB5qS0rtw0HP7bGgoyLsS7wnvsUZdB4mp3pwnSBIyzaVNe6hozOyXw', 'https://lh3.googleusercontent.com/Ln4yxU1pTLQ3COgFSs6HZvQsPoemLPgkQZZHNt5wNueGdDKzx9jKqvS0pVe3KhJTkQ', 'https://lh3.googleusercontent.com/k7rDSCqpOks5MnbHhgVXlYDkC75CbDPuY3bUvg_wzuhs8deqQTmATRHgIBDRl6GvoY39', 'https://lh3.googleusercontent.com/qtTvKTGUb92ZHaceFtDwR6-Da5EvDomnKjxD4UntbqBa_BJlIIKQd8AD2coGILadPxM', 'https://lh3.googleusercontent.com/yF1wGvhG2ilj25dyFr7rmHNv3PYE80wDSQ3irAuMZxYapXxfZ5bEanKY5IAqwuvtZqk'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Oct 11, 2012', 'updated': 1501001987, 'version': '1.0.12', 'recentChanges': '1.0.12\r\n- Updated German Translations\r\n- Added French Translations', 'recentChangesHTML': '1.0.12<br>- Updated German Translations<br>- Added French Translations', 'comments': ['An amazing app, that makes searching through the Arch Wiki much easier and nicer on mobile. A must for when X or Wayland breaks.', "Looking at screenshots I thought the app would simply display the wiki like a normal web browser. Instead I learned that it actually optimises it to the phone screen's size, which is very good for reading without having to scroll horizontally all the time. A nice addition would be wiki bookmarks.", "Nice app! However it'd be cool if you could add a dark theme, since using it now is rather blinding. Thanks for the app though!", 'Awesome that this exists. It would be even better if dark theme was offered, and if this could be offered as an offline application for Linux. 10/10 would Arch again.', "It's great to have a reference guide for my chosen OS in my pocket.", 'A must-have resource for all users of any distro, not just Arch alone.', 'Really good to visualize the wiki. Btw I use arch', 'Very useful, thank you :)', 'A educational remote prodedure.', 'wow, my archlinux, decilious, thanks to this arthor', 'A must have for distro hoppers and Arch users!', 'I use arch, btw.', 'great! btw I use arch', 'i use void btw', "was a convenient means of accessing the archwiki website before the app \nmysteriously stopped working. Did the job well enough when it wasn't \nbroken. Wishful thinking would be seeing the app fixed. Even more wishful \nthinking would be seeing it not only fixed, but upgraded to support saving \npages to view offline and low-light-friendly light-on-dark \nthemes/user-defined-css", "It doesn't work anymore. I'm getting this 'No title found' message in the header. By the way, the app was great before this problem occurred. The only bad thing was that it didn't have the offline mode.", 'Great!  Thogh it would be nice if we could get a dark mode and especially a find in page feature.', 'Everything needed to develop and build in your Arch system.', 'Great but it really need bookmarks / favorites', 'Great app. Thanks!', 'Почему бы не сделать темную тему? Почему бы не вывести в настройках язык по умолчанию?', 'Helpful while installing and learning archlinux!', 'Simple. Wish it could be used offline.', 'Excelente', 'amazing tool.', 'Very nice', 'Great app', 'Great to have when I crash my Linux box', 'Great for reading the wiki during the initial setup of my system!', 'This app is amazing! It\'s very handy when it comes to looking up on the Arch Wiki. Anyway, is there a way to avoid the app to scroll horizontally? I noticed there are some elements of the page that "break" the vertical scroll. For example, if you go to the Git page, there\'s​ a link which does that :)', 'To the smart people who ask for a bookmark, go to the browser on the desktop and then click "Add to Bookmark"! This app is a dedicated WUSIWYG archwiki app! So don\'t blame the developer for not adding a new bookmark feature and even if the developer create a bookmark button for you, another set of smart guys(they think they are) would comment on this app for not having a button for saving the article in pdf/epub. See all the negative comments, use the app first and then give your own opinion about it! By the way keep you the good work, this app looks and feels amazing on my Nexus 10 !', "I cannot tell you how many times this has come in handy when I bork my arch install and can't boot to X. The pages are wonderfully formatted and work great on even smallish screens. I have only noticed one bug, and that is when you click a link to a subsection of another article, it brings you to the beginning of the article and not the subsection. However, this is absolutely not a deal breaker and I'm mentioning it more for the sake of the devs. I'd also like to see an app for the forum, if possible!", "Much better than browsing the wiki with your phone (or tablet's) browser. Everything is presented in a uniform manner & is comparable to viewing it on your PC, albeit on a smaller screen. Definitely helps when you need to fix something & don't want to switch back to your desktop browser while working through the problem.", 'I am so greatfull for this app. it comes in handy too many times to mention.   Just wish the pages were formated for a moble screen better. a few sample commands  get wrapped to new lines. difficult for config files.', 'I installed Arch Linux the first time looking at the wiki with the Opera browser, but it was very slow and hard to see what was written. But I installed Arch again because I installed it incorrectly the first time, and heard about this app, and it was much easier to know what I was doing.', "Extremely helpful resource and definitely handy to have access to on the phone.  I'd like to suggest a dark theme if possible, for readability.   The light theme hurts my eyes after staring at code all day.", 'I love archlinux i use for more then a year. This app is a grate idea, and is pretty fast. I just don.t like the way you navigate thru it. It should have an meniu that opens by swiping right.', "The app is functional, simple and makes reading the wiki an easier task on your phone. But that's it. It doesn't offer any additional features. I'd love to see automatic search suggestions, for instance.", 'If you are an Arch Linux user, this definitely is a handy resource. It is easier to navigate with this than a browser. In fact, if you are a Linux user in general, this is probably worth while, as the ArchWiki is an amazing resource for open source software in general (unless of course you are using the heavily patched Ubuntu packages).', 'You have PC/laptop unusable since you are installing Arch, then this the best way to get to Arch Wiki. Just one feature request, add support for bookmarking and offline pages and updating offline pages, rest all is great. Great work!'], 'appId': 'com.jtmcn.archwiki.viewer', 'url': 'https://play.google.com/store/apps/details?id=com.jtmcn.archwiki.viewer&hl=en&gl=us'}
