{'title': 'Notification Notes', 'description': "Notification Notes is a simple note taking app that lets you display your notes as native Android notifications. The notes are displayed as persistent low priority notifications.\r\n\r\nFeatures:\r\n\r\n- Save your notes to note list\r\n- Show/hide note's notification with a switch in note list\r\n- Edit notes by touching them in the notes list\r\n- Remove note by long pressing it in the note list\r\n- Open the note list by touching a notification\r\n- Existing notifications are restored after restart\r\n\r\nNotification Notes is open source. See https://github.com/khuttun/NotificationNotes", 'descriptionHTML': 'Notification Notes is a simple note taking app that lets you display your notes as native Android notifications. The notes are displayed as persistent low priority notifications.<br><br>Features:<br><br>- Save your notes to note list<br>- Show/hide note&#39;s notification with a switch in note list<br>- Edit notes by touching them in the notes list<br>- Remove note by long pressing it in the note list<br>- Open the note list by touching a notification<br>- Existing notifications are restored after restart<br><br>Notification Notes is open source. See https://github.com/khuttun/NotificationNotes', 'summary': 'Show notes in your lock screen! Display your notes as Android notifications.', 'summaryHTML': 'Show notes in your lock screen! Display your notes as Android notifications.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.44, 'ratings': 391, 'reviews': 191, 'histogram': [23, 3, 27, 58, 277], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.7M', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'Kalle Huttunen', 'developerId': 'Kalle+Huttunen', 'developerEmail': 'khuttun.apps@gmail.com', 'developerWebsite': None, 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5557079998166842942', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/iQYJyIGc8a7TcXfDyF7gwU-3CY5pVzclJAhb1LeZZnjhYJ4s7iQq1hrJqWx59jBD-A', 'headerImage': 'https://lh3.googleusercontent.com/tAJxuJBnT_gyIBOuZCcq8JgvndQSRqNZ3B7t6yTeoL5-Yhgg4I6Yy9xAFwDTI2g42g', 'screenshots': ['https://lh3.googleusercontent.com/fL_GPvr1C4BOH5HqSk-IIfINnXMpGKQFyfhckmTXQYZ-x0NLs6i2P31Z39gV3DDhNA', 'https://lh3.googleusercontent.com/V7iDbvAfX-L2fdWqVrjuFLeJBqGVPSfXlkD_V4XMUwUi0z53re2VDIvqBHGxLAkDbQo'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 20, 2015', 'updated': 1546080017, 'version': '1.8', 'recentChanges': '- Add dark theme', 'recentChangesHTML': '- Add dark theme', 'comments': ['App does exactly what it says but needs more features. Specifically, needs a way for us to sort the notes by dragging them around. Also, you should give us the ability to choose which notes you want to appear in notification preview (my phone allows 7 in preview).', 'Great little app. I keep an empty note saved so when I need to write down a phone number etc, when on the phone, I just pull down the note from the status bar and type away .Just what I was looking for. Awesome', "Love that the notes can be grouped in one notification. Would appreciate I'd we could order notes on the notification and within the app alphabetically, manually, or based on date. Capability to time the notifications would be great too. It is nice there are no ads.", 'looking for something like this for a long time. just what i want. there is no need to change anything. neat and clean. simply perfect ☺ 👍', 'Just perfect. Do not see the low ratings given to the app, they are all for a previous version.', 'I love this app. No unnecessary permissions, lite, no internet access, no ads... Can we donate? I really like the fact that we can group notes in the same notif, and that we can edit and hide them. Other similar apps exist, but this one suits me better for these reasons. The only addition that would make the app perfect, would be to be able to re-arrange the notes with a click and drag, this would help a lot, for example to put an important note at the top when the notification is reduced.', "Open source, no invasive permissions, minimalistic UI, allows for longer notes - what's not to love? If I made any suggestion it would be to have options for the notification icon just to easily differentiate from other apps. But that's a super minor thing. This is an awesome app.", 'Hi dear developer, I appreciate this functional application, but if you prepare an icon for fast going towards top and bottom of the list, You get 5 stars, I need it very much because I have 1500 notes, and thats very exhausting to go to the bottom of the list. thanks in advance😘🌹', "I absolutely LOVE THIS APP. I've always needed something to give me notifications because alarms just don't help me. This app is perfect for someone absentminded or forgetful. I more than 100% recommend this app", "I use it for my daily affirmations. It does the job - no distracting UI, no excess functions to take away my focus. Good app. I'm surprised it didn't make the Editor's Choice list.", "Simple, intuitive, few permissions. Notifications are not persistent - they disappear if the device is restarted like every other app of this type that I've tried, (including when not 'battery optimised').", "Does exactly what it says on the tin, chief. Plus it's free, there's no ads, and no permissions you have to stress about. Great software, upset I didn't find it sooner.", "No bells and whistles, no lame pay walls. Just a simple notification app that does what it's supposed to do quickly and efficiently.", 'I travel alot for work, and I have used a similar app to remind me of where Im going next in my notifications. This is a decent app, however, If the app is closed the notification goes as well. This is a deal breaker for me.', "Honestly exactly what i wanted! Notes that stick on your notification bar till you get rid of them through the app and takes up little space on my phone. It's fantastic", 'Very good app. Please add the option to move notes up or down the list.', "Best in the business. Love it. But it doesn't mean it can't be improved. Bring periodic notification which may be customised.", 'Great app for daily use. Small and lite. Just a small request. Please add multiple device sync with google account.', 'Does exactly what I looked for and nothing more. Additionally it is adfree. Great!', 'A good little app that works well. Though would like to see timed reminders/notes appear in notification bar on set times and dates.', "Great app, better than the other 5 duplicate notification notes apps I've seen.", 'Just what I was looking for. Simple and incredibly efficient.', 'Would be nice if you could swipe to delete and rearange the order of items faster.', "Way better than notin. The task doesn't die after clearing notifications.", 'Best note app for me. Quick and simple', 'Great app but u lot missed the perfect opportunity to call this "Noteifications"', 'It works without any issues and is very handy. This app is worth a try', 'Guys, thanks for the great app! Please make it possible to move events up and down.', 'Should have feature to delete tasks in bulk after they are done', 'Best what I was Looking for Just add checklist window', 'Good app. Simple and does its job well.', 'Simple, well executed, minimalistic!', 'Best notification app ever I have used & will use forever', "It's perfect for what it says it does.", 'Simple but perfect for a need', 'simpler, better, faster.', 'easy and no bs just a simple app to use', 'It does what it says and it does it well.', 'Works great as advertised', 'Good but please add date and time'], 'appId': 'com.khuttun.notificationnotes', 'url': 'https://play.google.com/store/apps/details?id=com.khuttun.notificationnotes&hl=en&gl=us'}
