{'title': 'BeeCount Knitting Counter', 'description': 'BeeCount is designed for counting multiple parts of multiple knitting projects. Originally, I wrote it as a training exercise for learning Android programming, but as it has proven useful to some people (thanks, Ravelry testers!) I released it here. It has since been extensively re-written to improve both the UI and the data handling. \r\n\r\nBeeCount can store multiple knitting projects. Each project can have multiple \'counts\' and these may be increased, decreased or reset to zero. Projects may be edited to add or remove counts after creation.\r\n\r\nCounts can be linked together by editing a project after it has been created, and a count can have more than one link. For example, "rows" could increment two different pattern repeats at different rates. Counts may also have multiple alerts.\r\n\r\nBeeCount on Android will always remain free and without advertisements.\r\n\r\nPlease e-mail me with any support questions, or contact me on Ravelry. There\'s now a Ravelry group for discussing the use of this app: http://www.ravelry.com/groups/beecount\r\n\r\nPlease don\'t use the reviews for support questions or bug reports - it\'s often difficult to get the information necessary to resolve the problem, and I don\'t always notice comments straight away. Email is a lot faster.', 'descriptionHTML': 'BeeCount is designed for counting multiple parts of multiple knitting projects. Originally, I wrote it as a training exercise for learning Android programming, but as it has proven useful to some people (thanks, Ravelry testers!) I released it here. It has since been extensively re-written to improve both the UI and the data handling. <br><br>BeeCount can store multiple knitting projects. Each project can have multiple &#39;counts&#39; and these may be increased, decreased or reset to zero. Projects may be edited to add or remove counts after creation.<br><br>Counts can be linked together by editing a project after it has been created, and a count can have more than one link. For example, &quot;rows&quot; could increment two different pattern repeats at different rates. Counts may also have multiple alerts.<br><br>BeeCount on Android will always remain free and without advertisements.<br><br>Please e-mail me with any support questions, or contact me on Ravelry. There&#39;s now a Ravelry group for discussing the use of this app: http://www.ravelry.com/groups/beecount<br><br>Please don&#39;t use the reviews for support questions or bug reports - it&#39;s often difficult to get the information necessary to resolve the problem, and I don&#39;t always notice comments straight away. Email is a lot faster.', 'summary': 'A highly customisable, free and ad-free knitting counter.', 'summaryHTML': 'A highly customisable, free and ad-free knitting counter.', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.59, 'ratings': 426, 'reviews': 199, 'histogram': [21, 4, 17, 42, 340], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.6M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'knirirr', 'developerId': 'knirirr', 'developerEmail': 'knirirr@gmail.com', 'developerWebsite': 'http://knirirr.com/beecount/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8494191474844969784', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/HNGCB0419Azkw16kwZm7C1QJSw-UwSYAy1PdWBJTgvdEFMMPF2aUW_mqpH5YILZmIPs', 'headerImage': 'https://lh3.googleusercontent.com/cH0q7eYznATl7W5G2tJMLamOgdG2olihQ48Y-mFlWz5uo1TAq6Pqis5WBKIxfDX6L8Ja', 'screenshots': ['https://lh3.googleusercontent.com/ZcK_kpDMWXLPyggLqBW0--icOpC-uk_C9zlEUZh8UaPbc2nfYKs1bnrP_35CmmkfRA8', 'https://lh3.googleusercontent.com/5hdsvGuoIF7m9zA3K9sDv5WGFvZ-FKiEpcG4DDM7UTixY-8BHgVUdDVDNa1jii-8vP8', 'https://lh3.googleusercontent.com/5RCLkAX1Lhgpi8nQiBTCPHdIfDrLsTS4ZyzamBOG_cKVmGANhnpNUjUbUcb0XTLspUY', 'https://lh3.googleusercontent.com/RkBff7I_FmYreK9dyZfm7Sx3NX1qroUkp_BDbPo0Jt1dZQ6xV0WvysJgcuHqQcCP_Q', 'https://lh3.googleusercontent.com/ZD3ujRmMgBuxEaDjnCsc9fcN9k_kUQYwfEr_mQ23n7t-0sg-arQ0MMC-I52MI7ujc94', 'https://lh3.googleusercontent.com/NzkN5Z0XA5yfT4zNgJDD5l4gm7Kpqduo5ZQJX4_O-oz4lHV-S-a1K7ctQbFOnruUNMUS', 'https://lh3.googleusercontent.com/Wv4RLzdyhXOey-InVUOp41plG7vkbCa9-BydTr_35zZwG-kc_GJOnHRkrSTx-0Utgfo7', 'https://lh3.googleusercontent.com/TgUIGDt8z0MozLk_-6_ewOwUSAC4HYzvXzzmLhiGCj6m37YfyhHcTjOCmTuBf1_BSwbu', 'https://lh3.googleusercontent.com/IUK_xIkrj32ldztcpcYtMmtxcwInvq69nkJn26ZdyV5Tju0mnr9WJ_Rz0oMmbSQE29Y', 'https://lh3.googleusercontent.com/CaLXmsrgU6JmB1iswLwffjY2eMfOgtt90H41RgHRmGPqro6XCrMdnkawc_TR4nhohYI', 'https://lh3.googleusercontent.com/CPF952Dj64GRUIiUS6Hl23d8wanQlNyKdTPUlYRQrSNNH5ZPj_kHMs3vrqZFWr_zlZw'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Feb 23, 2012', 'updated': 1590076724, 'version': '2.5.1', 'recentChanges': 'Possible crash fix for Android versions older than 8.0.', 'recentChangesHTML': 'Possible crash fix for Android versions older than 8.0.', 'comments': ["This app has been my go-to knitting counter app for over a year and I've found it simple to use whilst having features that make it far more useful than a basic counter. Not only that, it's free and does not include adverts. It's a great app! EDIT: The dev promptly fixed an issue that affected the app on my phone when I left a comment as well.", 'BeeCount is a really great knit/crochet counting app. I like that I can have all of my projects in one place and how tidy the interface is. I also really appreciate the option to "link counts" which is useful for automatically counting repeats while separately counting rows. After trying multiple apps this one is my favourite and the only one I\'ll use', "Exactly what I needed. It keeps track of where I am in my repeat, and lets me add a little note. Also, it's amazing that it's free and there are no ads. I find it simple to use and I am glad I found it.", "It's a shame that this app seems to be abandoned. I would love to see it develop more. For example, I would love to see it have a repeat button that you could just add to your pattern that would just repeat for as long as you need.", "Great Interface and Beautiful Layout. Nice way to Organize and present in Professional good-looking layout. Only problem is I want to transfer the data from an Android to an iPhone. Each individual text box, labeled 'Add Count' is its own document and I therefore cannot select all to be transferred to a word processor nor do I see a print formatting option... Please fix.", "Great tool with a lot of flexibility. Only thing I wish it did that it currently doesn't is sync across devices.", "Perfect and simple. I found it quite intuitive, name your project, then set up counters for each part you're going to do. Love that I can have notes eg. Dec/Inc rows on the same page as the row counter, only one I've found that does this. It can also be set to tell you when you've finished pattern repeats. Exactly what I wanted.", "This is the third phone I've had this app installed on and will not be the last. There's no limit to the amount of projects you can save, you can set the counter to reset at a certain number, the display is large and easy to read and its an extremely easy to use format. I highly recommend using this app if you're doing chart work or anything that has repeat sections within the rows.", "I love using this app. It's not too hard to figure out and I can duplicate patterns very easily. This comes in handy when I'm tweaking patterns. I do wish it had cloud sharing capabilities so I could use it across multiple devices (for example, accidentally leaving my tablet at home but having my phone in me).", "I tried a couple apps to help me keep track of my patterns as I was knitting them; BeeCount came out on top. It's a sandbox app that lets you input the pattern, link counts, notes about the pattern, and a comfortable UI. I recommend this app a lot to other knitters. I really like it.", 'I like using this counter. It can be as simple or complex as you want. I think there is still room for improvement, and I would be willing to pay for a "pro" version that let me do things like rearranging the counts, duplicate counts within a project.', 'amazing and its doing exactly what i needed. i had a problem to find counting app where i can link few different counters and this app is doing that perfectly. also, very intuitive setup for counters.', "Great app for knitting! It's easy to customize for any complexity project.", 'Simple and intuitive, but the best part is the lack of ads', 'This is so awesome for use when I travel. Actually I love it so much I use it all the time now. I have it on both my phone & my tablet.', 'great row counter with simple to use multi row counters', 'This is the best thing since sliced bread!!!', 'love the pattern break down option!', 'Really helpful and well structured :)', 'Easy to use and Autosaves!', 'Love it, but it\'s not very intuitive, does not have any instructions. I\'ve had to scroll through the ravelry posts when I want to find out how to use a feature. Having a simple "getting started" instruction screen is important. However, once figured out, it is an excellent tool, especially tracking concurring rows in the same project!', "I like it, now that I have the hang of it. My favorite feature is being able to link different counters to increase or decrease at different intervals. This helps me keep track of not only the tries in a repeat, but also how many repeats I've done. I do wish there were a timer and an option to change themes. Otherwise, great counter!", "Have tried over a dozen different row counters and this one is my favorite. Even though it won't let me choose my own background picture for the app bo matter how many times I try, I love that it allows you to have multiple counters for a single project because it makes it much easier to keep track of row repeats. Wish it had a spot to type in your actual full pattern.", 'A great ap for all levels of knitting! I love that I can make notes and \nsplit my counts into sections! Definitely my go-to.', 'my favourite knitting counter! easy to configure for pattern repeats, simple and small. i love it!', 'Love this app. Can easily copy and paste pattern into the rows to make life \neasier.', "I loved this app and it has been my go-to. But since the latest update, I'm not able to create new projects.", 'WHERE Has this been?? 💗 GREATLY USEFUL AP!! 👍👍 💞 👏  ADMIN:: Would appreciate the ability to save/export projects across tablet/phone(s)...', "This is the best row counter app I've ever come across. I love how I can have it count the rows and the repeats and it will auto reset. Just a super smart app that I highly recommend. So happy I found it", 'Fantastic for knitters! I can count for multiple projects and even have \nmultiple counts w/in same project. I use it all the time now.', "Perfect knitting app, only minor gripe is I can't lock buttons from \naccidental presses.", 'love having multiple counts for a project... now if we can just have a timer attached for the project would be even better', 'The best out in the market and the only one I use.', 'Fantastic app - easy and intuitive to use!', 'Love the app, but when linking counts, it only increases by two on even numbered rows. You can probably understand why this is frustrating when they need to increase in the odd row. Am I missing something? It worked before.', "Great for counting rows/rounds especially for complex patterns with nested subsections. Tried a few others first and this was the only one that could cope with a complex pattern I was making. Only reason it misses out on 5 stars is the + button needs to be bigger or less crowded. It's too easy to hit one of the other buttons.", "I installed this counter and thought it was great , so I looked for s payable one thinking it would be even better...not so, I have since deleted the paid counter and reinstalled this app ....highly recommend , takes the strain out of counting rows, pattern repeats, increasing , and stays on screen ...awesome app..knitting for 46 yrs , I wish I'd had it yrs ago .", "Just one request. Can we have the ability to have different sounds for counting down and counting up. That way we'd know if we accidentally hit the minus button instead of the plus one.", 'The best counter linking system out of all the apps I tried. The app is convenient, free, and contains no ads. This is the perfect knit counter. Huge thanks to the developer)', "Incredibly useful! I've been using it as both a row counter and a tally for blanket pieces. Being able to customize the background is a lovely touch, too."], 'appId': 'com.knirirr.beecount', 'url': 'https://play.google.com/store/apps/details?id=com.knirirr.beecount&hl=en&gl=us'}
