{'title': 'Camera Roll - Gallery', 'description': "Camera Roll is the perfect Gallery App to enjoy your photos, gifs and videos.\r\n\r\n<b>Fast, Simple and intuitve</b>\r\nCamera Roll features a simple and intuitve interface, that doesn't get in the way. This App is designed around speed and performance.\r\n\r\n<b>Delightful Animations</b>\r\nThis Gallery App will delight you with its awsome and beautiful Animations.\r\n\r\n<b>Exif Data</b>\r\nWith Camera Roll you can see and edit the Exif-Data of your pictures.\r\n\r\n<b>Virtual Albums</b>\r\nCreate Virtual Albums to join mutilple directories in one album, without the need of moving or copying any files.\r\n\r\n<b>Hidden Folder</b>\r\nThis Gallery App is able to show and help you clean up your hidden Folders.\r\n\r\n<b>File Explorer</b>\r\nEasily view the folders on your storage or SD Card. You are able to quickly copy, move and delete photos or directories.\r\n\r\nFind the Source Code on Github: \r\nhttps://github.com/kollerlukas/Camera-Roll-Android-App\r\n\r\nJoin the community: https://plus.google.com/communities/110612994901138952207\r\n_______________\r\n\r\nThanks to Anjo Cerdeña for letting me use his awesome Google Pixel device frame!\r\n(link: https://dribbble.com/shots/3034433-Google-Pixel-device-frames)", 'descriptionHTML': 'Camera Roll is the perfect Gallery App to enjoy your photos, gifs and videos.<br><br><b>Fast, Simple and intuitve</b><br>Camera Roll features a simple and intuitve interface, that doesn&#39;t get in the way. This App is designed around speed and performance.<br><br><b>Delightful Animations</b><br>This Gallery App will delight you with its awsome and beautiful Animations.<br><br><b>Exif Data</b><br>With Camera Roll you can see and edit the Exif-Data of your pictures.<br><br><b>Virtual Albums</b><br>Create Virtual Albums to join mutilple directories in one album, without the need of moving or copying any files.<br><br><b>Hidden Folder</b><br>This Gallery App is able to show and help you clean up your hidden Folders.<br><br><b>File Explorer</b><br>Easily view the folders on your storage or SD Card. You are able to quickly copy, move and delete photos or directories.<br><br>Find the Source Code on Github: <br>https://github.com/kollerlukas/Camera-Roll-Android-App<br><br>Join the community: https://plus.google.com/communities/110612994901138952207<br>_______________<br><br>Thanks to Anjo Cerdeña for letting me use his awesome Google Pixel device frame!<br>(link: https://dribbble.com/shots/3034433-Google-Pixel-device-frames)', 'summary': 'Camera Roll is a simple and beautiful Gallery App.', 'summaryHTML': 'Camera Roll is a simple and beautiful Gallery App.', 'installs': '500,000+', 'minInstalls': 500000, 'score': 4.0671377, 'ratings': 2848, 'reviews': 1412, 'histogram': [211, 241, 301, 483, 1610], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.4M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'Lukas Koller', 'developerId': 'Lukas+Koller', 'developerEmail': 'lukaskoller6@gmail.com', 'developerWebsite': 'http://lukas.koller.us/', 'developerAddress': None, 'privacyPolicy': 'https://github.com/kollerlukas/Camera-Roll-Android-App/blob/master/PRIVACY.md', 'developerInternalID': '4713324370385782802', 'genre': 'Photography', 'genreId': 'PHOTOGRAPHY', 'icon': 'https://lh3.googleusercontent.com/geQfPVb7nFM3d4zPEcdAIUEQqZP7VirvU2ZWDrzfUhgGV2t520STWt5h22EvLBhRTQ', 'headerImage': 'https://lh3.googleusercontent.com/JRDfAvlQtC6ANkGwGF2iXUAoQ1gdL_BowUsYRXDiISeXCXbThk2v9tpzt_CEySOUvo8', 'screenshots': ['https://lh3.googleusercontent.com/4PDg67nL7tgM1iSt9HYp1I-wBviqd6HmgXFZBtDBuk4MY616VTIxZ3G-Bub7M_FbLXM', 'https://lh3.googleusercontent.com/j8qj0tE9JDcxwha98VMxyIYcDUX98rHp9rXv96jutRg3NxPHXdiQlqwib75403hiyQ', 'https://lh3.googleusercontent.com/6DIymkXU0mFAvy9b-EVIjAidIzrvFHwTc6vFecN5HPsnGtjiWIXHqYPBjWvyyKGOWQ', 'https://lh3.googleusercontent.com/19pv50PjLmgnGszW5B7EqJzdIIQ_a09QBpTB4eHIJTU5cjSxCYsWKv03al2_qOhANZo', 'https://lh3.googleusercontent.com/_dXB4Oraht_-23CgG5Eqdlq7pYBni0xTtGGIVgZX1iMiVNP0yJpQy89FLEXjFt5baA', 'https://lh3.googleusercontent.com/eKfr00vEADjS2EMe12AmRKb1WmhbedXd3UN6HSZMciF2h2YY4pxNXJ0ddxlHZNVBtac', 'https://lh3.googleusercontent.com/LrtSD_v3qPgmfj6tk4GvuoXoXPIfiVsWVl8jgNvI0hcoPeqjQg1owY17X4c9VsPj1w', 'https://lh3.googleusercontent.com/4RX2NjnO3ym9LHHL1wAH_rp2sDUERymAiCbYZnHO7eo3fX2FD5klb13nGUpN1kXglos'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 26, 2017', 'updated': 1526136943, 'version': 'v1.0.6', 'recentChanges': '- added List Style\r\n- now able to set custom ColumnCount for each Style (except NestedRecyclerView)\r\n- removed ScrollToTop\r\n- updated simplyfied chinese, polish & ukrainian translations', 'recentChangesHTML': '- added List Style<br>- now able to set custom ColumnCount for each Style (except NestedRecyclerView)<br>- removed ScrollToTop<br>- updated simplyfied chinese, polish &amp; ukrainian translations', 'comments': ['I really loved the app! But the problem is there is a some basic features missing a rotating option for image and show hidden folders not working for me also the app is not able to display so many of my photos it only displayed a green and black pixelated box! If these are fixed it really can be my permanent gallery app which I really need a proper one!', 'This looks like exactly what i want. The layout is concise and the navigation simple. Overall a very clean app. But sort by date is out of order! Its the default to sort by, the expected way to sort photos, and what i use the most. And its all mixed up! All the other gallery apps iv tested, as well as google photos are in the proper order. This kinda blows it for me, while i like the rest of the app, this is a very basic feature that i expect to work without any problems.', "That's so far the best gallery app. But one think would improve it very much for me. I sync my photos to my smartphone with nextcloud but in Camera Roll I can't add the path to images because it's in /android/media... which is grayed out. Could you solve that? And another cool thing would be sorting the images by tags given already in the metadata from Lightromm or Darktable. Thank you", "This app is great for those of us who have created slide shows of our trips/vacations, stored them in separate folders, and simply want to display the photos in the order we've taken them (alphabetically by photo image name) instead of last-in first-out (who wants to see their trip backwards?). And the list display of all the photo albums (i.e. by folder names) is just about perfect.", "Really cool and functional gallery app with a lot of features. Still working on Android Q for me, but I hope this app continues to be supported if it doesn't work for future versions of android or whatever etc.", 'As of Android 9 March 5th, 2020 security patch the app cannot delete images stored on an SD card. You are asked to "Grant removable Storage Permission" to the SD card root but upon selection you are returned to the initial selection screen and stuck in a loop.', "hello dev, are you still there? do you read the reviews? I really love your gallery app. it's beautiful. this app doesn't get update since 2018 but it works flawlessly. it has the simplicity, have the features i need (minus to add favorite 😔), dark mode, etc. I really appreciate your hard work. i really hope you're still working on this to make this app even better :)", "Outstanding app! ive been using Gallery KK since they stripped the native Android Gallery app out back when Marshmallow was released. This app is a welcome change and it even works really well on Chrome OS which is a must for me. Kudos. One thing though. Android's system UI doesnt see this as a option for picking files. For instance if you have a app running and you bring up a image the system UI doesn't see it as a viable option to open with. If it had that this app would be perfect.", 'App is pretty good, but has way too many problems. After a while, the app keeps stopping just from trying to do simple actions, such as deleting or renaming a photo, and when you exclude one album, almost every album deletes itself. But the app is easy to use, and useful/reliable.', "Love it except it doesn't recognize all images especially if they're tumblr downloads. Started after update to Android 10. I'm wondering if dev has abandoned his app.", 'Please update the app at regular intervals. Thank you. Unable to reverse sort by date.', 'When I access the app from my camera, I am unable to delete any photos. The only options available are info and share. It is a bit of a hassle to have to close the camera, open this app and then delete the photo(s). Apart from that, I love this app, it is beautifully simplistic, has some nice customisations, and is open source!', "It's missing a ton of features. Some basic things like sorting don't even work.", "First impressions were good, but can't see option to hide folders and sharing photos is limited? Ie no direct share to ig message", 'Does not fully work on Android 9. Wish it did since it is the only Gallery app worth having. Shows thumbnails but broken-screen icons instead of the picture. Update needed. Otherwise excellent.', "Features I would love to have in your album: 1. Make it easier to rotate photos, just make it the easiest. You'll get many more downloads. 2. Make more ways to sort out the albums : please add sort according to size too. That will help us a lot to sort out things in the gallery. 3. Please make the app more fluid and fully gesture based. Even getting back to the albums from the photo should just take a down swipe. 4. Please make sharing also an up swipe away.", 'Okay for just viewing pictures, but I was unable to move anything into or out of any folders. Then I discovered this gallery app lacks the ability to manage or create folders, only some "virtual gallery" nonsense, which is a poor stand-in and leaves your actual files in a mess. It can show you hidden folders, but you can\'t do anything with them either.', 'Overall experience was good, but please add one little feature which will deliver a great improvement in user experience. Please, can you add swipe down to close a photo while viewing it. Everytime I have press back button to close the currently open photo. You can refer the experience I\'m talking about in "mi gallery app". Thankyou for such a neat and clean app experience. Just little more improvement and it will be at top list of Play Store. Hoping updates soon 🤗!', "It's a quality product and simple to use. Includes a lockscreen image setting most galleries do not have. A real plus if you need the option. Also includes an image rotation function.....I Would like it to include a resize feature in the future and REMOVE THE TRASHCAN from the bottom of the image page. This is one of the best image galleries around and it will not frustrate the user at all. I really like it and it contains no ads. A ' no brainer' if you need a better image gallery. Quality.", "It's not bad, it's just not quite as helpful as I could want. It's rather slow, you can't batch edit names or rotation; in fact, you can do very little editing, which means using a different app... All. The. Time. And I have to use a file manager for renaming, etc. It's also rather slow at scrolling when selecting multiple photos. So if the things I most want to do aren't do-able or are too slow, this just isn't the app for me. Moving along: nothing to see.", 'I used the Camera Roll app for 2 weeks. For an unknown reason, a picture folder was not accessible, not visible anymore. I tried everything to no avail. Moreover when you scroll through an existing folder to the bottom, immediately that folder shuts down. To make the situation worse, Camera Roll uses a very strange sorting method in which capitals and lowercase have an influence in the sorting procedure. This is why Camera Roll, in which I had placed a lot of hope is unusable.', "it's a good app. it's beautiful, and quick - but only when it works. i sometimes find the app not responding or opening at all. i would have to clear all the background apps and then restart it for it to work again. one thing i noticed too are some media showing they're broken but they're actually not. i know it's a fairly new app so i'm confident the bugs are gonna get fixed. idk if there's one but you should put up a donation tab so we can pay u for your good work :) thank you!", "The best simplistic design I've found on the app store, but lacks many features of competing apps.", "This app is very simple and lightweight while still offering a strong set of features and settings. You can choose between a set of interface configurations and built in themes. It's possible to exclude folders from within the app or even override android's built in media caching service. On top of that this app plays animated gifs in thumbnails and is entirely open source. Strongly recommended.", 'The app will not even show much of the folder names. The white font is difficult to read and should be able to be changed colors. The app icon is black & red which should be able to be changed to different colors. Plus it shows my folders in two separate lists alphabetically ordered for some reason.', 'Love layout and file renaming. This would be the BEST photo app available and I WOULD PAY QUITE A BIT FOR AN UPGRADED VERSION IF THE FOLLOWING FEATURES WERE ADDED: 1) Ability to rename and move folders 2) Ability to display an empty folder so that I may move pictures to that folder. 3) Ability to navigate up/down folder structure 4) Would love the added ability to add tags to the pictures (that will remain with the picture when uploaded to windows computer).', "Other than its ability to hide files,there are many more that can be done. For example i can't move files to another folder via the app itself. I have to go to my stock file manager to execute that action. And the app should revert back to normal viewing instead of still showing hidden files after exiting the app. That would be the best.", "Crashes sometimes, often requires me to delete files multiple times before it actually deletes them, occasionally won't let me save rotated photos, recently it will get stuck on a certain photo as I open the app and won't budge unless I tab out and close it by swiping. Other than that, I like the simplicity of it and would love to keep it, but these bugs keep getting on my nerves more and more.", "Works but very limited. I was using Quickpic before. The album exclude feature doesn't seem to work. I clicked Exclude but it still shows up. Would be nice to be able to set folder Cover image and have hidden albums with password protection like Quickpic. Also there is very little customization, can't change banner color or anything.", 'Works fine for me, editing features are somewhat limited but all I really needed was cropping and it suits me just fine. Sadly I\'m having technical problem: if I set Camera Roll as default, when I tap on the photo preview in my Camera app, I\'ll get "Error: Album null." Other gallery apps work just fine.', 'Seems to be flawless but the animation is a bit slower while clicking and opening the photos but the rest is awesome, i would like to have more colors for themes and the most importantly add the recycle bin to this wonderful app to complete it. I hope my demand would be considered by the developers. Thanks!', "App is simple with good customization options, just what I wanted. But it'll be Great with a password option for deleting Pics/Videos, I don't want to delete something accidentally. Also it doesn't show the name of the Videos.. So if you're looking for a simple Gallery, definitely worth a shot!", "Quite often the app would go into a loading freeze when started. Then when you delete multiple pictures at once, you'll get the broken/missing image symbol. And won't know which picture is which cause they won't match the previews. The last straw came when I just started the app and it showed me a picture which I was planning to delete and so I did only to realise the app had deleted a picture of my daughters instead.", 'I wish the app would be optimised my pixel 2. All the portrait photos I take appear as folders instead of part of the camera roll folder which makes it hard to use', "The minimalist design is perfect and exactly what I'm looking for but too many bugs. Cannot copy or move files from phone to SD card without the file breaking. Almost lost import stuff due to this. Cannot recommend at the moment.", 'Not bad, it does appear to be the fastest open-source gallery out there currently. Could use a better Media Retriever to get files only QuickPic seems to find consistently. Also please add in the editor the ability to mirror images, and make the cropper less wonky to handle.', "i love the app but as of this update i cant delete photos. i think the reason why is because i format my sd card as internal. it can read photos but it cant do stuff ( deleting, editing etc. ) with them! please fix this. this app is great and awesome and i'll change my review if this gets fixed.", "Magnificent. I uninstalled Quickpic within 2 minutes of exploring Camera Roll's features. its functions don't have as extensive detailed settings, but it's simple, stylish, smooth, works, and is free, what more can one ask for?", 'Unreliable. It hasnt been updated since May 2018. The app has difficulty moving files between folders and/or deleting. Says files have been moved or deleted when they have not. Very slow to start. Im using it on a Samsung Galaxy S7 running Android 8.0.0.', 'This was my favorite gallery app until I tried to move a picture to a new folder within the app. The app crashes every time I try, and even leaves a blank file in place of where the original one was (it still moves the file, but leaves the "ghost file" in the original location, then crashes).'], 'appId': 'us.koller.cameraroll', 'url': 'https://play.google.com/store/apps/details?id=us.koller.cameraroll&hl=en&gl=us'}
