{'title': 'qBittorrent Controller', 'description': "Open source application for handling qBittorrent servers (web UI).\r\n\r\n\r\n<strong>DISCLAIMER: </strong>\r\n- This application will not download torrents to your phone/tablet.\r\n- In order to make it work you must have already configured your qBittorrent Web UI. Please check your server configurations with your browser before using this app.\r\n- To start using the app, you must set your qBittorrent server's settings and account by selecting 'Settings' from the left menu.\r\n\r\nIf you need help setting the application check the documentation pages http://git.io/pQB5\r\n\r\n\r\n<strong>FEATURES:</strong>\r\n* Add torrents directly, by clicking the link on your device's browser or from downloaded .torrent files.\r\n* Pause, resume, or delete with its downloaded data individual torrents. Pause or resume all torrents\r\n* Set and save a connection accounts (up to three servers for the Pro version)\r\n* Design for phone and tablets\r\n* Support for server version: 4.1.x, 4.2.x\r\n* Web server sub-folder publishing support\r\n* Magnet support\r\n\r\n<strong>qBittorrent Controller (free) vs. qBittorrent Controller Pro</strong>\r\n\r\nBoth versions have the same functions for handling qBittorrent servers, but the Pro version includes a nicer UI, the latest features and fixes, and it's Ads-free!!", 'descriptionHTML': 'Open source application for handling qBittorrent servers (web UI).<br><br><br><strong>DISCLAIMER: </strong><br>- This application will not download torrents to your phone/tablet.<br>- In order to make it work you must have already configured your qBittorrent Web UI. Please check your server configurations with your browser before using this app.<br>- To start using the app, you must set your qBittorrent server&#39;s settings and account by selecting &#39;Settings&#39; from the left menu.<br><br>If you need help setting the application check the documentation pages http://git.io/pQB5<br><br><br><strong>FEATURES:</strong><br>* Add torrents directly, by clicking the link on your device&#39;s browser or from downloaded .torrent files.<br>* Pause, resume, or delete with its downloaded data individual torrents. Pause or resume all torrents<br>* Set and save a connection accounts (up to three servers for the Pro version)<br>* Design for phone and tablets<br>* Support for server version: 4.1.x, 4.2.x<br>* Web server sub-folder publishing support<br>* Magnet support<br><br><strong>qBittorrent Controller (free) vs. qBittorrent Controller Pro</strong><br><br>Both versions have the same functions for handling qBittorrent servers, but the Pro version includes a nicer UI, the latest features and fixes, and it&#39;s Ads-free!!', 'summary': 'Handle qBittorrent servers remotely', 'summaryHTML': 'Handle qBittorrent servers remotely', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.1347518, 'ratings': 1425, 'reviews': 674, 'histogram': [444, 111, 181, 181, 505], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.7M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Luis Gallardo', 'developerId': '8790730601916417312', 'developerEmail': 'lgallard@gmail.com', 'developerWebsite': 'http://lgallardo.com', 'developerAddress': 'Av. Ernesto Blohm y la Estancia\nEdif. Centro Banaven. Torre C, piso 6.\nChuao, 1064. Caracas, Venezuela.', 'privacyPolicy': 'https://lgallardo.com/private_policy.html', 'developerInternalID': '8790730601916417312', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/HlQGpXOzv6zWMT_slqcsoq64CFFiU3dOdbd0m97shqFsKCHv4jCpg28udDBN1mHNLyY', 'headerImage': 'https://lh3.googleusercontent.com/XO1R3EsTUuHb77Lu9PivWPXchZVcMPyB2bkK8ccRTUSyiLReS_5Lo2n3mTBSPV2idLiw', 'screenshots': ['https://lh3.googleusercontent.com/58gxQ2J046-LXxrfLQrvC4S2_JO7jCam5a7NSJJwH1Htz0hAn0k5VSxMh91d5lBzp-zS', 'https://lh3.googleusercontent.com/mfED2y1Xr-YSCJiD87WbETqasq6JA5Q1JQ4NXvgJKlQ7UZWHXuhjeFKGd98TdwdPlX8', 'https://lh3.googleusercontent.com/q8r1gB3tceCRZ24DVibspYL08Yco5Xo67Bke2ZF4cqGN7fsY1zady1fqCKmWbTUIVAQ', 'https://lh3.googleusercontent.com/jhCu7WLa3bBJfDEG2MiTrzlsfMAQi0gnQdKWwf0T31CgkWc9JxVk_kT3X6rsurQ2n88', 'https://lh3.googleusercontent.com/s6h-qSVBDEfJTnkkVuziloQP6V3zoWZRWbaXPZTnmnzUF_x5OhWMS6LIQEVsvbzGQUg', 'https://lh3.googleusercontent.com/yBFsCbhHCF8RP1Pf6jZFpo5G4x_lGOzfJ_On8Sb0hwbG1i9SMQ2ra2QBcsZCoChjlRk', 'https://lh3.googleusercontent.com/rR_OQhv91kFGKT_QPUKZMG_94mTGn1Ao51CmWWwH9OqQTl9sntDBuXSGVIBDFt-tw8s', 'https://lh3.googleusercontent.com/w2F1ygj1OlHSpBYCSYc8s36p0-AH8sm52Jv0_sGjOKqqTqw9MH0JXnW0YPdxLVpUhkY', 'https://lh3.googleusercontent.com/ob-x-uOgpoLGNotMxVRra6u1OS8hCkR8iMKRPEOsLBqU8XInz3EtwPPk2MRU95bLIoI', 'https://lh3.googleusercontent.com/gp33egvVJTXck4v0j1jP_4TZhpGfH16RJWsm8YzbAx7sMIkcDwaDL87fdJ6OyfVJMnI', 'https://lh3.googleusercontent.com/7pAkzqvolAIXb5P1BKHGd2JoVSllTUlrOklaDtQpyk2PJVGyxFV_p2hioLKcs9eBsA', 'https://lh3.googleusercontent.com/4ZsM41wg6H8vUVqN2J-hOdBdk6l_a4MP_a3t0e8RDf5tY_wt70eLTW13GT3-5jw00A', 'https://lh3.googleusercontent.com/20_RmQOS0MGZryKuW4Js7KptxQePJoVB3uJ8T997LM6yDX20m-pJvPF0lZxqNLZnEncx', 'https://lh3.googleusercontent.com/tAy_Oy_8qbAFycYm9sfDNFtE5yUxZYydEpF7MTz29-I9hnWiCqv6mHg0Mrh88yvS4HQ', 'https://lh3.googleusercontent.com/7DkV5pe0qrnnrfQBt062AJVC_KmIDrBHjgGV75QIQ-F2bthcRpb9fA6nPBBgDK2LAxiW', 'https://lh3.googleusercontent.com/aki4nONjaS4EHNiUnRCsQl-QMWs9n6O2lQ51vDh87XNsOCk2lBUlfAnnHQ8DUf74gg', 'https://lh3.googleusercontent.com/bqGZmWGKnhrz_nC8z7WXs74FTK4UnTxnwaYcmMDcTXNWkFDburW2Rv0a8hwyL23YWRg', 'https://lh3.googleusercontent.com/pDH_7KpSJlqKGTPYUHEmoCUDm1nYxKEKCYR3Gl2V8gveL-cC2hXEebS8kJiaREKWeoU', 'https://lh3.googleusercontent.com/o9X3ROvtqBTckxoMXNpkOhZMQzr--zQZmVnuL9CQmMal9XRU4RNsMCBiua5QfDXb', 'https://lh3.googleusercontent.com/dlIoT9DOoLdDpq5K-1oIYuhS2f5J-7uWPevotYifLXjTrqisde_pV8r9sjuHLRpUyvQ', 'https://lh3.googleusercontent.com/1owQOR0Hr3p1QGpS5mWHtaNb_VGq20p_iLs3Dk256Pai78KKuZkkCNiz4vRabgTTKA', 'https://lh3.googleusercontent.com/EHr1YfDCJQIiHMvDI80Yc9_xq8PNzBhSoygZIfmEVNozPqnuquwnxEDZzxXQ70ShWSY', 'https://lh3.googleusercontent.com/cLIFrqomkH0_hWS9tCwDUPmxnOvU7RCA5ZYPdFFhkJVU3D5J7WmGmFrtaZ-LHT0sbw', 'https://lh3.googleusercontent.com/326Avz98ZGr1gYYucpp1lKhsrDfp6H3c10QYVKgvMzhXmDgMe6D5q7OF-7VARbuw-qE'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': True, 'containsAds': True, 'released': 'Jul 10, 2014', 'updated': 1589664968, 'version': '4.8.7', 'recentChanges': '* Remove ads space in Pro version\r\n* Fix Progress, Size, ETA, and Download / Upload Speed comparators\r\n* Remove Host and Referer headers', 'recentChangesHTML': '* Remove ads space in Pro version<br>* Fix Progress, Size, ETA, and Download / Upload Speed comparators<br>* Remove Host and Referer headers', 'comments': ['Latest version fix the below error I got in earlier versions. Just for reference here is the error I used to get and nownis fixed. " I\'m trying to connect via my android device I get unauthorized permission error. "', "Can't connect to my home server with qbittorrent client over https with Let's Encrypt certificate (all workikng well in mobile web browser). Edit1: 4.8.6 (as reported in app help menu) is working now. Thank you. I'm using qbittorrent-nox with Let's Encrypt ACMEv2 ssl certs as backend. Edit2: When I start the app, I just see an 'please wait' icon until i select something in the left menu (downloading, seeding, etc.). If nothing selected, then after about minute a connection error appears.", "Works great, however, when choosing a category, if said category already has a set destination, it should automatically download to said destination. If you add that, it's an instant five stars from me.", 'This is really a bad application. Since a couple of versions the app constantly freezes after some time. Also when checking details of a torrent the top bar showing download speed constantly causes the content to jump around.', "Can't get this app to connect at all, I can access my we server page from other PC's but this app cannot. I did follow the instructions on the github page but it just does not work.", 'Love this app, great support from developer. I am using an older version to support my ARM version of qBittorent', "I couldn't connect to my qbittorrent but the web ui works just isnt connecting plz help", 'It says the server is only available on the pro version what a waste of my data', "Migrated to this app because Transdrone no longer works (qBittorrent 4.2 introduced a new API which broke things a bit, but this app supports it!) I'd love to see categories and save path make an appearance but for now I'm happy to have a working solution. Thanks Luis! UPDATE! By 4.7.4 Luis has added both of the above features! If I could bump the review up to six stars, I would! Cheers mate, Happy Holidays!", "i'm using the most updated version here on Google Play. Won't download any torrent. You should set the Downloads folder as default file path, not empty. Typing the file path won't reflect as it is. There is no default path, it's just empty blank space. I can't set any path. There is no error appearing, the file path input is just not working.", "Helpful app. Allows me to browse torrents on my phone and send to my PC for download. Set up is not simple, but okay if you've configured qbittorent correctly. Recently Categories have stopped working for me. even though I type in the category name, no category is sent with the torrent. Appreciate the troubleshooting steps. No luck with it still. Everything is a fairly standard set-up, use a custom port number though. Latest versions.", "The app on PC and Android are updated, but I'm not able to point different save path- even the menu pop-up , I set the full path, but the content is saved only on default download path. Update: I have default save path (C:\\Downloads) on Windows desktop app. When I going to upload the torrent file from phone, I receiving pop-up and set different path (for example: E:\\Temp\\) , event that the content will be saved on default path (C:\\Downloads). Before 1 month everything works as expected.", "Very good app but the only downside is I cannot do any searches for new material from this app. I want to be able to search just like the web version of qbittorrent allows. If the pro version had that ability to do a remote search for new material then I'd buy it.", "My Linux server with your program is 100% up to date with my phone app and will no longer connect all my ports are correctly setup worked before now it will not work at all Web portal does work only Can't give the app a 5 since it does not work anymore has been broken for a few weeks Also no errors the loading just keeps spinning won't give a error", 'Doesn\'t work for me unfortunately. qbittorrent Linux v4.0.3, android qbittorrent v4.8.4. I am able to access via WebUI on a different machine fine. Is there a setting that I\'m entering incorrectly? The error is "host not found".', 'Useless for me. Nothing I do will make it connect even though web UI is working on port 8280 for me. Forwarded port, still no luck.', "Works awesome, just needs progress bars and for some reason, never seems to list the contents of the torrent (no files lists).. but it's fast and works beautifully!", 'Update. Excellent app. I use it all the time. Looking forward to the "label" feature returning for categories.', 'fake app Do you know why people startdd Using QB? Bcz, threre was no ads. And you killed it.', 'Very useful to remotely add your Torrents to your main pc when away. Does and it says it does', 'Excellent app. Only one think is missing, when adding a torrent a option to choose a download folder.', 'Does not connect. Going back to chrome and web interface.', 'Server not found. Web UI works on port 8080, and can login. Running v4.0.3, which is the newest from the ubuntu 16.04 repo.', 'Screen still flickering, not main screen or left screen, am talking about when enter to see a torrent file details. Update; what infos you taking about?!!', 'Cant connect when WebUI is selected to https. Works fine when unsecured.', "It does not work on latest version of qbittorrent Edit: now it's awesome", 'Great app, would it be possible to add the search plugin capabilities on the next release?', 'Hi, thank you for all your hard work. A feature that I would like to request on the app is "force resume".', 'Thank You for the quick responce! The new app works with the new qBittorrent 4.2.0! Keep up the great work!', 'plz add rss feed option. handy for seedboxes Thanks for the fast response! looking forward to it! 😁', "very good app for what it does but it's missing search? or i am not seeing it? my use case is to open it, search and add something to download on the server and watch it when i get home.", "App works flawlessly, contains a bit of ads but barely noticeable. For the people that are saying it only works on there home network, that's your fault, you need to port forward the connection in your router for it to work over the internet. I'm thinking of buying the pro version to support the developer for such great work, props to you sir!", 'Its really useful torrent client', '*** EDIT:  alright finally got it working QB-controller: ip: your-external-ip : port 23xxx  (choose random port-number) QB web UI: IP: *                      port: same as in QB-controller                      turn OFF "use upnp", "use https" and "enable host header validation"   Setup port-forwarding in your router to your internal-ip. 4 stars because the documentation on this is really lacking making the setup way harder than it has to be. other than that, great app. <end of edit>  Works only when the android device is connected to the same local network as the server, which is obviously kind of pointless for this kind of app. Nothing found about this in the documentation either.  Could someone answer if this is intended, a bug or how to set it up so it works outside the local network? Will update the review based on this.', 'Works well. Using it for few years now. Latest version no longer allows changing labels/categories which is major drawback.', 'almost perfect addition to my server, but the patch to be able to "send" torrent file names containing space does not work. The bug is closed, but it should be reopened. I always to change the file bake manually..', 'Hit and miss Worked on one net. Does not work on other. Needs a lot of work. I could not get to work on my home network from outside. Checked UpnP and all.. All working but this thing just does not connect. So basically I have to discard qBittorent and use vuze/deluge. They work without any hitch...', 'Eeech! Horrible. It is very difficult to configure and use, whereas other torrent apps will configure automatically. It is not Android/ Chrome Google friendly. I could not get it to download anything. It has to be configured manually, which only super- nerds know how to do.', "Ignore people that say it doesn't work. This app is a CONTROLLER. You need a server to connect to. Chances are you setup the server so you have all information that you need to configure the app!", "Hello, I cant seem to get this app to work remotely; only on my local network. I can't determine how to contact you directly so I'm doing so by leaving this review. Will leave a 5 star review and purchase the full app if you can fix this issue for me or direct my to appropriate documentation. (Have already checked the current help documentation and it does not provide directions for remote Webui setup)"], 'appId': 'com.lgallardo.qbittorrentclient', 'url': 'https://play.google.com/store/apps/details?id=com.lgallardo.qbittorrentclient&hl=en&gl=us'}
