{'title': 'Starth Bing Wallpaper', 'description': 'Starth Bing Wallpaper is a free and open source app, change your device background or lock screen with Bing image of the day. (some non-AOSP systems are not supported lock screen)\r\n\r\nFeatures:\r\n  1. Automatically change your device background or lock screen daily with Bing image.\r\n  2. Browse Bing image from the last two weeks.\r\n  3. You can manually set the Bing image as the background or lock screen.\r\n  4. Save the Bing image without logo.\r\n  5. View daily Bing stories.\r\n  6. Desktop widgets.\r\n  7. Lock screen wallpaper function, MIUI(need root) work on Android L(21) and above , Other System work on Android N(24) and above.', 'descriptionHTML': 'Starth Bing Wallpaper is a free and open source app, change your device background or lock screen with Bing image of the day. (some non-AOSP systems are not supported lock screen)<br><br>Features:<br>  1. Automatically change your device background or lock screen daily with Bing image.<br>  2. Browse Bing image from the last two weeks.<br>  3. You can manually set the Bing image as the background or lock screen.<br>  4. Save the Bing image without logo.<br>  5. View daily Bing stories.<br>  6. Desktop widgets.<br>  7. Lock screen wallpaper function, MIUI(need root) work on Android L(21) and above , Other System work on Android N(24) and above.', 'summary': 'Set Bing image every day as wallpaper', 'summaryHTML': 'Set Bing image every day as wallpaper', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.32, 'ratings': 235, 'reviews': 130, 'histogram': [14, 14, 16, 28, 162], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '7.1M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'liaoheng', 'developerId': 'liaoheng', 'developerEmail': 'liaohengcn@gmail.com', 'developerWebsite': 'https://github.com/liaoheng/BingWallpaper', 'developerAddress': None, 'privacyPolicy': 'https://github.com/liaoheng/BingWallpaper/blob/image/PRIVACY_POLICY.md', 'developerInternalID': '4709636818280099909', 'genre': 'Personalization', 'genreId': 'PERSONALIZATION', 'icon': 'https://lh3.googleusercontent.com/V1PYnTLy4WKSG6CZIZbgGWzQcrjt3_4ARpTKvmTmuN5MWt1F6SyfElp6uBfwCBBB6lw', 'headerImage': 'https://lh3.googleusercontent.com/tgGhIAWkGVN7QnX8rRGXaGbvfBV7Xi9B7mxxLrnhFb1Nce6FdhK_GRrP1InUT9Xdxds', 'screenshots': ['https://lh3.googleusercontent.com/rlsc0rSenZUb_eMwDsAAQo9YYOC_hoXH3c82RXzyVUPTT4kuKKLuIMeT0K0KemjVtw', 'https://lh3.googleusercontent.com/OAUB0rYjr7HDFxXvzrDODpOKMEKuqMW4U4Scotx5jvZn1OV12bV5ey9wfINRBqont-o1', 'https://lh3.googleusercontent.com/Wc4UOlWQrvIqiqynGqd5GbRq2wfeaQ8iXTYYsWU3OTd4JA-WyMjV8vGp744fd5mz6BA', 'https://lh3.googleusercontent.com/SFvbn9xkSOHOQX_PRwn4QBb2fR60-jz1DCs4N4FMCtgEWXdNSspKZx0vJQEZomfzkjsp', 'https://lh3.googleusercontent.com/-X-wNuA6h3IYcaZPbTMdXk_9Cq_aZ6j2txSmy0cCen07CFuIKbfGOrr0-Owp6aNgs-k', 'https://lh3.googleusercontent.com/Yxiie-eIgji1kVAx2ST0CXasSjdk1FIovv2v4JliorQxQKFzXQ_9W-5T8eCZc3xgxuI', 'https://lh3.googleusercontent.com/78Rm8WH1cm5A5nsJgBphkdYzf0ljnLADlb62f1YPOR5__DuNMRtvZuI1EihhuIEANkCZ', 'https://lh3.googleusercontent.com/qTX4Ll4jBHYsrnYTS90jPPi33_t_n_zXBzkVpHon-tM__ue68li_qadAd9Yb7pHR-50', 'https://lh3.googleusercontent.com/3oeIBkLVg5iea33474JNOHzh1ZdsXCSe-giH9PKfk9wGhqXpQAw6pBvl_BFmSHDFfQ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 12, 2018', 'updated': 1591607618, 'version': '1.7.5', 'recentChanges': '1. Migrate FirebaseJobScheduler to WorkManager\r\n2. Fix some system set wallpaper black bar\r\n3. Fix some crash\r\n4. Update third-party library', 'recentChangesHTML': '1. Migrate FirebaseJobScheduler to WorkManager<br>2. Fix some system set wallpaper black bar<br>3. Fix some crash<br>4. Update third-party library', 'comments': ["This app works very well on my Android 6 phone, but doesn't work at all on my Android 10 phone. On the Android 10 phone it doesn't load the images.", 'Resolution is not great, so so is a best thing i can say, and there miss compatible resolutions and rolling or fix wallpaper, i mean a little lower than good', 'I love this app it has great pictures to choose from.', 'Excellent, wallpaper updates every day, beautiful pictures and information. Well put together app with NO annoying ads, keep up the great work!', "My Honor 7x shows the local (Indian) wallpaper but this device, Realme C1 isn't. All settings are EXACTLY same, runs in background and updates perfectly.", "Zooms wallpaper on home screen. Stays perfect on lock screen. Please fix. Edit: Okay. Thanks for the reply. Here's your five stars. Cheers.", 'Perfect Was looking for an app that allows changing the wallpaper via a long press shortcut, this does just that', 'Great and beautiful wallpapers!', 'Oooo, great apk! Thank you sir!', "Ahhhhhh! How wonderful it is to finally get Bing Daily Wallpaper on the LOCK SCREEN of my Android device! I have to manually change the wallpaper, but at least the option is there! Bing Daily Wallpaper was one of my Windows 10 mobile's best-loved features. When I was FORCED to switch to Android, I got a Note 4 that could not display Bing Daily Wallpaper on the lock screen, but only on the home screen. But now, on my new device, I can get it on the lock screen! 😊 👍 How Very Nice!", "Works manually but doesn't update wallpaper automatically. I have disables battery optimization and enabled unrestricted background data.", 'Antivirus is showing security risk about your app after recent update.', 'Very nice app. Automatically checks for new wallpaper every 3 hours(if set) and sets the everyday bing wallpaper without any hassle. Kudos to the developer and very importantly no ads.', 'I cannot use a daily wallpaper with gaussian blur on home screen and without filter on my lock screen. Can you please make an option to make it possible. Thank you. Great app.', 'i still cant set this app to auto change my wallpaper. tried add widget, whitelist, no battery optimizing, allow to operate in background. so what else that i miss? since install, i need to manual set myself daily. pls help. using android 8 with samsung A9 pro', 'Pictures are nice quality and centered well,. Just not very interesting pictures used after 5 days.', 'Works well on S9+ with Andoid 9, but need to modify some permissions at Battery.', 'The best app for Bing Wallpapers. Only problem: why not all regions but only USA and China?', 'My screen resolution 1080-2246 not available also when i set for higher 1080-1920 resolution it auto set 800-480 why?', 'awesome app. it provides you with different wallpapers everyday', '"Setting wallpaper failed" in status bar', 'Something is wrong with the permissions this app uses!', 'Need more such apps with daily surprise wallpaper.', 'Good app but the download settings is a little off', 'I hated this app it did something to my iPad. it changed my iPad settings and change my layout of my iPad.', "Works and it's free", 'not updating automatically sometimes', 'Great app love it', "It's working", 'dxu be coming', 'Great App!', 'Exceptional photos', 'Perfect m', 'very good', 'nice app', 'simple,clear,great job.干干净净，难得的好东西。', 'Replacement for another bing wallpaper app. Works well.', 'Nice app', 'Pictures SUCK, and not having control to switch them, and when... SUCKS \nWORSE. LACKLUSTER LAZY CODE WORTH HALF THE PRICE YOU CHARGE.. Uninstalling', "Doesn't auto refresh on Galaxy S7"], 'appId': 'me.liaoheng.wallpaper', 'url': 'https://play.google.com/store/apps/details?id=me.liaoheng.wallpaper&hl=en&gl=us'}
