{'title': 'Vaporizer Control Crafty VCC', 'description': 'Why?\r\n\r\n - The app from the vendor is to slow in showing battery state. I especilally disliked that a progress indicator always visually blocked the for me most important info - the battery state\r\n - As the app was not free software there was no fdroid version and there are some Android users that just run free software ( respect! ) So e.g. Richard Stallman can now use the device\r\n - possible wear extension ( I could imagine this handy - but I have no wear device yet )\r\n - in the states where weed is legal we could have presettings for THC\r\n - perhaps I get some samples to try in my crafty;-)\r\n\r\nyou can find the source-code here: https://github.com/ligi/VaporizerControl', 'descriptionHTML': 'Why?<br><br> - The app from the vendor is to slow in showing battery state. I especilally disliked that a progress indicator always visually blocked the for me most important info - the battery state<br> - As the app was not free software there was no fdroid version and there are some Android users that just run free software ( respect! ) So e.g. Richard Stallman can now use the device<br> - possible wear extension ( I could imagine this handy - but I have no wear device yet )<br> - in the states where weed is legal we could have presettings for THC<br> - perhaps I get some samples to try in my crafty;-)<br><br>you can find the source-code here: https://github.com/ligi/VaporizerControl', 'summary': 'Alternative free control app for the crafty vaporizer - faster than the original', 'summaryHTML': 'Alternative free control app for the crafty vaporizer - faster than the original', 'installs': '5,000+', 'minInstalls': 5000, 'score': 4.44, 'ratings': 199, 'reviews': 133, 'histogram': [15, 1, 5, 29, 145], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.0M', 'androidVersion': '4.3', 'androidVersionText': '4.3 and up', 'developer': 'ligi', 'developerId': '5229070112536767347', 'developerEmail': 'marcus.bueschleb@googlemail.com', 'developerWebsite': 'http://ligi.de', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5229070112536767347', 'genre': 'Health & Fitness', 'genreId': 'HEALTH_AND_FITNESS', 'icon': 'https://lh3.googleusercontent.com/6admjzlnNjwJsHYgJRWCA_-XC_Ofz3hgk_E6qCZWworpeWx2nTIIL_XUcHM0jwYhx4E', 'headerImage': 'https://lh3.googleusercontent.com/J3OHHo-a3OvZ6OkQ4OKbXAi_qJqbfL7DGROu_ss_FGeT3VylU3xeOv8zj2vFQRZuVkPe', 'screenshots': ['https://lh3.googleusercontent.com/hmo5MiIMfBQCG0027FEztghT9xuJDaGx3yhYSa0ulbFT720ox4jDqZDuf0mJWpMhJes', 'https://lh3.googleusercontent.com/BWPxtGrxojqZaxxLvfLWkxOMkJSbVlsnz_cakCQJ_OXtx-R2a0-GxudV28yyxKEtsi8', 'https://lh3.googleusercontent.com/N1e5aPk0v8zvhwT5xFlLM3sU2YAJs2-VSxHD7yWHy24TVD9pUmn-6E31JbqVUlGgpzw', 'https://lh3.googleusercontent.com/69chVs6oHJo7wX60otVjsx4n9R9KRKUOc5662Pp3STJ8Ub45Vx3St0rIlm0jD3o8ED67'], 'video': 'https://www.youtube.com/embed/F95mc0HDwtI?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/F95mc0HDwtI/hqdefault.jpg', 'contentRating': 'Mature 17+', 'contentRatingDescription': 'Use of Drugs', 'adSupported': None, 'containsAds': None, 'released': 'Apr 20, 2015', 'updated': 1456243541, 'version': '1.9', 'recentChanges': 'Use latest build tools and fix a crash', 'recentChangesHTML': 'Use latest build tools and fix a crash', 'comments': ["Initial experience and review was bad and I feel awful. The actual crafty is the issue. I'm sorry to the developer(s). Once I did a couple resets of the device and my phone it connected fine and is leagues above the manufacturer app. No kicking you out of apps, actual battery life remaining and all the same options as the S&B app but better.", "It works ! The storz and bickle app hardly ever worked with my crafty + so tried this and boom works even better than the official app, as it gives battery life in a percentage rather than blocks of hi lo and so far connects every time which is a pretty basic but absolutely essential feature. Why is this app better come on storz and bickle shape up in fact don't bother as I'm sticking with this app. Good job devs.", 'Thanks for the app. The original one from S&B conect to my crafty + just one with dificulties and will not pair anymore. This app is a live saver for me. It works fine for the new crafty+, even if the crafty is off still gave me the temp reading, battery, etc. Surelly will be nice to have more extensive design, but not really a problem. Also, switch off time set up will be very practical add on futures updates. Well done and keep updating this app please', "It pairs with my unit (crafty) but it didn't pair with ( crafty+ ) . After rebooting both my phone and crafty + they are connected ...it's more precise than the original showing actual battery percentage. I would recommend.", "Open the app. Switch on your crafty. That's it. Set temp, booster and brightness. Thanks to whoever got this together it's saved me some hassle.", "Love it as the official app won't connect. I like the plant temperatures but I'd find a seperate page with a load of more generic increments more useful, say every 5c between 170c and 210c. Or some settable buttons. Widgets would also be tight. Up and down, up 5 and down 5 buttons would also work. Maybe use volume buttons for temp when in app?", 'No fuss it just works. So simple and no crazy permission request like with the S&B app. I was so frustrated with their app. They wanted me to ship my brand new device in for repair because their app would never connect which is crazy talk. Device works perfect. Match made in heaven with this app. Thank you! Thank you! Thank you!', "Brilliant app, gets around the shady location thing in the offical app caused by Bluetooth LE on Android. __ HOWEVER, you can't turn off the LED. This needs to be fixed, gotta be able to turn the lights off to be truly discrete. __ 5* if it had an LED switch. A separate toggle would actually be *better* than the original app. __ Edit: Ow, sorry to hear that. 4* now, up from 2. Google can suck a filthy cheesy crusty thing. Please keep updating outside. __ PARAGRAPH PUNKTUATION!!__", "Thank you so much. The official app stopped working for me and this has been a lifesaver. Only suggestion would be better (more relevant) preset values. The main screen is pretty empty and I'd just put the presets and the slider on there.", "This app doesn't work with newer crafty's. In response to ligi - You don't state that it doesn't work with the Crafty+, this is all that they sell now, so what I said is correct - This app will not work with newer Crafty's.", 'This was too much of a breeze, dont understand why the official one has to be so complicated, thanks for the alternative', 'Excellent. Good control in setting temps and watching battery use', 'Simple and useful. No need for anything else', "This app made my day i couldn't download from appstore and from google play, I've tried on old tablet Yoga and wasn't compatible with it. Popped on this app in some forums and instaled it on Yoga Android 4.2 and it works great. Thanks and happy vaping...", 'Way better than the official one, my device actually connected to the app.', 'Does NOT WORK with recent android 10 update. This app is now completely useless for the newer crafty +', 'Good basics, but it would benefit from more polishing and adding more features the vendor app has.', 'works absolutely perfectly 👍👌. Connects quickly wothout issue, and settings are updated instantly.', 'Way way way better than the intended app from the company. I found this very easy to use, thank you.', "Sucks...hardly works...I was worried about depending on an app for control..the S&B app no better..you'd think these guys would do better..just get your $ that's all", "Thanks so much!!! the official app didn't even recognize my vaporizer.", 'Very useful and works better than the original app that was made for the Crafty Vape!', 'After the Storz and Bickel app quit, this worked for me about 2 days then stopped pairing with my Crafty.', 'was working and has now stopped pairing like the craftt one did', 'Simple and quick. Nice!', 'Great app to customize your vape', 'thank you for making a crafty app that works.', 'Does not work with Crafty Plus, Contacted the developer and he was rude and had a very bad attitude.', "All I need and nothing I don't. Excellent.", 'you need to play this,kids!', "Works better than s and b's.", 'You da man Pulitzer award', 'Cheers for taking the time to make this 👍', "Doesn't recognize my crafty", 'Load of bollocks', 'nice works good', 'I like the way this app automatically searches for my crafty and finds it without having to enter the serial number. I also like the digital brightness display and the digital battery meter that the original app lack. This app does not have ability to control the charging indicator or vibration but seems to do everything else. Wish it could be used to extend the auto shut off time!', 'I use this app with the Crafty vaporizer device instead of the the official app made by s&h. PROS: I prefer this app because I find it to be simpler and more straight forward to use, it has all the same important features. It also gives the exact battery level (0%-100%) instead of the less exact official app which gives battery level in 20% increments. CONS: the only thing that I think must be added to this app are the vibration function controls and sound functions for the connected smartphone device.', "The only suggestion I have is that after changing the unit of measurement, the temperature selection is still in Celsius when you hover over the bar (not a big deal). There also didn't seem to be a way to turn off the Crafty's vibration feature through this app. Otherwise, this is a lot more responsive and reliable than the official app. Thanks!", "Could you have an app 'force stop' button on main screen to reset the app? If I turn my blue tooth off and on the app stops and freezes. I have to go to settings,apps, force stop. The app then works fine. Connects about 5-7 sec. Simple app. Perfect."], 'appId': 'org.ligi.vaporizercontrol', 'url': 'https://play.google.com/store/apps/details?id=org.ligi.vaporizercontrol&hl=en&gl=us'}
