{'title': 'FAST App Search Tool', 'description': 'Find and Launch Applications fast and for free with a small App that needs not a single permission!\r\n\r\nJust type in a fraction of the name of the App you want to launch - most of the time 3 chars are enough.\r\n\r\nIf you have an Device with Jelly-Bean or newer you can use the Google Now gesture to open this app.\r\n\r\nThe app is smaller than 70kb\r\n\r\nFAST is an recursive acronym for FAST App Search Tool\r\n\r\nYou can choose between 3 Themes:\r\n #1 dark\r\n #2 light \r\n #3 transparent ( try this with some Live Wallpaper :)\r\n\r\nA single click launches the App - a long click gives you 3 Options:\r\n #1 Go to the App details\r\n #2 Open the App in Google Play\r\n #3 Open the App as a Notification for FAST access at a later time\r\n\r\nThe App is GPLv3 - you can find the source on GitHub: https://github.com/ligi/FAST\r\n\r\nBig thanks to http://github.com/jfreax for his contributions!\r\n\r\nTags ( sorry but otherwise this tool is hard to find ;):\r\nopensource launcher search apps free easy simple fast small GPL github  super ultra uber mega speed launching applications notification appsearch app-search quick productivity launch time saving power user java github open source home replacement', 'descriptionHTML': 'Find and Launch Applications fast and for free with a small App that needs not a single permission!<br><br>Just type in a fraction of the name of the App you want to launch - most of the time 3 chars are enough.<br><br>If you have an Device with Jelly-Bean or newer you can use the Google Now gesture to open this app.<br><br>The app is smaller than 70kb<br><br>FAST is an recursive acronym for FAST App Search Tool<br><br>You can choose between 3 Themes:<br> #1 dark<br> #2 light <br> #3 transparent ( try this with some Live Wallpaper :)<br><br>A single click launches the App - a long click gives you 3 Options:<br> #1 Go to the App details<br> #2 Open the App in Google Play<br> #3 Open the App as a Notification for FAST access at a later time<br><br>The App is GPLv3 - you can find the source on GitHub: https://github.com/ligi/FAST<br><br>Big thanks to http://github.com/jfreax for his contributions!<br><br>Tags ( sorry but otherwise this tool is hard to find ;):<br>opensource launcher search apps free easy simple fast small GPL github  super ultra uber mega speed launching applications notification appsearch app-search quick productivity launch time saving power user java github open source home replacement', 'summary': 'Launch Applications fast and for free with a small App that needs no permission!', 'summaryHTML': 'Launch Applications fast and for free with a small App that needs no permission!', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.16, 'ratings': 750, 'reviews': 363, 'histogram': [127, 15, 7, 60, 540], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '74k', 'androidVersion': '2.3', 'androidVersionText': '2.3 and up', 'developer': 'ligi', 'developerId': '5229070112536767347', 'developerEmail': 'marcus.bueschleb@googlemail.com', 'developerWebsite': 'https://plus.google.com/108684152853280523320', 'developerAddress': None, 'privacyPolicy': 'https://raw.github.com/ligi/FAST/master/PRIVACY.POLICY', 'developerInternalID': '5229070112536767347', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/ARGbF67gajWMpzaVD3g2AgSWJe70yHRczeDrbMACu3J8CCnMryEGwcIsv6MAoIaZsoc', 'headerImage': 'https://lh3.googleusercontent.com/4XhYDF32iyg2NPXTiMlqeQHrN4M2MSXdv_ObPNrpWcOMSvnil9AoxeAXnhFJv6Mwba8', 'screenshots': ['https://lh3.googleusercontent.com/hy3dDgCBbOEPOoZY6dSij8q1cXeqlOgGoht9905wwmKxO0oOQh-vvXVtqRKD0_h1uSqK', 'https://lh3.googleusercontent.com/Ap8fqarJFvr3rxFKDOjOv56jm5ibTHylNHVJY8_9XIremOzrqsRz8k1EmNeIST7eqcqT', 'https://lh3.googleusercontent.com/Rr2K5uDIM-ECQECus8r6TicAYpW1NrFbT0QKYeRhp_zAefzlGCGzfUSzQ9NoNayRfEs', 'https://lh3.googleusercontent.com/6bpf__UkCtOrAk3LZj-oxFlR_7ou_QPHHoEkQImfuCV-4ETo9kYsheE7kQVkXP0xbA', 'https://lh3.googleusercontent.com/U33RGU5fOMVontgMsKC-bIc0x6jG7ozlpg_P0BGrssJWXO9BvzGxsm0Qv587jHZPkPM', 'https://lh3.googleusercontent.com/YUm4FSPVhqXdvSvziM7bz7qrXvCuzc6tiksBQs9LJeNCrD_8vzkDB8ROcPvGi0rDkg', 'https://lh3.googleusercontent.com/eOe-MBXppfgSB5_t6P30ROTJYPW14Lh_CI8Rfkb6vGb9o_HRzaWl2ICX29FT889Yd48', 'https://lh3.googleusercontent.com/SglVIF5E3uG70KEWs54918C3p2gPjTk3hE5pTEgBkqkEQplaAOiYvQceSDg9j1iXKiNL', 'https://lh3.googleusercontent.com/dg3RBPcb1wr1nXF67hES29A1j8JErHuUxUjzHVhrxg5G4UYKjXuRnimMSp_4TWZQP8w', 'https://lh3.googleusercontent.com/2gv1w2QluAdADxeFBBJaVHdqCyQ7x8uvwpC0T3JChmIykrmNhD27q3XmFSfOEmvfiV8', 'https://lh3.googleusercontent.com/2mm1naeBXas5AeYdC7STgwd-OG3ur_IePMT5L1hq07zl2itoaKh1UEAU-t909RH_fw', 'https://lh3.googleusercontent.com/NNNr0nFlDHUsOAo3FPY9h5Oc5t1uWUuIiFo0pYKCOydaOZQ7LwcxHPBak5d-mtoKo0M', 'https://lh3.googleusercontent.com/Be7sVQTKT1mm6JY0Kv6B4d-tZv57hU-fZcLOXFMD-PApaakKLxYZCMwRmf6kU2TyHA', 'https://lh3.googleusercontent.com/5wc7j02Hzs6JXJ5OUxVfgWUg2H_STeURClb5F7SzJBfxpadg1zo1eesMrjm3C3AL480'], 'video': 'https://www.youtube.com/embed/090bIEiedaQ?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/090bIEiedaQ/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Aug 11, 2012', 'updated': 1505384651, 'version': '6.7', 'recentChanges': 'Pinning, aliasing and bugfixes - thanks to SebiderSushi\r\nAndroid-O support - thanks to cketti', 'recentChangesHTML': 'Pinning, aliasing and bugfixes - thanks to SebiderSushi<br>Android-O support - thanks to cketti', 'comments': ["The fastest tool of you have several hundreds of apps, and need to search by package, app, etc. name, with partial matching. If it doesn't work, just make sure to clear cache because it may not pick up recent app installs or updates", "Good App. I really enjoy using it. How about an update please? There is a need for extra app sizes. Also need some more sorting options, ie another page to sort by type, SMS another with favourites, etc. Let's talk please.", 'very good! i like it a lot! fast, good overview, no bugs yet detected! a few more options for app sort would be great like recent and recent plus usage. and more options for icon display... great app, thanks a lot!', "great app faster to search your apps in case you have more than 60 of them installed like me . you need to wait for some while when you install a new app as fastapp won't be able to index it immediately.", 'very nice one but i needed the search box to appear at the bottom , there is no option to customise thst unfortunately. pls look into the possibility and incsn keep this. else this is of no use to me on OnePlus 7 which comes with a search in app drawer already', "It,s very Usefull !!! When my phone is error , i can't see app . But i can see playstore . I download this then set the theme as default. I can see all my app. Thank You FAST App Search Tool", 'Awesome app but please add T9 mode also. Thanks.', 'Very helpful quick search for finding that one certain app on a crowded device. Great! 5 stars', 'Excellent app. Good sittings for search. Thanks a lot!', "Best ever designed app to search for apps especially in MIUI since it doesn't come with a search option", 'amazing. this app does not need any permission. works flawlessly.. awesome...', 'spam it lets you search apps but it removes your home screen', 'this is awesome app ..i like this app very very much ..nice nice features', 'perfect app, low memory good performance', 'simply useful; thumbs up!', 'super app!!!. like it so much', 'This is a piece of work, not good! Not a help!', 'bad app.difficult to find any specific app.', 'waste app. app is misbehaving', 'Like this app', 'Just what i need…', 'Well done dev👍👍👍', '1,2,3,.. Fast!!', 'Love it all...thank you', 'too hard to use', 'Want to find everything', '.......................……………………………...........mmm ..............nothing to say..... n..... not sure', "Marcus, I think this could be the beginning of a beautiful friendship....  If not, we'll always app paris..  Write to me at Ricky's Cafe Americon   I didn't mean to take it this far, bad movie puns are in my DNA... but everyone loves Casappblanca and I'm sure everyone will love this app. Maybe not today, maybe not tomorrow, but soon,,,and for a very long time 😉  I'm not going to remember writing this.", "Uninstalled fast finder, i am using it now. fast compared to fast finder as well as works better. & Just look at the size.., free, no ads, small & fast ..Simply what I needed. Two suggestions-...1_ it doesn't detect a newly-installed app instantly (maybe would detect later but didn't check). I have to force stop it or clear off from memory to make it detect..2_it doesn't show shortcut on home screen, detects only main app's icon. .. One more_ when icons are sorted by installation time, it does so in ascending order, it should do so (or should provide option for both) in descending order.", "This is easily the best app search tool I have found. Admittedly, all it really does is take the Search Apps text box and repackages it into a simple icon and adds some features, but that is very handy. It offers a simple user experience. It displays and searches through all the apps on your device. You can set it up so that it displays a lot of very small app icons. I've set mine to display the maximum (105 applications on a single page). You can set it to either have a keyboard hidden until you use it or open automatically depending on how you want to open your apps. It can be set to launch apps automatically. And it closes automatically once you've opened an app (i.e. it doesn't continue to run in the background). Theoretically, you can have a home page with this one app on it and still get to everything. There is no lag, and there are no ads. This is as close to using a folder-less system for apps as you can get. And I almost forgot to mention, it's very FAST.", "Has huge potential but sorting apps by usage doesn't work as forgets usage sort order & randomly sorts unused apps to top. Search sometimes doesn't list apps when searching or after app installs (force stop temporarily fixes this). Otherwise has great search & function as a launcher. Future improvements could include option to increase/decrease an app's sort order, arrow navigation keys (helps select apps without reaching for top of screen), hidden apps list, & app-locking.", 'I m using lenovo a7000 running marshmellow....i was facing issues when i was using lenovo launcher ,huge battery drain was tgere....but at last i have debloated it and installed your launcher and my battery doesnt drain much now....i also has 30% battery damage in my phone.....so i just think off lite apps which use less resources when compare to others....thanks for being part of my apps list....thanks developers for developing this app....', 'KIWIX APP IS NOT VISIBLE . KIWIX APP IS ALREADY INSTALLED I CHECKED IN \nGOOGLE PLAY STORE BUT NOT VISIBLE IN THIS APP', 'If works well, but sort by usage is broken and has been for a long time.', 'Please add property to add icon to home screen and change icon pack.. Also it do not store the setting to file so as to pull incase of reset', 'By Usage records are intermittently lost unknowingly.', 'Good but first letter should be given more importance rather than matching \nit in the middle of a name and results should beshown about the first \nletter first (eg - C for chrome, camera)', 'Thanks for giving android app search a new life. Geniusly done. Very light on resources. Two thumbs up. I like the auto launch option', "This tool saved me from folder hell. Type to run is so insanely simple and \nintuitive! And it's FOSS! <3", 'Amongst the best search tool. Lite and has transparent theme to blend with \nthe Ui of the phone. Currently using it on Redmi N3'], 'appId': 'org.ligi.fast', 'url': 'https://play.google.com/store/apps/details?id=org.ligi.fast&hl=en&gl=us'}
