{'title': 'AtmosphereLogger', 'description': "This app logs atmospheric pressure by using device's barometer.\r\n\r\nThis needs device that has pressure sensor.", 'descriptionHTML': 'This app logs atmospheric pressure by using device&#39;s barometer.<br><br>This needs device that has pressure sensor.', 'summary': "Logs atmospheric pressure by using device's pressure sensor", 'summaryHTML': 'Logs atmospheric pressure by using device&#39;s pressure sensor', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.61, 'ratings': 226, 'reviews': 129, 'histogram': [38, 20, 29, 40, 97], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '495k', 'androidVersion': '3.0', 'androidVersionText': '3.0 and up', 'developer': 'lllllT', 'developerId': 'lllllT', 'developerEmail': 'lllllT-al@tamanegi.org', 'developerWebsite': 'http://www.tamanegi.org/prog/android-apps/atmlogger.html', 'developerAddress': '4-7-24, Kamiaoki\nKawaguchi-shi Saitama 333-0844\nJP\n', 'privacyPolicy': None, 'developerInternalID': '7532817148458991099', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/57iJ8AqDvO-KHe4I6g69UQE8qrzSADfUjVeKjLFO9Gk9fuXb0iQOK_py3LjQOlZi', 'headerImage': 'https://lh3.googleusercontent.com/i2eWuHy-cGJTmV-fHem7R-k1yJlHEz433oRmh03HAeZTpzml1WWmEjQkxufFIT_pqZs', 'screenshots': ['https://lh3.googleusercontent.com/10Aw23of596iR5YU_PMI6QufqDKL6yACDs-2M9BvAQ5EAl3nG83qubfr6Y9IqLNvRyvb', 'https://lh3.googleusercontent.com/dTQQDltyPnnYRIjNiTJ7tsC_cuWgVKJQFLs2pFU0OcySiV5rT3ry3f_aTaYsPG5Oqw', 'https://lh3.googleusercontent.com/xcmtInO5_wCgXO1eeBPLP577X9HwHaLVCf0vDyvJFL_jRacvvrLh9z9yb5MB_frDsTw', 'https://lh3.googleusercontent.com/H9Q4bmZggiD-3yDlrhAF5qNPvKce8avtmS0flsoExSEr8M06FqsJ3PQs5qmMo9aCovQ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 19, 2011', 'updated': 1541932769, 'version': '0.2.3', 'recentChanges': '* Added exporting feature\r\n* Fixed some problems', 'recentChangesHTML': '* Added exporting feature<br>* Fixed some problems', 'comments': ["This app has potential - clear graphics - but no data is displayed. I tried a reinstall with no luck. There are few options and no help. So... there are other similar apps that work, and I'll uninstall this one. (using galaxy s7).", 'it would be nice if the colors and interval were changeable. but it does what it says on the tin', 'Great app! Would be nice if displayed a real time value.  Would be cool to be able to zoom in on graph.', 'Great app, very clean interface, no battery drain.', "the graph colour and line is so light and fine it's unreadable", 'This app does not Log data on my phone. Seems useless, anyone help ?', 'Very hard to see.', 'I find this the best Barometric pressure app that I have tried. No noticeable impact on battery life! Wish there was a widget to quickly glance at the trends on the home screen without opening the app and a numeric display of the current pressure.  Hope the developers continue developing it.', 'Sony Xperia Active with Android 4.04. Free, no adds, simple, clear., highly readable even on my tiny screen  It is just a barograph displaying the raw pressure sensor data. X and Y axis labels and grid lines are clear and well spaced. It is possible to move on the graph to see past recorded values. Reasonable foot print: SD storage: 2.1 MB, internal storage almost nothing, cached process memory 2.3 MB. The application intermittently and randomly stops recording hence 3 stars. If this was fixed, 5 stars', 'Nice app and seems to log fine, but please make the charts zoomable as one can not see details and exact hours now. Thank you!', 'It logged perfectly for 13 days but the graph remains blank after that.', "Still massive amounts of noise on the graph. How often is is logging anyway? It doesn't seem to be stated anywhere!", 'no export data.pour interface.no calibration menu.have 2 screens to show same data.use space to show temperature and humidity at the same time.till no without calibrations(for all sensor) is no use.', 'And wrks good. What else do I need? Can see when I go to subway or fly plane =)', 'Needs options to change theme...very hard to view data in strong light....please add this as well as abilty to change polling periods.', '+простенькая и маленькая программа. +батарею не ест. -нет черного фона. -нет коррекции по геоположению. -очень мало настроек. -виджетов нет.', 'Very good , but wish the line colour was black', 'Tryed them all for me this is the best.', 'Great app thx', "Other similar apps that I tried would stop measuring every now and then for no apparent reason. This one just works, no matter what. Very lightweight, doesn't eat the battery. One tiny thing could be improved though: I wish there was a possibility to have dark background.", 'A simple clean app, it just works. You could wish for all sorts of things, but then it would be bloated slow and less useful.', "Appears to be a great app. Have been running it for about 20 days. Accurate recording of recent depressions, expecially last night's howler. Does not seem to be too battery hungry. It would be superb if there was a facilty to download the pressure log.", "Seems quite good: reasonable permissions, doesn't stomp on battery, and displays data clearly. But, there is no export of the collected data. This seems like snatching defeat from the jaws of victory.", '+ runs in the background + very low battery usage   Is there a way to export graph data? Taking a snapshot is very crude.', 'Nice app. As spurious lows hamper the autoscaling a manual scaling system would be a great  improvement.', 'Best barometer app out there but bottoms out every time I restart my moto x. Otherwise the app to beat', 'Please add an option to save the logs in any data format which could be opened in excel. Comma separated text file would be perfect.', "Tracks pressure beautifully, but needs sample frequency setting, because it's massacring my battery life.", "Simple and smooth UI, doesn't affect my battery too much. I would love an option to zoom in !", 'Please add current pressure indicator in digits.', "Doesn't work.", "The measurements are plotted, but can't get the raw data.", 'Best one so far, but I need the option to specify the log interval and also specify the max log period.', 'Does exactly as required, never crashes and uses next to no battery power', "Only improvement would be ... Make the scale adjustable. That's it. Nothing else.", "It doesn't affect battery life as well.", 'Great! Simple. Logs days worth of data. Easily see trends changing.', 'Export would be nice', 'This nice app shows jumps in the pressure because as i commute to work and my altitude changes.... just as it should!  A few hundred feet is significant', 'Делает ровно то, что надо. Батарею не жрет. Если сделают график удобнее для просмотра, вообще цены ему не будет.'], 'appId': 'org.tamanegi.atmosphere', 'url': 'https://play.google.com/store/apps/details?id=org.tamanegi.atmosphere&hl=en&gl=us'}
