{'title': 'MultiPicture Live Wallpaper dn', 'description': 'This is donation version of MultiPicture Live Wallpaper.\r\nFeatures are completely same as free version.\r\nUse free version first and check what can do, or what can not do.\r\n\r\nShow different pictures for each screen as Live Wallpaper.\r\n\r\nTo Use:\r\n[Home] > [Menu] > [Wallpaper] > [Live Wallpaper]\r\nor create and open shortcut to "MultiPicture Live Wallpaper Setting"\r\n\r\nFeatures:\r\n* Show pictures from gallery\r\n* Show pictures from folder\r\n* Show pictures from Web album (need plugin)\r\n* Change picture by double tap\r\n* Change picture by time interval\r\n* Transition effect\r\n\r\nNOTE:\r\nThe scrolling depends behavior of the Home application.\r\nIf scrolling does not work or something strange, try to change workaround option.\r\nOr check Home app\'s settings too. (such as wallpaper scrolling enable/disable, overshoot of scrolling, etc.)\r\n\r\nNOTE:\r\nThis does not works properly with home application of the Galaxy S series (ICS) and the HTC Sense 3.X.  Because these home applications does not notify right screen position.\r\n\r\nThe source code, the plugin interface and previous versions are available from web site.', 'descriptionHTML': 'This is donation version of MultiPicture Live Wallpaper.<br>Features are completely same as free version.<br>Use free version first and check what can do, or what can not do.<br><br>Show different pictures for each screen as Live Wallpaper.<br><br>To Use:<br>[Home] &gt; [Menu] &gt; [Wallpaper] &gt; [Live Wallpaper]<br>or create and open shortcut to &quot;MultiPicture Live Wallpaper Setting&quot;<br><br>Features:<br>* Show pictures from gallery<br>* Show pictures from folder<br>* Show pictures from Web album (need plugin)<br>* Change picture by double tap<br>* Change picture by time interval<br>* Transition effect<br><br>NOTE:<br>The scrolling depends behavior of the Home application.<br>If scrolling does not work or something strange, try to change workaround option.<br>Or check Home app&#39;s settings too. (such as wallpaper scrolling enable/disable, overshoot of scrolling, etc.)<br><br>NOTE:<br>This does not works properly with home application of the Galaxy S series (ICS) and the HTC Sense 3.X.  Because these home applications does not notify right screen position.<br><br>The source code, the plugin interface and previous versions are available from web site.', 'summary': 'Show different pictures for each screen as Live Wallpaper.', 'summaryHTML': 'Show different pictures for each screen as Live Wallpaper.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.87, 'ratings': 553, 'reviews': 313, 'histogram': [94, 16, 44, 110, 287], 'price': 1.99, 'free': False, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '288k', 'androidVersion': '2.1', 'androidVersionText': '2.1 and up', 'developer': 'lllllT', 'developerId': 'lllllT', 'developerEmail': 'lllllT-mpl@tamanegi.org', 'developerWebsite': 'http://www.tamanegi.org/prog/android-apps/mplwp.html', 'developerAddress': '4-7-24, Kamiaoki\nKawaguchi-shi Saitama 333-0844\nJP\n', 'privacyPolicy': None, 'developerInternalID': '7532817148458991099', 'genre': 'Personalization', 'genreId': 'PERSONALIZATION', 'icon': 'https://lh3.googleusercontent.com/0rdiitflNOsnDhQT_9Mbsa0dLQka7GFRJ90E2t6fm8jB2sFjB7NmpJZYRZcKA5PZwOQH', 'headerImage': 'https://lh3.googleusercontent.com/Q79dXJZ4pIrP09H1E_rxJvGWrOF-QUQOp56NFLI0eDjHkLn7Tv3411qiG1j-uRewYP8F', 'screenshots': ['https://lh3.googleusercontent.com/JwQYtz1o6qGY-e2I2ADkqcPGuF51mL3Nya2ClB-Drq1ugmLgroXlmt0Vbq-fHmHkFB0i', 'https://lh3.googleusercontent.com/KO75iD-a71sUDuuH7P8KglfqcSOznpX54diDhB9nUSahW7UwkVfTtAREdiymllu16PE'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 22, 2011', 'updated': 1360457935, 'version': '0.6.11', 'recentChanges': 'v0.6.11:\r\n* adjust default settings\r\n* add READ_EXTERNAL_STORAGE permission to read pictures\r\n* add xxhdpi resources\r\n\r\nv0.6.10:\r\n* Add workaround option for ICS MR1 tablet\r\n\r\nv0.6.9:\r\n* Adjust workaround behavior for ICS tablet\r\n\r\nv0.6.8:\r\n* Improved low memory case\r\n* Adjusted layout\r\n\r\nv0.6.7:\r\n* Reduce memory usage for some devices\r\n* Fixed some problems\r\n\r\nv0.6.6:\r\n* Adjust display timing when loading\r\n* Improved image quality\r\n* Fixed error\r\n\r\nv0.6.5:\r\n* Add color depth option\r\n* Adjust for Android 3.1 Launcher', 'recentChangesHTML': 'v0.6.11:<br>* adjust default settings<br>* add READ_EXTERNAL_STORAGE permission to read pictures<br>* add xxhdpi resources<br><br>v0.6.10:<br>* Add workaround option for ICS MR1 tablet<br><br>v0.6.9:<br>* Adjust workaround behavior for ICS tablet<br><br>v0.6.8:<br>* Improved low memory case<br>* Adjusted layout<br><br>v0.6.7:<br>* Reduce memory usage for some devices<br>* Fixed some problems<br><br>v0.6.6:<br>* Adjust display timing when loading<br>* Improved image quality<br>* Fixed error<br><br>v0.6.5:<br>* Add color depth option<br>* Adjust for Android 3.1 Launcher', 'comments': ['So far so good.  I have been using this app for a couple years.  Glad the picasa plugin was fixed.  This app was down for a while until the picasa authentication problems were resolved.  My one gripe on this app is that it does not correct the portrait/landscape mode of the picture or let the user be able to adjust it if the app does not know how to adjust.', "This app is the epitome of personalisation , this app is Android. A lot will say the fact that you can root the phone and a few will say installing a different rom. In the end everything that we insist that represents what we like cones under customising your phone and for the majority this app speaks volumes. I can't to rhe life of me understand why Google didn't do an app like this and even more confusing is why no one hasn't picked up this app and started updating it. Don't change it maintain", 'Excellent!!! I made the donation just to show my gratitude and support.Hopefully,with good enough money,the developers can keep coming up with something good!!! This App works well with my Lenovo K3 Note, Android 5.1!!! But it\'s not showing Multi- Pictures on Android 9!!!Do something about it???(Also,I really think this App should just be known as "Multi-Wallpaper",instead of the long name with the word "Live",because it doesn\'t provide Live-wallpapers and can\'t set one!!!)Anyway,Thanks!!!', 'used for several years and had to uninstall picassa plug in now that app no longer on Google play i paid for this wallpaper and cant use it. have tried to get help im done asking for refund used app for last 4yrs at least last update now app junk told to upgrade pay donation that would fix it now its worthless.', 'Fantastic live wallpaper app. have been using it from almost day one of its original release on the play store. still have not found any other app that does the same as well as this.', 'Easy setup. Cropping/sizing works well. True color option yields vivid, lifelike photos!', "Hasn't been updated in forever and hasn't worked in forever. Looks abandoned anyway so don't bother.", "It just stops working and can't find it anywhere on my phone. When going to the app store to download it again it says that it is installed.", 'love it. would give 5 stars but for some reason I cant find the app on my phone. I have to use the widget if I wanna change something in the app', "I can't seem to figure out how to change my individual screens. I've tried several times. I wish I hadn't made the donation, now I feel ripped off. What a bummer.", 'Soooooo cool! Love it! Cool transitions too!', "why my huawei nova 3 don't change photo after swipe the screen? it works well on my oppo a71.. why???", 'Very nice application, I always use it .', 'it still works on my new vivo 95 but differently , why no updates till now ?', 'Thank you so much for making this app family library compatible. I love this app!', 'using this since 6 years, never gets old !', 'Used to be great. Abandoned app.', 'Best app I have', "I like this app because it takes my gallery pictures and turns them into a live wallpaper slideshow. One thing I wish it could do with the random is not repeat the same picture till the whole folder with the pictures have been gone through. Sometimes I see the same one not long after it changes to the next. There are some pictures I haven't seen but once and others I see all the time. Needs to be fixed.", "I'm using Stock Android Jelly Bean: 4.1.2 for the LG Optimus L3 II E430. The live wallpaper works perfectly fine for my little phone. I do have Apex Launcher Pro installed. To make this work, I had to go into Apex Settings > Homescreen Settings > Wallpaper Mode. In Wallpaper Mode, select: 'Multiple Screen (scrolling).' // Also, if this works but it seems unstable, go into EDIT of the live wallpaper and disable Transition Effects. Hope this helps. Always liked this live wallpaper. Brilliant stuff.", "I have been using donate version for a year. app work on android6,7,8. automatic detect add/delete picture in folder very versatile other app didn't have this feature. The transition effect only play crossfade other didn't work. On Android8 picture stretch bug when device reboot. fixed by go to Set As Wallpaper again. wait for improve update.", "Worked fine until latest update for android now it only shows that its not set up or needs reload. No matter what I try to do I can't make my pictures show up. Used to love this application now I'm wanting my money back.", 'Wish I could create a widget button or an icon on the screen to change wallpapers instead of the double tap setting (double tap gesture is normally used for many other features, so it gets confusing). Otherwise this app is wonderful... Highly recommend it more people can use it.', 'The basic function of randomizing images for the screens works. That way of selecting images seems to be the only way which results in images shown. Selecting individual images does not work at all and it yields a message "image is not available", which is plain rubbish. Spelling and wording are uncorrected, which strengthens the feel of unpolished software. There is a wealth of settings though so if you want the basic functionality, then you may find this perfect.', "Hi, first of all congrats to the developer, great idea, only app that covers everything in this domain. Unfortunately after buying the donation version I end up using the free version just because the paid version has bugs like after a while it kept saying please refresh or setup, but don't matter what I did it did not refresh. The free app works perfectly.I'm not saying don't buy the app cuz the developer deserves the money but use the free version,", "I've loved using this for several years.  Since Marshmallow,  there is a hiccup with picture display.  The picture set for screen 1 shows up on screen 2 after sleep or reboot.  Touching the 2nd screen sets the correct picture.  Maybe time to look at an update.", 'I keep both the donation and free version on my phone, so I can have different settings.  A potential feature would be to allow multiple "profiles" within the app so I can setup a background for cars, and another for planes, and another for Star Wars, etc.', "It used to work but it hasn't been updated in a very long time. I hate when I pay for unsupported apps.", "I used thus app years ago on older androids, (now on LG G5) and it still has a major flaw. If you had previously set a lock screen up in your phone's stock settings, this app WILL NOT OVERRIDE the current wallpaper you set on the phone =/ I donated to you guys. Any way to fix?", 'Edit: Does not work for Galaxy Tab S. I donated and received nothing in return :-(  Previously: Installed latest ICS upgrade for my Galaxy Tab 10.1 and MultiPicture Live Wallpaper Donation version isn\'t showing 5 different walls even when using those "Workaround for some home application" bullets. Assuming "For ICS MR1 Tablet" is the workaround for my tablet, well it doesn\'t work, neither does "Force 5 screens" nor any of the others. &gt;.&lt;', 'loved this app on droid 1,2,3 and Samsung Galaxy tab. however since i upgraded to droid razor max, individual picture screens have not worked no matter how I try. If they get a patch or fix this then the rate will get higher until then I give it 1 star.', "But would like some improvement please.  Picture source, when select album, please have option to select all / unselect all (and maybe better to have a black list of unwanted folders).  Add different picture for landscape?  For album, automatically choose portrait or landscape picture for different screen mode?  And also, I'm using the Nexus 7 (2012) with Android 4.3, Go Launcher.  After installing, the icon does not show in the launcher, not even in the app list, not even in search.  If I go to App in Settings, then I see it. I don't know if this is software bug or not compatible with Go Launcher.", "It doesn't show different pictures for my different screens on my galaxy s4. Would rate higher if problem fixed!!! Please fix it!!", "Worked MUCH better on my DROID razr.  Doesn't have a different picture for each screen for galaxy note 3. Would have been four stars but developer doesn't respond to email.", "I brought the full version, I love it. Only one error I can't see the app icon on my S8, please fix this and allow gif pictures too, cheers", 'Great app, which I would give 5/5 if a problem was fixed. Have set to show \nthe whole picture. My photos on my phone used to be all good, but are now \nshowing too large and sideways. Would be most grateful if this was fixed!', "This is definitely the most advanced, most sophisticated, and most complete wallpaper utility in the playstore. You won't regret learning how to use it.  Watch out for copycats or less functional versions.", 'It used to work very well on a galaxy ace, but it will only show one image on all screens even thoug its been cofigured properly on a galaxy s3 mini and galaxy s4 mini, they both have the latest android update.', "This app actually does more than the creator describes.  In addition to offering a different wallpaper (and so a different theme if you want) on every page you can customize each of those pages to change the background or not, how often and the appearance.  It's actually kind of fun having a different background on every page.  Never want your main page wallpaper to change?  The app can handle that.  You can pull backgrounds from multiple folders or just create a folder on your device with the pics you want displayed stored in it.  You can even use pictures you've stored online.  The app will fit the photo to your screen or you can let the app create a border with similar background color.  Works great on my Asus TF700 tablet", "This app allows you to set different wallpapers for different screens, to recursively search folders rather than forcing you to use the gallery or something like that, and perhaps most importantly, it allows you to set how the picture will be displayed so that you can avoid cropping and the like. This app is a definite godsend and well worth donating to.  I did run into some weird problems with my S4 where when I put in a new SD card, this app completely failed to ever pull pictures from folders on the SD card (though it working when setting a specific picture rather than a folder). But when I told it to use the Donation version instead of the normal one, the problem went away. So many there was just some installation problem or something (since the donation version isn't supposed to be different from the free one). I don't know. But it's working again for me, and no other slideshow wallpaper that I've seen in the play store comes even close to this one. It gives you great control over what gets displayed where and how it gets displayed. I highly recommend it."], 'appId': 'org.tamanegi.wallpaper.multipicture.dnt', 'url': 'https://play.google.com/store/apps/details?id=org.tamanegi.wallpaper.multipicture.dnt&hl=en&gl=us'}
