{'title': 'monerujo: Monero Wallet', 'description': "Monerujo is the first app for managing and using Monero wallets on Android. It is a lightwallet: it uses remote nodes for synchronizing to the Monero blockchain while keeping all your private data on your device. You can run your own node at home or connect to nodes provided by the Monero community - it's up to you!\r\n\r\nMonerujo is open-sourced (https://github.com/m2049r/xmrwallet) and released under the Apache License 2.0 (https://www.apache.org/licenses/LICENSE-2.0).\r\n\r\nWhat is MONERO? It is Private Digital Currency.\r\nMonero is a secure, private, and untraceable cryptocurrency. It is open-source and accessible to all. With Monero, you are your own bank. Only you control and are responsible for your funds. Your accounts and transactions are kept private from prying eyes.\r\n(getmonero.org)", 'descriptionHTML': 'Monerujo is the first app for managing and using Monero wallets on Android. It is a lightwallet: it uses remote nodes for synchronizing to the Monero blockchain while keeping all your private data on your device. You can run your own node at home or connect to nodes provided by the Monero community - it&#39;s up to you!<br><br>Monerujo is open-sourced (https://github.com/m2049r/xmrwallet) and released under the Apache License 2.0 (https://www.apache.org/licenses/LICENSE-2.0).<br><br>What is MONERO? It is Private Digital Currency.<br>Monero is a secure, private, and untraceable cryptocurrency. It is open-source and accessible to all. With Monero, you are your own bank. Only you control and are responsible for your funds. Your accounts and transactions are kept private from prying eyes.<br>(getmonero.org)', 'summary': 'The Android Monero Wallet', 'summaryHTML': 'The Android Monero Wallet', 'installs': '50,000+', 'minInstalls': 50000, 'score': 3.75, 'ratings': 494, 'reviews': 285, 'histogram': [118, 9, 24, 64, 276], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'm2049r', 'developerId': 'm2049r', 'developerEmail': 'help@monerujo.io', 'developerWebsite': 'https://monerujo.io/', 'developerAddress': None, 'privacyPolicy': 'https://monerujo.io/privacy-policy.html', 'developerInternalID': '8761512233687321159', 'genre': 'Finance', 'genreId': 'FINANCE', 'icon': 'https://lh3.googleusercontent.com/9k11icALvChXNUj3m2cOOq-1eP8ouqKQCTvO3xST-rZ5-_4BrBm8PGSKt8VNcKXINg', 'headerImage': 'https://lh3.googleusercontent.com/wZ4vrm2PtXjVxryMz5sJt8mqYNy3gJOgbVyrkadbsm2XgM4cCHulwW_x71zX8C7_lw', 'screenshots': ['https://lh3.googleusercontent.com/Mn1B7F9BuaMTUsXPoUzXl1SQX8_-mWZPY2qm8aEIek2u1YX_C-rRRwx8ZCvaI_UjrK8', 'https://lh3.googleusercontent.com/tPawik025Q89R279GWmpnkpjQoDPS5UOBkaCEJWaIrlpgsf6EfBJyv39XUEkzgUkud8', 'https://lh3.googleusercontent.com/fx44vBI7In7aaoLaA9-AV23rIRn0Dtt5DepkOVje9VJ9s5mlVx4C2aegcEPPrTKTGy4', 'https://lh3.googleusercontent.com/pKypagnglzq5_QXmBV6t2kFsAV7nr-EaXQ9phkGTp9QpgR78p8vj7lS67JVj9TC82qk', 'https://lh3.googleusercontent.com/vZms_dkMy-dnxJmXJWSvwc-FuOAgsA_AawjNsd6njFzPUV89w9Tq1F9ThALvkkPQfw', 'https://lh3.googleusercontent.com/6unL3odQU1DgbpVIBzpkkv-O8XX2RqUvNm2HryzT1MowsV1RnEBIzNXxKvDNj0t7bA'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 29, 2017', 'updated': 1583735741, 'version': "1.12.13 'Caerbannog'", 'recentChanges': '- Update restore heights\r\n- Minor bugfixes (restore height handling, crashing)', 'recentChangesHTML': '- Update restore heights<br>- Minor bugfixes (restore height handling, crashing)', 'comments': ['For two months all went just terrific. Receiving new Moneros, stacking up a little bit. Then my password became "incorrect". Monerujo\'s support team is also a bunch of smarty pants: Blaming the victim, they said I must have forgotten the password. Couldn\'t even restore there from seed. So I migrated to Cake: I restored my Monero wallet through my seed, the restore height & the wallet name. All FUNDS did get restored eventually. NOT thanks to the Monerujo developers, though. Be extremely careful.', 'The best Monero wallet. Very fast, stable and allows me to connect my own node.', 'UPDATE: after 24 hours the send function started working, no complaints now.', "Good but the app crashes a bit and doesn't always load nodes", "My only issue is during setup. Why can we not copy the Mnemonic seed and other pertinent information to the clipboard? I would say if I didnt have a cloud based secure password application that it wouldn't make sense, but to manually copy all that information is tedious and vulnerable to manual errors. If the problem is having that information in the clipboard a warning message should be sufficient.", "I put some monero in no problem. Now a few months later I login using my fingerprint and it wont let me send monero out , it wants my password and wont let me use my fingerprint as an option to send funds out. Even though I'm logged in I cant retrieve my seed from within the menus like I can in other aps so I'm stuck with some funds I can look at but cant seem to send out of the wallet.", "Can't recover wallet from seed, error message is: Electrum-style word list failed verification. Please correct this issue ASAP. Edit: Only way to recover is to enter the seed generated private keys (private spend key, view, etc). Please save all related keys before deleting the wallet.", "This app is incredible cosidering the lack of trustworthy and functional apps for XMR. I've send to it, send from it, morph-tokened to it and even used it to restore XMR sent to a freezing cold wallet that had never been used. It performed each task flawlessly.", 'To be honest, I find Monero to be a bit tedious to use. It was hard for me to find answers how to deal with my various keys and what not. I hated using the "F" wallet because there\'s no access to private keys. When I found this, I was overjoyed because it actually had a place for adding your keys and works off of the local device. It\'s EXACTLY what I\'ve looking for and I hope this wallet continues to live up to its promise. Only time will tell...', "Probably a good app, I wouldn't know. After installing I went into the nodes section and it said it was bookmarking the 3 best nodes. Then I went back to the main screen where it froze. I force stopped the app and went back in to see that it was frozen again. Uninstalled and reinstalled and still the same issue. Tried using my mobile data instead of WiFi with the same result. I don't understand how it works for so many other people.", 'Amazing how so many people are this technologically incompetent .... VERY basic troubleshooting is all it takes to realize that the app works perfectly fine, but only if you actually learn to update apps once in a while. Took me less than a minute to figure this out myself without complaining/whining... Everyone who was not able to figure out that all you needed to do was update the app to connect to a node should stay away from crypto, entirely, until they learn to fix something this easy...', 'True and tried. Great exchange w BTC. Great security with Ledger. Great team keeping app updated.', 'Great but still not noob friendly', "Very good wallet. I connected my ledger nano x for a while but the app is very very intermittent once it's connected and frequently asks to reconnect device. The app then either crashes or freezes. I'll be using the app but just not with the ledger nano x until there is a major update released.", 'Old review was outdated- so far the latest version works great. I just wish it explained what the permissions were for at first app open. some of my friends were scared off by that.', 'Best local crypto wallet I have found on android. Finally can use Monero on the move in a very easy to use format. Has all the features needed to keep secure and keep track of my coins. All I want now is easy onion node connections.', 'Simple, clean and efficient. I really like the design of the UI.', "Great UX and design that's both playful and powerful. Love the support for managing nodes, which is key for encouraging decentralization!", 'Great easy to use interface Monero wallet. Nice to have a little bit of my monero on my phone to spend whilst mobile. The remote node search feature is great, connects in seconds.', 'Its over a week I sent a 30usd equivalent to my wallet and it hasnt reflected yet. I have sent 7 mails to support and no help or feedback yet. If anyone sees this please review my case', 'This thing works smooth and nice for me. In fact, since monerujo exists, I never ever touched official guide wallet. Cheers!', 'do not use this wallet. remote nodes is the best eay to lose your coin. app isnt working properly anymore. theres no support so you cant even open a ticket. good luck if you decide not listen to me. you have been warned', "I used it to receive and send and it works flawlessly. Can't ask for better. So glad to have a trustworthy mobile wallet for XMR.", 'Just perfect. I wish it was more presented and encouraged to ise in media and web.', 'Simple, secure and trusted. Stay away from any wallet that has "free" in its name.', 'No longer works for me. I have my node but try to create a wallet or literally do anything and nothing, just that shrugging pixel guy in the background. Tried uninstalling and reinstalling.', 'would like to be able to specify tx speed, maybe multi sig, and when on tor, the wallet barely finds any nodes. other than that its a great app.', 'Great development team and product. Love how they keep making it better.', "It said my version was wrong, then I upgraded and it said my password was wrong, then I just couldn't access about $100 dollars of crypto. This is bad news. STAY AWAY!", 'Supports Ledger Nano S (selection will appear after it is plugged to your phone). Wish it supports Trezor T also.', 'Best mobile wallet i have used for Monero. They continually update and and pretty quick to respond when asking a question.', 'Require access to my photos. Not gonna happen.', 'The best Moneo app out there, including the GUI. Furthermore, works flawlessly with my ledger nano s.', "I created a second wallet because I could not get into the first one after setting my password. Now I can't get into the second wallet after setting the password for that one.", "easy to set up and use. make sure you keep your backup seed safe and don't forget your password.", 'Great wallet! Wish all wallets were this simple and stable to use... !!', "Says node version incompatible, please upgrade. I have tried multiple nodes. I'm assuming this app is a scam. I cannot access my funds", 'Great app for an awesome crypto project. So glad they finally added finger print unlock.', "seriously I have to write down seed!? Most will let you copy and paste backup seeds, some let you screenshot it. So, who has the time to write down all of the seed!? Yeah you have to write down almost everything. It's not convenient.", "Please include all countries currencies. I can't see my country currency. I love the app so much. Add country currency like my country Nigeria (NGN) and more, then I will add the star to 5🙌🙏🙏"], 'appId': 'com.m2049r.xmrwallet', 'url': 'https://play.google.com/store/apps/details?id=com.m2049r.xmrwallet&hl=en&gl=us'}
