{'title': 'Tickmate', 'description': 'Tickmate is basically a one bit journal. For each day, you can specify whether something occurred or not. The occurrences can be arbitrary things, like flossing your teeth or having a drink. You are able to quantify your habits and the accumulated data can be displayed for the past weeks or months to track changes over time. This way, it may help you to get over your old habits or embody new ones.\r\n\r\nTickmate is open source, GPLv3 licensed software.', 'descriptionHTML': 'Tickmate is basically a one bit journal. For each day, you can specify whether something occurred or not. The occurrences can be arbitrary things, like flossing your teeth or having a drink. You are able to quantify your habits and the accumulated data can be displayed for the past weeks or months to track changes over time. This way, it may help you to get over your old habits or embody new ones.<br><br>Tickmate is open source, GPLv3 licensed software.', 'summary': 'Tickmate is a one bit journal to keep track of arbitrary occurences.', 'summaryHTML': 'Tickmate is a one bit journal to keep track of arbitrary occurences.', 'installs': '1,000+', 'minInstalls': 1000, 'score': 4.47, 'ratings': 107, 'reviews': 48, 'histogram': [2, 2, 11, 18, 72], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.2M', 'androidVersion': '3.0', 'androidVersionText': '3.0 and up', 'developer': 'Hannes Gräuler', 'developerId': 'Hannes+Gr%C3%A4uler', 'developerEmail': 'hgraeule@uos.de', 'developerWebsite': 'http://github.com/lordi/tickmate', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5374040932524684619', 'genre': 'Lifestyle', 'genreId': 'LIFESTYLE', 'icon': 'https://lh3.googleusercontent.com/mtzV1klAlAyLJvul3Tl_16t8LIuHYGeRwhOH83BnVlQhJs2OZg6IRM90yKa-o-X5UFk', 'headerImage': 'https://lh3.googleusercontent.com/SfBqlDWP5GPx7l5RHyQjZWuVql5dcrmSYEugkv7lmwM3Fk6e7X2XM2SmC0_BdBARIbw', 'screenshots': ['https://lh3.googleusercontent.com/kbTUpEsenyMyD4SL9mMcEYAbhkCAqEb4TKQnG342xuQmSLrOHtAxyj2KKU7mfvLocWk', 'https://lh3.googleusercontent.com/AkDQtrTbkZbXiBP7m73IIpd61HLbLFdCddPniNF6gF1hGUJhwCo1zR3O_HdrwrC8og'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 13, 2014', 'updated': 1505035762, 'version': '1.4.6', 'recentChanges': '* User can add daily reminder notification', 'recentChangesHTML': '* User can add daily reminder notification', 'comments': ["I love this app, it gives me the data in exactly the way I want it. But now I was just editing some tracks, it crashed and isn't opening anymore. I'm really worried that several years worth of data are lost. How can I get the data back??", "Great app, simple and effective. For me it works better than other, more complicated goal trackers. One feature which is missing ia setting the week to start on Monday. If it gets this feature, I'll give 5 stars!", "Interface is ancient. Looks like it's a dead project now.", 'just tick. now i know all about my habits', "Really hope this app continues to get updated. I'd like to see more icons from which to choose (even though there is already a reasonable amount of them). I find the app to be unique in it's simplicity and effectiveness in tracking habits that happens multiple times a day. You want to be aware of how many coffees you really are buying per months? All you have to do is quickly open the app and make one click. The app will count the occurrences over time for you to reference back. Easy enough so you will stick to it!", 'I have returned to this app year later. Still good as always however I worry that if this app gets removed from the store or something of the sort I would not be able to open the databases again and my tracking would be lost. I think being able to export databases to other formats (csv, txt) is desirable.', 'I keep track of my good and bad habits, medication, mediation, perspiration and procrastination. Works great on Android 6, 7 and Cyanogen 12. Open Source. Database is portable too!', 'Nice', 'It is super simple and I like it for that. While most of the trackers of the kind focus on adding bunch of features, turns out one-bit colorful buttons are all you really need. I also liked the default selection of trackers; doing my best at making someone smile everyday since I have installed the app (:  Only thing that is a bother for me is that relocating trackers in the tracker list is inconvenient. To move a tracker just one position down or up, I have to long-press, then tap. Doing so five times in a row is quite a patience test.', "The UI is pretty ugly and no widgets is lame too. This app also moves through screens with a delay on my phone. However, I really like that you can easily pick an activity (presets and make your own) and easily track everything from if you worked out today to how many beers you drank. I'd pay for this if it had a material design UI and a widget that lets you quickly check a task", 'This app has a very simple UI and no distractions. Just the kind needed for habit tracking.', 'Great! Simple and exactly what I was looking for.', "I use this app every day, to track around 20 events. The app itself is a shining example of software. It does one thing very well. Updates consistently improve the user experience, without adding bloat or breaking the user's expectations.", "I didnt expect to find an app which would do what I was looking for. Count and track events. I didn't know what to search for as the results were giving me habit building apps or  counters. Then i read tickmate name in readme file of another habit app. If only there was a way for the developer to make this app more discoverable. Nice work man.", "Tickmate does only one thing and is best at it. Nothing else, not even an attractive UI(compared to others). This is what productivity is all about, where it's not the app but its utility that matters. Best productivity app I have ever used.", 'Does what you need, but would be better if it counted streaks and had more colours. Needs to scroll horizontally at some point instead of tracks becoming unusably narrow. I found a bug: if you try to record a multiple-entries-per-day track on a day in the past that is the same day of the month as the current day, it will instead be recorded for today. Took me a while to work out what was happening.', "The app's features are great however the interface is too old. If you update it's interface to material design, I'll be happy to pay for it. The multiple entry feature is fantastic. And add widgets too please.", 'Exactly what I need and nothing more', "1 -None of the locking options work. They did, then they stopped.  2- Constantly doesn't start with today at the top means I add ticks to previous days unless I'm very careful. 3- widget to update today's ticks quicker on the go would be handy!", "I appreciate the great idea. Thanks you fixed the bug. 👌👏. I'm looking forward to a simple widget for that day's entry.", "Nice, simple, interface to tick off whether you're adhering to your goals. No unnecessary permissions is an additional bonus.   The only grouch is, and I feel I am not being very gracious here, that there is no option to transpose the goals into rows and the days into columns. The tick-off buttons get a wee bit narrow if one is tracking more than, say, six goals.   Five stars, nevertheless.", 'Great simple app, would be ideal to have it as a bar on my home screen so I see it more regularly to remind me to use it!', '"Could not create external storage" :( also, can there be a widget feature? As well as rearranging the order of habits :)', 'The UI gets really crowded if you have a lot of tracks. The deus should add horizontal scrolling.', "Does what it's supposed to do, track stuff easily, draws useful graphs.  5/5", "Perfect for making sure I do certain things and limiting the number of times I do others. . The only thing I want is the ability to sort and organize the order after they've been added.", "I like it a lot.  I think it's great, and the new counting feature is fantastic.  Now all that I want is a backup and restore function and I think it's perfect", 'Does exactly what it says in a easy to use format', 'Good idea', 'I just need a widget and its complete!!!'], 'appId': 'de.smasi.tickmate', 'url': 'https://play.google.com/store/apps/details?id=de.smasi.tickmate&hl=en&gl=us'}
