{'title': 'RPN calculator', 'description': 'RPN is a four function calculator designed to replace the standard Android calculator. It features large buttons designed for easy touchscreen use. It operates using Reverse Polish Notation, uses high accuracy decimal arithmetic internally, and has a fixed point scrollable display.\r\n\r\nThe code is open source and available at https://github.com/lpar/RPN\r\n\r\nFound a bug? E-mail meta@pobox.com', 'descriptionHTML': 'RPN is a four function calculator designed to replace the standard Android calculator. It features large buttons designed for easy touchscreen use. It operates using Reverse Polish Notation, uses high accuracy decimal arithmetic internally, and has a fixed point scrollable display.<br><br>The code is open source and available at https://github.com/lpar/RPN<br><br>Found a bug? E-mail meta@pobox.com', 'summary': 'A simple touch-friendly RPN calculator with accurate decimal arithmetic.', 'summaryHTML': 'A simple touch-friendly RPN calculator with accurate decimal arithmetic.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.49, 'ratings': 230, 'reviews': 118, 'histogram': [9, 9, 6, 39, 165], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'ATH0', 'developerId': 'ATH0', 'developerEmail': 'meta@pobox.com', 'developerWebsite': 'http://meta.ath0.com/software/rpn/', 'developerAddress': None, 'privacyPolicy': 'http://meta.ath0.com/privacy-policy/', 'developerInternalID': '7266865637562557765', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/rtZPDT8_1u7kqJle5RguE0H-5oCGeoE9OxlPZVyNoftRt19Q9Q05kQCUv0MJJjhMPg', 'headerImage': 'https://lh3.googleusercontent.com/bow9Y09EhVasjTGaL4ng2deFYrdTXBrGQni07-mFKbfJSdvY8GsyHXb6AYS7v3Dof2g', 'screenshots': ['https://lh3.googleusercontent.com/6-cGvZH-aBZQZdFTH6pnmiC4WFDrsrFtQSwdH3Ngk538iUkB9aB2I0b-Cwk2SBsQWA', 'https://lh3.googleusercontent.com/jt2te4cJVR0RhPGK54AYZHJ64Cjj1Sqlci0LW445oSiPPZiCxnH7kI499sFS06wndXAr'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Aug 1, 2010', 'updated': 1375489693, 'version': 'Varies with device', 'recentChanges': '2.0.4 fixes a crash and allows raise to fractional powers.\r\n\r\n2.0.3 tweaks font sizes when system font size is "Huge", to avoid a layout glitch.\r\n\r\n2.0.2 fixes visual glitching on Galaxy Nexus running Jelly Bean (Android 4.1).\r\n\r\nVersion 2.0 added a redesigned Holo UI and requires Android 4 (Ice Cream Sandwich). It also added a square root function. Version 1.x is still available for older phones.', 'recentChangesHTML': '2.0.4 fixes a crash and allows raise to fractional powers.<br><br>2.0.3 tweaks font sizes when system font size is &quot;Huge&quot;, to avoid a layout glitch.<br><br>2.0.2 fixes visual glitching on Galaxy Nexus running Jelly Bean (Android 4.1).<br><br>Version 2.0 added a redesigned Holo UI and requires Android 4 (Ice Cream Sandwich). It also added a square root function. Version 1.x is still available for older phones.', 'comments': ['Minimalistic, nice design. 5 stars if it had EE button... and Rotate would be nice too.', "My essential calculator app. Those of us who know RPN use it because it's the easiest method to do calculations. This is a simple and straight forward basic RPN calculator app. Thanks go to the developer for freeing us from Algebraic notation.", 'This a straight forward RPN for addition, subtracting, multiplying and dividing. Big buttons and decent display. I like the simplicity.', 'Perfect minimalist calculator, great interface and graphic display.', 'nice big numbers. no reset, no scroll. starting to have problems with response time.', "Good app for basic rpn calculations. But you can't even enter a negative number, or do basic trigonometry functions.", 'RPN is the best. This app stays true to this notation. Very stable app!', 'The only calculator for me.', 'not a widget.', 'Have used RPN for 40 years.  Have looked at many Android RPN calcs and settled on this one primarily because of the great stack/history view.  Would give you five stars if it had a Roll button to scroll the stack.  Would also like slightly larger/bolder font on the buttons.  Not updated since 2013, really?  Too bad.', 'Installed it, loved it. Read on your web site about why RPN and why a simple calculator and I can just say "me too!". I used to have an HP48 emulator installed, which I loved until I hit the wrong (small) key, or the emulator itself hung (specially when this happened in front of a non-initiated friend who wondered what the hell I was doing with such a calculator). If only you could add two things to aim for "6 stars". I wish I could navigate up/down the stack, not just swap/drop (Maybe just tapping a line on the stack could copy it to the bottom). And I\'m also not crazy about the icon; I think it does not fit well with the dark, simple style of the app. But then again, taste is subjective.', 'This is the most elegant and easy to use calculator I\'ve found. That\'s saying something since I was 22 years at HP and still have half a dozen HP calculators in a drawer. The "SET DP" was not obvious but hey, what\'s my brain for? If it would ever rotate when I change orientation on my tablet it\'d be perfect. Thanks!', '"No frills" might sound like a criticism, but it\'s not. If all you want is a simple, easy to use RPN calculator with basic features and an uncluttered interface then this is the app for you. I love it.', 'I love the design! Very simple calculator almost perfect at what it does. Only thing: PLEASE move the enter button to the right side.', 'I used fancy HP rpn scientific calculators in school and work back in the day, and find RPN very intuitive. These days I only ever do basic arithmetic and this is the perfect simple rpn calculator for that.', "could you add 'DUP' to copy the top most stack? I know I can use copy and paste yet I think DUP is faster. Anyway, great app :-)", 'The square root button is not needed (it\'s just a matter of using 1/x and x^n)...you could replace with "%" which is really the only missing function! Please set the color to be theme independent or give us an option to choose. Great app! Thanks!', 'I am so thankful this app exists. There are too few people left in the world who appreciate the elegance and efficiency of rpn! This app creates a possibility to keep it alive.', 'Perhaps my only suggestion is to change the audio feedback to a soft click which can optionally be turned off (like how Free42 sounds).', 'It took me a long time to find a nice one. Well done.', "This is high quality! If you're looking for an rpn calculator this is the best choice!", 'I like it, simple and does what I want without excess or silliness.', 'Fast startup, enough features. RPN, my way.', 'Solid basic calculator. No permissions requires. One 4 stars + 1 star bonus for price.', 'Nice for those that want an RPN calculator.', 'No support for exponential notation', 'This is just such a nice straightforward simple everyday calculator!', 'Did I miss something? Where are the trig functions?', 'I have loaded this on every phone I have ever had.', 'Clean fast and simple RPN.', 'Does all the things I need.', 'Nice, simple calculator for those of us who like RPN.', 'Love it! Just what I needed for a quick Calc.', 'I like it', 'Its pretty simple and nice to calculate..', "So, I have RealCalc, which offers an RPN mode, but for the life of me, I can't understand why it duplicates your entry in both x & y every time you hit enter.  The result is that you have to remember to use an operator on your last entry, rather than hit enter and then use an operator.  So I went looking for a simple RPN calculator for my everyday (non-scientific) needs, and this one works very well for that purpose.  My rating of five stars is based on the fact that it serves the purpose it was intended for - a simple RPN calculator - very well.  It has a multi-line display, and <enter> behaves the way I think it should.  And it's free (open source, also!)  Thank you!", 'The thing I might object against is the placement of the enter button. I would have preferred it to be horizontal rather than vertical for easier reach. But that is a very minor complaint.', "This is a simple but effective multi-line RPN calculator. The simplicity reduces the key count and thus makes it easy to use on a small screen--unlike apps that are clones of HP scientific calculators. On my Galaxy Note II this isn't an issue, but I could see it being one on other phones.", "Would Be nice as a popup floating half-screenapp. as a full- screen, it's too big on the buttons,too small on the text.", "It has more functions but I really love RPN for basic arithmetic and that's good enough for me."], 'appId': 'com.ath0.rpn', 'url': 'https://play.google.com/store/apps/details?id=com.ath0.rpn&hl=en&gl=us'}
