{'title': 'Terminal Emulator for Android', 'description': 'Access your Android\'s built-in Linux command line shell. Unleash your inner geek!\r\n\r\nThis is a new version of the popular "Android Terminal Emulator" application. Same great program, just with a new name.\r\n\r\nTop Features\r\n\r\n+ Full Linux terminal emulation.\r\n+ Multiple windows.\r\n+ Launcher short cuts.\r\n+ UTF-8 text. (Arabic, Chinese, Greek, Hebrew, Japanese, Korean, Russian, Thai, etc.)\r\n+ Completely free. No ads, no in-app-purchases, no nag screens, nothing.\r\n\r\nQuick FAQ:\r\n\r\n+ If you are having trouble entering text, try installing the free "Hacker\'s Keyboard IME". (Especially if you have a Samsung or HTC device.)\r\n+ This app isn\'t a game emulator.\r\n+ This app won\'t help you root your phone or change your phone\'s IMEI.\r\n+ You need to know (or be willing to learn) how to use the Linux command line to use this app.\r\n+ You may want to install a set of command line utilities like "Busy Box" or "Debian chroot" in order to add commands beyond the commands that come built into your Android device.\r\n+ If you get a -505 error when trying to install this app under Android 5.0, it means that some other app is using the same permissions. You will have to uninstall the other app in order to install Terminal Emulator for Android. (People tell me that "jrummy\'s Toolbox Pro" causes this problem.)\r\n\r\nWant to know more about Terminal Emulator for Android?\r\n\r\nJoin the G+ community: #Android Terminal Emulator\r\n\r\nhttps://plus.google.com/u/0/communities/106164413936367578283\r\n\r\nOr check out the documentation wiki:\r\n\r\nhttp://github.com/jackpal/Android-Terminal-Emulator/wiki\r\n\r\nWant to add or improve a translation of Terminal Emulator for Android? See https://github.com/jackpal/Android-Terminal-Emulator/wiki/Translating-to-Other-Languages for instructions.', 'descriptionHTML': 'Access your Android&#39;s built-in Linux command line shell. Unleash your inner geek!<br><br>This is a new version of the popular &quot;Android Terminal Emulator&quot; application. Same great program, just with a new name.<br><br>Top Features<br><br>+ Full Linux terminal emulation.<br>+ Multiple windows.<br>+ Launcher short cuts.<br>+ UTF-8 text. (Arabic, Chinese, Greek, Hebrew, Japanese, Korean, Russian, Thai, etc.)<br>+ Completely free. No ads, no in-app-purchases, no nag screens, nothing.<br><br>Quick FAQ:<br><br>+ If you are having trouble entering text, try installing the free &quot;Hacker&#39;s Keyboard IME&quot;. (Especially if you have a Samsung or HTC device.)<br>+ This app isn&#39;t a game emulator.<br>+ This app won&#39;t help you root your phone or change your phone&#39;s IMEI.<br>+ You need to know (or be willing to learn) how to use the Linux command line to use this app.<br>+ You may want to install a set of command line utilities like &quot;Busy Box&quot; or &quot;Debian chroot&quot; in order to add commands beyond the commands that come built into your Android device.<br>+ If you get a -505 error when trying to install this app under Android 5.0, it means that some other app is using the same permissions. You will have to uninstall the other app in order to install Terminal Emulator for Android. (People tell me that &quot;jrummy&#39;s Toolbox Pro&quot; causes this problem.)<br><br>Want to know more about Terminal Emulator for Android?<br><br>Join the G+ community: #Android Terminal Emulator<br><br>https://plus.google.com/u/0/communities/106164413936367578283<br><br>Or check out the documentation wiki:<br><br>http://github.com/jackpal/Android-Terminal-Emulator/wiki<br><br>Want to add or improve a translation of Terminal Emulator for Android? See https://github.com/jackpal/Android-Terminal-Emulator/wiki/Translating-to-Other-Languages for instructions.', 'summary': "Access Android's built-in Linux command line shell. Unleash your inner geek!", 'summaryHTML': 'Access Android&#39;s built-in Linux command line shell. Unleash your inner geek!', 'installs': '10,000,000+', 'minInstalls': 10000000, 'score': 4.296109, 'ratings': 117691, 'reviews': 21638, 'histogram': [11561, 3212, 7627, 11700, 83587], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '551k', 'androidVersion': '1.6', 'androidVersionText': '1.6 and up', 'developer': 'Jack Palevich', 'developerId': 'Jack+Palevich', 'developerEmail': 'jack.palevich+market@gmail.com', 'developerWebsite': 'https://github.com/jackpal/Android-Terminal-Emulator/wiki', 'developerAddress': None, 'privacyPolicy': 'https://github.com/jackpal/Android-Terminal-Emulator/wiki/Privacy-Policy', 'developerInternalID': '4631813199916769088', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/2jbUS9Hz8nWQEZKQR17xpxEnXhlW3tisxmhi-NNrMaA6TQT2RtewoHAezDXCbEPJxg', 'headerImage': 'https://lh3.googleusercontent.com/CDSk9Tl3uE24WISWvDexs63CjhVus61xX0RbrF-sbRT2nilROIDj3HdXFR5sFPv9HrY', 'screenshots': ['https://lh3.googleusercontent.com/bYMG4ze9HMscJd1ecbHdpg43Ug3SPtfMAKy3X7MkjgTQFVcxPo34LDsiGY_9Yuuc0U8c', 'https://lh3.googleusercontent.com/8BKj09aBxeKjFIBHViFGMvPfdk8ELDWk5_tXhfys5DrrFCsBFCrmtMMtFlOleVYwEg', 'https://lh3.googleusercontent.com/i5wmDn02a4l_hEDGxf-RZkUuDir2bY6uuKNgF_aT9IEaNVgXnzCa1KlHWixPqs4C50Y', 'https://lh3.googleusercontent.com/PKqbtYcoA0muBAlJGp8Bk5riqsJcfweUasKW6eo3o18l29PO1e22XrLTt-9c7-QSa8c', 'https://lh3.googleusercontent.com/sGcAR1f_wH1a7uJWGFAPMsBzSZDM3HPbsoJTXOMERzc6GFtsVeGaMjzoShYKfM672ush', 'https://lh3.googleusercontent.com/AwlEFtY850JXSP_AK3uNXp6btKa2AgVbHoqEir7vKZpgRMNu7ez5kZayh6Mc--JF9TE', 'https://lh3.googleusercontent.com/kg0-K1XzPkA4IKpXk-qPN6lCGb0JZarMIKr-LUsHMzK6Uq86OAecRHWx7BOXr1c_OQ', 'https://lh3.googleusercontent.com/02E7xF3yHK0UkDYsdyzPX1djgme6IBhjXlM8xvP4kqS_FBXUP_wP9TBM3W6h4tz7PIo', 'https://lh3.googleusercontent.com/85aqL2rkzpqm2I1U5cGXoQtqgq95f6GhmSDcjlkm--Yt9y_5psxAEhYi_yimM4kaIaE', 'https://lh3.googleusercontent.com/z4hwQkLTdr9SlM1WalgnRzLl1phjqS3dGlmlXk3B97oGCJqwho-K-I1MYqAsn08V9abs', 'https://lh3.googleusercontent.com/HdUhEvBlitTTqIz0UC-LbKeLfmQuKwmQoG7YOt_okbjfCt0TcQuhTjHAEZtqnkg6FyRt'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': None, 'updated': 1429111032, 'version': '1.0.70', 'recentChanges': 'v1.0.70 Allow hiding Material Design Action Bar\r\n Improve text paste.\r\n Fix UTF-8 support.', 'recentChangesHTML': 'v1.0.70 Allow hiding Material Design Action Bar<br> Improve text paste.<br> Fix UTF-8 support.', 'comments': ["Its 2020 now, but simple operation as Select text does not work (doesn't do anything and nothing can be selected) Xiaomi Mi 9T, Huawei P9 and Mate 9, all with stock ROMs. Should I use special keyboard or what (using Google Keyboard)?! Really don't know, how it can work in all other apps but not here. No Share options either (only Send by mail). App stuck in the past times", "it is excellent.. very configurable .. but the copy/paste doesn't work properly... that's the only reason I uninstall it .. at least in my android 4.1.2 .. you can not paste commands that you copy from a webpage or from a TXT file.. It is the only reason why I stop using it.", 'Good. I think its not a bug. After boot, the android is load the system. It take 1 or 2 minute to complete. Yeah, its a good app!', 'Excellent app, but one thing, you should makemit request granruntimepermissions permissions so you can grant it that permission and run adb shell commands on your device without a pc for example, pm grant "ect" "permission name"', "Add some desktop keyboard buttons above the keyboard, like juice ssh. Volume buttons are annoying and I can't remember it.", "You don't provide update? Ok. It doesn't even load after opening 2-3 tubes. Takes hell lot of time!", 'It only steals the data of your mobile, do not download, it will not go away even after uninstalling.', 'Yep a bug, this app load too long in the first run. It works just fine after few minutes or later.', "Random times the app won't load a terminal for me to type in and it takes a few restarts of the app to show a blinking cursor", 'There is a bug, when you first use it then close the app and restart your device, it wont let me type again when i open the app, so it needs a little bit of time by doing clearing the data and force stopping it. Its so annoying', 'Very handy for checking my network connection (the wifi on my tablet isn\'t that reliable), so getting access to the PING command is VERY handy.  Unfortunately, if I\'m using GBoard (the only soft keyboard I use), I can\'t bring up my last commands to reuse. This is a MAJOR failing of this program, as not only do the "Special Keys" not work, I have to use a separate keyboard, or figure out what other soft keyboard might actually provide directional arrows.  And if your suggestion is to actually find another soft keyboard, shame on you for thinking that I should find an alternative program to fix a failing in this one.', "So far so good, nothing bad happens to me. And it's pretty simple interface", '(No root) When typing in action "IP link show", it responds with IP: not found. I\'m not using a vpn. The network is public though some sign in is required. My goal is to temporarily change my MAC address.', "This App doesn't work it won't do anything there used to be a good App but not anymore I did like this App befor. This needs to be fixed", "Android just wouldnt be Android without a terminal emulator to run 'nix commands. Highly recommended", 'Glitchy, i have given it SU and now when ever i restart my phone i literally have to uninstall and reinstall just to get the app working again. The terminal opens but i can not input any commands and terminal loads up and stays blank', "Was going to use to emulate my MAC address, but it shows a different address than what's shown in settings. I can't trust that it actually sees my address and will properly emulate it.", 'The best terminal emulator for android. Continued by material terminal.', "Volume key shortcuts do not work, so there's no way to interrupt processes, move the cursor, re-use previous commands, and so on. Unless you're running one-off commands that you know will complete (i.e., not ping), the experience is frustrating. Uninstalling in favor of Termux.", "Special keys don't work. Very impractical to use a shell without a functioning control key.", 'Special keys stopped working. Vol down + C not working.', 'Oo oOo Crawling Bugs.....BUGS Everywhere!!! I prefer Termux but use this as my 2nd terminal if needed', 'Not compatible with blackberry. Asking to show ip link says access denied. Uninstalled', "I used to love this app, but it hasn't been updated for long time. Especially it is difficult to use special keys. Nowadays, I prefer JuiceSSH, yes it has option to connect to local device! Much much nicer to work with.", 'works without any problem (Android 10; asus zenfone max pro m1)', "Not able to enter special characters such as tab... Tried changing func key to volume up and volume down even no key didn't work for me", "Doesn't change Mac address, on the Samsung Galaxy S8 :(", 'Cool Terminal... Needs an "Exit" tho, keeps runners in the background unless you force stop it...', "Shortcuts don't work - can't complete commands and repeat them with different parameters for example", 'It worked great for many years. Changing phone (Android 8 vs Android 6, Xiaomi Vs Galaxy S4) the Volume-UP Volume-DN keys no longer work in order to enter control and function keys. Hope in a new release.', "The only one star comment is stupid. How is it the fault of the developers that android protects users against arbitary root access? If you're not smart enough to know the reason for preventing root access maybe you shouldn't be downloading a terminal emulator in the first place. Just a thought, jcraft59.", "This app I've had no issues with. I'm unsure if it was like a spoof code that hacked my system from a repository. I got a screenshot of 3 Linux PCs logged into my account which I only own a phone. I kicked the hackers ass. With a phone, against 3 Linux PCs. Yea", 'yow i tried "dumpsys battery set level 999"and it work and i tried "dumpsys battery set level 9999" and says systemui has stopped and the system try to reload itself but it cant do it .......so to fix it i restarted it and done but hahahha experience lol good app 5 star', 'Awesome app! I dont need root. I just needed some good ole CLI so I could find the folder on the SD card that had 50+GB in it Thank you for your work! Much appreciated', "It starts but doesn't work, no prompt, cannot enter any command, cannot even stop the app! Maybe it is not compatible with Android 6.", 'Fantastic app. Very happy with the user interface and ability to execute commands on my phone. Highly reccomend it', 'its cool and its ok but its not Termux. I like Termux better but my rooted phone doesnt support it and when i try downlpad it as an apk from some where else the install fails', "Built for Android 3. Volume key shortcuts don't work, so you can't input control or any key not on the built-in keyboard. Frustrating; uninstalling.", 'Curl not installed and no apt , no idea about package manager Very bad app , I prefer termux rather it 🙃', "Unless the phone is rooted new protections built in prevent you from executing 'su' commands and just issue permission denied messages. I was trying to spoof a MAC for my switch (wifi) and this app was useless for that without root."], 'appId': 'jackpal.androidterm', 'url': 'https://play.google.com/store/apps/details?id=jackpal.androidterm&hl=en&gl=us'}
