{'title': 'MapSwipe', 'description': "Humanitarian organizations can't help people if they can't find them. MapSwipe is a mobile app that lets you search satellite imagery to help put the world's most vulnerable people on the map.\r\n\r\nIn MapSwipe, developed in collaboration with the Missing Maps project, users choose a crisis prone part of the world they want to help, such as spotting villages at risk from a cholera outbreak in the Democratic Republic of Congo. They must then swipe through satellite images of the region, tapping the screen when they see features they’re looking for including settlements, roads and rivers. \r\nThis information is fed back to mappers who need this information to build detailed and useful maps. At present, they have to spend days scrolling through thousands of images of uninhabited forest or scrubland looking for communities that need mapping. Now, members of the public can directly contribute to MSF’s medical activities by locating people in need more quickly so mappers, and ultimately medical professionals on the ground, can get straight to work.", 'descriptionHTML': 'Humanitarian organizations can&#39;t help people if they can&#39;t find them. MapSwipe is a mobile app that lets you search satellite imagery to help put the world&#39;s most vulnerable people on the map.<br><br>In MapSwipe, developed in collaboration with the Missing Maps project, users choose a crisis prone part of the world they want to help, such as spotting villages at risk from a cholera outbreak in the Democratic Republic of Congo. They must then swipe through satellite images of the region, tapping the screen when they see features they’re looking for including settlements, roads and rivers. <br>This information is fed back to mappers who need this information to build detailed and useful maps. At present, they have to spend days scrolling through thousands of images of uninhabited forest or scrubland looking for communities that need mapping. Now, members of the public can directly contribute to MSF’s medical activities by locating people in need more quickly so mappers, and ultimately medical professionals on the ground, can get straight to work.', 'summary': 'Help improve humanitarian responses worldwide from the comfort of your own phone', 'summaryHTML': 'Help improve humanitarian responses worldwide from the comfort of your own phone', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.35, 'ratings': 282, 'reviews': 128, 'histogram': [16, 14, 16, 39, 194], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '42M', 'androidVersion': '4.3', 'androidVersionText': '4.3 and up', 'developer': 'British Red Cross', 'developerId': 'British+Red+Cross', 'developerEmail': 'info@mapswipe.org', 'developerWebsite': 'https://mapswipe.org', 'developerAddress': None, 'privacyPolicy': 'https://mapswipe.org/privacy', 'developerInternalID': '7751656606363587225', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/TwxuFG-ge8F3stwiYENv5ezf4QmERHQsa770-NyskDpRQTmbMt2QuJ9-b93JPsWKvsI', 'headerImage': 'https://lh3.googleusercontent.com/iiLP-lGiLD6HdiyONwRdVDst28isZlXsrSzsT3PP9n1j1V2rAsznBd55lxBu_l_RF1wI', 'screenshots': ['https://lh3.googleusercontent.com/vCYzBBuoiuclN0pEDEc77RjnnTPV3G9UDhaaiB_xWSGFXQemR4RTn_b3sIwXjM3Cno4', 'https://lh3.googleusercontent.com/ZXF13CPHbbjnKZnCrrfAF5POReQ42dk43_SyvMmlKfT7Tm6DGcUNLPTt-e38cX5j3w', 'https://lh3.googleusercontent.com/ag523CU1llbjjKZ3nUIMdwdGt2MKYvtz4pnwzCt-wN3oKsKqvYq8VWxhGge5SZo7gg', 'https://lh3.googleusercontent.com/lQHb6lI3TIhCc2w75Lwt_buWxh6aA-CFOgwsO3Jcc8tns9xMxubNOJ_mu0tQmPkv_g', 'https://lh3.googleusercontent.com/tneHHzyat3q1tC6eTQfUlc99hs7NFp4Wkgy-9gXbAt4zaQ2HvrChl3wrE3pf2TPg5w', 'https://lh3.googleusercontent.com/XPwlTZdL-Wey1nDKnEnPiTeSU4csnHM6MfStodLpU4LS2I59ZeOoPDnQR_bRWvNMnw', 'https://lh3.googleusercontent.com/Eb21xB-KcjP52MEF_kRSJFlUngMhog9yxZT-Hp_djho67JmIXI2ngnEd8Ws7rkvDu34'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 13, 2016', 'updated': 1591374174, 'version': '2.0.4 (0)', 'recentChanges': 'This release brings a lot of changes you have requested:\r\n- Images are loading much faster so you can start mapping right away\r\n- Scrolling is smoother, particularly on long sessions\r\n- Reduced memory usage will help on low end phones\r\n- The swipe down action is now much easier to access\r\n- The "Map further" button is back!\r\n- Some users were not included in the leaderboard, this is now fixed\r\n- Push notifications work again.', 'recentChangesHTML': 'This release brings a lot of changes you have requested:<br>- Images are loading much faster so you can start mapping right away<br>- Scrolling is smoother, particularly on long sessions<br>- Reduced memory usage will help on low end phones<br>- The swipe down action is now much easier to access<br>- The &quot;Map further&quot; button is back!<br>- Some users were not included in the leaderboard, this is now fixed<br>- Push notifications work again.', 'comments': ["I'm not sure if how helpful it is. From a user perspective I miss the option to zoom in or out to properly identify a feature. On desktop, I can zoom in all the way to discern a house from a tree, but more importantly zoom out far enough to discern a man-made path from other linear terrain features. As it is now, I do not leave a task with the feeling that I have identified the features well, which creates frustration immediately and discourages to continue in the long run.", "New phone and no longer works. Not sure if it is phone or new version. Can't zoom and also can't swipe. Tutorial also stuck. What a shame.", "The swipe down gesture doesn't work most of the time. Usually the screen just jitters to the sides while I try to swipe down. Please fix?", 'I used this App on my FairPhone2 (Android 6.0.1). That was fine until recently. Now it stopped and when I try to re-install the Google Playtime shop says " FairPhone 2 is not an eligable device for app install" ?', "A nice way to contribute, shame that out doesn't use OSM single sign-on. Also it would be cool to have a visual of the full serial image and and much was complete.", 'Fun to use in putting people on the map', 'Great way of helping map parts of the world.', 'amazing project, simple to use', "don't dumb your time on social media, bring people on the map", 'Surprisingly addictive and a really easy way to help and support activists \nand support workers in remote areas.', "I use this on the crapper. It's a great way to make a difference.", 'Not downloading maps in offline and online mode.', 'By', 'Great app!', 'Amazing idea.', 'I did a few sheets of maps a day or so back, but last night and this morning i have not been able to load or sync completed maps. Did the same set 4 times last night but would not sync back to your server, very frustrating.......If not fixed soon i will uninstall.  The recent update makes it more stable, thanks. The Madagasgar maps say looking for "buildings" only but the intro to the set talks of Roads. Which is it? So far I have only marked buildings on the Madagasgar series.', "I love Mapswipe! Great to be able to do something so interesting and addictive that is helpful to others. However, I haven't been able to load any maps for about a week now. I've tried pressing the 'Bugs? Clear Project Data' button, but it didn't make a difference. Any suggestions Pim? I'm suffering withdrawal symptoms!", "I couldn't get one of the areas to load - the area only completed up to 1% - but it's working now and no more crashes! Thanks for the fix. Great opportunity to help people around the world and play a real - life hidden objects game :)", "I like the gamification of this volunteer work. When maps fail to load, the work-around is to clear the app's cache then force quit. Levels go to 6 then wrap back to 1. Project statistics are not updating which is demoralizing.", 'One suggestion would be to enable user to give a full screen of the same reading. It can get every tedious having to triple tap for missing imagery.', 'I have downloaded maps a number of times and then go to do mapping offline (eg flights to Africa) and I can not access the downloaded images to do the mapping offline. I like the concept but it hard to do it regularly if the offline function is not working.', "It's meditative. I thought it was going to be kinda tedious but I soon got hooked. You get a feel for what is different from where you live in places you'd never see otherwise. You also see lots of similarities as well (if, like me, you live in a rural areal).", "Great app let down by buggy offline downloads feature. You do a download, you get a notification to confirm successful download, but it doesn't work - still says connection required. Sometimes wiping app data in Android settings and trying again fixes it. Evem when it does work, it isn't clear when or whether tiles marked while offline are synced correctly.", "Great concept. The app was happily working for a week but now it's been stuck on the loading screen forever. Tried downloading the maps, clearing the project data, clearing the offline maps, restarting the app but it's still getting stuck :-(", 'Great, great app. One of the best things you can do with your device, helping Doctors Without Borders in their vital work. I work in geospatial tech, and this simple little app to get public participation is genius.', 'A fantastic app that is getting better and better. Such a great and simple way to help out. Awesome job!', 'Would have rated 5 but like other reviews it has stopped loading maps, tried bug fix but no change about to uninstall, pity cos I liked feeling I was doing something useful!', 'Great idea but the interface is somewhat dated and there seems to be quite a few bugs left. I hardly ever get to map after downloading tiles. These seem to just vanish.', 'Good implementation. Could use a more granular approach to swiping. So half way done would could for example.', 'Amazing! Instead of just wasting time on my phone, I can actually do some good in the world!', 'My first review was cut off for some reason, so here it is again.  1- show lat/lon of imagery on each screen, so I can use the web to check details if I\'m not so sure on the app  2- quick and easy way to mark all 6 tiles as bad imagery, e.g. tap once to select all tiles, tap again to mark as bad and tap once again to confirm. That\'s 3 taps instead of 18 taps I have to do right now, and there are many instances of full cloud cover on Colombia region. 3- show on summary a list of projects that each user worked on, the no of kms covered and no of objects found per project. This helps users motivated to help in further projects. Right now, all we get is a summary. Simply showing the Level alone is not sufficient; what does a Level 10 compared to Level 8, for example. 4- On my 8" Android tablet, holding down on a square is supposed to show a magnified image of that square but what it actually show is no bigger or better resolution than the normal square. The magnified square looks better on iPhone or Androne phone but not on the tablet.', 'I uninstalled and reinstalled through Google play to fix this error.', "UI is a little difficult at times - especially long pressing to zoom on tiles but otherwise such a beautiful use of people's spare time!", 'Helping cure malaria while on the bus, much better than candy crush', 'Zoom feature never worked on my Samsung tablet. Maps no longer load. There is a feature to contact mapswipe, but nobody responds.', 'Brilliant app!  Good tutorials and a great opportunity for us to do something useful when we have a few moments to spare.', 'A simple way to contribute to a great organization. The app provides multiple offline options to work, and is simple to figure out.', 'Maps fail to load on a regular basis', "I'd like to help but this app has only worked once on my Nexus 6P", 'Lost my data had to login again sometimes maps are odd colors with white mists'], 'appId': 'org.missingmaps.mapswipe', 'url': 'https://play.google.com/store/apps/details?id=org.missingmaps.mapswipe&hl=en&gl=us'}
