{'title': 'Shader Editor', 'description': 'This is open source:\r\nhttps://github.com/markusfisch/ShaderEditor\r\n\r\n* Live preview in background or on an extra screen\r\n* Syntax highlighting\r\n* Error highlighting\r\n* FPS display\r\n* Use any shader as live wallpaper\r\n* Exposure of hardware sensors\r\n* Support for wallpaper offset\r\n* Exposure of battery level\r\n* Supports multiple touches\r\n* Previous rendered frame in backbuffer texture\r\n* Import and use arbitrary textures\r\n* Disables rendering when battery is low\r\n\r\nSome devices limit GPU usage to consume less power when not plugged in. Always check the performance with the soft keyboard hidden and the power cord off. A shader should make at least around 30 fps to not slow down the UI if you intend to use it as a live wallpaper.\r\n\r\nUnfortunately error information is disabled on some devices (e.g. Huawei Ideos X3, Asus Transformer). Error highlighting/reporting is not possible on these devices.\r\n\r\nPlease report bugs here:\r\nhttps://github.com/markusfisch/ShaderEditor/issues', 'descriptionHTML': 'This is open source:<br>https://github.com/markusfisch/ShaderEditor<br><br>* Live preview in background or on an extra screen<br>* Syntax highlighting<br>* Error highlighting<br>* FPS display<br>* Use any shader as live wallpaper<br>* Exposure of hardware sensors<br>* Support for wallpaper offset<br>* Exposure of battery level<br>* Supports multiple touches<br>* Previous rendered frame in backbuffer texture<br>* Import and use arbitrary textures<br>* Disables rendering when battery is low<br><br>Some devices limit GPU usage to consume less power when not plugged in. Always check the performance with the soft keyboard hidden and the power cord off. A shader should make at least around 30 fps to not slow down the UI if you intend to use it as a live wallpaper.<br><br>Unfortunately error information is disabled on some devices (e.g. Huawei Ideos X3, Asus Transformer). Error highlighting/reporting is not possible on these devices.<br><br>Please report bugs here:<br>https://github.com/markusfisch/ShaderEditor/issues', 'summary': 'Create GLSL shaders and use them as live wallpaper.', 'summaryHTML': 'Create GLSL shaders and use them as live wallpaper.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.55, 'ratings': 628, 'reviews': 234, 'histogram': [18, 12, 43, 81, 471], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.2M', 'androidVersion': '2.3', 'androidVersionText': '2.3 and up', 'developer': 'Markus Fisch', 'developerId': 'Markus+Fisch', 'developerEmail': 'mf@markusfisch.de', 'developerWebsite': 'http://markusfisch.de', 'developerAddress': 'Virchowstraße 39\n90409 Nürnberg', 'privacyPolicy': 'https://github.com/markusfisch/ShaderEditor/blob/master/PRIVACY.md', 'developerInternalID': '6126613670975892871', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/rrG4QP2py6akl7v5p1WzF9pwHpV5gMQii6Y5WTRxitzVbSS9yJ0N1j726ZLsKhRMpXo7', 'headerImage': 'https://lh3.googleusercontent.com/wuxyRmM3qA9Fg8ylE--VtUbMQalohAWQzyxQEuYcg7tMvHIsctB52a1W4CbcPV7OTTGX', 'screenshots': ['https://lh3.googleusercontent.com/sOomvxfRdNhqeLYL0xjMpEHfO5HaPzvAUNJ21RkFZRzEEaj7HdsvL9h8pe28LzeATSg', 'https://lh3.googleusercontent.com/fXM-jwpO9ACJgxOjVN8fNyO1jLBqzvl9F2dqPSZY5chK4JhTXr64PxeFH4udK53N-g'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 2, 2013', 'updated': 1583137498, 'version': '2.19.0', 'recentChanges': '* Add 1/16 and 1/32 quality levels\r\n* Set quality to 1/2 for shaders added by intents\r\n* Update toolbar title when shader is renamed', 'recentChangesHTML': '* Add 1/16 and 1/32 quality levels<br>* Set quality to 1/2 for shaders added by intents<br>* Update toolbar title when shader is renamed', 'comments': ['Hey! Great app! Actually there are annoying things while editing. And orientation uniform updates not fast enough (around 5fps, while fps of the shader is 60). And I think, it would be great if the shader updates only when the code compiles successfully (the black screen which appears all the time is really annoying). Thanks!', "This is a great app. I love just tinkering while I'm waiting around for something. Would be cool to have a dedicated programming keyboard or something, I suck at typing on these phone screens. One actual request, if we could have even smaller scaling like 1/16 and 1/32 for some super retro fun", "Really sick app. I've made so many cool shaders with this. My only wish was we could use maybe smaller buffers with greater precision. Right now it's seems that the backbuffer values are compressed to 8 bits and I wish to save a space of about 100 full precision values instead of a whole screen of 8 bit values.", 'idk if this is the fault of my device or the app but I thought I should mention it anyways. The issue is that the motion sensors have stopped workng. By that I mean when you declare a uniform (e.g. gravity) and set the varible to somthing like an rgb value or posistion it does not change when the device is moved.', "Awesome editor with straightforward and obvious workflow. Frag fiends take note, it's a 2D plane for generative art / image manipulation / etc rather than making textures for a model. Hard to stop tweaking, and would love to see vertex shaders in this format", 'Crashes when pasting lines introduces a new variable. Import and export create new files each time instead of overwriting. Editor becomes progressively slower until restarted, regardless of highlighting. Screen rotation causes delays in shaders that display independently of orientation.', "I love this app with all my heart. User friendly, efficient and it's helped me learn more about shaders. The only thing on my wishlist would be the ability to get a uniform float for audio to make music visualise shaders but alas this would probably be very difficult on Android.", 'Does somebody know how to put it as a wallpaper, when I try it appears that I have to set the app as live wallpaper? Please help me', 'If it had multiple buffers it would be just perfect, I love all the uniforms that desktops and laptops lack in terms of sensors.', "It'd be nice to have vertex shader too, poor rating since it cannot be set as live wallpaper on this device.", 'it is nice to have camera input) pls keep working, there always are things that could be better', 'Neat! I was originally just looking for a shader editor, but this guy ALSO gave it a use - wallpapers! Clever!', "Amazing app, if you know glsl then absolutely great, I've made a few dynamic wallpapers already", 'Dear God this is awesome, I can now keep practicing my shaders from the bathroom.', 'This app is what i was looking for! Thank you', 'This app can teach you about graphic!', 'Helps pass the time and gains experience.', 'Gave me the life changing revalation of how much I suck at GL', 'o holy shader openGL .es the free venn aspie lan deed it TERF? nope binaro? who nud at? woah!', 'Perfect, just made a cool bandelbrot live wallpaper', "This is not one star,this is a zero star,because there a no hint.I don't know to doing to this app,plese", 'Fun toy.', 'Awesome', 'yay!', 'WOW :)', 'Very Good', 'Perfect', 'Great little toy. Better to save often and sometimes copy&paste your work \nto text file outside the app as it could crash unexpectedly from time to \ntime (mine did usually on pasting from clipboard). Shaders cannot use \ncustom textures, but camera picture is available so you can see your \nconvolutions etc. live... Much better than learning on static pictures. Has \na few examples to get you started.', 'Super! works very good, Syntax highlighting, etc. But it would be great if \nI could also add pictures bigger than 1024x1024 and other resolutions, like \n1080x1920, since the most phone screens are not 1:1. Also an auto save \nfunction would be great.', 'No auto-save, app instantly closed itself while multi-tasking and lost 30 \nminutes of work.', 'I want to say a big THANK YOU to the developer(s). I hope you understand how amazing tool you have built. Please, add more attribute values, allow renamig shaders when saving them, also pay attention to not loosing the code when an activity is suddenly closed. Add more samples. Keep up the good work!', "Amazing! This is simple, elegant, fast, and a very wonderful way to practice learning glsl on the plane and in a car when there's no signal etc.  The live wallpaper thing alone is a goldmine.  Thank you for making this!", "It would be great to ditch Android's keyboard and make your own. This way you would only include the syntax needed for a glsl shader. Auto complete for variable names and keywords would be nice too.  Really great to make wallpapers especially without a need for my desktop computer.", "This is very good! Though, it'd be awesome if there's an audio support for more interactive wallpaper.", 'Amazing app! Would love these two features; the ability to record video of a shader, and the ability to apply a shader to your entire phone screen on top of normal usage.', "Phenomenal little shader editor that's great for practicing on the fly and \nmaking some cool, custom live wallpapers", "It's really easy to use, and despite a small screen (phone), it's not cluttered. However, I can't seem to use my shaders as my phone's background", 'Awesome fun', "Awesome! Made my own Conway's Game of Life shader. One thing I would suggest is allowing naming of shaders.", 'its perfect for my away from home use! wish that there was a refrence inside the app, mentioning all the parts of the code for newer users.'], 'appId': 'de.markusfisch.android.shadereditor', 'url': 'https://play.google.com/store/apps/details?id=de.markusfisch.android.shadereditor&hl=en&gl=us'}
