{'title': 'Binary Eye', 'description': 'Works in portrait and landscape orientation, can read inverted codes, is Material Design and can also generate barcodes.\r\n\r\nUses the ZXing ("Zebra Crossing") barcode scanning library. Supported barcode formats are: AZTEC, CODABAR, CODE 39, CODE 93, CODE 128, DATA MATRIX, EAN 8, EAN 13, ITF, MAXICODE, PDF417, QR CODE, RSS 14, RSS EXPANDED, UPC A, UPC E and UPC EAN EXTENSION.\r\n\r\nThis is open source:\r\nhttps://github.com/markusfisch/BinaryEye', 'descriptionHTML': 'Works in portrait and landscape orientation, can read inverted codes, is Material Design and can also generate barcodes.<br><br>Uses the ZXing (&quot;Zebra Crossing&quot;) barcode scanning library. Supported barcode formats are: AZTEC, CODABAR, CODE 39, CODE 93, CODE 128, DATA MATRIX, EAN 8, EAN 13, ITF, MAXICODE, PDF417, QR CODE, RSS 14, RSS EXPANDED, UPC A, UPC E and UPC EAN EXTENSION.<br><br>This is open source:<br>https://github.com/markusfisch/BinaryEye', 'summary': 'Yet another barcode scanner for Android. Free, no ads and open source.', 'summaryHTML': 'Yet another barcode scanner for Android. Free, no ads and open source.', 'installs': '5,000+', 'minInstalls': 5000, 'score': 4.78, 'ratings': 133, 'reviews': 57, 'histogram': [2, 1, 2, 9, 117], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.6M', 'androidVersion': '2.3', 'androidVersionText': '2.3 and up', 'developer': 'Markus Fisch', 'developerId': 'Markus+Fisch', 'developerEmail': 'markusfisch.de@gmail.com', 'developerWebsite': 'http://www.markusfisch.de', 'developerAddress': 'Virchowstraße 39\n90409 Nürnberg', 'privacyPolicy': 'https://github.com/markusfisch/BinaryEye/blob/master/PRIVACY.md', 'developerInternalID': '6126613670975892871', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/zYE7uIiZnNfPPDKLEy6UHEFjpRclVABPWLJRBiMvFgwiyLmyRM4cWSLVReeXsRzIog', 'headerImage': 'https://lh3.googleusercontent.com/Gax3ddsEa7vLpm9VxR1NlPZd0r7JBZE9-5Et-CNspl0s9senfv88V8KGXNmFvGijXA', 'screenshots': ['https://lh3.googleusercontent.com/mrjJo8OoXhBa9vsjH2rK5fbtjR-nv11VBERTQrOkOuDeURZzNM4Iy2PGQKdkfL6_8ME', 'https://lh3.googleusercontent.com/UFTwRPtzS8h8Ib2RTtUKGHX9lCnWg4iavvMyq-WhBIG1GiAcIim7dozfXZFCNVlxM78C', 'https://lh3.googleusercontent.com/ylyq-hUBU5y2885oGIwT-Ie4cQlL35h35_tMJdFhSG9m0RL0G5PE9gMAdD_sYiElrQ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Aug 27, 2017', 'updated': 1591558429, 'version': '1.31.0', 'recentChanges': '* Stop detection while region of interest is modified\r\n* Fix resetting region of interest\r\n* Add Polish translation', 'recentChangesHTML': '* Stop detection while region of interest is modified<br>* Fix resetting region of interest<br>* Add Polish translation', 'comments': ['So close to perfect. App not finding the PDF417 shown. Wierdly it has no issues whatsoever with microPDF417. Wish there was half star choices, 4.5 of 5.', 'Excellent! The only QR reader I could find that saves correctly binary data from QR codes as a file.', "There's so many QR and barcode scanners out there and there's something wrong with nearly all of them. And then there's this one. Does it all exactly the way I want it to! Clever design with just the right features and totally without ads. Thank you dev!! You sure pulled it off with this one!", "The best barcode scanner. Super fast. Reads all types of barcodes and QR codes. No ads. Non-intrusive UI. It's a pity that play store never shows these great ad free apps when searching for barcode scanner apps.", 'What happened!!! Was working fine. Last update broke app completely!!! Shuts down eveytime I try to open. UNINSTALLED...going back to my big, but trusty scanner...', 'Works fast and accurate. I as able to customize all my needs (lIke special URL or search engines).', "Great barcode scanner, no spam, no ads. It's Open source software so you can find it in F-Droid.", 'This is the best barcode scanner available!', 'Pleasant surprise.. simple to use and fast', "Thanks for your hard work. You're really talented. No bs, I wish I could do this kinda stuff, but I barely figure out how to survive day to Day. Ty. Pix3xl with the magic mask. 😁", "Thank you for making this open source! We used you code as the platform for one of our applications and it has worked beautifully. It's a very solid built app", 'Amazing, has features to send get requests and even reads that awful PDF format... Its even open source', 'Perfect! Finally an ad-free and open source QR-code scanner! Thanks for your work!', "Fantastic app that does what it's supposed to without asking for unnecessary permissions! Thank you!", 'unable to add or connect wifi via qr code with android9? bug?', 'Very happy with this app.', 'Exactly what I was looking for - lean and clean.', "I tried every single QR code scanner on F-Droid and this one is the only one that scanning an image file by sharing it using Android's share menu. Besides that, it also just looks the nicest of all the available apps.", 'This has become my main scanning app: it recognizes encodings very quickly, and it immediately gives you the output with a copy button right there, so you can do whatever you want with it. It also tells you the format, so that you can turn around and generate your own version of the same barcode, for scanning a store club card, for instance.', 'A high quality, clean, attractive, simple, free, ad free, open source bar code scanner. Not only reads pretty much all bar codes, but can create them as well -- a really nice and handy touch! Thank you. :)', 'No ads, just barcode scanning. Absolutely amazing.', 'open with only works with browsers which means that you cannot use this to scan Wi-Fi QR codes as they will not be able to be opened with the settings app', "Didn't do a damn thing except tell me the UPC number. I can already read it myself! So what the hell good does having the number do? I was expecting this app to take me to the internet and show me the brand and more info about this item. Worthless app IMA", 'contains no trackers as described in aurora store', 'Very usefull app. Do you plan to add feature to load image from file?', 'Best qr code scanner', 'Great! Minimal! Open source!', 'So many barcode scanners in the Play Store, but none have been as reliable as Binary Eye. Simple, easy to use and open source too!', 'Amazing.', 'Good app', 'NOICE!', 'Simple, awesome!', 'Beautiful', 'Funny.'], 'appId': 'de.markusfisch.android.binaryeye', 'url': 'https://play.google.com/store/apps/details?id=de.markusfisch.android.binaryeye&hl=en&gl=us'}
