{'title': 'Toaster', 'description': "Records every toast message including the sender package. May be helpful if you get messages and don't know, which app sends it.\r\n\r\nIt has to be activated as accessibility service.", 'descriptionHTML': 'Records every toast message including the sender package. May be helpful if you get messages and don&#39;t know, which app sends it.<br><br>It has to be activated as accessibility service.', 'summary': 'Do you want to know, which app shows toasts? Toaster records every message.', 'summaryHTML': 'Do you want to know, which app shows toasts? Toaster records every message.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.65, 'ratings': 178, 'reviews': 75, 'histogram': [12, 0, 1, 8, 154], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.1M', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'MARS3142', 'developerId': 'MARS3142', 'developerEmail': 'tickets@toaster.uservoice.com', 'developerWebsite': 'https://github.com/mars3142/toaster', 'developerAddress': 'Peter Siegmund\nBrahmsallee 32\n21423 Winsen (Luhe)\nGermany', 'privacyPolicy': None, 'developerInternalID': '8544457319989441779', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/W1kd04ManEi9KZQQnkuBQA__pWqZnVE9ZpSwwlfPVOaJqh8AZ6Cp9LwmgvvAXzFaaQ', 'headerImage': 'https://lh3.googleusercontent.com/B5lsrZRtiJgm4CBUd4yGKaW9ef6R4I-tBx8CoXxD12ULbjZ3qr0V_6pRmTo7PAS8Rew', 'screenshots': ['https://lh3.googleusercontent.com/5H7OS7eqZv68qzn7b_jypJ9oLoPG1ISnp4JOlusZIbeZ57ulXGURy_YH6Ue5Jz1UUg8', 'https://lh3.googleusercontent.com/Rmqa1zNCww-U10PuWb8qBDzC3fXstBWi4cdvodkVafLQivYZAj1IQaoqIaAbl39jjY8', 'https://lh3.googleusercontent.com/NySC697KvP6UbmNIbvXUKYI-4Otolq8ReViavy70dRYqmi0KmLR2YabrtTs1Xw7EJWg', 'https://lh3.googleusercontent.com/4ZssBH7ygd5jHlqAp878ceaYLXlLWgJJV5_1qj4xmFipE_GOVI7lDWiGKysa0G6DlUs', 'https://lh3.googleusercontent.com/yG0fQsu7NiINF0tUW2TOgXLepx3kT6E0YnuwmXhT00CnYVL4k5Swy5Ajk2xd1fcBrDk', 'https://lh3.googleusercontent.com/FLzAWB7ayaxWFRbAKtbA961A41-GhTChhxBQRuCHBa9-kmBr1evCt2pdVOUxM9RPZQ', 'https://lh3.googleusercontent.com/uivXb2ejCO5RucH6pGTCxqzwUZXZDJfafS5422HKZ6s9vkTvpKR7zDnB1018GGxqWzo', 'https://lh3.googleusercontent.com/7ssBxvHKlhpjzL3H-Or69rM4Ksr8FvwMhA7iG5HoTYEfZBy4_QTnHdjlnLADCYMg4w', 'https://lh3.googleusercontent.com/b4l-9n1eUUHnkMxxYmKUSQVJ0lS9qtZprN07BLc9pJZx_D8tgkr7GzU86XarPe7pWkg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 21, 2014', 'updated': 1514543095, 'version': '0.4.9', 'recentChanges': '* sneak peek (work in progress) of the new design in Material Design', 'recentChangesHTML': '* sneak peek (work in progress) of the new design in Material Design', 'comments': ['Great app. It identified the app that was spamming with pop pups.', 'Detected which app was spamming me. Thanks! This app is a great idea and very useful.', "The app seems to be doing nothing, even though I have activated the accessibility service for the app. Anything that I'm missing?", 'i am not complaing about this app it seemed to be what i wanted. could someone tell me how to get it to load? please it doesnt load anything but a blank page. any sugestions would be great. thanks.. thank you for the info.', 'toast source has a little more features. Hi5', 'I cant activate this app , could you please help me', 'Helped solve a problem', 'Helped me identify the culprit was WeChat.', '不必root就可用來找出哪些APP一整天亂丟Toast，非常方便好用。', 'Real life', 'I was getting a "Check your connection and try again" message when I didn\'t have a bad network connection.  It was happening when I just had the phone open on the home screen. I downloaded this app and found out it was the NYTimes VR app. Deleted it, problem stopped.', 'I had an app that constantly displayed "no client"  toast messages. I went crazy over finding the rogue application that messed with me like that. I uninstalled all sorts of useful apps with the high hope that the culprit will be among them but at no avail. I was sick of factory resets and scouted the Internet and found this little jewel. Thanks dear developer for putting my worried to rest. Ps.  The app. Was gReader, an RSS reader I forgot to set up. Google should implement icons for toast notifications.', "Some app was unable to download something so there was something wrong. This apps tells you what app was doing this with the Samsung Galaxy S5 and it was the default message app. Thanks. I'd 100% recommend this to others!", "Am getting an error in the Amazon app and someone on a forum recommended this app to troubleshoot the problem. Gave it accessibility and even restarted my phone but the app comes up with no entries and is blank. That gives me two apps having problems...  EDIT: I have a Pixel and as noted by quick developer response, this seems to be an Android Oreo issue. Wanted to bump up the rating to reflect the quick response and that they're trying to work on a fix. Totally understandable!", 'My device lost all its accounts after returning from Safe Mode, and an app was displaying a toast with an error every 5 minutes. This app helped me find the misbehaving app. Thanks!', "This dev and app is another reason why android is so great.. This app solves the toast message mysteries when I couldn't look fast enough to see what the message was or what app created it. I click on thos app countless times a day.  Wish I could give it 10 stars.", "Why is Toaster not working for me. I'm trying to Google, but not able to find a solution. I turned on Accessibility asked the first time I opened that app. But it's blank, no apps. Please help! I'm clueless!", 'Love this little app.. helped me to figure out the cause of those annoying network error popups, thus...BOOM!', 'What a wonderful little utility. Let me find the problem, and fix the problem. Thank you.', "... but seems to intermittently get turned off as the required accessibility service, so isn't always active at the critical point. Update: Thanks for quick response! Device is running standard Galaxy S5 Mini 5.1.1, and only other app listed with accessibility service is Airdroid. Probably a bug in Lollipop, I will keep an eye on it, though Marshmallow is (finally) due out soon :) Done it again, seen reference to an issue with Samsung SmartManager battery optimisation, so trying disabling for your app.", "This works great.  I found out what app was bugging me and turned off it's notifications.  I wish they made this for windows 10.", 'Had these bloody messages popping up on my phone about not being able to download, try later. Installed this app and within 5 mins I had rectified the problem, thanks 10 out of 10👍', 'Does its work perfectly. Fixed my problem with a toast message saying "Currently unable to download..."  in a sec. Recommend it.', "TIP: if you get the boy able to download at the moment message and find out it's the messages app, I backed the messages, deleted them all, restored only the sms ones and so far so good :)", 'There was a message popping up for weeks & it was driving me crazy, this app found it within seconds of downloading it and I delered that sucker! 5*****', 'Had the annoying "network error, please try again" error and couldn\'t figure out which app it was coming from. App helped figure out it was Google Drive', "Solved my issue as I kept getting the message 'currently unable to download please try later' which was due to messages app", 'Loved the app, though it lacks ability to display notification (as a setting option. You get a 5 star with this option)', 'Helped me remove a pesky "Time Bomb" app.', 'Very useful, to discover which culprit app which keep pooping up annoying Toast message.', 'Fixed that stupid error of "unable to download now". Couldnt of done it without you!', 'Finally found, which app keeps sending that annoying message. Thanks.', 'Thank you', 'Had a random app sending me text notifications. Found it and solved it.', 'Turns out the "No APN specified on the device." toast was coming from the Messaging app in CM12.1', "Says what it claims. I used it to find which is toasting even when I'm not using any apps and found it.", 'Worked for "this test version is too old please update" toast', 'Simple app that is perfect at solving a frustrating problem.', "It simply works. It does what says it'll do, and I love it!", 'Thank you!'], 'appId': 'org.mars3142.android.toaster', 'url': 'https://play.google.com/store/apps/details?id=org.mars3142.android.toaster&hl=en&gl=us'}
