{'title': 'Dialer for Rebble', 'description': '[ This project is now actively maintained by Rebble! :) ]\r\n\r\nDialer for Pebble completely revamps calling controls. It allows you to answer calls, decline calls, toggle speakerphone, toggle mic mute right from your pebble.\r\n\r\nYou can also place calls right from pebble without even touching your phone, by browsing call history or filtering through contacts and groups.\r\n\r\nTURN OFF CALL NOTIFICATION IN ANDROID PEBBLE APP. OTHERWISE THIS WILL NOT WORK PROPERLY.', 'descriptionHTML': '[ This project is now actively maintained by Rebble! :) ]<br><br>Dialer for Pebble completely revamps calling controls. It allows you to answer calls, decline calls, toggle speakerphone, toggle mic mute right from your pebble.<br><br>You can also place calls right from pebble without even touching your phone, by browsing call history or filtering through contacts and groups.<br><br>TURN OFF CALL NOTIFICATION IN ANDROID PEBBLE APP. OTHERWISE THIS WILL NOT WORK PROPERLY.', 'summary': 'Improved call interface for Pebble', 'summaryHTML': 'Improved call interface for Pebble', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.3800907, 'ratings': 2252, 'reviews': 693, 'histogram': [132, 71, 193, 264, 1589], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.8M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Barclay Consulting, Inc.', 'developerId': 'Barclay+Consulting,+Inc.', 'developerEmail': 'dialer@rebble.io', 'developerWebsite': 'https://plus.google.com/communities/105292167808840816317', 'developerAddress': None, 'privacyPolicy': 'https://docs.google.com/document/d/1gVhRg6_wwsRFMV7TxgLVJMgChXho96stNNDGOwQ5uW8/pub', 'developerInternalID': '8897642657964241330', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/RxfoCMC5c2gRaZmaBfjWmYdBtkhFhcF8a7FohEiBdDqpgy4KmvJVAPj_KdT9vOXsrA', 'headerImage': 'https://lh3.googleusercontent.com/kqPGmNduwKKCORZ6MzE4Ao-kwyp9aQ-MmMD1K-2XiNjfE62aLF8L7sPy6Dj69sq4aA', 'screenshots': ['https://lh3.googleusercontent.com/px4xKhzd71YkUdKHFlZm8Zc1M6PvAw05xHsgivwsRIDVE0TPYFdUeUfIqOQoAGpboB8', 'https://lh3.googleusercontent.com/7DiM7ke61X8ijYKQtCyh8hiLngSbZp0ZaHZ9Id3ixvYPm7Em2af_BIcWd-T67TAE0Dc', 'https://lh3.googleusercontent.com/yZyddK2q5h2OB-RVceef6dzgnBYVwhGgUN1Gkg-jCtg9_mZ5zy41vy3w4Z6WIdLqMkg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Aug 20, 2013', 'updated': 1508397635, 'version': '3.3.1', 'recentChanges': 'Fixed phone voice', 'recentChangesHTML': 'Fixed phone voice', 'comments': ['I just came back to Pebble from GWA2. I knew because I now have an android S10e that I would have to load "Dialer for Rebble" to get contacts on incoming calls. That part works fine but I can only answer calls. The red icon at the bottom of the watch screen shows a line thru it so I can\'t reject a call, the middle icon Green phone works great to answer and the top texting icon is white with a line thru it also so I can\'t reject and send a text. I have heard other Android 10 users with the same problem. Please help!', "This seemed to install fine and I disabled the Phone Calls for Pebble app in notifications. I get caller ID and the picture now, BUT the 3 buttons do absolutely nothing when selected. I have to go to the phone to accept, reject or speakerphone...not sure what I'm missing. On a new Pixel 3a with Android 10.", 'This app is dope. My only complaints are that the screen is not lighting up when call occurs and there is no way to light it up in dim places (pressing back button exits the screen) and the icons and styling should follow the pebbles design language.', 'Downloaded today after finally having enough of the lost display following upgrade to Android 9. There were some complications with the install, meaning i needed to download the .pbw file from the developer website to update the Pebble. This needed to be sideloaded using CX Explorer, most file managers would not support opening in the Pebble App. I was guided through by the developer, who was incredibly responsive and helpful. Highly recommended!', "Seems to work fine, but what's up with requiring phone microphone access? That isn't listed in the permissions on the FAQ.", 'The incoming call is displayed on my Pebble Round, but the watch buttons do not work to accept or reject the call. This started when my OnePlus 6T updated to Android 10.', "Turns out after updating to android Pie the default call notification doesn't show caller ID anymore. Dialer for Pebble seems to solve this issue. Much better then the original notifier and I'm glad this still works with updated android.  PS! There are people still using this watch and you should get one and keep this app floating :)", "the latest versions of Android seem to have broken some of the functionality... For example: when hanging up a call on your phone it doesn't go away on your wrist (the time just keeps ticking) I think most people would even want to pay for an update (development costs money and somebody has to pay for it)", 'like others, caller ID on my pebble broke with pie. this fixed it while also adding contact pictures on incoming calls and some nice other controls and phonebook lookups. Nice work! Thank you!', "It WORKS!! Android 9 on Huawei Mate 20. :-) It didn't work until I disabled call notification in the Pebble app (I've missed this in the description). Now my Pebble is fully functional again! :-)", "Shows me who's calling but none of the options shown (answer, reject or speakerphone) actually do anything when you press them. Anyone got any ideas how to fix this?", 'Didn\'t realize how bad the built in call notifications were until this app showed how awesome they could be.  Fixes "unknown caller" issue in native app on Android Pie.', 'After Android 9 Pie update, my pebble displayed unknown caller for all calls. This app got caller id working again. Thank you.', 'Life Saver. Thanks for bringing back this important functionality back to my Pebble.', "Pathetic. The way of selecting contact is idiotic. You should be ashamed of having such a stupid system. Make it a normal scrolling list instead of the most idiotic system I've ever tried to use.", 'Keeps loosing notification access on my oneplus. Probably my phones fault more than the app though', 'Fantastic - I can now still get the incoming caller on my Pebble using Android 9', 'Excellent, solved my "Unknown Caller" problem on Android Pie', 'I can not get this run on my watch. it just runs time.', 'Great fix for unknown caller issue', 'Useful when working and phone in pocket', 'please fix my watch keeps spinning and will not show me who is calling please fix.', 'Perfect with photo ID. Oneplus 5T', "It doesn't show my contacts, it doesn't work", 'Great addition to the watch.', 'still working in my pebble.', 'call notifications working on my pixel 3. Pebble time steel lives on!', 'Thanks for giving new life to my watch!', 'I have to add to the appreciation of everyone else. Thank~You so, SO much for keeping these ever~so precious watches useable! There is absolutely nothing out there that is as affordable & as functional as Pebble schtuffs. It was heart breaking & tummular~heart area sinking when they sold. I know that sounds dramatic, but this watch is like an extension of me =p Please keep doing whatchya do! Much ~ peace~ love~ happiness~ healthiness~ success~ hugs~ &~ kittens~ to ya!~~~', 'Just what I needed! I used to use this app, but deleted it when the standard Pebble software did all that *I* needed. I don\'t need all the features of this app.  This app is now ESSENTIAL for me as my Android phone is running Android Pie, which has changed the permission structure associated with phone call information. The Pebble will need to be changed to cope with this. Currently a phone call is reported on a Pebble as from "unknown". With this app you not only get the name of the person calling, but also their picture from your contacts displayed on the watch.  If you have Android Pie and a Pebble you need this app.', 'Fantastic app, that elevates the capabilities of my Pebble. Developer is super re-active and was able to help me very quickly to pinpoint a wrong setting where the dialer would not show on my Pebble upon incoming call. I had my phone in silent mode (as always) but within the Dialer app enabled the setting "Respect phone\'s do not disturb mode"', 'Pebble watch cannot communicate with the app (blocked) on Android Pie (9.0) if Medium power saving is enabled! Please update it, to be able to use in any circumstances! I love it anyway!', "Restored my Pixel 2/Pebble Time Steel from the dreaded 'unknown' caller ID on incoming calls. Can accept a call, mute the microphone, but reject/end call doesn't seem to work.  Using Rebel.io firmware for app store and watchfaces now that Pebble servers are down. LONG LIVE THE PEBBLE!", "This app extends the capabilities of the phone calls manager of the Pebble. \nIt's rich in features, fully customizable and runs flawlessly.", 'Incredible app! Thanks for all your efforts in keeping this updated. A must have if you have a pebble watch.', 'after upgrading to Oreo, SGS7, denial of call does not work. Too bad.', 'Best app for pebble, make it very useful', "Déçu d'être obligé d'installer cette application depuis Android 9.0, car je n'avais plus l'affichage des noms, mais affichage bien plus agréable qu'avant avec notamment la photo du contact qui appel. Par contre les boutons racrocher/micro/haut parleur ne fonctionnent pas. Je ne peux que décrocher.", 'Thank you for your continued support.', "Such a useful app. I I've being able to manage calls right from my Pebble."], 'appId': 'com.matejdro.pebbledialer', 'url': 'https://play.google.com/store/apps/details?id=com.matejdro.pebbledialer&hl=en&gl=us'}
