{'title': 'Track Work Time', 'description': 'This app can track your work time easily! It lets you categorize each recorded interval by a client/task and a free text. Of course, the list of clients/tasks can be edited to suit your needs.\r\n\r\nAdditionally, if you wish, your flexible time account is taken care of: you always see how much you worked. You can also keep an eye on how much work time is left for today (by a notification which you can enable).\r\n\r\nYou even may provide the  geo-coordinates or the Wi-Fi network name of your work place and the app can automatically clock you in while you are at work! This is done without using GPS, so your battery won\'t be emptied by this app.\r\n\r\nIf you prefer to use other apps like Llama or Tasker for tracking your movements, that\'s fine - TWT can be triggered from these apps and just do the book-keeping of your work time. In this case, you have to create broadcast intents called org.zephyrsoft.trackworktime.ClockIn or org.zephyrsoft.trackworktime.ClockOut. When using ClockIn, you can also set the parameters task=... and text=... in the "extra" section of the intent so your events are more meaningful. For more details on this, see the web site.\r\n\r\nIf you like, the app can backup its data on Google\'s servers using Android\'s standard mechanism. But it\'s always up to you - if you don\'t enable it actively, it won\'t happen!\r\n\r\nFinally, the app can generate reports for you. The raw events report is the right thing if you want to import your data somewhere else, while year/month/week reports are fine if you just want to keep track of your task progress.\r\n\r\nThis is an open source project, so if there is something you don\'t like, you are very welcome to contact me or even write some code yourself and contribute it. Please don\'t try to communicate with me via reviews, that doesn\'t work in both directions. Just write me an email, and I\'ll see what I can do.\r\n\r\n\r\n\r\nImportant note: The app definitely won\'t covertly send your personal data anywhere. Only if you explicitly enable it, the backup will be stored on Google\'s servers. Here\'s why the app needs the permissions it asks for:\r\n\r\nACCESS_COARSE_LOCATION: If you want to auto-clock your time being at a specific location, you may give the coordinates and the app will detect when you enter and exit the location. It uses the network to get the coarse location, so your battery won\'t be drained by GPS. If you don\'t like the app being able to do this, you may take away the permission - the app will continue to work without it.\r\n\r\nWRITE_EXTERNAL_STORAGE: The app can generate reports of your clocked time. This permission allows to write the reports to SD card (which is necessary before sending them to you, e.g. via email).\r\n\r\nRECEIVE_BOOT_COMPLETED: If you enable location-based clock-in and clock-out, the app checks periodically where you are. If your device reboots, it has to tell this to TWT or else TWT won\'t check the location correctly until you open it manually for the first time after the reboot. The background service is disabled by default.\r\n\r\nINTERNET: In some rare cases, the app might crash. To fix these crashes if they occur, it is critical to receive reports about them, so the app sends some information about the problem to the developer just before it goes down. None of the private data you entered into the app will be sent, neither any locations nor any times! As this is an open source project, you can verify this very easily, just look at the code! Please note, if you don\'t like the app being able to do this, you may take away the permission - the app will continue to work without it, but perhaps some bugs might not be fixed.\r\n\r\nVIBRATE: The app can be configured to vibrate at location-based clock-in / clock-out events. If you don\'t like that, just don\'t enable the option in the app. It is disabled by default.', 'descriptionHTML': 'This app can track your work time easily! It lets you categorize each recorded interval by a client/task and a free text. Of course, the list of clients/tasks can be edited to suit your needs.<br><br>Additionally, if you wish, your flexible time account is taken care of: you always see how much you worked. You can also keep an eye on how much work time is left for today (by a notification which you can enable).<br><br>You even may provide the  geo-coordinates or the Wi-Fi network name of your work place and the app can automatically clock you in while you are at work! This is done without using GPS, so your battery won&#39;t be emptied by this app.<br><br>If you prefer to use other apps like Llama or Tasker for tracking your movements, that&#39;s fine - TWT can be triggered from these apps and just do the book-keeping of your work time. In this case, you have to create broadcast intents called org.zephyrsoft.trackworktime.ClockIn or org.zephyrsoft.trackworktime.ClockOut. When using ClockIn, you can also set the parameters task=... and text=... in the &quot;extra&quot; section of the intent so your events are more meaningful. For more details on this, see the web site.<br><br>If you like, the app can backup its data on Google&#39;s servers using Android&#39;s standard mechanism. But it&#39;s always up to you - if you don&#39;t enable it actively, it won&#39;t happen!<br><br>Finally, the app can generate reports for you. The raw events report is the right thing if you want to import your data somewhere else, while year/month/week reports are fine if you just want to keep track of your task progress.<br><br>This is an open source project, so if there is something you don&#39;t like, you are very welcome to contact me or even write some code yourself and contribute it. Please don&#39;t try to communicate with me via reviews, that doesn&#39;t work in both directions. Just write me an email, and I&#39;ll see what I can do.<br><br><br><br>Important note: The app definitely won&#39;t covertly send your personal data anywhere. Only if you explicitly enable it, the backup will be stored on Google&#39;s servers. Here&#39;s why the app needs the permissions it asks for:<br><br>ACCESS_COARSE_LOCATION: If you want to auto-clock your time being at a specific location, you may give the coordinates and the app will detect when you enter and exit the location. It uses the network to get the coarse location, so your battery won&#39;t be drained by GPS. If you don&#39;t like the app being able to do this, you may take away the permission - the app will continue to work without it.<br><br>WRITE_EXTERNAL_STORAGE: The app can generate reports of your clocked time. This permission allows to write the reports to SD card (which is necessary before sending them to you, e.g. via email).<br><br>RECEIVE_BOOT_COMPLETED: If you enable location-based clock-in and clock-out, the app checks periodically where you are. If your device reboots, it has to tell this to TWT or else TWT won&#39;t check the location correctly until you open it manually for the first time after the reboot. The background service is disabled by default.<br><br>INTERNET: In some rare cases, the app might crash. To fix these crashes if they occur, it is critical to receive reports about them, so the app sends some information about the problem to the developer just before it goes down. None of the private data you entered into the app will be sent, neither any locations nor any times! As this is an open source project, you can verify this very easily, just look at the code! Please note, if you don&#39;t like the app being able to do this, you may take away the permission - the app will continue to work without it, but perhaps some bugs might not be fixed.<br><br>VIBRATE: The app can be configured to vibrate at location-based clock-in / clock-out events. If you don&#39;t like that, just don&#39;t enable the option in the app. It is disabled by default.', 'summary': 'Track your work time easily! Categorize each interval by client or task + more!', 'summaryHTML': 'Track your work time easily! Categorize each interval by client or task + more!', 'installs': '5,000+', 'minInstalls': 5000, 'score': 4.3170733, 'ratings': 41, 'reviews': 15, 'histogram': [2, 3, 1, 9, 26], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.2M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Mathis Dirksen-Thedens', 'developerId': 'Mathis+Dirksen-Thedens', 'developerEmail': 'android@zephyrsoft.org', 'developerWebsite': 'https://zephyrsoft.org/trackworktime', 'developerAddress': None, 'privacyPolicy': 'https://zephyrsoft.org/trackworktime/privacy', 'developerInternalID': '7000175784206589526', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/0tJ5niZrJ9J8IDqU1mh6Hcv3QFOM5gYQaM759Op6QsF0egmeOa_GhtD7B_nqhKt3Fw', 'headerImage': 'https://lh3.googleusercontent.com/BP8TzellxeG-InVjOA7j0GmpDvUqoX1urC567KIzmT-RyE-dcacJvmYosf0lNQgdMxQ', 'screenshots': ['https://lh3.googleusercontent.com/oKivUKXZUFNs21_kZo_Wu_7cx9RwQDOLAFWhd2IOwlYAvllvHVnVVwC9ugYBetPWJQ', 'https://lh3.googleusercontent.com/06zpEqPw69FyzGyDYKo-s6S7OP70tqUvLy47cJlV5-nC8nlpcAvuqdhMN52MjRkQGL-6', 'https://lh3.googleusercontent.com/8Q3VBWLTdvgo3XIE4lrFkNHqXZZ1paqSK11fPMqMb1gnstYaM3WJ6lrt8iyuksNqj8g', 'https://lh3.googleusercontent.com/BtPG4gP_ezrLHkHhMB-9FdI4nBtXqGEUE_1TyaqYE25Tmynm_w7c9T_qu6YB9gEsVRE', 'https://lh3.googleusercontent.com/fA7dnOPLam34K_8BkUP_Ut6EUXCsUZg6rXPYglTGbJThgvnJFX37Sr-CvdMUObq9ziY'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 22, 2013', 'updated': 1579723032, 'version': '1.0.6', 'recentChanges': 'Version History / Release Notes: https://zephyrsoft.org/trackworktime/history', 'recentChangesHTML': 'Version History / Release Notes: https://zephyrsoft.org/trackworktime/history', 'comments': ['Though a little awkward UI during setup or manually managing events, it is the best app I have found: It is simple and does not eat up battery and does not require any online account or ads. It is what I was searching for. Thanks!', 'Great app. Thanks for keeping it opensource!', "I use this to track driving time. As a driver, I am on and off the clock several times a day. This is the only app I found that allows several in/out's. I like that it is simple to start and stop. I like that it lists them in order in the edit events section and allows time corrections if needed. This is great, but it does not allow what job you are on for each time period showing. Other than that, it's serving my needs. So far, it seems to be ad free and no other source needed to run it.", 'Unable to track by location, gives an error on invalid settings. All permissions in android granted. Still doesnt work.. Device MI Note 5 pro Update: Thanks. The ignore before events option had a negative number. I fixed this setting. Maybe the error message can be made more self explanatory. But all in all works well now.', 'Just what I was hoping for; no gripes - it seems if I will have one, there are plenty of useful options to configure around.', 'Very awesome app. Easy to use. When you login to work, just click start tracking. When you take a break, click stop. When you return from your break click start. Any errors , just go in and change the time. IT AUTOMATICALLY CALCULATES the total time LOGGED IN (start tracking time) and shows you Exactly how much you worked and how long your breaks were. Negative reviews are from lazy users not willing to fiddle around with the app. It serves it\'s purpose perfectly , unlike many other so called "5 star" apps. 95% of customers are dumb. This is a good app. Good job devs  You may want to work on your UI thought. Looks a little bland. But functionality is perfect.', "Great for auto checking in/out, working really reliably. It's also completely free and opensource. It's a bit less user friendly, needs better description on what some settings actually do.", "I have been thinking about tracking my work hours for a while now, then I came across this app today, tried it for 30 mins couldn't understand a few things. So I contacted the dev, got a super fast response and solving the issue too. Now to try it out fully. Thanks for helping me Mathis.", 'Einfach zu bedienen und macht was sie soll', 'The main functions work great, especially the ability to detect arrival/departure to/from work by triangulation/GPS but, some functions like the "flex time" don\'t seem to work correctly and there is no help or user manual.', 'Be aware that you can only view/edit the current week!'], 'appId': 'org.zephyrsoft.trackworktime', 'url': 'https://play.google.com/store/apps/details?id=org.zephyrsoft.trackworktime&hl=en&gl=us'}
