{'title': 'Mattermost Classic', 'description': 'Mattermost is secure, workplace messaging from behind your firewall.\r\n\r\n- Discuss topics in private groups, one-to-one or team-wide\r\n- Find what you\'re looking for with full text search, filters and #hashtags\r\n- Easily share images, video, audio and files \r\n- Personalize your experience with custom colors, formatting and fonts\r\n- Connect in-house systems with webhooks and Slack-compatible integrations\r\n\r\nTo use this app, you need a "Team URL" from a Mattermost server. To host your own server go to http://www.mattermost.org/download/\r\n\r\nFind the Terms of Service for this app here: https://about.mattermost.com/terms\r\n\r\nThis is a reference implementation of an open source Mattermost Android app available at: https://github.com/mattermost/android', 'descriptionHTML': 'Mattermost is secure, workplace messaging from behind your firewall.<br><br>- Discuss topics in private groups, one-to-one or team-wide<br>- Find what you&#39;re looking for with full text search, filters and #hashtags<br>- Easily share images, video, audio and files <br>- Personalize your experience with custom colors, formatting and fonts<br>- Connect in-house systems with webhooks and Slack-compatible integrations<br><br>To use this app, you need a &quot;Team URL&quot; from a Mattermost server. To host your own server go to http://www.mattermost.org/download/<br><br>Find the Terms of Service for this app here: https://about.mattermost.com/terms<br><br>This is a reference implementation of an open source Mattermost Android app available at: https://github.com/mattermost/android', 'summary': 'Secure, self-hosted workplace messaging', 'summaryHTML': 'Secure, self-hosted workplace messaging', 'installs': '50,000+', 'minInstalls': 50000, 'score': 2.29, 'ratings': 403, 'reviews': 237, 'histogram': [193, 60, 56, 24, 68], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.4M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'Mattermost', 'developerId': 'Mattermost', 'developerEmail': 'feedback@mattermost.com', 'developerWebsite': 'https://about.mattermost.com/', 'developerAddress': None, 'privacyPolicy': 'https://about.mattermost.com/privacy/', 'developerInternalID': '7231322553409637977', 'genre': 'Business', 'genreId': 'BUSINESS', 'icon': 'https://lh3.googleusercontent.com/LYAk-r4tsHSjcMs0i7SVdXiVyEvsIupRYqxXtEmBUpTdOSXwBBYJGeif-VWU1He0Cg', 'headerImage': 'https://lh3.googleusercontent.com/0AprDFEe4jVtUn3yB66tfdffNGS6IgjFBDxwqeWlSkjoFHz1UxF5_EJafioGfNNgV2g', 'screenshots': ['https://lh3.googleusercontent.com/lwKN4tYR3JVmqrc8IER08ITECfpQmuE03XVxG_28OHwUf1NHKfoVXul_puB7gH4_QA', 'https://lh3.googleusercontent.com/xkz4foEAtmQnoib8qTh-suDgRnDbyIPuuxrZ82c4HRW8qGVQfCaIx1NGgma4voU3b1g', 'https://lh3.googleusercontent.com/K9iqWClh-nVLc5SokuYw-SNeOSUscNRx3zs8fx1uuq3QMCHch-5ZjwYqKeucXRhvb48', 'https://lh3.googleusercontent.com/AG7_msCdk2GnhFQZDYF25QJOnrRpa8ivk7c3TzT3i31D477-W-N_omkSVB6fybN3vGG3', 'https://lh3.googleusercontent.com/Rhqin3l1bvpcukvzAaTVr82yaM71GaZWmEPSVx77vVIFSioLYTdeuEzHkmAfYQ6blw', 'https://lh3.googleusercontent.com/sXoTsyU8DnRJyN3xtFeg7tHdNT43YF35sr5yxOrEst6ii9SLemHX0SXBVGTOrCyuV-N_', 'https://lh3.googleusercontent.com/PDhraGj_e0AqsgV2rr92ZjFRwAaNZnQni5evEkLcioEB9HLYKxL9uPP5vDGMdKaVQNlu', 'https://lh3.googleusercontent.com/Vg1AMpmQw5hYnRUHCxsd33gJe2zMrOlI5W4ChLmoHAd1_rtzUdwuSHW86CvNRJmjkg', 'https://lh3.googleusercontent.com/0tV-rf_pX-4eIWJGVi7kvU0X6HjQ045LE6W5C_ZwWaY6D_3wjqwlMCF2tQr8tG2xBw', 'https://lh3.googleusercontent.com/d4C6VfG81YeePAHsWoGKR8Nrlm53NBSk9n2Dq2A2XR8wth4mAxXNeFgHTleMCKNfxkB5', 'https://lh3.googleusercontent.com/B6sqEV8EEer1dyhEcwUlXNxBL5_yaDQKmp_ZwRaU-T43Meim8nrRlJMOhMKYAy8BRGc', 'https://lh3.googleusercontent.com/DtorDV53H_OSoEUiau-cEAaIez5FNA0mAsVI76D4_bJotBEZiVdWAZVA66mZPcgfOw', 'https://lh3.googleusercontent.com/zAiOnp5rPISqaq19fXMg_tmwPtBoNIk08KrXmV_G-BqHAnkTqqKy1RxQIbRQC3WenJc', 'https://lh3.googleusercontent.com/sjDi2isarNJ_yuXfQ4IrpRZPqV3xJi_9DAC8BKFmyS1tFyfZJ7WylC_46_2O9nEqRzM'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 16, 2016', 'updated': 1526430007, 'version': '3.10.3', 'recentChanges': 'Mattermost Android 3.10 requires Mattermost Server 3.0 and higher\r\n- Fixed an issue where some push notifications failed to send', 'recentChangesHTML': 'Mattermost Android 3.10 requires Mattermost Server 3.0 and higher<br>- Fixed an issue where some push notifications failed to send', 'comments': ['mattermost is great on the computer client. i have troubles with the android client though where it whitescreens routinely for me. means that my testing client cannot reach me when i am not home and puts me at risk of mussing work opportunities. it is great on android when it works though. I do recommend it.', 'Slow. Only version that actually lets me sign in. Have to reinstall to get it to work some times...', "Doesn't keep your password after instructing it to", 'Overall a usable app, but can be slow and non-responsive sometimes. \nRecently it just stopped working by quitting everyone after sign in.', 'Functional, but... Not much more.', 'Fast enough for my simple needs, does the job and well.', "For a web wrapper it works rather well. If it comes up with a white page it's enough to put it in background and bring it back. Push notifications work reliably. (Make sure to configure your device not to kill the app in background!)", 'The webapp is really good, but it was not a good idea to wrap it in a mobile application.  It has improved but it is still slow, when you type.  It is not fun to work with the mobile app. I just waiting for the planned native application.', "I love Mattermost, but this app needs to become more responsive. It works without bugs so far, so it's not that big of a problem.", 'Unresponsive.  30 sec to boot.  10 sec to show the keyboard when typing the text entry.   Apart of that, the application is complete. But this is soo wrong. Very poor UX.', "Not native, can't be used as a target for sharing things, not responsive, has weird buggy behaviour. All in all a bad experience.", 'So far nice, but missing one important Thing: multi Server Accounts, Like you are a membre if an business Account and rum your own server for stuff with Friends, it is crucial to add both servers and Accounts, cause by that only 3 stars, if that Feature is included it would be a 5 star app', 'Best part of the app: it never even launches when I try opening it. Just a blank screen...', 'Absolute rubbish. Use money, buy Slack, be productive with your life.', "Web wrappers are a terrible experience. It's slow and laggy, but it works.", 'Has a lot of catching up to do with the Slack app.. hurry up guys!', 'Became unusable after certificate renewal on server side', "Love it. For real though, why aren't you using LocalStorage to allow for offline message queuing?", 'Notification IS slow . I need a native app', 'Website in apk. Bad optimisation', 'Need a native app before can be a serious Slack competitor', 'Some bugs, but nice app.', 'Add customs notification alert  ... Sound alert mute option ...   Even messaging( active session in web )  in web sound alert in mobile .', 'Lacks integration with Android OS, notification system and caching functions', 'Server connection issues', 'Bug white screen', 'very slow, no landcscape view, no option for in-app notification, hard to change team, colored noti-small-icon(must be black&white). rebuild your app immediately.', 'Not a native Android app,  just a view of the web page.  Slow, clunky and unreliable.    A native app would be well received.', "It's great for reading messages but I cannot respond on the app anymore. It types so slow, it's not worth it. It's so delayed.", 'Bad experience. Not Native.', 'Just a webapp wrapper instead of a native experience. This makes it very painful to use properly, while mattermost is quite a vital channel of communication within the company. Implementing simple touch feedback on some buttons could improve the mobile experience already significantly.', 'It takes at least 10 seconds to respond to any input and behaves in utterly unpredictable and confusing manners. Why anyone thought this was an acceptable piece of software for release is beyond me.', "I like the idea, and on web on PC it works well. On mobile there are many issues; it is slow to start, often presented with a white screen you cannot get off of, scrolling often doesn't work. There are also improvements to the app I would like: the ability to read messages offline, the ability to pull the sidebar across.", 'I tried to implement mattermost to replace slack and was pretty Impressed by the performance and features on the desktop. Sadly, most of our companies interaction is on the phone and this app is really clunky and unresponsive most likely because it is an html wrapper. This really killed adoption as it is frustrating for millennials to use as it cannot compete with the speed of ANY other messaging application it is competing for time with. DO NOT WASTE YOUR TIME INSTALLING THE SERVER!!!', 'Switched our team to mattermost instance because I believe open source is important. The Android app is lacking though. Startup is slow and does not feel polished.', 'Promising. Did not work with self-signed SSL. Laggy (probably due to app being a wrapper fit the web site). Would be nice to have audio and video chat in the future.', "It lags when I type, and the keyboard closes whenever I press the send button. You'd do better to use it directly in the browser. Please, a native app.", "Useless. Also shows 'download native app' in sidebar. Fail.", 'This is not a real Android app, it is just a browser (slower than Chrome) that points to the mattermost server. Completely useless.', "When switching from Slack to Mattermost, I expected a fully functional Android app, as the Desktop functionality seemed pretty amazing. As the Android app (and probably the iOS one, too) are basically browser wrappers, you're better off using Mattermost in your mobile browser directly."], 'appId': 'com.mattermost.mattermost', 'url': 'https://play.google.com/store/apps/details?id=com.mattermost.mattermost&hl=en&gl=us'}
