{'title': 'Diaspora Native WebApp', 'description': 'Features:\r\n\r\n- Pod selection.\r\n- Animated Gif support.\r\n- Embedded videos playback.\r\n- Opening links in external browser.\r\n- Access to "hidden" streams: Liked posts and commented posts.\r\n- Share photos from the app (via Gallery or Camera).\r\n- Share content from other apps (links, text).\r\n- Good performance.\r\n\r\nAccessibility and performance:\r\n- Toggle loading images (text-only mode for slow connections).\r\n- Change minimum font size.\r\n\r\nTranslated to various languages (constantly adding more)\r\n\r\nSource code available under GPL3 licence on GitHub: \r\nhttps://github.com/martinchodev/Diaspora-Native-WebApp\r\n\r\nAuthor:\r\n- Diaspora: martinv@diasp.org', 'descriptionHTML': 'Features:<br><br>- Pod selection.<br>- Animated Gif support.<br>- Embedded videos playback.<br>- Opening links in external browser.<br>- Access to &quot;hidden&quot; streams: Liked posts and commented posts.<br>- Share photos from the app (via Gallery or Camera).<br>- Share content from other apps (links, text).<br>- Good performance.<br><br>Accessibility and performance:<br>- Toggle loading images (text-only mode for slow connections).<br>- Change minimum font size.<br><br>Translated to various languages (constantly adding more)<br><br>Source code available under GPL3 licence on GitHub: <br>https://github.com/martinchodev/Diaspora-Native-WebApp<br><br>Author:<br>- Diaspora: martinv@diasp.org', 'summary': 'Client for the Diaspora Social Network', 'summaryHTML': 'Client for the Diaspora Social Network', 'installs': '10,000+', 'minInstalls': 10000, 'score': 1.67, 'ratings': 397, 'reviews': 291, 'histogram': [289, 35, 19, 15, 35], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.3M', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'TTTDevs', 'developerId': 'TTTDevs', 'developerEmail': 'contact@tttdevs.com', 'developerWebsite': None, 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '4929467383986841630', 'genre': 'Social', 'genreId': 'SOCIAL', 'icon': 'https://lh3.googleusercontent.com/4zm-G_0oK6gKc6ihlbXi2MGfJnI1acpKE3aU5thVZ3-9bEnNT_JtyTDatBVgeHiCOQ', 'headerImage': 'https://lh3.googleusercontent.com/w3Pqx4oD4LRcJy84lJrGt7ZdzJy2H9pnkpSL__Ew_Fete1A3TV8zU4npZXM4rSj5ksvy', 'screenshots': ['https://lh3.googleusercontent.com/CuNAFh7I-jUV_4kjtL5ib9Tta5s-OhmMMBsvjyCaGiR-NPffrFDTA73IgNfYznM45HA', 'https://lh3.googleusercontent.com/-V8nPBjQXNYKcBmu1lEONKW9Xe_VQ5hBcFHffXFYVqQN5nV5ThWbH2-KCCO0Lyc0UfyL', 'https://lh3.googleusercontent.com/ZUeIaF9Kya9fehXhTbgn0OXEF2Mxaff2yT6alIl78cpICObTZKEIVbpC27ZvnECZBedl', 'https://lh3.googleusercontent.com/k6ibQQ8W919algABj5AMuA3xueuicy4fR5uzDqUgizbhpGOaUbdB8lotCPkiV1nnfxRM', 'https://lh3.googleusercontent.com/cPTlPcuPjLcQtuYJ-t5Ga3Qa_GGdMl-WXDJwAGgsmNyhoxrUWA3t8lcr3UqjBVoz8Fc', 'https://lh3.googleusercontent.com/eA1YW9Ij2wY0a3H-X0qwCQ0lvwx70t7T_9e2-JDtpp1ahHdL2QjIrisMRGp2FO-CQBY'], 'video': None, 'videoImage': None, 'contentRating': 'Mature 17+', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 12, 2015', 'updated': 1552913258, 'version': '1.9', 'recentChanges': 'Updated libraries and Android SDK versions.\r\nFixed. Pod list activity not loading pods.\r\nMinor UI changes.\r\nCode cleanup and refactoring.', 'recentChangesHTML': 'Updated libraries and Android SDK versions.<br>Fixed. Pod list activity not loading pods.<br>Minor UI changes.<br>Code cleanup and refactoring.', 'comments': ['Not a bad app for connecting to pods, but the complete lack of any push notifications really hurts it. I want to know when people post things for me, not have remember to specifically check it multiple times a day. If that feature was added.. it would certainly get a much better score.', 'Works but with serious sharing issue. When attempting to share from another app like Google news or smart news on Android 8.0, the app crashes 100% of the time. The only way to share articles to your feed is to copy and then paste the URL, completely defeating having the sharing option entirely. This needs fixing.', "Getting started is quite confusing. System asks to enter a POD, with complete ignorance I don't know what a POD is nor is there any options to choose a POD. This app is completely obsolete.", 'Lacks basic features like push notifications, and editing of posts, and comments. Also every time I try to share into Diaspora from a third-party app, including chrome, it WILL crash, every single time.', "Can't log in. Can't get it to do anything. I set up a profile but can't interact or find anything or anyone. User instructions for newbs would be a helpful addition on the homepage.", 'So, old LG tablet w/Android 5.0.2 and the app works quite well. Much better than using web browser. Fast ( this tablet blows) no hangs or freezing. kick fedbook in the butt and go *Diaspora!', "Please fix mentions so that we get a list when we type an @. Please allow images in comments. Please allow the ability to see a friend's contacts. Please have the app show up as an option when clicking a notification link in an email. A Gplus refugee.", "the pods are confusing, I want to like this site but it is super difficult to navigate. For something that's been around as long as this has it's quite disappointing", "DO NOT INSTALL. This is a fake app for collecting data on whoever installs it. You can't access Diaspora with this. No sign in or sign up buttons, just a search bar for pods that can't pull any results because it's not Diaspora.", 'installation on Essential (phone) with Android version 9 OS. Crashed consistently, in fact never actually opened.', 'At the time i write this review, the app simply does not start on my device.', 'Does not load on S9+. Crashes immediately. I will change the rating once the basic implementations have been added and fixed.', 'Crashes immediately on the OnePlus 5. Get the splash screen and gone.', 'cannot make it run on my oneplus 5 I see splash screen then it crashes', 'No longer works. Crashes on launch in Nokia 6.1 Plus with Android 9 Pie.', "If I click anything, it just opens Diaspora in my browser. It's just a glorified bookmark.", 'This does not run on my Verizon Samsung J3. It crashes with a "missing library" exception.', "Downloaded it, and it wouldn't open at all. I was hoping for a viable alternative to Facebook but you can't even make a functioning app.", "I've been using this app for years but now that I've got my new phone it no longer functions. I think it needs an update.", 'Failed quickly. Closes as soon as you try to open it.', 'Shows splash screen and then crashes immediately on S8+...', 'Crashes straight after splash screen on honor 9 lite. Unusable', 'Crashes immediately on Android 10.', 'Crashes on launch.', 'It is not working on my android 10 device.', 'Constantly says something is wrong, near unusable', "Using this app on Pixel 3 with current Android and Action Launcher for Pixel. Can't share to this app. Therefore useless.", 'not been able to use just crashes on trying to open app.', 'Crashes on open. Totally non-functional.', 'Force closes immediately on Huawei P20 Pro. Uninstalled.', "crashes often and generally not that enticing. Is this open source? I'd be happy to contribute.", 'app wont stay open. its unusable for me', 'Crashes as soon as you open it.', 'Crashed immediately on Huawei', 'I installed it twice and as soon as I open it, it closes.', 'Crashes immediately when opened!', 'Crashes immediately on Pixel 1.', "Only needs push notifications, and it'll be pretty much perfect", "Is this app still operational? I'd love a Diaspora app, but I cannot seem to login and there is no list of pods.", 'Crashes on startup on a Pixel 2'], 'appId': 'ar.com.tristeslostrestigres.diasporanativewebapp', 'url': 'https://play.google.com/store/apps/details?id=ar.com.tristeslostrestigres.diasporanativewebapp&hl=en&gl=us'}
