{'title': 'Linux Deploy', 'description': 'This application is open source software for quick and easy installation of the operating system (OS) GNU/Linux on your Android device.\r\n\r\nThe application creates a disk image on a flash card, mounts it and installs an OS distribution. Applications of the new system are run in a chroot environment and working together with the Android platform. All changes made on the device are reversible, i.e. the application and components can be removed completely. Installation of a distribution is done by downloading files from official mirrors online over the internet. The application requires superuser rights (ROOT).\r\n\r\nThe program supports multi language interface. You can manage the process of installing the OS, and after installation, you can start and stop services of the new system (there is support for running your scripts) through the UI. The installation process is reported as text in the main application window. During the installation, the program will adjust the environment, which includes the base system, SSH server, VNC server and desktop environment. The program interface can also manage SSH and VNC settings.\r\n\r\nInstalling a new operating system takes about 15 minutes. The recommended minimum size of a disk image is 1024 MB (with LXDE), and without a GUI - 512 MB. When you install Linux on the flash card with the FAT32 file system, the image size should not exceed 4095 MB! After the initial setup the password for SSH and VNC generated automatically. The password can be changed through "Properties -> User password" or standard OS tools (passwd, vncpasswd).\r\n\r\nFEATURES:\r\nSupported distributions: Alpine, Debian, Ubuntu, Kali, Arch, Fedora, CentOS, Slackware, Docker, RootFS (tgz, tbz2, txz)\r\nInstallation type: file, partition, RAM, directory\r\nSupported file systems: ext2, ext3, ext4\r\nSupported architectures: ARM, ARM64, x86, x86_64, emulation mode (ARM ~ x86)\r\nI/O interfaces: CLI, SSH, VNC, X server, framebuffer\r\nManagement interfaces (CLI): Android terminal (or adb), telnet, web browser (web terminal)\r\nDesktop environment: XTerm, LXDE, Xfce, MATE, other (manual configuration)\r\nSupported languages: multi language interface\r\n\r\nNOTICE:\r\nInstructions and guides: https://github.com/meefik/linuxdeploy/wiki\r\nAsk questions on the forum: http://4pda.ru/forum/index.php?showtopic=378043\r\nPrevious versions: https://github.com/meefik/linuxdeploy/releases\r\nFor access to a repository: https://play.google.com/store/apps/details?id=ru.meefik.donate\r\nDonations: http://meefik.ru/donate/\r\n\r\nATTENTION!\r\nThis program comes with ABSOLUTELY NO WARRANTY. This is free software, and you are welcome to redistribute it under license GPLv3.', 'descriptionHTML': 'This application is open source software for quick and easy installation of the operating system (OS) GNU/Linux on your Android device.<br><br>The application creates a disk image on a flash card, mounts it and installs an OS distribution. Applications of the new system are run in a chroot environment and working together with the Android platform. All changes made on the device are reversible, i.e. the application and components can be removed completely. Installation of a distribution is done by downloading files from official mirrors online over the internet. The application requires superuser rights (ROOT).<br><br>The program supports multi language interface. You can manage the process of installing the OS, and after installation, you can start and stop services of the new system (there is support for running your scripts) through the UI. The installation process is reported as text in the main application window. During the installation, the program will adjust the environment, which includes the base system, SSH server, VNC server and desktop environment. The program interface can also manage SSH and VNC settings.<br><br>Installing a new operating system takes about 15 minutes. The recommended minimum size of a disk image is 1024 MB (with LXDE), and without a GUI - 512 MB. When you install Linux on the flash card with the FAT32 file system, the image size should not exceed 4095 MB! After the initial setup the password for SSH and VNC generated automatically. The password can be changed through &quot;Properties -&gt; User password&quot; or standard OS tools (passwd, vncpasswd).<br><br>FEATURES:<br>Supported distributions: Alpine, Debian, Ubuntu, Kali, Arch, Fedora, CentOS, Slackware, Docker, RootFS (tgz, tbz2, txz)<br>Installation type: file, partition, RAM, directory<br>Supported file systems: ext2, ext3, ext4<br>Supported architectures: ARM, ARM64, x86, x86_64, emulation mode (ARM ~ x86)<br>I/O interfaces: CLI, SSH, VNC, X server, framebuffer<br>Management interfaces (CLI): Android terminal (or adb), telnet, web browser (web terminal)<br>Desktop environment: XTerm, LXDE, Xfce, MATE, other (manual configuration)<br>Supported languages: multi language interface<br><br>NOTICE:<br>Instructions and guides: https://github.com/meefik/linuxdeploy/wiki<br>Ask questions on the forum: http://4pda.ru/forum/index.php?showtopic=378043<br>Previous versions: https://github.com/meefik/linuxdeploy/releases<br>For access to a repository: https://play.google.com/store/apps/details?id=ru.meefik.donate<br>Donations: http://meefik.ru/donate/<br><br>ATTENTION!<br>This program comes with ABSOLUTELY NO WARRANTY. This is free software, and you are welcome to redistribute it under license GPLv3.', 'summary': 'Installing and running a GNU/Linux distribution on your Android device', 'summaryHTML': 'Installing and running a GNU/Linux distribution on your Android device', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 3.8698728, 'ratings': 14447, 'reviews': 5217, 'histogram': [2615, 827, 950, 1481, 8572], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '17M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'meefik', 'developerId': 'meefik', 'developerEmail': 'meefik@gmail.com', 'developerWebsite': 'https://github.com/meefik/linuxdeploy', 'developerAddress': '-', 'privacyPolicy': None, 'developerInternalID': '9173474936359441277', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/3AdKQ4eDUiLw_ubUqzmSVyuWPtFOZNIOOL7nF5n6Q-RDCPO6vAdfT3Gdrkco95_HzQ', 'headerImage': 'https://lh3.googleusercontent.com/4O9utYCLgBNkFmPjHzlr66sQcfGnjPFD5UtzgtRHjfvVzX8FbdTZfDeif494W1vYP60', 'screenshots': ['https://lh3.googleusercontent.com/sDspuKlxcr3U9ddMx1Rn3-c1Pu95Q5DivPjMYnwFHT5YYpbUPbx61X5O2o1FiZcKDw', 'https://lh3.googleusercontent.com/lonsIbKmLNUWER2VghqhQxQosX8_HIV4hSKL5NZ3dypUfQZh_90eoIoiKx_1fbN9eKxA', 'https://lh3.googleusercontent.com/sRfiAm495xJNhvFpNhfmjvPyl_ns7A5vpSyG1FDwhDqW2gjkL4GfsAyVAptpU2-mc98', 'https://lh3.googleusercontent.com/EouO2ZloQZeJakXLJwdL-Hd6Id1OlwJsKjiyoU6np3fbtcVkJ-iIHE-ZGLdKRLmqo-4', 'https://lh3.googleusercontent.com/bMkhbS0sxMRs-UwDo38pzU-OYS73qW0CpNIW9lCriS3BcBriunP36rBuxAAB7fWMb8U', 'https://lh3.googleusercontent.com/TNZT7UToLwQSxpGn-E9xmA3L1bCb7PiN19LsLFBH9GzcQn7lST5pZc9KILkb3rP4NyE', 'https://lh3.googleusercontent.com/JwHEbFTcjB_S5a7XJLOZ-GuK0EI9TOET95Khit25poa-sIuT54sdIsufsRF3JbikOw', 'https://lh3.googleusercontent.com/gOzqABRp6JPcfQexIy4fXGYvRkqsc4PtiGjW99A4eT2GcpcTrHCUnEbT3UbaZSyfRA', 'https://lh3.googleusercontent.com/BRo35SUI6PPjukcKurGulwPL6byBbr1J96gEgngi9yZ5PXgxmbGKvSwjb9G00mMNPw', 'https://lh3.googleusercontent.com/OR1KKRj0rCYJ3eYjxiuDE232pKc51pTaThuhd3YNVne9oIUDqBII_PxyYQcK0H03-fRN', 'https://lh3.googleusercontent.com/V9lMlBg7owBDRL3Ur3chgRReXG4R6a08SWHpwDwPxGr0v39KqCHlBsmd7j92giTbaHFC', 'https://lh3.googleusercontent.com/6c2WDPPpLN-2aI8FodwjjPKlyi7dlFovcR8eRJgmHuVbXM9NiuTH5m3cc2ICsXus7heF', 'https://lh3.googleusercontent.com/T2QLbD-b5yCIZxWQtEyHox0oToW5ZC39tklbDdQ6GXN-NycRewZ9_2uvxOqRKZNK_w', 'https://lh3.googleusercontent.com/QZzp7hT0wKTUOZlcdkh9GTZ6lkKuw7qcgi1HZLqKItXrP_t_ysYU-l3HORvkAwqjDKE', 'https://lh3.googleusercontent.com/B2yMHM3CyMYhMOEm2tXb9GL2Vxdxf0o-b6z0oaqB0AV52RsG2aa5jwbebB2QeF2vkxM', 'https://lh3.googleusercontent.com/o8XIUfGzE3eaRbUpGckbu_j4SYrvR-BqiJjTSJib6N4scKroRTnTXcD864zgeKZcW8M', 'https://lh3.googleusercontent.com/_oRwFEchEcyLneMzQEAjihU7-PjJ-3teiNQO588uC3Uc4LcOeN4M6u6vMIM9SutiZA', 'https://lh3.googleusercontent.com/fdnDLsDN98BXpov_TvHXGf-7gYG1NBmDUVqZcUUpiIsQ1yzRbXLJ_tF4Sgxwd6fGPg', 'https://lh3.googleusercontent.com/8XFN23NCN69cKpp99v7FVSrNp8HlryLUMFloewtnFDy7ug4Y8-tP6E65FifMJ57_rU_h'], 'video': 'https://www.youtube.com/embed/9b8PnZge7vA?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/9b8PnZge7vA/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Aug 23, 2012', 'updated': 1583080749, 'version': '2.6.0', 'recentChanges': 'Set target version of SDK to 28 for binary execution in Android Q\r\nUI refactoring (@Iscle)\r\nMinimum Android API set to 21', 'recentChangesHTML': 'Set target version of SDK to 28 for binary execution in Android Q<br>UI refactoring (@Iscle)<br>Minimum Android API set to 21', 'comments': ["I've used linux deploy many times on every phone I've owned. it has always worked flawlessly. i have a Xiaomi mi 8 now, and it's not working. Another review says they have the same phone and they had to soft link /dev/block/loop0 to /dev/. I don't know what that means because I'm not a smart man and I can't find any answers on the internet. If i figure it out I'll change to five stars, because it's a great app that's always worked before now.", 'I\'m using Linux Deploy on a "used to be a Kindle Fire 8" now running Lineage 14.1. I\'ve basically found Linux Deploy to be exactly what it is, an application for configuring and deploying a container. It\'s not flawless but then again, who thinks they should be able to download a free container application to run flawlessly on a hacked piece of hardware running a makefit, unsupported OS. I have installed and tried Alpine, Kali and Ubuntu and it has exceeded my expectations. Thanks Anton!', 'It can easily get 5 star but start and stop button not working from notification panel. Besides exit button also needed to be added at the notification panel', 'App will not recognize any connection but Wi-Fi, screw everything else. ie: not F.O.S.S. therefore rejected, on my phone, what u do w/URS is on U. I do not support folks who charge B4 dnld, is Bad Practice. Also listed wrongly, should be in PAID apps, cuz definitely not Free Software.', "Awesome for running linux on one's Android. Have used it for two yesrs with few problems.", 'Excellent!The Alpine linux ssh login issue has been fixed!THANK YOU', 'LinuxDeploy helps me run a Debian command line inside my Samsung phone, ready to use wherever I go. I am very happy to help support the author with a contribution to Piggy Helper.', 'With my xiaomi mi 8 I had to soft link /dev/block/loop0 to /dev/ to link the loop: ln -s /dev/block/loop0 /dev/ ... Fantastic application!', 'Not working in Rog 2 no download option found and if I click on start getting error requires super user privileges', 'Dear, meefik There is a lot need of opengl (3.2) in this app It would be very appreciating to to see such a feature please try to add it if it is possible or if not reply me Thank you SocialGamerGang', "Doesn't seem to work on my Oneplus 7 Pro for some reason...", 'Hello This is a good app. but if someone could tell me which one i use for launching games? thanks..', 'Rooted phone running Android 10, does not work. When you figure out one problem it\'s followed by the next. Has issues reading its own data directory somehow and when you get past that it can\'t mount the os image. Android 10 "support" for this app only just happened but has a long way to go.', 'We cannot use docker also lxc in have this root package i have my mobile also rooted but lxc downloading roofts but not running it. Alpine term apk have in github is better than termux app', 'Nice app but please add no-su features please!!!', 'works very well. But very hard to configure all things, also after installation almost blank linux system i get nothing in there and frustrating thing is almost no command preinstalled, no apps . Fix it and please give something so that we can enjoy running linux. Remove all bugs after installing linux so that i can get something to explore. How i configure audio please tell this ?? Although i have enabled audio output. All things very-very complicated. Give something to start.', "Tricky setup for someone inexperienced as myself but many guides and forums later.. Got phone rooted, got Linux Deploy, formatted SD card, installed Ubuntu and both remote desktop and SSH access work great. I'm very surprised at Linux ARM support for basic apps like Libre office. This app works great but it's a long journey for those dedicated to try.", "Everything is well. However, I cann't stop the container when I run a container for a long time. And I can start the container agian after rebooting. OS: android 9.0 Again, it gets well after installing busybox completely. I want run some commands automatically after starting a container, is this OK?", 'This is the best way to run linux on android in just a few easy steps. You can install ssh with connectbot and view the GUI with VNC Viewer. Thank you so much to the developers!', 'The best so far for my need to replace my PC functionality. Just a little problem is that the container need to wait 5 minutes since my cellphone bootup before it can start. I believe that is something to do with the superuser. Hope developer can fix this up. Many thanks...', "I'm really impressed by the automation this app does for installing the linux distros. [Update] As it turns out, the observed problem with the home and recents button was caused by some android setup wizard activity beeing triggered after the sudden shutdown. The problem was resolved by starting the exit activity of the android setup wizard.", 'The bad ratings are from people who don\'t understand what root means. The app is versatile and reliable and does something the Android\'s Linux kernel is capable of: containerization. And very easy options to make stuff "just work". It\'s amazing really, desktop Debian/Ubuntu/& many more on a phone.', "i want to install kali linux on my sd card.my phone name is symphony v85.i change the img file location to internal memory to external.after downloding it's not starting can you help me?", "Really great app , but the most great future don't work (framebuffer) ,please bring it to work again", "Works great, been using for many months now and have had no issues. Nice little env for when I'm on the go. As somebody that uses Linux on every device they have it's nice to have something like this, especially for on the go development.", "my old Note 3 is a debian server running all sorts of services, it's amazing how much power these phones have and with Linux Deploy you can get to it, thank you developer, a truly awesome app!", 'This is a great app and performs exactly as it should. If you don\'t know what "superuser privileges" are you probably shouldn\'t be using this. Of course it requires root because it is deploying a new operating system on your phone.', 'I wished I could experience this. Unable to rootkit this device I cannot afford another device yet.', 'Works perfectly. If you get the error "Creating image file .. Fail" change the installation type to directory in the configuration and install it in the environment directory(default option).', "it has some glitches' but when you get to know them, you can usually bypass them. I couldn't make it work on my old Huawei p6 though, any other phone, even older and crappier worked ok. Thank you :-)", 'This app streamlines the process of getting a Linux system installed on your device. The documentation from github helped a lot for learning about all the features/settings available.', "I don't know how many apps out there exists like this one but after some reading online to make the necessary configuration settings correct I was able to apply the Kali image and I can boot into it -what a great app I have to say thank you very much for your effort really cool stuff keep it up ðŸ‘", 'I keep getting this error: mounting the container >>> fail & there is no help on the internet about this error. This app is useless.', 'I am sure this is a very cool app so I am giving it 5 stars because I love Linux and now I will be able to run it on my phone. How do I get root access? I cant figure it out, I know the command for the PC version but I cant even access the terminal on this app.', 'Pay to deploy free software? No thanks', 'Very good app, it just unlocked the power behind an android device. Very usefull, you can turn your old phone into a powerful Linux server.', 'What the hell is this thing , if its working with VNC y so much trouble installing other things', 'Just updated, linux now will not start, either from the gui or the command line reporting "Missing parameter: TARGET_PATH"  It\'s not so great when just updating the app breaks the installed system -.-', 'Works great on Android 9! I installed Ubuntu Bionic sucessfully on Google Pixel XL. However, Arch gets errors when trying to install libsystemd. Maybe fix it to systemd-libs?', 'good. but it contains some glitches just like when launching firefox on Ubuntu Mate. it launced once, but not another time. i hope support can help.'], 'appId': 'ru.meefik.linuxdeploy', 'url': 'https://play.google.com/store/apps/details?id=ru.meefik.linuxdeploy&hl=en&gl=us'}
