{'title': 'VoIP.ms SMS', 'description': "VoIP.ms SMS is an Android messaging app for VoIP.ms that seeks to replicate the aesthetic of Google's official SMS app.\r\n\r\nFEATURES\r\n\r\n• Material design\r\n• Push notifications\r\n• Synchronization with device contacts\r\n• Message search\r\n• Comprehensive support for synchronization with VoIP.ms\r\n• Completely free\r\n\r\nRATIONALE\r\n\r\nA number of people use VoIP.ms as a cheaper alternative to subscribing to a voice plan for their mobile devices.\r\n\r\nUnfortunately, this can make sending text messages rather difficult, as the VoIP.ms SMS Message Center is clearly built as a diagnostic tool for use in desktop browsers, not as an easy way to send and receive messages on a mobile device.\r\n\r\nVoIP.ms does provide a mobile version of this interface with an improved UI, but it still lacks important features that are only possible with a dedicated app.\r\n\r\nLICENSE\r\n\r\nThis application is open source; it is made available to the public under the Apache License 2.0. You can download the source code from the application's GitHub repository, which is located at https://github.com/michaelkourlas/voipms-sms-client/.", 'descriptionHTML': 'VoIP.ms SMS is an Android messaging app for VoIP.ms that seeks to replicate the aesthetic of Google&#39;s official SMS app.<br><br>FEATURES<br><br>• Material design<br>• Push notifications<br>• Synchronization with device contacts<br>• Message search<br>• Comprehensive support for synchronization with VoIP.ms<br>• Completely free<br><br>RATIONALE<br><br>A number of people use VoIP.ms as a cheaper alternative to subscribing to a voice plan for their mobile devices.<br><br>Unfortunately, this can make sending text messages rather difficult, as the VoIP.ms SMS Message Center is clearly built as a diagnostic tool for use in desktop browsers, not as an easy way to send and receive messages on a mobile device.<br><br>VoIP.ms does provide a mobile version of this interface with an improved UI, but it still lacks important features that are only possible with a dedicated app.<br><br>LICENSE<br><br>This application is open source; it is made available to the public under the Apache License 2.0. You can download the source code from the application&#39;s GitHub repository, which is located at https://github.com/michaelkourlas/voipms-sms-client/.', 'summary': 'Messaging app for VoIP.ms.', 'summaryHTML': 'Messaging app for VoIP.ms.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.36, 'ratings': 366, 'reviews': 259, 'histogram': [25, 10, 10, 76, 241], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.8M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Michael Kourlas', 'developerId': 'Michael+Kourlas', 'developerEmail': 'michael@kourlas.com', 'developerWebsite': 'http://www.kourlas.com', 'developerAddress': '1266 Jester Court\nManotick, Ontario\nK4M 0A2\nCanada', 'privacyPolicy': 'https://github.com/michaelkourlas/voipms-sms-client/blob/master/PRIVACY.md', 'developerInternalID': '8396855075681814519', 'genre': 'Communication', 'genreId': 'COMMUNICATION', 'icon': 'https://lh3.googleusercontent.com/f8yNUQnOnFtfZkrJc6IFcB0UsyMRq-dMBHH4-XbprrzjQwxE-q8AT9rlSynzUmvoavIy', 'headerImage': 'https://lh3.googleusercontent.com/mr4RfXl1teUZ1Xc_aK_VStrjMS-YsD_4eQsHl7Cn0BOsvMPvak2RFQLHdXFNgUXcBA', 'screenshots': ['https://lh3.googleusercontent.com/BmpsH2bAidw8oN-2YrSGGmRnjQLBvewupSpRcympuOeHQIl5KA1TgrbWBF4mu2DjPQ', 'https://lh3.googleusercontent.com/RiopOYIpKmLKUEWVib6XImiY9lePv5qC1OMoStVGAEPrfFHp9bm0SlIrmo8s59VtxeY', 'https://lh3.googleusercontent.com/4QVBfb2ZnMUG5i0qBwYbUf6JwD5xZOB80rSXF6z5gsHo7BojfMfDRTabnhMMaWUhywA', 'https://lh3.googleusercontent.com/BMWJ3sbHpuSwXItOx2XurE_-riad-O3WguIFJCukNs0ifyiVHPJ4mh9yER5-IWgn38Q'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 6, 2014', 'updated': 1580570359, 'version': '0.6.5', 'recentChanges': '0.6.5\r\n• Dark theme\r\n• Allow viewing all DIDs in conversations view\r\n• Allow backing up a single conversation\r\n• Allow changing the maximum size of the message text box\r\n• Allow copying the DID and contact phone numbers from the conversation view\r\n• Use Android keystore to store VoIP.ms email and password\r\n• Bug fixes', 'recentChangesHTML': '0.6.5<br>• Dark theme<br>• Allow viewing all DIDs in conversations view<br>• Allow backing up a single conversation<br>• Allow changing the maximum size of the message text box<br>• Allow copying the DID and contact phone numbers from the conversation view<br>• Use Android keystore to store VoIP.ms email and password<br>• Bug fixes', 'comments': ["I love this app, it looks great and it's free. The only issue I have is when multiple messages come through at once (split because over character length) they don't show up in the right order (which can be a little confusing). I would be happy to help troubleshoot this if needed.", "All good! Messages still come in out of order though. Have to jump back and forth between long messages. Oh and I know you can't send or receive images with this but could you somehow indicate that someone tried to send one to you?", "I've been using this app for a couple of years and it's been great. There has been an issue for the last couple of months though with syncing new messages. Like some other reviewers have stated, seems push notifications are not coming through. Any ideas? Might be related to the recent slew of android updates.", 'For Push notifications to work, make sure you follow the instructions for the URL Callback settings!', "Looks like a good app but I can't get it to work for some reason.. I have sms enabled, and logging in to this app enabled sip url callback to the proper url it looks like but I get sms failed whenever I try to send an SMS.. not sure if it's the app or VoIP.ms. Edit: fixed, it was an issue on VoIP.ms' end", 'Overall, this app is fantastic. Although I do have a minor annoyance. I use 3 numbers, but use one of them way more than the others. I can\'t figure out how to change the order of appearance for those numbers. My primary # is second on the list, so I have to select it each new text message. If I could change the order, I would place it at the top. Alternatively, having the option to turn off the number select altogether, and have it use whatever number the "tab" you\'re on is would be amazing.', "I was super excited to discover this app and thought it was a 5 star for sure but on my second attempt to send a message I'm getting an error that it can't send the message because it's too long. That seems pretty basic. The message was probably slightly longer than a single sms message. So i guess I'm back to sending voip.ms sms messages by email since there is no such limitation. Too bad!", 'First, I must say I really like this app. The problem that I indicate has only started in the last while. My phone no longer receives incoming SMS messages when the are sent to the phone. Let me clarify, unless I specifically have the app open in the forefront, I see nothing… Does not download them in the background even with 5-minute synchronization… strange… Updated to the latest version and still nothing....', 'Love the app! It works great and it\'s very useful.  I would like to offer a couple of suggestions to improve it even more:  - When selecting a contact that has multiple phone numbers, the window that pops up to select the correct number to use should indicate each number\'s description (i.e. "mobile", "home", "work", etc.)  - I don\'t know if that\'s possible due to the app not using the SIM card for SMS but it would be awesome if it could be registered as an actual SMS app with Android so that it could be selected as the default SMS app. This way other apps that integrate with SMS functionality could use it instead of Google Messages.  Thanks for developing this app and keep up the great work!', "This app was the deciding factor on whether I would switch to VoIP.ms or not. I can use this with a data-only plan and have nearly the same experience I would texting through a carrier. There are some quirks because of VoIP.ms limitations, like how large messages are split up and out of order, but they're manageable. Edit: removed feature request because I just saw on your GitHub page that VoIP.ms is working on MMS. Exciting stuff!", "Pretty nice, seems to work well! Only issue is that my SMS are coming out of order... I'll send a message, then the reply will come above it, and then my text below my first... seems inconsistent as well. But, it works! So that's a pretty big plus.", "i was excellent on Android 8 but now that I'm on Android 9 i find this app hangs when you launch ir or switch between apps to get to it. last update May 18, 2018. It's a fine app that just needs some bugfix, other than that good job creating it! edit 2019.04.15: update just came out this morning adding support for Android 9. i uodated it and it's working beautifully. Great app!", 'This app is great, it makes the voip.ms number on my phone act like a first-class phone number (ie I can text back and forth with other folks who are not voip.ms customers and everything just works).  I really like the new look that came with the latest update.', 'Great app and love the fact that author made it open source. One feature I would LOVE to have is dial contacts using DISA PIN feature of voip.ms. The feature is similar to how calling card apps work - you dial your own voip number, pass in DISA PIN and then the contact to call.', 'clean simple no fault alternative sms to cell-phones from - your choice of tablet or other non cell ( or cell) android device with potential advantages of blue tooth keyboard for faster typing, plus privacy element of 2nd non cell msngr, plus $$ savings vs. some data plans. push feature a hugeb plus!', 'great app allowing almost instand sms through Voip.ms. i just hope there is a material design redesign comig soon because the app is looking kind of dull. Great job. I would be willing to pay gor a pro version with more customization !', "the best app. I rarely leave reviews but the maker deserves more than reviews. I've donated and suggest others should too as the maker wasn't gready and didnt introduce ads or buyable functions. I hope the sms service from voip.ms stays free", "This app just works. I've been using it for several years and have found it to work flawlessly. If issues do occur, Michael is very quick to respond and helpful.  Thanks Michael!", 'Very good application for VoIP.ms. I like it. Thank you.', 'Excellent SMS app and easy to get started. Outgoing messages seems to be a bit delayed, but incoming is pretty much instant. Need a phone version of this...', 'Works great! I briefly inspected the code and saw no problems. When voip.ms releases MMS it will be even better than carrier SMS minus the obvious issues with UDH concatenation or encoding.', 'amazing app, hats off to the developer. love how to enable API IP Address outside of office or home wifi / mobile data i can just add 0.0.0.0 to allow any ip to aviod missing any text', "I really love this app, but i don't run the most recent build simple because I hate the new color choices. Could we at least get to choose the background color for messages?", 'Now VoIP.ms is like real second provider here. Wish this app could handle standard SMS in dual-sim style. And message assembly/disassembly desperately needed, especially for Unicode (shortened) messages.', 'awesome app. would it be possible to limit outs access to a single phone number when you have multiple? thanks', 'Love everyrhing about this app ecept one thing. Some times it sends my reply 3 times. Not sure why but as a bussines owner it can look unprofesional when i reply to a cusromer 3 times.', 'This app is the best way to do SMS when using VoIP.ms. The ability to set this as the default Android SMS app would be appreciated.', 'Lightweight, no ads, no hidden fees, fast, open source, clean user interface. Super.', 'Works just like a regular sms app. 5 stars if there is a unified view for all numbers.', 'Awesome app. Thanks for making it easier to get SMS from voip.ms.', 'Can I use this app to send sms messages within nz because voip.ms says their beta system is only for us and can. I did have a voip provider that did sms too until recently. They appear to have stopped this part of their service 😟', 'Great app, and works as expected. Thank you very much!', "If you open it up the sms don't appear right away other than that is great please fix it thanks", 'The sms app just works . Voip.ms has been awesome !', 'great little app that works with voip.ms to send texts', "I love the app. Anyway to donate other than PayPal? I'd love to send some money, but their .99 fee is ridiculous. OpenCollective would be great.", 'App freezes when it tried to load address book when you click on the + sign', 'love this application. like the new material design. Great revision. Do you have the source on GitHub or gitlab? Would love to contribute.', 'Picture message is the only missing feature.', 'Thank-you for your hard work. This app is well-made and works as expected.'], 'appId': 'net.kourlas.voipms_sms', 'url': 'https://play.google.com/store/apps/details?id=net.kourlas.voipms_sms&hl=en&gl=us'}
