{'title': 'Message Counter - SMS Counter', 'description': 'Free and Open Source Message Counter!\r\n\r\nFeatures:\r\n- Shows number of SMS sent each day and per each cycle\r\n- Shows the number of SMS messages in inbox, sent and total.\r\n- Custom Ignore Numbers\r\n- Top message senders as chart\r\n- Notify when SMS limit per cycle is reached\r\n- Material Design interface\r\n- Sorted list of received messages\r\n- Home screen widgets\r\n- No Advertisements\r\n- Free and Open Source\r\n\r\nSupport this project by In-App Donations, so that we can provide updates and bug fixes.\r\n\r\nFAQ. https://github.com/midhunhk/message-counter/wiki/FAQ\r\nFacing issues? https://github.com/midhunhk/message-counter/issues?page=1&state=open\r\n\r\nThe source code is available at https://github.com/midhunhk/message-counter\r\n\r\nThis app is developed by a single designer/developer working in his free time. Hence updates or new features may not be frequent.', 'descriptionHTML': 'Free and Open Source Message Counter!<br><br>Features:<br>- Shows number of SMS sent each day and per each cycle<br>- Shows the number of SMS messages in inbox, sent and total.<br>- Custom Ignore Numbers<br>- Top message senders as chart<br>- Notify when SMS limit per cycle is reached<br>- Material Design interface<br>- Sorted list of received messages<br>- Home screen widgets<br>- No Advertisements<br>- Free and Open Source<br><br>Support this project by In-App Donations, so that we can provide updates and bug fixes.<br><br>FAQ. https://github.com/midhunhk/message-counter/wiki/FAQ<br>Facing issues? https://github.com/midhunhk/message-counter/issues?page=1&amp;state=open<br><br>The source code is available at https://github.com/midhunhk/message-counter<br><br>This app is developed by a single designer/developer working in his free time. Hence updates or new features may not be frequent.', 'summary': 'Track your sent Text/SMS count per cycle and get notified when you cross it.', 'summaryHTML': 'Track your sent Text/SMS count per cycle and get notified when you cross it.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 1.39, 'ratings': 945, 'reviews': 247, 'histogram': [803, 47, 28, 0, 66], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '1.9M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'AE App Labs', 'developerId': '6177347481993841752', 'developerEmail': 'aeapplabs-support@live.in', 'developerWebsite': 'https://ae-app-labs.github.io/', 'developerAddress': '225 Van Horne Ave\nNorth York\nToronto,\nON, M2J 2T9', 'privacyPolicy': 'https://github.com/midhunhk/message-counter/wiki/Privacy-Policy', 'developerInternalID': '6177347481993841752', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/p65Wh4uE7uKy0knCSEeCVT-M1C1QzxUN79D0nK-zGEHPKacDRpJ0JeOMIB48Szes_IvT', 'headerImage': 'https://lh3.googleusercontent.com/0d96Pjm6TEsw2t9SxVPaxomPMkuFLOIHq_hO7DoHMXhRwFSYNP4rpByGU0Wqz8CUYzs', 'screenshots': ['https://lh3.googleusercontent.com/H_nn7-FYXOVtDvMtWq9qH7LGvX5Bv0S6-xQqQwmhL6KrXxVSQDR6H7aC3ZOKeEzHNPk', 'https://lh3.googleusercontent.com/DBMgbgglAACYa-ERjVEYZ3KxobKPZj8BE9Qylp5VCaUYs1tqB1oSGuNjQDn6617ZOg0', 'https://lh3.googleusercontent.com/yzsS9mdHi98qPlKvCl-dYSnvvMlu8cnpwnpsjkKnfOWaCjuRUNIokOS235jFkRsxOQ', 'https://lh3.googleusercontent.com/8ObkL-pMLPP56jn12c99SR6c4CgjCOBv1pv2tVEUOGK8ZsyOe2u4svsdM_hnrgSq0g'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 23, 2013', 'updated': 1557747218, 'version': '4.1.1', 'recentChanges': 'Updated Translations', 'recentChangesHTML': 'Updated Translations', 'comments': ['This app is good. I used it for long days. But recently I have watched something unusual. I am using postpaid number. So counting of sent message is very much important for me for my billing purpose. On last day I found that this message counter is showing 3 messages extra, while I am sure that I have not sent those extra 3 messages. In fact other message counter app is also showing the correct statistics. What may be the reason? Please look into the matter and solve it.  Additional information: I have received 3 OTP related message on that day in my inbox. Can these be wrongly reflected as sent messages?', 'Very easy to use and really helpful for me. It works on any messaging apps. Loved it.', 'app counting sms properly for saved contacts only and not unknown numbers sms. As well no count for success or failed delivery messafes.', "well i know i have sent 1 sms today and this shows 38. so either the App isn't accurate or my operator JIO is doing something wrong..", "Doesn't work.. asking for downloading another app from another appstore", 'idiot app... no working.just wast of time.', "Doesn't work, just wants me to download from another app store", "Can't download it!!!", 'does this app count a messenger messages?', 'What I wanted!!! Kudos !!!', 'Fantastic app I love it ❤️❤️😋', "doesn't work", "doesn't work", 'mad appp', 'Frzi h', 'boring app', 'bad', '5 stars. Congrats 🙂', 'its good but is limmited to sms  there must be an option for other messaging app like messenger', 'Nice app', "I really loved your app, i always send sms, and after sending 50, i'll have to reactivate, so this will remind me, now i want to ask you something, it's about the sms counter, for ex : if i send 3sms in one (one sms that is more than 400 characters long) it'd be considered one sms, but we get charged for 3, so does ur app count the sms threads or the number of characters in each thread?       Edit : Just tried it, and it does count by thread, can you do anything about this feature please ?", "this use to work but doesn't work anymore. I sent 118 messages yesterday and sent a further 200 today. and yet it still says 118.  well be uninstalling app. as its still not been fixed.. very very bad app..", 'Used this app it is not that good starts in the middle of a texting cycle so trying to keep track was impossible as the date for accuracy was not there. It is not a good app at all deleted it', 'I was optimistic about this one. It doesnt seem to work... ive sent sms since yesterday and not a single count..', "It's very bad app .", "Doesn't count my messages when u use Signal app", 'Worst app', "It used to work fine. Now, I've sent like 20 messages, and the counter says zero. Please help. How do I check if the background service for the app is running?", "It's not counting correctly..I sent 20 SMS,it shows 4 SMS..", "Can't read Private ones no.  Of messages and hence misses to take 5star", "It's counting recieved messages as sent messages so it showing more number than I sent", 'How reset counter?', 'Food', "Hard to find specific information, no real way to filter results for each contact by date or billing period (additional contact groups would be nice, which may or may not be possible) - secondly, the total messages includes my previous phone SMS' but the list and chart numbers are only my current phone totals.  Other than those tiny complaints this app is amazing and its the totals you want, then get this app!", 'I\'ve message limit per day. It would be good to have limit options like, 1) per day 2) per week 3) per month (with cycle starting date). Though it\'s showing "Today" option, we have to keep an eye.', 'It does works but it fails to start the msg count at few days and even after sending few messages the count shows zero.', "It's making most of my applications lagging.", 'Strange app. I have been messaging left right and center,  yet shows a very low count', 'Fake', 'Awesome'], 'appId': 'com.ae.apps.messagecounter', 'url': 'https://play.google.com/store/apps/details?id=com.ae.apps.messagecounter&hl=en&gl=us'}
