{'title': 'Public Transport - Timisoara', 'description': "Get real-time vehicle arrival times from Timisoara's public transport system. \r\n\r\nUse your device to download live arrival times obtained from the real-time GPS tracking units installed in all public transport vehicles (trams, buses and trolleybuses). The app connects directly to Timisoara's Transport Authority (RATT) servers and presents the arrival information in a format optimized for mobile devices.\r\n\r\nFeatures a utilitarian interface designed for quick browsing and information access. Arrival times are displayed using two formats:\r\n- N min the live time, obtained via GPS until the vehicle arrives in the station\r\n- HH:MM the scheduled vehicle arrival time. The scheduled time will most commonly be displayed when the vehicle has not yet left the end-station (i.e. no vehicle heading your way)\r\n\r\nFeatures:\r\n- Display live vehicle arrival times for all stations from a line. \r\n- Display arrival times for connecting lines \r\n- Does not require GPS activated on your device (saves battery)\r\n\r\nApp github: https://github.com/MihaiBalint/TimisoaraPublicTransport\r\n\r\nSpecial thanks to RATT and the people at http://www.ratt.ro/forum\r\n\r\nPrivacy policy: https://opentsr.com/privacy_policy.html\r\nTerms: https://opentsr.com/terms_and_conditions.html\r\n\r\nRequires\r\n- Internet connection to download live times\r\n- Memory card access for caching", 'descriptionHTML': 'Get real-time vehicle arrival times from Timisoara&#39;s public transport system. <br><br>Use your device to download live arrival times obtained from the real-time GPS tracking units installed in all public transport vehicles (trams, buses and trolleybuses). The app connects directly to Timisoara&#39;s Transport Authority (RATT) servers and presents the arrival information in a format optimized for mobile devices.<br><br>Features a utilitarian interface designed for quick browsing and information access. Arrival times are displayed using two formats:<br>- N min the live time, obtained via GPS until the vehicle arrives in the station<br>- HH:MM the scheduled vehicle arrival time. The scheduled time will most commonly be displayed when the vehicle has not yet left the end-station (i.e. no vehicle heading your way)<br><br>Features:<br>- Display live vehicle arrival times for all stations from a line. <br>- Display arrival times for connecting lines <br>- Does not require GPS activated on your device (saves battery)<br><br>App github: https://github.com/MihaiBalint/TimisoaraPublicTransport<br><br>Special thanks to RATT and the people at http://www.ratt.ro/forum<br><br>Privacy policy: https://opentsr.com/privacy_policy.html<br>Terms: https://opentsr.com/terms_and_conditions.html<br><br>Requires<br>- Internet connection to download live times<br>- Memory card access for caching', 'summary': 'Get live public transport arrival times in Timisoara.', 'summaryHTML': 'Get live public transport arrival times in Timisoara.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 2.5978837, 'ratings': 4010, 'reviews': 1165, 'histogram': [1877, 371, 350, 307, 1103], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Open Transport Routing', 'developerId': '7623755293427854224', 'developerEmail': 'nailuii@gmail.com', 'developerWebsite': 'https://opentsr.com/', 'developerAddress': 'str. Charles Darwin nr. 2 ap. 3, Timișoara, Timiș, Romania', 'privacyPolicy': 'https://opentsr.com/privacy_policy.html', 'developerInternalID': '7623755293427854224', 'genre': 'Maps & Navigation', 'genreId': 'MAPS_AND_NAVIGATION', 'icon': 'https://lh3.googleusercontent.com/I4AafOGw2PMvnpa9w4JklxiJ6gIgWXLbXxLDPs-QAVizU9VTnncRFmC-WzlDttypR8c', 'headerImage': 'https://lh3.googleusercontent.com/BLD9XYdtd9XeISu6AtHo492HZknAVHq1haxxNFq1_17nNTVr2CUVmu8u4M7iU1kUJPw', 'screenshots': ['https://lh3.googleusercontent.com/K1aOdyzvCtpQztorLLFjqlnl5SVlauOCLZqDLnSnSYZWXJ0J2kmU4SyqkDIJ_tuWhuc', 'https://lh3.googleusercontent.com/zY0SjgUPhQpzsNhET5FbV8ZYsZL2gjxTyPib7S8fiHdboykHw4g4_-_VDAjdz4A0_rM', 'https://lh3.googleusercontent.com/uracSNBmy9DmNX6-ixB3p6BusghWIKPOhDT5GVFIRQR28vVxpay2bbbOi6L-2LXJe8s', 'https://lh3.googleusercontent.com/9LLpsyh7Dy2hEq6LdH_R_YurXWu3RfPSqNmUwr_bkxet0BKteJC7DDz21HjqlcUgC2B8'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': True, 'containsAds': True, 'released': 'Feb 8, 2012', 'updated': 1575704309, 'version': 'Varies with device', 'recentChanges': 'Update transport routes', 'recentChangesHTML': 'Update transport routes', 'comments': ["This app is useless. It almost never works! I am very surprised when is does.. It's one of the worst apps i used so far.", "This peice of shot of app is not working. It cannot download lines from both URLs which means you cannot use it all as it's the main functionality of the app.", 'The app is mostly useless. It has been malfunctioning for almost a week now.', 'Kept getting worse until the point of being completely useless. Desperately needs some bug fixing or something..', "It's barely functional and most lines have only errors.", 'Network Error.Please fix the problems.Asap!!!!', 'App not working!', 'Does not work at all.', 'Does not work at all', "can you solve please the route for bus 18 from 'solvent' to 'pt. verde'", "Doesn't work at all", 'This is the worst application ever created, jebem vam ja majku..', 'Nu va merge aplicația de o luna @___@', 'Sometimes it works.', 'The app is way better organized than the "official InfoTraffic". The fact that you can also see the times of the possible connections available at a specific station gives it a big advantage in terms of user experience. Lately, there some issues in terms of correctly displaying the waiting times for some of the public transportation lines (eg. E2 line starting with AEM station), as well there is a lack of displaying some of the stations available only during specific time intervals. Ty for it', 'In principiu e bună aplicația. Însă atunci când nu merge, păi nu merge. Arată niște ore haotice la care trebuie sa ajungă mijlocul de transport. Aștept până la minutul afișat și când se apropie timpul, se decalează cu alte 20 se minute spre exemplu. PS: Ar fi fain sa introduceți detalii pentru zilele nelucrătoare.', 'Nu respecta timpii, da erori des, stai in frig ca prostu. Ma mir ca are 2.4 rating', 'In anumite momente nici nu merge la cat de kkt ii', 'Cu aplicatia asta ma apuc de carnet', '50% din autobuze nu apar pe traseu....', 'Nu functioneaza corect', '‼‼‼‼', 'A mers OK pentru o vreme, dar vechimea se simte tot mai tare: network error aiurea pentru trasee pe care alt app le arată OK, câteodată indicatorul de vehicul e doar un cod "& gt;" și nici nu-l vezi bine unde e, alteori vehiculul e pe traseu și aplicația arată că nu e și că mai ai de așteptat un secol... cam varză treaba.', 'Aplicația este bună, felicitări! Păcat de periodicele estimări proaste ale timpilor care, din câte observ, se datorează și sunt aceleași cu ale panourilor RATT-ului.', 'ughhh....de unde sa încep? ah da cu începutul: cea mai proasta aplicatie pentru transportul in comun din Timișoara. La 7 din 10 folosiri imi da erori de conexiune desi am datele mobile pornite sau sunt conectat la o retea de internet. În plus, actualizarile nu ajuta cu nimic, sunt doar spațiu ocupat in telefon. Cel mai important insa este ca niciodată, dar absolut niciodată nu afișează corect in cat timp vine tramvaiul/autobuzul. Arata ca vine in 2 minute si stau jumătate de ora dupa tramvai!!!', 'Exista o problema la tramvaiul nr 8 sens dinspre Aem, da network error, \nrestul functiuneaza ft bine', 'O aplicatie buna de sters , imi amitesc cand erau tabelele alea cu ore fixe \ncare erau de 10 ori mai bune , in loc sa evoluam noi mai mult scufundam in \nhaos probabilitatea ca sa iti arate o ora exacta e cam de maxim 10%', 'Aplicatia e stricata, nici odata nu a ajuns autobusul pe timp, altele nici \nnu arata unde e autobusul si sa schimba timpul de asteptare de fie care \ndata am dat refresh', 'Tocmai am petrecut 35 de minute in statie, pentru că tramvaiul pe care ar fi trebuit să l iau la 7.44 a trecut la 7.40', 'Nu imi arata nicicum timpul cand ar trebui sa ajunga expresul. Imi arata \nnetwork/internet error orice server as alege', 'Sunt probleme cu conexiunea la serverele RATT...network error. Chiar daca schimb linkul tot aceeasi eroare primesc pe linia E1.', 'Deci efectiv iti da connection error atat de dein aplicatia asta incat iti vine sa tr caci pe ea', 'Useless pana RATT/STPT isi modernizeaza serverul!', 'Este o porcarie de aplicatie. Nu te poti baza pe ea de nici o culoare. Se schimba timpii complet aiurea.', 'Da mai des connection error decât timpii in care ar ajunge mijloacele de transport', 'Dă tot timpul Server Error și și atunci când nu dă, timpul este greșit', 'o aplicatie de toata jena, rusine programatorilor pentru mizeria asta, m-a facut sa pierd autobuzele de nenumarate ori ca nu le arata pe traseu sau da eroare de net, o porcarie', 'Inainte mai nimerea programul. Acum nici nu il mai arata si da eroare de conexiune cand face update la program desi am incercat si pe date si pe wi-fi.', 'Autobuzul 5 ar mai trebui bagat, ca nu stiu pe unde circula, e acuma recent pus pe un traseu prin piata 700 si cetatii cred.', 'Incerc de ceva vreme sa reusesc sa vad mersul ptr M44 si nu reusesc deloc, indiferent de ora la care accesez aplicatia. Unde gresesc eu sau unde e problema aplicatiei? Sau ptr. M44 nu functioneaza? Utilizes Samsung S7 Edge.'], 'appId': 'ro.mihai.tpt', 'url': 'https://play.google.com/store/apps/details?id=ro.mihai.tpt&hl=en&gl=us'}
