{'title': 'Retroboy', 'description': 'Retroboy provides vintage imaging technology not seen since the digital cameras and monochrome screens of the previous century. A series of real time filters implement various image processing algorithms, to emulate the graphic experience of classic hardware. This app is open source and pull requests are most welcome!\r\n\r\n https://github.com/mikljohansson/retroboy\r\n\r\n* 4-tone Bayer dithering as found on the Nintendo® Game Boy® Camera\r\n* Amstrad CPC filter with 27 color palette\r\n* PXL-2000 PixelVision filter emulating one of the first digital video cameras\r\n* Commodore 64 filter with VIC-II 16-color palette\r\n* Atkinson dithering filter used by the original Apple® Macintosh® OS\r\n* Halftone dot filter as popularized by Roy Lichtenstein and the pop art movement\r\n* Record animated GIF movies\r\n* Scene mode setting to support for example low light exposure\r\n* Zoom using the volume rocker\r\n* Adjust the dynamic contrast to further enhance your photos\r\n* Process images from your gallery by tapping the share button and selecting Retroboy\r\n* Share your pictures through Facebook, Twitter, Tumblr, MMS, E-mail or any other methods your device supports', 'descriptionHTML': 'Retroboy provides vintage imaging technology not seen since the digital cameras and monochrome screens of the previous century. A series of real time filters implement various image processing algorithms, to emulate the graphic experience of classic hardware. This app is open source and pull requests are most welcome!<br><br> https://github.com/mikljohansson/retroboy<br><br>* 4-tone Bayer dithering as found on the Nintendo® Game Boy® Camera<br>* Amstrad CPC filter with 27 color palette<br>* PXL-2000 PixelVision filter emulating one of the first digital video cameras<br>* Commodore 64 filter with VIC-II 16-color palette<br>* Atkinson dithering filter used by the original Apple® Macintosh® OS<br>* Halftone dot filter as popularized by Roy Lichtenstein and the pop art movement<br>* Record animated GIF movies<br>* Scene mode setting to support for example low light exposure<br>* Zoom using the volume rocker<br>* Adjust the dynamic contrast to further enhance your photos<br>* Process images from your gallery by tapping the share button and selecting Retroboy<br>* Share your pictures through Facebook, Twitter, Tumblr, MMS, E-mail or any other methods your device supports', 'summary': 'Snap pictures in glorious retro style dating back to the days of monochrome', 'summaryHTML': 'Snap pictures in glorious retro style dating back to the days of monochrome', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.44, 'ratings': 161, 'reviews': 70, 'histogram': [6, 9, 11, 12, 120], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '893k', 'androidVersion': '2.3.3', 'androidVersionText': '2.3.3 and up', 'developer': 'Embargo', 'developerId': 'Embargo', 'developerEmail': 'info@embargo.se', 'developerWebsite': 'https://github.com/mikljohansson/retroboy', 'developerAddress': 'Embargo Software\nKarl Johansgatan 20\n414 59 Göteborg', 'privacyPolicy': 'https://github.com/mikljohansson/retroboy/blob/master/PRIVACY.md', 'developerInternalID': '7703766011727122831', 'genre': 'Photography', 'genreId': 'PHOTOGRAPHY', 'icon': 'https://lh3.googleusercontent.com/knRW2-DdNqgrGK4fTAX51R1D1nuCyc1KYVR-mCxZtNzufIOzwzRF-FLDyHHMKGPm23mx', 'headerImage': 'https://lh3.googleusercontent.com/e1t7oalYed7fNPrvCY-xYw9FgijawmWdFVoRUFOYjiO71BsIuxFnZYduAw54viSTTS4', 'screenshots': ['https://lh3.googleusercontent.com/YH5ecDTha5eAIdIfvqzzVcncd5zv_2Uwpe4GvxBEkefLubXoRwkrmls5h2V4UOpm3-0', 'https://lh3.googleusercontent.com/E9V5BMo8tN0N_tZkq9xzMa-rKfA4Y7ptbmjVGIlQ_N8TrIf5lEIqkHGS7DJC_YcWa4s', 'https://lh3.googleusercontent.com/tv9Qam0xpoWDUb3gyooCDLatNlgRy7rLESea9IWvA4nY9Z8visJw_EnvQZsV9HwOX5g', 'https://lh3.googleusercontent.com/wQAokpUO9s3FbmoC17WmcYW1HhYu4NCrtT8qs4AKLx7yPHPYH-_yi8g38f_RjbUdA3I', 'https://lh3.googleusercontent.com/eH6RzF1ICNAV34rJhqPP-U9p4HDhCQzfOJk0Ntrw9rOqXwiA-JHRwrfLv4R4VUTGaF0', 'https://lh3.googleusercontent.com/ASoLWG0xX0M0DlrW_my0XpWFFC7QnWQP4OsUbtFSXHO6LXKmBo8qlQmgLagrq0_8HHI'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 9, 2012', 'updated': 1419107148, 'version': '2.5.2', 'recentChanges': 'Version 2.4.0-2.5.2\r\n* Various minor enhancements and bugfixes\r\n\r\nVersion 2.3.0\r\n* New PXL-2000 PixelVision filter. Please drop us an email if you own a PXL-2000 and would like to help us tune the filter.\r\n\r\nVersion 2.2.2\r\n* Added exposure compensation\r\n* Improved low-light performance\r\n\r\nVersion 1.6.1\r\n* Fixed issue with preview not starting on Galaxy S2/S3/Tab', 'recentChangesHTML': 'Version 2.4.0-2.5.2<br>* Various minor enhancements and bugfixes<br><br>Version 2.3.0<br>* New PXL-2000 PixelVision filter. Please drop us an email if you own a PXL-2000 and would like to help us tune the filter.<br><br>Version 2.2.2<br>* Added exposure compensation<br>* Improved low-light performance<br><br>Version 1.6.1<br>* Fixed issue with preview not starting on Galaxy S2/S3/Tab', 'comments': ['great simulator of these old styles. Only feature I would wish for would be a synthetic color pxl2000, by using the rgb channels breaking each out separately applying the effect to each channel as monochrome and then recombining the image back to rgb. The idea would be as if you had 3 pxls each with an r g or b filter and then combined thier output into an rgb image', "Great app. No ads. And it even emulates the C64's double width pixels. The only way it could be better is if there were more filters like the Apple II's double hi-res mode.", "4 1 thing it doesn't have the same features that the origenal gameboy camera had like 2 have a double face connected or 2 hands or the bubble feature none of that kinda stuff.", 'How k and white only the other color options are still black and white', "It's not greedy for money at all!", 'A perfect pixel vision app IF it could record video with sound.   I have been trying to find a good retro \'pixel vision\' photo app and came across this one. It surprised me because it has a bunch of retro camera filters including PXL2000 camera, gameboy camera, apple computer and more!   Very authentic reproduction! The app also shoots "video" which is really just an animated gif clip.   My only wish is that this app offered real video recording with sound and frame rate adjustments. Id like to shoot movies and edit them and the current gif video can\'t import into any video editor.', 'This is wonderful. The only bugs are crashes from extended video in higher resolution in some devices, and implementing h.264/.mp4 exporting as well as .gif would be more awesomeness! Thanks developers ☺', 'Fast and easy to use and understand. I would like some sounds though :) Like a shutter sound and the ability to record in 8-bit.', 'Buena aplicacion para ser gratuita cumple con lo que dice, sin publicidad? Genial.', 'Now I want more filters,  your ideas are awesome :)', 'Love these filters. Really reminds me of graphics from back in the day.', 'thanks for the detailed and up-to-date changelog 👍', 'on Nexus 5X', 'Brings back my memories of growing up with the original game boy.', 'Lots of fun. Simple. Not complex or hard to use. Eventually more filters/features would be fun.', 'The redditors are incoming.', 'Love it!', 'Tray.....', 'Beautiful.', 'Definitely the best retro camera app out there.', 'I used to love the old Gameboy camera and this app brings back so many memories.  Thanks!', "I had this on my iPod touch 4th gen, and I'm glad I got something that compares and surpasses it since I got 13 megapixels on my Note 3! Love the GameBoy style camera :)", 'awesome. hope you keep working on it.', "I was looking for a Gameboy Camera and immediately purchased this app. To my surprise, there's plenty of more fun filters to goose from! And you can even edit an image you already have saved as well, which is awesome. Hope to see plenty of more filters, I'll definitely support and spread the word of this awesome app!", "Doesn't work on galaxy s3. Uninstall and refund.", "I think the app could do with the gameboy camera style borders. I'd love to see this become even more authentic looking! I have some influencial friends who would spread this like wildfire if it took pictures that came out exactly as they did on the gameboy camera (similar to 8bit pocket camera on the crappstore)", 'Awesome.  Very fun and cool.  Has many customizable options too.  You can make the pics really look like the real thing or change the resolution and get clearer pics with fantastic effects.  Well worth the money.  App rocks.  I have jelly bean 4.1.1 with a quad core.', 'Hell yeah, an Amstrad CPC effect!  The rest of them are very nice as well, really lovely app...', 'a great application to take some really nice photos with. several sized, several filters and a really good live-view functionality that most camera programs are missing. hope to see some new filters soon!', "It's ok but nothing too exciting and about it. Nothing that catches my eye in what it does 😕😕😕😕😕", "Can't open it,"], 'appId': 'se.embargo.retroboy', 'url': 'https://play.google.com/store/apps/details?id=se.embargo.retroboy&hl=en&gl=us'}
