{'title': 'Autostarts', 'description': 'The Original Autostarts Manager. Keep control over your phone: See what applications do behind your back. \r\n\r\nI will show you all the apps that run automatically when you turn on your phone, and on any of the 190+ events that Android triggers in the background. Root users can disable unwanted autostarts and speed up their phone.\r\n\r\nNote: Root-Access *is* required to make changes. Otherwise, this application will be read-only.\r\n\r\nNote: The new "all device features" superuser permission indicates root access is used; this will be required for all root apps in the future. You will still be asked to confirm root access on an individual basis. See: https://plus.google.com/103583939320326217147/posts/T9xnMJEnzf1', 'descriptionHTML': 'The Original Autostarts Manager. Keep control over your phone: See what applications do behind your back. <br><br>I will show you all the apps that run automatically when you turn on your phone, and on any of the 190+ events that Android triggers in the background. Root users can disable unwanted autostarts and speed up their phone.<br><br>Note: Root-Access *is* required to make changes. Otherwise, this application will be read-only.<br><br>Note: The new &quot;all device features&quot; superuser permission indicates root access is used; this will be required for all root apps in the future. You will still be asked to confirm root access on an individual basis. See: https://plus.google.com/103583939320326217147/posts/T9xnMJEnzf1', 'summary': 'Keep control over your phone: See what applications do behind your back.', 'summaryHTML': 'Keep control over your phone: See what applications do behind your back.', 'installs': '50,000+', 'minInstalls': 50000, 'score': 3.32, 'ratings': 2678, 'reviews': 1185, 'histogram': [856, 160, 160, 267, 1231], 'price': 1.99, 'free': False, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '486k', 'androidVersion': '3.0', 'androidVersionText': '3.0 and up', 'developer': 'Michael Elsdörfer', 'developerId': 'Michael+Elsd%C3%B6rfer', 'developerEmail': 'elsdoerfer@gmail.com', 'developerWebsite': 'http://elsdoerfer.name/=android-autostarts', 'developerAddress': 'Am Wald 2\n85077 Manching\nGermany', 'privacyPolicy': None, 'developerInternalID': '7523240749040624532', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/pDu0f8vk2CedmBTufuRol11muMMDf7cCRXAr3xfBZNMPeSvV0ozUPe_g9JGFI7dG7-28', 'headerImage': 'https://lh3.googleusercontent.com/wPQw5UUHOU8ww_Tix90NeTf85W1DdwSPRoRJq3UMiDTgm-w4QMjyGcQDLj-Wzdfa4sE', 'screenshots': ['https://lh3.googleusercontent.com/MbNDKoJyH-9z56I17dVQIRi_6m4vqJ4abATJaj4kNHQHdld92chqDM3azg-EImy0OXU', 'https://lh3.googleusercontent.com/pcGNBRApHDK0WN23QpIUcOXA4COZE9TtOXbMjAEr7vJCNepLrtavB1igNrjuRfvOfpw', 'https://lh3.googleusercontent.com/ujUgWuryTZiJ5m9wPIqsauTgePGj2SCleJPitr_4qEBTZQrOdTPK1mXsZAf6unYs9w', 'https://lh3.googleusercontent.com/x1TWXBX27EvkKfL6tuLh6bqDzt6eEV4n5pvQuykV8_e3zI5vDQS-tPxUJR7-cCX2Og', 'https://lh3.googleusercontent.com/3gCTgyPlYAod0qxqzGcldWSxKPscohppjaY2Zot_iV7GT7H6Gutvs0iOQGVdOWn53A'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': None, 'updated': 1489410508, 'version': '1.9.8', 'recentChanges': 'Fix for 64-bit devices. This was the main issue. Please let me know if there are other crashes or problems.', 'recentChangesHTML': 'Fix for 64-bit devices. This was the main issue. Please let me know if there are other crashes or problems.', 'comments': ['Does not work anymore... Android 9.0 Used to work great, now is useless. Always says no apps auto start... Glad app was cheap when i bought it as it is useless now :( Gave 2 stars because it was great back in the day', 'I loved this app, but it no longer works in Android 9. I emailed the developer a few months ago, but got no response.', 'Sony Xperia e6883 Z5 Premium Dual: after one week of use I have higher performances and long lasting battery. Definitely A+', 'Was great on my galaxy S2 back in the day, but on my 5.0 Note3 it keeps crashing when loading apps :(', "Android 7.1.2 Lineage. Works like it has since my G1. A godsend that keeps me using certain apps... maybe even Android at all. Why can't the big guns realize they're the ones compromising user security and device usability? Oh, yeah it's about shareholders & bosses, credit and investment. Oh, how I miss the days of customers and cashflow....", "Doesn't work with Android 9 Pie. AbandonWare. Don't buy!", 'App not supported anymore. Last update in 2017', '"no applications are autostarting"', "Doesn't work... Wow... need root??👎👎👎👎 uninstall.", 'Completely non functional. Therefore a complete scam as charging me money for nothing is a bit unethical', "This doesn't work anymore.", 'Still crashes after latest update. App cannot handle a large number of installed apps. Worked on stock ROM with stock apps, but once you start installing apps and the count goes up, app gives up.', 'Good, but often not updated via Google Play Store (often get update prompts for it in F-Droid but not here) and hard to touch info buttons without scrolling instead. Update (03-10-2018): Doesn’t work with Android 9 Pie.', "Excellent app. It allow us to disable the so-called 'receivers' from the Android, which are a mechanism that triggers many apps to start and stay running in background consuming memory and slowing down . I have been using this app for years without any problems and my phone working well. Users facing issues using Android 9.0 will regret for jumping on this 'upgrade crazyness' and for discarding their old good phones.", 'Yay it works again. This is the only startup manager that has ever worked properly for me... and it stopped working when I got a Pixel XL. I think the last update fixed it.', 'updated after developer abandoned it several years ago. still does not work on rooted galaxy S6. worked only on very very old phones.', 'Nexus 6p running latest PN rom. So far everything works as expected. Good work', 'Just checking in to see if the dev is still around. This was a must have app back in the early days of root and when apps were less restricted. You still alive, developer? :)', 'crash when starting on samsung galaxy j3 6, android 5.1.1', 'bugged. no response to bug report email.', 'Devs abandoned this paid app.', 'Crashes upon startup on Android 7.0', 'Suddenly on op5 is working without issue', "FC's on Samsung S6", 'It crashes', 'Works fine, s7 nougat', 'Works great!', 'Used to be the best.', "Two UI issues for me. First, there doesn't seem to be any way to sort events alphabetically. Secondly, the little 'i' buttons are very small, and right next to the invisible scroll bar (especially so in 'By Application' view with one app. expanded). This means it's hard to hit the 'i' and very easy to hit the scroll bar by mistake, and jump to somewhere completely different in the long list! Dev., you could make the 'i' nearly 2x as big and it would still fit in the existing UI, and would help! Thanks!", 'Very powerful one. Just amazing and really required to save battery.  Some improvements necessary: 1. Sort by disabled/enabled 2. Keep the information/help message that appears after clicking "i", for a longer duration. It goes off quickly and gives no time to read the full information. 3. Provide an easy mode for "one click disable" for all events.', "Doesn't work! Brand-new VS986 (LG G4),with root access running 5.1. Autostarts has been given root permissions but fails to see root and then does not work at all.  I've reached out to the dev, but as it stands this is 100% useless.", 'Seems to do fine preventing apps from starting up automatically.   1 star down since it didn\'t find the Carrier IQ process (IQ Agent Service) which is what I really wanted to kill (IQ starts GPS at will and logs different data). If this app could kill IQ, I would give 5 stars.   If you\'re wondering, I downloaded "My Android Tools" to disable Carrier IQ. Haven\'t seen it pop up yet, and it\'s free (with ads).', "When I try to disable an app I get a blank white box with no details inside it and it doesn't disable anything. 1-star until fixed BC it's useless now (Galaxy S6 Edge+root)", "I've used this app for a while after buying it and it worked perfectly. With Android 6 (MM) it doesn't work since it can't see root for some reason, rendering the app useless. Please help developer :(", "Overall, great app to have and use. lately i'm having a little problem. I'm using an HTC One M9 and its rooted but when I got to disable something. the app isn't letting me. I guess it is telling me that I don't have root when I know I do.  has anyone experienced this lately?", "I cant use this anymore because it doesn't wait long enough after requesting root for superuser to catch and grant the request. Huge shame.", 'Worked fine on my HTC One and Oneplus One. But not on my Oneplus 2. Gives me the error "Unable to change state on ..." On whatever app I try to disable. And yes I\'m rooted and it is allowed to gain root.', "Used to be a great app, so much so that I have recommended it to lots of people. Too bad it doesn't work on a firmware that's over a year old.", "Worked prior to new phone. Is rooted but error showed that phone isn't rooted. Running 5.1.1.", "This damn Google play music won't start after every connectivity change and application updates. That is amazing app."], 'appId': 'com.elsdoerfer.android.autostarts', 'url': 'https://play.google.com/store/apps/details?id=com.elsdoerfer.android.autostarts&hl=en&gl=us'}
