{'title': 'Kirikiroid2', 'description': 'Kirikiroid2 - Android port of Kirikiri2\r\n=======================================\r\n\r\nKirikiroid2 lets you play some of your private backup games of legally on Android.\r\nDoujin developers could also use it to test the kirikiri2 game on Android without\r\nrewrite any code/scenario (if your game do not use any custom plugin).\r\n\r\nWe do not provide any game or commercial content, please do not ask us for that.\r\n\r\nKirikiroid2 implement most features of original Kirikiri2 but:\r\n\r\n- No external plugin module (or may be in the future?), only hard-coded internal\r\n  plugin module\r\n- No CD-Player and MIDI playback, all request will ignored and no exception will\r\n  be thrown\r\n- No font select window, control center, script/pad editor, and so on...\r\n\r\nAnd some additional feature:\r\n\r\n- Execute "patch.tjs" before "startup.tjs", if it exists\r\n- Execute "RegisterData.tjs" for emulate Windows Register\r\n- Use "xp3filter.tjs" for decoding crypted xp3 archive, see the demo for detail\r\n- Use the fantastic libavcodec media library for decoding video/audio, you can play\r\n  almost every video/audio that ffmpeg supported, just your CPU is strong enough\r\n- You can choose OpenGL ES2 renderer instead of original software renderer, save\r\n  more battery and keep cool, play smoother, but it cost more memory, and not as such\r\n  compatible as software renderer :(\r\n- Use "default.ttf" in game folder for ttf rendering if it exists, otherwise uses system font.\r\n  Some system maybe has no CJK fonts, you should copy a valid ttf font and rename it\r\n  to "default.ttf" in game folder.\r\n- Use "default.cur" in game folder for virtual mouse cursor if it exists.\r\n\r\n -----------\r\n  Usage \r\n -----------\r\n\r\n  Copy the whole game data to sdcard or internal storage, run Kirikiroid2, pickup\r\ndata.xp3, or somename.exe if no data.xp3. Some games need xp3filter or patch,\r\nyou may found it on our forum: bbs.avgfun.net\r\n  The Options in Global Option menu will affect all your game, and In-Game Menu is\r\nthe game script registered functions, it will only worked in that one game. There has\r\nno per-game option so far.\r\n  If you tap two fingers on screen, it will regarded as mouse right-clicking.\r\n  In virtual mouse mode, tap one finger and keep on for a while, to emulate left button\r\ndrag; Tap two fingers for a while to emulate right button drag.\r\n\r\n -----------\r\n  Notice\r\n -----------\r\n\r\n  Most of commercial games use custom extension plugins, and most of those cannot\r\nplay under Kirikiroid2. You can login our bbs: bbs.avgfun.net and leave your message\r\nabout your game, we may implement it in the future version.\r\n\r\nPlugins available ([soft] means only works under CPU render mode aka. no opengl mode):\r\naddFont\r\nAlphaMovie[soft]\r\ncsvParser\r\nexpat\r\nextNagano[soft][beta]\r\nextrans[soft]\r\nfftgraph[null]\r\nfstat\r\ngetabout\r\ngetSample\r\ngfxEffect/gfxFire[soft][beta]\r\njson\r\nKAGParserEx\r\nkrmovie\r\nlayerExAlpha[soft]\r\nlayerExAreaAverage\r\nlayerExBTOA\r\nlayerExDraw[soft]\r\nlayerExImage\r\nlayerExMovie\r\nlayerExPerspective\r\nlayerExRaster[soft]\r\nlayerExSave[soft]\r\nminizip\r\nPackinOne\r\nPSBFile\r\nsaveStruct\r\nscriptsEx\r\nshrinkCopy\r\nsqlite3\r\nutil_generic\r\nutil_system\r\nvarfile\r\nwindowEx\r\nwutcwf\r\nwuvorbis', 'descriptionHTML': 'Kirikiroid2 - Android port of Kirikiri2<br>=======================================<br><br>Kirikiroid2 lets you play some of your private backup games of legally on Android.<br>Doujin developers could also use it to test the kirikiri2 game on Android without<br>rewrite any code/scenario (if your game do not use any custom plugin).<br><br>We do not provide any game or commercial content, please do not ask us for that.<br><br>Kirikiroid2 implement most features of original Kirikiri2 but:<br><br>- No external plugin module (or may be in the future?), only hard-coded internal<br>  plugin module<br>- No CD-Player and MIDI playback, all request will ignored and no exception will<br>  be thrown<br>- No font select window, control center, script/pad editor, and so on...<br><br>And some additional feature:<br><br>- Execute &quot;patch.tjs&quot; before &quot;startup.tjs&quot;, if it exists<br>- Execute &quot;RegisterData.tjs&quot; for emulate Windows Register<br>- Use &quot;xp3filter.tjs&quot; for decoding crypted xp3 archive, see the demo for detail<br>- Use the fantastic libavcodec media library for decoding video/audio, you can play<br>  almost every video/audio that ffmpeg supported, just your CPU is strong enough<br>- You can choose OpenGL ES2 renderer instead of original software renderer, save<br>  more battery and keep cool, play smoother, but it cost more memory, and not as such<br>  compatible as software renderer :(<br>- Use &quot;default.ttf&quot; in game folder for ttf rendering if it exists, otherwise uses system font.<br>  Some system maybe has no CJK fonts, you should copy a valid ttf font and rename it<br>  to &quot;default.ttf&quot; in game folder.<br>- Use &quot;default.cur&quot; in game folder for virtual mouse cursor if it exists.<br><br> -----------<br>  Usage <br> -----------<br><br>  Copy the whole game data to sdcard or internal storage, run Kirikiroid2, pickup<br>data.xp3, or somename.exe if no data.xp3. Some games need xp3filter or patch,<br>you may found it on our forum: bbs.avgfun.net<br>  The Options in Global Option menu will affect all your game, and In-Game Menu is<br>the game script registered functions, it will only worked in that one game. There has<br>no per-game option so far.<br>  If you tap two fingers on screen, it will regarded as mouse right-clicking.<br>  In virtual mouse mode, tap one finger and keep on for a while, to emulate left button<br>drag; Tap two fingers for a while to emulate right button drag.<br><br> -----------<br>  Notice<br> -----------<br><br>  Most of commercial games use custom extension plugins, and most of those cannot<br>play under Kirikiroid2. You can login our bbs: bbs.avgfun.net and leave your message<br>about your game, we may implement it in the future version.<br><br>Plugins available ([soft] means only works under CPU render mode aka. no opengl mode):<br>addFont<br>AlphaMovie[soft]<br>csvParser<br>expat<br>extNagano[soft][beta]<br>extrans[soft]<br>fftgraph[null]<br>fstat<br>getabout<br>getSample<br>gfxEffect/gfxFire[soft][beta]<br>json<br>KAGParserEx<br>krmovie<br>layerExAlpha[soft]<br>layerExAreaAverage<br>layerExBTOA<br>layerExDraw[soft]<br>layerExImage<br>layerExMovie<br>layerExPerspective<br>layerExRaster[soft]<br>layerExSave[soft]<br>minizip<br>PackinOne<br>PSBFile<br>saveStruct<br>scriptsEx<br>shrinkCopy<br>sqlite3<br>util_generic<br>util_system<br>varfile<br>windowEx<br>wutcwf<br>wuvorbis', 'summary': 'Want play your Kirikiri2(*.xp3) game on your Android device?', 'summaryHTML': 'Want play your Kirikiri2(*.xp3) game on your Android device?', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.16, 'ratings': 423, 'reviews': 207, 'histogram': [54, 12, 16, 63, 274], 'price': 4.99, 'free': False, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '31M', 'androidVersion': '2.3.3', 'androidVersionText': '2.3.3 and up', 'developer': 'Kevin Steve', 'developerId': 'Kevin+Steve', 'developerEmail': 'zeas06@gmail.com', 'developerWebsite': 'http://www.avgfun.net', 'developerAddress': 'Shutang St. No.13 Room.105, Fuzhou, China', 'privacyPolicy': 'http://www.avgfun.net/privacy_notice.txt', 'developerInternalID': '8412793774652844394', 'genre': 'Simulation', 'genreId': 'GAME_SIMULATION', 'icon': 'https://lh3.googleusercontent.com/YZ5aiB-OToR8Nqj7rt8bRql10hx2A519fVaP_qo3Umf1gi_pSMnHWyNRvkSzHbzMKCg', 'headerImage': 'https://lh3.googleusercontent.com/lqb1od4BDJw7LNWs8bV6fP1526TDHoAj9HnIlBvRh9mCtmVgg78wzB7H7AcsajVikUw', 'screenshots': ['https://lh3.googleusercontent.com/qVDgNBoPwKkk7Z-gLrjHQ_S7KMeNunayWxv2EtVQZR5YlQQP9gpI9WewqBRtOpu0NlM', 'https://lh3.googleusercontent.com/gPdV-cCFUXzPmkT_CLCE_Sv5gJY-DrZjLIr4KuUvAGeTznzsqxyzPxR3u5-sILcT7Q', 'https://lh3.googleusercontent.com/2yj7r-B26Rw_SMvZIvogVBkG2-E9LlTuAvUAdbrWfCpYymdOZmPKSBSjI9ljf7S9nWQ', 'https://lh3.googleusercontent.com/9DbTI4qaOWqscwiPWbHiGqpMEdjpMl2odT4mefCjFFxsDHVusgOUAgqzxnT1o3kmWg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Apr 13, 2014', 'updated': 1531205258, 'version': '1.3.9', 'recentChanges': '- support unpack rar archive with password\r\n- fixes issue that dialog freeze after resume from background\r\n- fixes issue that sound playback crash on Android 8.0+', 'recentChangesHTML': '- support unpack rar archive with password<br>- fixes issue that dialog freeze after resume from background<br>- fixes issue that sound playback crash on Android 8.0+', 'comments': ['The emulator performs very well, but make sure to research what games are playable and patchable before using. Additionally, some games need the OpenGL option enabled to perform well.', 'Works just fine on my end. A bit stutter-ish but does it job properly. Could do better on the UI part.', "A fun way to read Visual novels on the road. But I wonder if it might require an update or if it's just my phone. While I was reading my VN it ended up freezing mid-sentence 3 times in a row. So in this case could the app freeze if run for long periods of time perhaps?", 'Runs Fate/stay night Realta Nua practically perfectly. Search for "kirikiroid2 patch list" and download the "hollow ataraxia" patch instead of the "stay night" patch since it works a lot better', 'App crashes when trying to launch Fate VN. Used to work but now crash without error, unsure what changed.', 'New version crashes after loading Nekopara Extra. Older versions seem to work though', 'the app just crashes if i try opening a vn i the sd card even inside the default folder locafion please fix', 'Feel so good men..able to play my favourite VN eventhough not all of them supported and i have high expectation on this apps.hope more updates and power..Raawwr', 'FSN realta nua with eng patch running smoothly on Android 9.1. This guy deserves the 5 star rating.', 'It doesnt work on android 9. Please update quikly.', 'service temporarily unavailable', 'Works well for me playing fate stay night', 'Excellent mobile simulator', 'Not work at Android 10', 'I tried everything on reddit says yet i cant u use it,i want refund', 'worth my money', "It used to work great on my phone, but now it'll not work on either my phone or my tablet; LG G5 and Samsung Galaxy Tab2 respectively. Fate/Stay Night and Hollow/Ataraxia both load up, but then become slow and generally unresponsive. Software issue?   Will update review when fixed", 'Fantastic app. Using it to read fate currently. Works exactly like it does on PC without having to make the sacrifices you do for other VN readers.', 'The app crash if I try to run a game in the external storage on Android 8, \nplease fix it.', 'Games work wonderfully smooth. Really good for playing vn on the go.', '支持正版 太棒了這個模擬器', '前排支持正版，很好的模拟器', 'Great app to read VNs. Latest update seems to ruin the voice over though. \nEverytime you skip the voice over it makes this "tchk" sound', "Amazing app. Whenever I try to open a game from sd card it just hangs though. The fetch sd card permission setting doesn't seem to help. I'm on 8.1.", "Right clicking doesn't work(Two finger tap) also no I'm game menu showing up", 'Game crash when touch with 2 finger.. Any idea to fix it?', "On Nougat 7.1.1 and games can't be launched on External Storage anymore. Used to work before on Nougat, but now it just freezes. Only works on internal which is ridiculous.", 'Took a little while to get it to work, but runs really well! Thank you for the great app', 'Nearing end of Fate/ games. Getting it to work was tricky but it plays perfectly :-)', "It's been working good so far, seems to work better than previous versions.", 'Fate/ Hollow Ataraxia used to work. Now the game is so slow and unresponsive. Please fix.', 'The game is too slow and unresponsive, please fixed it..', "Won't play all eroge but some works flawlessly!  Edit: anyway to play from external storage like usb otg?", 'Playing through fate/stay night realta nua and the only problem I had was the game crashing at the end of the 720p video. Was able to click on the video and skip to the text at the end of it so that I could save. Working great now! Thanks for creating this awesome app! :]', "I'am never play VN on android, but with this app, almost every VN works pretty well, maybe in next update, the developer can fix animation in CG", 'Thank you for the timely resolution. Any app that allows me to play Fate or G-senjou on the go deserves full marks.', 'FSN plays great. Excellent app with dedicated developer.', 'Tnx it works now...time to play', "Got Fate to work. Finally I can enjoy it in my phone. World's well and the a save function too. Too expensive though, but this is the only one working properly for Fate so there isn't any other option.", 'After upgrading to 6.0.1 it doesnt seem to be working properly.'], 'appId': 'org.tvp.kirikiri2', 'url': 'https://play.google.com/store/apps/details?id=org.tvp.kirikiri2&hl=en&gl=us'}
