{'title': 'Enhanced Controller for Onkyo and Pioneer', 'description': 'This app allows remote control of an Onkyo/Pioneer/Integra Network Player or a Network A/V Receiver via the "Integra Serial Communication Protocol". Some TEAC models like Teac NT-503 are also supported.\r\n\r\nThe two most popular features of the app are music playback and sound profile management. \r\n\r\nOther benefits include:\r\n- Maximum privacy: No ads, no trackers, no telemetry, no special permissions like GPS\r\n- The modern Material design supports different color themes and works on smartphones and/or tablets in portrait and landscape mode\r\n- One-click access to music playback actions\r\n- Full music playback control (play, stop, pause, track up/down, time seek, repeat and random modes)\r\n- Full tone control (listening modes, bass, center, treble and subwoofer levels)\r\n- Enhanced Play Queue support (add, replace, remove, clear, change playback order)\r\n- Tuneln Radio, Deezer, and Tidal streaming (if supported by receiver)\r\n- DAB / FM / AM (if supported by receiver)\r\n- Multi-zone support (if supported by receiver)\r\n- Multi-room support: Allows control of groups of devices attached via FlareConnect (like Wireless Audio System NCP-302)\r\n- Possibility to control FlareConnect without WiFi\r\n- Control of devices attached via RI\r\n- Display device details and control device settings such as dimmer level, digital filter, auto power, and sleep timer\r\n- Allows control of receivers over an OpenVPN connection (even over a cellular connection)\r\n\r\nPlease note that the app does not support the music streaming from your phone to the network player or the receiver.\r\n\r\nAt the moment, the app is tested with following devices: \r\n-  Onkyo: NS-6130, NS-6170, TX-L50, TX-NR509, TX-NR616, TX-NR636, TX-NR646, TX-NR656, TX-NR676E, TX-NR686, TX-RZ810, TX-RZ830, TX-RZ900, HT-S7805, TX-8130, TX-8150, TX-8250, TX-8270, TX-8390, TX-L20D, R-N855, CS-N575D, CR-N765, CR-N775D, NCP-302\r\n- Integra: DRX-5.2, DTR 30.7, DTR 40.7\r\n- Pioneer: VSX-LX303,VSX-LX503, VSX-932, SC-LX701\r\n- Teac: NT-503, AG-D500\r\n\r\nThe app is 100% open source. Please feel free to download, explore, fork or contribute to it on https://github.com/mkulesh/onpc', 'descriptionHTML': 'This app allows remote control of an Onkyo/Pioneer/Integra Network Player or a Network A/V Receiver via the &quot;Integra Serial Communication Protocol&quot;. Some TEAC models like Teac NT-503 are also supported.<br><br>The two most popular features of the app are music playback and sound profile management. <br><br>Other benefits include:<br>- Maximum privacy: No ads, no trackers, no telemetry, no special permissions like GPS<br>- The modern Material design supports different color themes and works on smartphones and/or tablets in portrait and landscape mode<br>- One-click access to music playback actions<br>- Full music playback control (play, stop, pause, track up/down, time seek, repeat and random modes)<br>- Full tone control (listening modes, bass, center, treble and subwoofer levels)<br>- Enhanced Play Queue support (add, replace, remove, clear, change playback order)<br>- Tuneln Radio, Deezer, and Tidal streaming (if supported by receiver)<br>- DAB / FM / AM (if supported by receiver)<br>- Multi-zone support (if supported by receiver)<br>- Multi-room support: Allows control of groups of devices attached via FlareConnect (like Wireless Audio System NCP-302)<br>- Possibility to control FlareConnect without WiFi<br>- Control of devices attached via RI<br>- Display device details and control device settings such as dimmer level, digital filter, auto power, and sleep timer<br>- Allows control of receivers over an OpenVPN connection (even over a cellular connection)<br><br>Please note that the app does not support the music streaming from your phone to the network player or the receiver.<br><br>At the moment, the app is tested with following devices: <br>-  Onkyo: NS-6130, NS-6170, TX-L50, TX-NR509, TX-NR616, TX-NR636, TX-NR646, TX-NR656, TX-NR676E, TX-NR686, TX-RZ810, TX-RZ830, TX-RZ900, HT-S7805, TX-8130, TX-8150, TX-8250, TX-8270, TX-8390, TX-L20D, R-N855, CS-N575D, CR-N765, CR-N775D, NCP-302<br>- Integra: DRX-5.2, DTR 30.7, DTR 40.7<br>- Pioneer: VSX-LX303,VSX-LX503, VSX-932, SC-LX701<br>- Teac: NT-503, AG-D500<br><br>The app is 100% open source. Please feel free to download, explore, fork or contribute to it on https://github.com/mkulesh/onpc', 'summary': 'Enhanced controller for Onkyo/Pioneer devices: listen to music properly!', 'summaryHTML': 'Enhanced controller for Onkyo/Pioneer devices: listen to music properly!', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.53, 'ratings': 233, 'reviews': 189, 'histogram': [9, 6, 6, 37, 172], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.5M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Mikhail Kulesh', 'developerId': 'Mikhail+Kulesh', 'developerEmail': 'mikhail.kulesh@gmail.com', 'developerWebsite': 'https://github.com/mkulesh/onpc', 'developerAddress': 'An der Schüttenriehe 5, 28258 Bremen', 'privacyPolicy': None, 'developerInternalID': '8576006156374486579', 'genre': 'Music & Audio', 'genreId': 'MUSIC_AND_AUDIO', 'icon': 'https://lh3.googleusercontent.com/gEN8PKFsWAtrihPEA4FX33zTuFN1xz_bOvx5b2Dode17CfsaQAGvfwpazFmtTbkOIQ', 'headerImage': 'https://lh3.googleusercontent.com/8Svb16CpxomJ-Qrf3txXruHHiUDiL4IDtZs3qOgTpG8YIoaoLhwhoUjvm52t3V-t4qI', 'screenshots': ['https://lh3.googleusercontent.com/Jcw_i0cz9vsualH_c0iGxjzqq9JLxX_XBt1yFmSGhRbM_pVXYXyErsv2NeJ8gowEAh4', 'https://lh3.googleusercontent.com/bxCZzVBTHbTrro0mjbtizVOgJTtzJNEVFhA_Ay78wDS4sMI-cQ-S0t5eshRUYZ475EI', 'https://lh3.googleusercontent.com/AzE9AuQlecZ0FkDHe2DwkClg-m9rrvS0d7vmMaJpF9Dikbt9qGA4IR0Ulp4oClkLyQ', 'https://lh3.googleusercontent.com/K_HOtKJtKG1XHXbgsaheihKk-q4ZzcRAf1H0ZGmftEX9j5q5IDHKwab472QikUZRLH4', 'https://lh3.googleusercontent.com/HDoh_AZagu5aRjlrgojzuSo31bXXBmbmeflW0k85e3oIcatyDCMnZH-nh4DkvUZd7Ms', 'https://lh3.googleusercontent.com/Z6CmDcNcWfr1WZ50-T7OakSDG60xhfdbd-MFY7sizJeBsah9rKyRedZVuk7YPZRsptL9', 'https://lh3.googleusercontent.com/1gFav1JYSYbhv3Pp-wyEocgG0VWPcTaDMwPkKn4HcyTsCtPyt-9QNre162BWQyvSfQ', 'https://lh3.googleusercontent.com/o2ZUW9vwEOaccvtEdmfWkBsTe4SwpeK0ur9eLMetJ5StKPt40a7EC6ZP8hLFCFvrNvQ', 'https://lh3.googleusercontent.com/BI_6T1rryyU6u0h4nwo08_Zfy2DfJV8xhdQLsMB4N6Rp_jMAzvtUCccMpq4QeIATrwhU', 'https://lh3.googleusercontent.com/b_3f39Mwcq7ICYqS8Fz9xwecxmwiUlctXHB7S-OcqfVKPf7AVIyYqxJaFW1zZZB85Q', 'https://lh3.googleusercontent.com/72QErUxycDFPazQAbPp8ZaW9gj-AyaR10ungDKCsMEl9RYmixrWoI0GendkjwNYokyw2'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 12, 2018', 'updated': 1591435650, 'version': '1.13', 'recentChanges': '• IP address of the receiver in now shown in the DEVICE tab\r\n• Listening mode control is now available on the RC tab\r\n• Added possibility to memorize multiple devices\r\n• Added possibility to control FlareConnect without WiFi\r\n• R-N855: fixed tone direct availability on the app startup\r\n• TX-NR616: fixed availability of the network services\r\n• CR-N765: fixed invalid format of track time', 'recentChangesHTML': '• IP address of the receiver in now shown in the DEVICE tab<br>• Listening mode control is now available on the RC tab<br>• Added possibility to memorize multiple devices<br>• Added possibility to control FlareConnect without WiFi<br>• R-N855: fixed tone direct availability on the app startup<br>• TX-NR616: fixed availability of the network services<br>• CR-N765: fixed invalid format of track time', 'comments': ["Can i donate to you? This is the best app to control an Onkyo reciever. In the Onkyo remote and app, if you want to change the output type(Direct, Stereo, Dolby surround etc etc) you'd have to cycle through all the options. That's 10+ options. And if you accidentally skip over the desired you'd have do the entire thing again. This app gives you the list of all the possible output types and you just click to chose. Makes life so much easier. 10 stars", 'What a phenomenal improvement over the app that Onkyo/Pioneer supplies! Thank you so much for putting in the time and effort to do this. So intuitive and useful! I found this because I was monkeying around with the Github repo you forked as the basis of this app. One unfortunate problem I am having with the app is that the Setup (gear) button does nothing. The "Quick menu" (three lines) button works as expected and brings up on-screen menu just fine. But, Setup does nothing from any state of the receiver or the app. Would love to see this fixed. Let me know how I can help (I am not familiar with Android development, but I can test!)', 'Comparing with the garbage application which Onkyo/Pioneer is giving to the customers, this app is awesome. Thanks for the time and effort. I was about to send back my stereo but this all just works like a charm.', 'I have been waiting for years for this app. Trying all those bad Onkyo apps. This one is perfect, finally I can enjoy my hifi system as it was meant to best. Big thank you', 'Works great on my Pioneer SC-LX701 receiver! Pioneer has not update their official app in years and their app no longer works on Android 9 or higher. But this app seems to support all the major functions and zones! Thank you soooo much!', 'fantastic. I installed it when my physical remote started malfunctioning. does everything that I need to do on a routine basis. easy to set up and use. nice job!', "What a find! After years of struggling with the Onkyo apps, this makes things super easy and intuitive! It's also open source!!!", 'Amazing. Easy. Onkyo should buy it from you. Thank you.', 'Best Remote Ever! Controls my Teac NT-503 flawlessly. Seamless access to NAS, and even remote volume control playing DSD files!!', "This app is gold!! So much more advanced than Onkyo's app. 5 STARS.", 'Would be nice to have Cable TV channel lineup info when hdmi arc or tv is selected..', 'Very good! Onkyo developers can learn from you.', 'An open source and a superior alternative to the Onkyo branded apps', 'Early days, But it seams way better than the official controller. Well done. Edit: 13/03/20. Just download this app. It is so much better than the stock Onkyo one.', 'Just installed it a couple of minutes ago, but I can confidently say this is light years ahead of Onkyo Controller app! Using it for Onkyo TX-8250. I will gladly help testing or debugging, just let me know. Great work!', "Great job, blows away the official onkyo controller! Finally a 'replace queue' function for the play queue. App in general solid and quick. Using on tx-8260. Thank you!", 'Awesome app, lovely developer, highly responsive to all issues', 'Great app massive improvement on the standard onkyo app which is often slow and unresponsive. Like the different skins too', 'Only thís app works (very) well with my Onkyo receiver. (TX-NR636)', 'I cant set up sleep time. After tapping sleep time button it disappears.', 'After earlier issues getting receiver connected I decided to try again four months later. Glad I did... I was able to get my 4 yr old Onkyo connected to the app and it is working perfectly. Love how you can control so many aspects of the receiver from my phone.', 'Amazing, my cr-n 765 "reborn". All works great, and fast. One thing not working, button "next track" and "prev track" when i play from network source "home media". I check "play\\pause" work properly.', 'All sound control features that should be in Pioneer Remote Control are here. Excellent', "I love the slick interface. I prefer it over the stock Integra remote app. Though I have a DTR-70.4 and I can't control all 4 zones; only the main zone shows up in the side menu and is selectable. Also, I can't access Pandora, Spotify, or my home network hard drive. Not sure if these are bugs or if I'm missing a setting.", 'This app makes a phenomenal difference in the usage of Onkyo receivers. The default app by Onkyo is almost comical in its lack of usability, while this app is clearly designed, easy-to-use, and very helpful especially in two zone setups. One minor enhancement request for this app would be to support changing FM tuner stations. Thanks to the app creator!', 'This app is outstanding and it works flawlessly with TX-8270. I\'d like to suggest a couple of minor improvements - providing a quick toggle for the Music Optimizer function (that is, the "MOT" ISCP message), and replacing the current preset-cycling controls under the Device/Settings section with individual buttons (e.g. \'Off\', \'A\', \'B\', \'A+B\' for speaker selection) to allow for faster access to the different options. You are doing a great job with this app, keep trucking!', "Won't connect to my onkyo receiver, it sees it but, when selected won't connect. Onkyo TX-NR828", 'Great app that works better than the official one. Lets you enter the IP address, so you can find the amp even om a different subnet. Very friendly and fast response from the developer, glad I could help by providing some information from the logs.', 'There are no instructions on how to hook this app to my onkyo tx-nr646?  After consulting with Mikhail  I am changing my review to awesome!!!   This is a truly awesome app for my onkyo set up!  Thank you so much to Mikhail for the great support...i love it!', "great app, connects to my older reciever. The official app doesn't even do that! Would love to see more listening modes get added, like the various thx modes.", "It works! Unlike the crappy Onkyo app you can find the amp via ip address; something Onkyo doesn't let you do. Thanks for making this!", 'Way better than Onkyo app But menu & remote pages are way to small u have a whole screen to use why not use it if u want see how a really good app is made have a look at the Yamaha app thanks for your hard work', 'Volume control on onkyo zone 2 (audio control) not showing up', 'Thanks for the App! FYI works with Onkyo R-N855! Dev is a very nice guy willing to help! Congratulations!!!', 'Nice app with lot of options. Highly recommend if own Onkyo.', 'Very nice alternative to Onkyo app. always getting better and working well.', 'at least onkyo plays music from my phone or dlna to onkyo receiver , this shows that the app found something but nothing to open search or click to...', 'Much better than the stock. I still wish for the tunein control improvement, but i guess its all device demendant', 'werkt goed perfect ...thanks. only volume button to smal', 'Finally a good app...'], 'appId': 'com.mkulesh.onpc', 'url': 'https://play.google.com/store/apps/details?id=com.mkulesh.onpc&hl=en&gl=us'}
