{'title': 'microMathematics Plus', 'description': 'With microMathematics Plus, you can not only perform mathematical calculations in naturally readable form, but can also create and manage your own collection of interactive formulas!\r\n\r\nThe microMathematics Plus is a revolutionary new kind of mobile calculator. It is the world’s first scientific graphing calculator and function plotter on Android oriented around a worksheet. It allows live editing of mathematical identities combined with highly accurate computations.\r\n\r\nThe app is 100% open source. Please feel free to download, explore, fork or contribute to it on https://github.com/mkulesh/microMathematics\r\n\r\nNot only students, but also everybody who likes mathematics or needs more than just a basic calculator will benefit from this amazing technique of mathematical calculations and plotting.\r\n\r\nBenefits and features:\r\n\r\n- Verification, validation, documentation and re-use of mathematical calculations\r\n- Works on smartphone or tablet in portrait and landscape mode\r\n- Supports all commonly used mathematical operations\r\n- Mathematical expressions are written in an intuitive and naturally readable form\r\n- Supports SI and non-SI units (including units of information)\r\n- Powerful mathematical touch-screen editor with undo function makes editing easier\r\n- You can do multiple calculations and subsequently correct or change all used formulas\r\n- It is possible to store intermediate results into 1D, 2D, or 3D array that can improve calculation performance\r\n- Mathematical expressions are collected in a document, that includes not only formulas and plots, but also additional text and images (SVG format is also supported)\r\n- You can store your document on SD card and export it into LaTeX format or an image (SD writing permission is needed)\r\n- SD card on Android 6+ is also supported\r\n- The app contains detailed "How to use" page and several examples\r\n- Supports different color themes\r\n- Supports data import from ASCII files\r\n\r\nThe microMathematics Plus has exactly the same user interface as the microMathematics free version, but implements more mathematical functionality: units of measurements, arrays, complex numbers, functions of many arguments, plots for several functions, contour and 3D plots, summation and product operations, derivative and definite integrals, if-function and logical operators. This version has following mathematical limitations: it does not support special functions, vectors, matrices and many other things from high-level mathematics.\r\n\r\nLanguages: English, Russian, German, Brazilian Portuguese.', 'descriptionHTML': 'With microMathematics Plus, you can not only perform mathematical calculations in naturally readable form, but can also create and manage your own collection of interactive formulas!<br><br>The microMathematics Plus is a revolutionary new kind of mobile calculator. It is the world’s first scientific graphing calculator and function plotter on Android oriented around a worksheet. It allows live editing of mathematical identities combined with highly accurate computations.<br><br>The app is 100% open source. Please feel free to download, explore, fork or contribute to it on https://github.com/mkulesh/microMathematics<br><br>Not only students, but also everybody who likes mathematics or needs more than just a basic calculator will benefit from this amazing technique of mathematical calculations and plotting.<br><br>Benefits and features:<br><br>- Verification, validation, documentation and re-use of mathematical calculations<br>- Works on smartphone or tablet in portrait and landscape mode<br>- Supports all commonly used mathematical operations<br>- Mathematical expressions are written in an intuitive and naturally readable form<br>- Supports SI and non-SI units (including units of information)<br>- Powerful mathematical touch-screen editor with undo function makes editing easier<br>- You can do multiple calculations and subsequently correct or change all used formulas<br>- It is possible to store intermediate results into 1D, 2D, or 3D array that can improve calculation performance<br>- Mathematical expressions are collected in a document, that includes not only formulas and plots, but also additional text and images (SVG format is also supported)<br>- You can store your document on SD card and export it into LaTeX format or an image (SD writing permission is needed)<br>- SD card on Android 6+ is also supported<br>- The app contains detailed &quot;How to use&quot; page and several examples<br>- Supports different color themes<br>- Supports data import from ASCII files<br><br>The microMathematics Plus has exactly the same user interface as the microMathematics free version, but implements more mathematical functionality: units of measurements, arrays, complex numbers, functions of many arguments, plots for several functions, contour and 3D plots, summation and product operations, derivative and definite integrals, if-function and logical operators. This version has following mathematical limitations: it does not support special functions, vectors, matrices and many other things from high-level mathematics.<br><br>Languages: English, Russian, German, Brazilian Portuguese.', 'summary': 'A revolutionary new kind of mobile calculator (open source)!', 'summaryHTML': 'A revolutionary new kind of mobile calculator (open source)!', 'installs': '1,000+', 'minInstalls': 1000, 'score': 4.7, 'ratings': 114, 'reviews': 68, 'histogram': [1, 0, 5, 18, 88], 'price': 1.49, 'free': False, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '5.1M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Mikhail Kulesh', 'developerId': 'Mikhail+Kulesh', 'developerEmail': 'mikhail.kulesh@gmail.com', 'developerWebsite': 'http://www.linkedin.com/in/mikhailkulesh', 'developerAddress': 'An der Schüttenriehe 5, 28258 Bremen', 'privacyPolicy': None, 'developerInternalID': '8576006156374486579', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/1G8rOn5GhbPCpaUDD4Z7p513XetKeDh2ElgBuOzQN9mh6pupBw7EtnrSjZJnbAcrk6Cy', 'headerImage': 'https://lh3.googleusercontent.com/4gT4MnVxd4ZY3HEJnFyca4oJa3snjsG1UjsadamNfH9fGjZ2PYF6hR8XC9VaORLz2k0', 'screenshots': ['https://lh3.googleusercontent.com/TWtL8nu-Iww8G-DT_dbn2EmjtaV0L46g4SoPVucmfVE23O-o8A8WUTKVD2ZFiECJ2w', 'https://lh3.googleusercontent.com/qxn8BdD1kAYMCrcjMmmX6M-wJj97vtCztd4ss12aTit8OJWF4Lnuqk0D_MNkeHMsPA', 'https://lh3.googleusercontent.com/xWyTCziPPaXzIk5wNq_DJK6Ptq2AU4WksB0yylq9gCenGZwLnNc8JM-G718LHWRAqA', 'https://lh3.googleusercontent.com/QJGGtj7g7lsGXTopNUxeNawvAn5ZElyXgo82WTO0zPUrtj_aO7LhaKfIR1rEdg44eOU', 'https://lh3.googleusercontent.com/DkPaQKTMJ0oh5Ah9IwLu9uLA6F1TKZcZSolaHRrQQPbiI7ixpu8vrj20hDdowKnE1IVU', 'https://lh3.googleusercontent.com/eKNR3kI73SsvQxBEUj3ka0FwtJM8bOQ2incxrqjMyFykst2TIWdO0DkOvNJg9HjSTsQ', 'https://lh3.googleusercontent.com/ZcFxma6vxfvDhgMyDsWYXY5oFeT_1CAKhd2KcVa0j1RnRG-NAQdUHUxW3ljxcSti7KA', 'https://lh3.googleusercontent.com/vznJt6jCn4yI4oQW8mGoYFt1rTrlO0c9gjw0ADs2R0Y1CGrG0nrIwFmwsqtQ3tyLf2ZP', 'https://lh3.googleusercontent.com/jzna8tZyEvSW-M1jbYYLoGhWpXKbrMUXPEoKA_5B5GuAWastFoSmkcU3ouCRre7g8xiS', 'https://lh3.googleusercontent.com/5gR1QCtGEI4uQEYtme0CS6x5ROD9oYAjpGWH2f5cHbT_L5ah9v2YJ6g_qsm0loCt2zg', 'https://lh3.googleusercontent.com/HaReX2MSfhJ3BlDkMezKHdQNleVSQmA5yB_HmuZEzyQPN9uXGpltdBcJXBGnONeGpg', 'https://lh3.googleusercontent.com/Mwh2ESu5Cpgw9-vOeJnNPqnN7gEz9pyg4TyOmCSRL3uIE7ZvFYhu5UiRD61CK0KZC0fr', 'https://lh3.googleusercontent.com/Wstvtwb9O59aACt0TzmzK1cvCYx6ejFZ_CaNRulzK7IlP9atv-VZA-WVIJDa81baHXIT'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 26, 2014', 'updated': 1585506872, 'version': '2.19.0', 'recentChanges': '- The app is adapted for Android 10\r\n- Improved device rotation behaviour\r\n- Added more examples', 'recentChangesHTML': '- The app is adapted for Android 10<br>- Improved device rotation behaviour<br>- Added more examples', 'comments': ["I have been looking for an affordable Mathcad like application for years and this is by far the best I've found. I do a lot of simple calculations where I frequently mix SI and Imperial units. For example: hp=:100 rev/min * 250 ft*lbf. I've noticed that this gives the correct value in SI units, Watts. Similarly length calculations default to meters. Is it possible to configure the output units to display other units? In all I am very impressed with this app, highly recommended!!", 'dear sir, please add special functions, vectors, matrices and many other things from high-level mathematics m waiting for this and my friends also.', 'As civil engineer with 10 years computing experience in Russia and 25 years design experience in United States, I may responsibly claim that microMathematicsPlus by Dr. Kulesh is most closely resembles MathCAD, having similar features and familiar appearance while being conveniently available for fraction of price and fully functional in field environment.', "It's awesome, as good as mathcad", "Very impressed with this. The developer keeps improving the app and listens to the feedback from users. There are still some little things I'd like to see like the ability to export into more formats or introducing subscripts into defined variables but overall this is excellent. Keep up the good work.", "Considering the level of calculating/computing and visual presentation that \ncan be done on a smartphone or notepad with this app is amazing. It is \nversatile and fluid in defining a problem and showing the solution. \nVariations and changes can easily be made and recalculated. \nMicromathematics Plus is the best math app I've used.", "It's very good indeed. The one thing that would make it complete, for me, would be the ability to handle units (like Mathcad or SMath).", "Very impressive. Much better execution than Wolfram Cloud. The interface is amazing; it's actually pleasant to use with a touchscreen. Must-have for anyone doing any kind of math on a regular basis.", 'The closest thing to Mathcad in Android OS. Please add subscripting for variable display and also add string variables and operations.', 'Reminds me of Mathcad..  Can you integrate SymPy for symbolic calculations?', 'Please add matrices and handwriting notes.', 'Great research tool', "If possible can you add latex import,latex style editing?? It's fine even if the higher math functions for vectors, matrices etc is not executed for now...but this tool can become a very good report writing tool. Plus..if possible can we import data from an external file for graphing?? Would be a *great* help. Keep up the good work.", "Possibly powerful but hard to see, to understand, and to use. Documentation is poor, it's more of an advertisement than a user guide. Toolbar is awkward and hard to see . Extremely difficult to edit equation. Could nor export worksheet as JPEG or HTML file. Have not tried graphing. It's handy nevertheless.", 'Hope there is more to come... Will you be expanding to cover matrix calculations and vectors?', 'I love it! Excellent app!', 'The input seems to cumbersome without a dedicated keyboard I suggest moving the toolbar symbols in a multiple screen dedicated keyboard . Moving through the toolbar is slow and how do I make the infinity sign  for integrals, can I do limits ? It needs a basic introduction video tutorial. I hope developer keeps working on it, this could be the best math app in the store', "It's Good! You can mix text and equations, do calculations and export to Latex and html. Like a min version of mathcad! But intetface is a bit annoying: won't let you just write 2x+1, instead you must use the add button and the multiplication button.   Also no recursive functions, you can't redefine a function and no case base defintions eg ( f(0)=1 and f(x)=x+5, if x&gt;0 ). But the most annoying thing is the inability to add symbols that are not computed like in a proof. But it's still good.", 'Really good App that means I can reuse all my MathCad programmes. A serious mathematical tool for android. easy to use.  Need to document the key/mouse combination for zoom in/out please.', 'Excellent effort. Good job.', 'Powerful, but too complicated to use in practical situations. Even graphing x^2 is very hard for people. I let mt friends (mathematicians) read through the how to use doc and they figured it out, but say there should be simpler ways to graph. Pethaps make a video over it.', 'If I use - sign (minus) it shows as error. Please fix this.', 'Great tool.'], 'appId': 'com.mkulesh.micromath.plus', 'url': 'https://play.google.com/store/apps/details?id=com.mkulesh.micromath.plus&hl=en&gl=us'}
