{'title': 'Breathly - Just Breathe', 'description': 'Pause for a minute and try Breathly.  \r\nUse Breathly for daily relaxation and breath training: just choose a breathing technique and focus on the guided exercise. \r\n\r\nBreathly is free and open source. No ads, no In-App purchases.', 'descriptionHTML': 'Pause for a minute and try Breathly.  <br>Use Breathly for daily relaxation and breath training: just choose a breathing technique and focus on the guided exercise. <br><br>Breathly is free and open source. No ads, no In-App purchases.', 'summary': 'Breathly is a simple way to focus on your breathing.', 'summaryHTML': 'Breathly is a simple way to focus on your breathing.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.46, 'ratings': 197, 'reviews': 118, 'histogram': [7, 3, 13, 35, 135], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '7.2M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Mazzarolo Matteo', 'developerId': 'Mazzarolo+Matteo', 'developerEmail': 'breathlyapp@gmail.com', 'developerWebsite': 'https://breathly.app', 'developerAddress': None, 'privacyPolicy': 'https://github.com/mmazzarolo/breathly-app/blob/master/.stores/google-play-store/PRIVACY_POLICY.md', 'developerInternalID': '5140000471038330897', 'genre': 'Health & Fitness', 'genreId': 'HEALTH_AND_FITNESS', 'icon': 'https://lh3.googleusercontent.com/Gh4V_YyeG6dkJiFnC5l6zh4UAHlFjqaXQOB_OpvVhMIw9B5G2VxuHRVTnBdlftae8g', 'headerImage': 'https://lh3.googleusercontent.com/m8e8Ww_7dBf08N5Eac8ohi7VyDYLaIX6m_RiRzBXvHUR8rV5A7PMGm1mSyTegkzuzw0', 'screenshots': ['https://lh3.googleusercontent.com/iG2N6CiywiXvE_rITUQhwODauFzdD9eFYUhpRFJAz-mrHw1UJmvMMpQdefSa5j3_XSo', 'https://lh3.googleusercontent.com/9JSS6yfWb-amnpKgMz3HX6hB29V1xT-uwKFU5ndyw8tK-ATR2w3pDintBo6Hr5L6JYM', 'https://lh3.googleusercontent.com/P6UvEMG_Eap3Lxsm6t1Qvy7nV2_Uc8ehHGHlOQegSTTauwpo-KiWphkpqcMHiYmQQNZn'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 9, 2019', 'updated': 1590067637, 'version': '1.8', 'recentChanges': 'New setting! "Vibrate on step change" \U0001f973\r\n\r\nUpdated guided breathing options: 🎵\r\n  - Updated "Laura\'s voice"\r\n  - Added "Bell cue"\r\n  - Added "Paul\'s voice"\r\n\r\nBugfixes and other minor improvements', 'recentChangesHTML': 'New setting! &quot;Vibrate on step change&quot; \U0001f973<br><br>Updated guided breathing options: 🎵<br>  - Updated &quot;Laura&#39;s voice&quot;<br>  - Added &quot;Bell cue&quot;<br>  - Added &quot;Paul&#39;s voice&quot;<br><br>Bugfixes and other minor improvements', 'comments': ["Was really happy with the app but after the update I can either listen to monotonous irritating voices, or what sounds like a bicycle bell. It's great if you aren't bothered by the sound, but I use this with my eyes closed so need the audio. I'll unfortunately be looking into other apps now as it's hard to focus on breathing whilst being guided by sounds that annoy me", "I love the breathing exercises in this app and I want to give it five stars but I personally can't take how bright it is. I use it at night in bed and it's so brightly colored it distracts me and disturbs my sleeping partner. The night mode seems perfect but it changes back to the bright screens when the excercises start. If only it would keep the soothing dark screen during all excercises it would be the perfect app. If you use this only during the day you will love it.", "I LOVE IT! It's free, it's simple, and it helps me relieve more stress than a magnesium-powder drink does! I highly recommend this app! My favorite parts about the app is the dark theme and the voice cues. I use this app regularly and I will continue to do so!", "I love this app, it's simple and effective. The graphics are very mesmerizing and calming. I love the dark mofe, but would also love the option of having that as a background for the exercise!", 'Works good but I much preferred the voice before the update. New voices are plan with no emotionm the previous voice had a sense of calmness..would of rated 5 if the voice was kept.', "I really want to like it but the one audio cue isn't calming. Edit, in response: Previously suggested vibrate seems promising. For sounds, maybe bird chirps?", 'Almost perfect! I wish it had numerical visual countdowns along with the existing verbal cues.', "I love it! It's very simple but I love the overall look of the app", 'Needs other audio options besides the breathy girl. Unbearable.', "The app doesn't work when the screen is off, rest is alright", 'Is it possible to add custom breathing pattern?', "Fantastic app! The only thing missing is a vibrate setting for guided breathing so I don't disturb my wife while she sleeps. Maybe if the phone pulses once for in/out, twice for hold, the user can still keep track of the pattern without having to look at the phone or turn on the volume. Or maybe a high frequency pulse for breath in/out and a lower frequency for hold.", 'Simple and beautifully designed. I appreciate the lack of ads and purchases too. It would be great if the app had landscape support for tablets though. Consider also expanding the area for scrolling when chosing breathing modes to include the entire screen, currently you have to swipe the area of the text, which took a few frustrated swipes to figure out. Looking forward to more releases :)', 'Simple app for mindful breathing. Exactly what I was looking for. Easy to change the breathing options. There are 4 numbers listed under the names of each option that I believe indicate the pattern of breathing in, holding breathing out, and holding. Also a nice description of each breathing pattern, if its more energising or relaxing. I also like the timer feature.', "Nice idea, but it must be for people with the lungs of a mouse! I couldn't find a control to change the timing of the breathing pattern. I'll play with it further, but I need twice as long to breath in and out... Reply to developer: It's not the STYLE I need to change, it's the SPEED - I breath slower than the app.", 'Very comprehensive guided breathing app. Since a dedicated machine version of this currently costs US$300, this app is a no-brainer. I agree with other reviewers that the female voice is distracting. I would rather have a tone system, or an actual breathing recording (how cool would that be!).', 'App is really nice but I feel the biggest issue is that it does not run in background or split screen which stops you from using your smartphone completely for other uses. You will have to break your exersice to use your phone. Rest everything is nice.', 'Great app, exactly what I was looking for. Suggestion: maybe having just a tone or note feature for the guided breathing? I use the app to help myself sleep, and hearing a voice can make it difficult from time to time. Otherwise, amazing app.', 'Fantastic app. Love the simplicity. What would be really nice is if there was some sort of non-voice related sound prompts to guide the breathing if you choose to do it with your eyes closed. Thanks', 'Works very well and is simple to operate. Feel great after using it. I don\'t care much for the robotic female voice. Also it would be helpful to explain what the four numbers mean on each breathing zone page. It\'s name sounds like one of those neologisms Donald Trump is likely to coin. But these are minor things. I have a "Resperate" device which is a bit of a faff to use. But you can use Breathly pretty much anywhere. I like it very much.', "very good app, but missing custom inhale /exhale duration abilities (only has presets). Also would be nice if audio queues included just a gentle sound rather than someone's voice. Finally when the app is backgrounded it should continue playing", 'I really like that it has the box breathing. I do not like that I cant speed up or slow down the breathing. The current speed is too fast, I cant take as deep a breath as I need. I would like the option to change the speed.', 'Wonderful app with great UI and functionality but can definitely be improved. Like others have said, the four numbers are a little bit confusing as to what they could possibly mean. Also, I can only switch breathing techniques by swiping on the text, not anywhere else. I am even confused whether I have successfully changed the breathing technique because I\'m mot sure if I should press "Back" or "Pick a technique", which looks clickable.', 'Amazing, simple and beautiful app. All you need to focus on your breathing and make a small and purposeful breaks. I love it. All the recommendations', 'This is exactly the app I was looking for. Simple. Good looking. Accessible. No ads, or things inviting you to sign up online or something. Is there a way I can donate to the developer? I just want to say thanks.', 'Just installed this app to lower blood pressure. Already love it. I figured it out when most of the time apps are hard for me to understand. Although it might help to have a little quick tutorial at the beginning. That would have made it even easier to know that I could choose between techniques. Thank you for the app.', 'I think this is one of the best breath control apps out there - the deep calm mode suits me just fine- the female voice is spot on and has a wonderful calming effect -Thanks for this great product.', 'Love the app. Never seen a more minimalistic app. Serves the purpose without any clutter. Vibration option would be helpful.', "Hi, Apologies for sounding silly, but how do I switch breathing exercises? I want to use square 4, but can't see how I select it? I only see standard exercise on my screen of app. Thanks", "I think this will be the PERFECT tool for me. Thank you for making this simple and clean! My only suggestion would be, I'd love to see an option to set reminders. My doctor asked me to do this 3x a day and a prompting reminder would be a great addition and super helpful.", 'Beautiful app. I love how simple it is. Will it be possible to set the whole app to night mode and not just the menu? That would be awesome', 'Simple and designed well. Features audio for those of us who close our eyes during breath work. Wonderful app!', 'The app is ok. But it does not have a vibration on ring. It only has annoying women voice.', 'Simple and probably easy to use. Few things i would like to change in this app like more clearer breadth indicator and custom timers', 'Love this app excellent job done. I never want missing it in my daily life. Best partner to feel hapieness in all facettes of life!', "I like the interface of this app, it's very pretty! I can't seem to get it to choose another technique though, I only have square breathing.", "It worked first go. I was at the beginning of an anxiety attack and I found this by chance on Play. I tried the 478 breathing and to my surprise it worked. I could feel the difference almost immediately. Kudo's to the app maker for this. I'd happily pay for this app because it is going to be my go to foe next time. Can I suggest a panic attack app for people like myself that is a single button and defaults to a 478 breathing pattern? Just keep it real simple. Maybe as basic mode for this app?", 'Absolutely wonderful. Simple and uncluttered. I love it', 'App is really helpful. Easy to use. Design is pretty simple and good. Recommend it to everyone 👌', 'Please make a feature where the app reminds people to do breathing exercises everyday at a specific time. That would be very helpful. If you do that, I will give it 5 stars. :)'], 'appId': 'com.mmazzarolo.breathly', 'url': 'https://play.google.com/store/apps/details?id=com.mmazzarolo.breathly&hl=en&gl=us'}
