{'title': 'mpv-android', 'description': 'mpv-android is a video player for Android based on libmpv.\r\n\r\nFeatures:\r\n* Hardware and software video decoding\r\n* Gesture-based seeking and volume/brightness control\r\n* libass support for styled subtitles\r\n* Play network streams with the "Open URL" function\r\n\r\nFull set of dependencies for each build can be found in the release notes on our github repository.', 'descriptionHTML': 'mpv-android is a video player for Android based on libmpv.<br><br>Features:<br>* Hardware and software video decoding<br>* Gesture-based seeking and volume/brightness control<br>* libass support for styled subtitles<br>* Play network streams with the &quot;Open URL&quot; function<br><br>Full set of dependencies for each build can be found in the release notes on our github repository.', 'summary': 'Video player for Android based on libmpv.', 'summaryHTML': 'Video player for Android based on libmpv.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.2727275, 'ratings': 1128, 'reviews': 522, 'histogram': [82, 51, 92, 153, 748], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '23M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Prismriver Media', 'developerId': 'Prismriver+Media', 'developerEmail': 'mpv@prismriver.jp', 'developerWebsite': 'https://github.com/mpv-android', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5739442500648366083', 'genre': 'Video Players & Editors', 'genreId': 'VIDEO_PLAYERS', 'icon': 'https://lh3.googleusercontent.com/bmwjxEBtPJQ16rEwtiLRI8bS0ZBbslERSDYFBNpxLsIDCyEYa9NixNgfG1X6t0dtmEuR', 'headerImage': 'https://lh3.googleusercontent.com/dsEjrHgkc8qrgVGW5-X16T-pQqX5se2XEKaU-20Zv_eM7kRfbLl2bFbsCeCfsokYmg', 'screenshots': ['https://lh3.googleusercontent.com/-7EzGAUDoNCHEtkcw0nj0CRMuT5eZzlWzTrekIiUu865iZMrkCoNBnqPE6nRwf4B', 'https://lh3.googleusercontent.com/omS3YHBtPlV5a3q95ZzIhNvYunY-oTXxGZ_8nLvXSJxrL3bcllUxorVxwVR1Dy2Gc4pj', 'https://lh3.googleusercontent.com/bZMJ9j3NghXcUeQ_3YLo9kWxPaFSHFndcHeM9uqJT3Qdb8hmqi3A3NK3gnOc-4Koplg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 7, 2016', 'updated': 1591109626, 'version': '2020-06-02-alpha', 'recentChanges': '- Fixes :\r\n  - Fix hardware decoding performance (regression from last build)', 'recentChangesHTML': '- Fixes :<br>  - Fix hardware decoding performance (regression from last build)', 'comments': ['Love this player so much, it improves the picture quality immense to your own liking with adding your own lines of code but even if you are not tech savy it is still amazing as you can adjust settings in its ui, I just want to give a huge thanks to the developers for continuing to update the app, far far far better than any other video player by far!', 'This is a minimalist, high-quality media player descended from the groundbreaking open source MPlayer. It plays any video or audio file you throw at it and never quits. The developers deserve special praise for successfully porting mpv to Android.', 'HW decoding: opens with a black screen, you have to seek forward to start playing the video. Nothing big since the video plays fine otherwise. Also are there any plans for a better ui? Please add a lock mode.', "Perfect Video player along with the Configurable options this one's a killer. Only negative thing is that I cant use my phones built in Equalizer. Edit: they fixed the equalizer problem, now I'm having trouble with 10bit x264 videos :(", "Just like on desktop, it can play anything with great controls. Simply awesome! If there's no playback in a popup, I'd suggest adding it, as well as streamlining the process (uppercase T and putting the video in a corner of the screen) on desktop - you could learn from how Firefox does it (single button, no borders, buttons with constant pixel size regardless of how much the video is resized)", "This is the FASTEST player for Android, hands down. Thanks to libmpv, I don't think there's a codec this can't handle. Aside from a few missing features (such as cropping videos, media info etc. which will come I'm sure with time (maybe even integration with YouTube-dl?) ), this player is perfect! I have been using mpv in my PC for a while, and thanks to these developers I get to have mpv in my phone as well! Keep up the great work guys.", "Please add an option to switch from brightness to gamma when swiping in the left part of the screen. I can configure brightness using built-in Android controls but there's no way to change gamma in any video player for Android. By default gamma control is mapped to 5/6 keys on PC.", 'slows with some hevc variant that only allows sw decoding. has a tendancy to overstretch the controls and at times forget the last played position. other than that its very good no ads to bother you.', 'I only give it 3 stars for its implementation of the mpv core as it is truly compatible all kinds of videos. However the UI design and control is horrible. I understand the difference between desktop and mobile but that is too much of a degrade from that, thatvis the comparison with the default desktop UI controls.', 'Videos which were lagging in vlc, in this player it run absolutely smooth. It would be a 5 stars if files explorer would be better🙂', 'App is awesome, only feature missing to make this replace all my players would be a subtitle downloader through Opensubtitles. Even if it requires login.', "Running very nice on Android 11 not even mxplayer dose that and the UI is not the greatest it's far from the worse gestures work great thank you for bringing this to Android", 'It is a logical solution to attemp to play videos that wont play on any other app!', 'works great. love the ability to adjust video settings like add sharp or contrast etc. please add option to make screen use 100% brightness when play video and go back to auto after stop playing. like MX. thumbnail view also would be nice.', 'excellent player for windows and linux , but lot of development needed for android Keep Going ...', 'Repeat shuffle options? I use this to play my music videos Is it a possible feature? Otherwise this a no frills straight-forward media player And the ONLY one that can use a sort of audio normalizer which I do use for movies.', 'Wonderful free app. The only features i miss from other apps are the zoom and aspect ratio change features.', 'Have to include aspect ratio & video pause modes.. otherwise its good❤', 'Nice app but please atleast add a repeat button specially useful when playing short media files.', 'I like mpv Desktop very much, but this mpv for Android does NOT work well, especially on my old Mi Pad. Everything is NOT smooth.', 'Best desktop video player, so cool I found it on android too! :)', 'Please add option to adjust subtitles delay', "I gave it a try, but the very first video I played crashed the phone so hard I had to remove the battery. I tried again, this time disabling hardware acceleration... and the app crashed upon opening a video, but at least it didn't crash the entire phone like the first time. Uninstalled it after that.", 'Needs a better UI, or I should rather say, needs a UI 😒', 'Great and simple Video Player', 'Hey, how do I get the progress bar to stop flickering? Settings are Greek to me.Plz Wow. I just kind of figured all android players were the same but wrapped differently; I was wrong. I am using. Movie is 720p and I have been using it to compare players.I left most of the settings alone on this one and played it and I swear it looked at least 1080 p. It was like it got upgraded. UPDATE: working with tv box and when i open the app it just sends me to solid explorer. ???', 'One of the best video player AND it is free (and FOSS) and without ads. Advanced/complex ASS subtitles (e.g. in karaoke style fansubs in anime\'s OP/ED) work great. The interface is simple but might lack some features. "VLC" (also free/FOSS) has a worse support for complex subs but a much more complete interface.', 'ahahahak, good job for mpv developers 😎👍 maybe good if enable picture-in-picture display', 'Most customizable video player', "MPV is my go-to media player on both macOS and Windows. I'm glad to see this android port works very well and it works exactly in the manner I want: no fancy Library view, just a Files view to navigate and play smoothly. The playback interface is minimal, swipe right/left to seek, swipe up/down to change brightness or volume. This is all I want personally for a media player on mobile.", "Simple and elegant. It's based on mplayer, may lack some advance UI features but it is perfect to play any file you through at it.", "I still use VLC for videos. But this app does one thing that other apps don't do, it plays my playlist off of my web servers like Apache and Node http smoothly. For some reason when I use WiFi VLC and other apps play good. But when I go off of WiFi the playlist pause for a long period of time between songs. This has to do with the Android and not the apps that i'am using. This app plays my playlist with no long pause between the songs, which is in of of itself no big deal cause Google Play will play playlist very well. Perhaps I need a newer version of Android but I plan on keeping my cell phone. good app with one caveat: the color purple with black makes for a crappy interface. The interface is not all that good but it does the job. i recommend this if you use your own web server and play playlist off of them.", "It's super light weight and is extremely fast to open files. I use it to playback files from file manager/FTP viewer, and the speed is unlike any other app. Negatives: automatic rotation feature doesn't work, but can choose default portrait or landscape. UI is slightly visually outdated. Speed is the compromise, and it's worth it.", 'Great potential. Mpv has all the things you need from a media player. It has upscaling and downscaling filters, alot of issue fixing options and an overall very simplistic looking software. But. Sadly right now there is too many problems to recommend this to you. 1. Im using Oneplus 6T which cannot run videos with hardware coding. I have to use S coding: Lower quality with higher battery consumption 2. Most online videos (like youtube videos) dont work at all. 3. Overall high battery consumption.', "My phone isn't 8K capable (for those who might be curious, it's the hardware's fault), but I thought VLC was great until I saw this can at least produce a moving 8K picture. I tested The Daily Dweebs. VLC couldn't even perform a tiny fraction as well. So, I'm pretty sure mpv-android is the fastest performing player for Android, and if it's available on desktop, I'm installing this on every one I'm allowed to install software on.", 'I love mpv. I have on my Ubuntu pc.. absolutely nothing wrong with this player and would give it 5 stars if I could Chromecast.. not sure if it plays HD, 4K or H265.. I have some videos on my Galaxy s10 plus that it can not find but my smartshare does so I am not sure about that one. mob is great it just may need to coincide with what my phone is capable of. great player though even better when more up to date. looming forward to it', 'best video player app i havr been use! it has everything u need for rendering high video like hevc,h264, and others. it also support format mkv and mp4 vid. app design not very impressive but easier to use. Furthermore, it support rendering graphic subtitles that other player app do not have.....now it feel good watching anime with my Android.', "Still the same stuttering and doesn't when audio is set to off. AVC High Profile 41.8 Mb/s VFR Avg11.960FPS Min6.687FPS Max12.037FPS | AAC LC mp4a-40-2 CBR 96.0 kb/s 48.0 kHz. Taken from phone camera. Camera is factory set to prioritize exposure over frame rate. Test done on a very dark area on purpose to eliminate video decoding as the root cause but don't count on it. Tested all video sync and interpolation options. No time for another config parameters hunt.", 'Effortlessly handles softsubbed mkv with animated subs and extra fonts. Good enough for me.', 'Fast play added i see and background play found in option which works stayimg in place going out and in the application! 5 Stars. AWESOME :) Have other issues but overall what other players have not been able to do MPV does Flawless! Was so tired of having a hard time finding something working.'], 'appId': 'is.xyz.mpv', 'url': 'https://play.google.com/store/apps/details?id=is.xyz.mpv&hl=en&gl=us'}
