{'title': 'Comfort Reader - speed reading', 'description': "Comfort Reader makes reading e-books easier for you. It streams any text directly to your eyes. Smart text processing and colored letter animation help you to recognize and understand text faster and better. Reading an ebook will seem just like watching a film - at the speed that works best for you.\r\n\r\nMain features:\r\n- supported file formats: txt and pdf\r\n- displays just the current phrase you are about to read\r\n- makes sure that associated words won't get chopped randomly (as in conventional Speed Reading Apps with Rapid Serial Visual Presentation)\r\n- creates a fluent stream of text at your desired speed\r\n- colored letter animation stimulates better concentration and comprehension\r\n- trains your reading, reduces regression and expands your vision span\r\n- fully customizable text appearance and reading configuration", 'descriptionHTML': 'Comfort Reader makes reading e-books easier for you. It streams any text directly to your eyes. Smart text processing and colored letter animation help you to recognize and understand text faster and better. Reading an ebook will seem just like watching a film - at the speed that works best for you.<br><br>Main features:<br>- supported file formats: txt and pdf<br>- displays just the current phrase you are about to read<br>- makes sure that associated words won&#39;t get chopped randomly (as in conventional Speed Reading Apps with Rapid Serial Visual Presentation)<br>- creates a fluent stream of text at your desired speed<br>- colored letter animation stimulates better concentration and comprehension<br>- trains your reading, reduces regression and expands your vision span<br>- fully customizable text appearance and reading configuration', 'summary': 'the app that makes reading e-books enjoyable', 'summaryHTML': 'the app that makes reading e-books enjoyable', 'installs': '1,000+', 'minInstalls': 1000, 'score': 4.37, 'ratings': 100, 'reviews': 53, 'histogram': [5, 4, 4, 23, 64], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '11M', 'androidVersion': '5.1', 'androidVersionText': '5.1 and up', 'developer': 'Michael Schlauch', 'developerId': 'Michael+Schlauch', 'developerEmail': 'info@rhizomaticdesign.net', 'developerWebsite': 'http://comfortreader.rhizomaticdesign.net', 'developerAddress': '39100 Bozen', 'privacyPolicy': None, 'developerInternalID': '9024581973640477279', 'genre': 'Books & Reference', 'genreId': 'BOOKS_AND_REFERENCE', 'icon': 'https://lh3.googleusercontent.com/zcTKH0v-97ooV3JZISuqkGZgjSAfv4w7CCxwB4jN-3qmY_OKsgvK2vefDDyTZ8RDv6YT', 'headerImage': 'https://lh3.googleusercontent.com/DtEh5R1WqpnJTTxhRdxacIvfpxOdZlKFtUtZvOUBjI3w8m3hBEf9f2ee_hNRn9UF0xU', 'screenshots': ['https://lh3.googleusercontent.com/OVR49jRrv4DcW6fF5_nBkp8C3S0vZv5pnuMzCEOqYRy3vbtlh4dOkbRIhjdeOFJuPaE', 'https://lh3.googleusercontent.com/wizp3KYwnoVjwl4MvUInAJ54rWia3-JuVdz60NAVZiimnrqYVmSIFPrtI5tvmNnD4BQ', 'https://lh3.googleusercontent.com/hF_FVnn8Z9ItZWht0WKLCMhMMQlUModTB6s9N18ijd6SS_jjk8MvLWvvt2p99Yv_g04', 'https://lh3.googleusercontent.com/7CtCfcGOjNGKyz9LElY1LlX0IJP--dda2J6IoExSjmpCw64C6CKY3xC5NX52a34yUjo', 'https://lh3.googleusercontent.com/XCm_kLnSGt37YvOcb4tIEZHyyCXNiIgr0veUjQ1zfNId7D8EXGIofaoDhU2qxnB1PKQR', 'https://lh3.googleusercontent.com/SXYKkagTurW5-us42aoJNVUGJx7ZmG5ic8qGy22tUErUZIw6sKlr8T2TgeWHQUQXrnk'], 'video': 'https://www.youtube.com/embed/j8faET-o8XI?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/j8faET-o8XI/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Aug 11, 2014', 'updated': 1576320795, 'version': '1.9.6', 'recentChanges': '- single-line mode: switch additional lines on or off (peripheral vision)\r\n- support for OpenDyslexic typeface\r\n- settings (import text): paste text and edit\r\n- save up to 10 recents reads (along with respective wpm settings)', 'recentChangesHTML': '- single-line mode: switch additional lines on or off (peripheral vision)<br>- support for OpenDyslexic typeface<br>- settings (import text): paste text and edit<br>- save up to 10 recents reads (along with respective wpm settings)', 'comments': ['Lovely reader which allows me to read by just seeing a single line in the centre of a black screen I enjoy the fact that the reader opens web pages which contain the text of a book.....once you have shared the web page address with comfort reader the reader will open the book.....you can then disconnect from the web & continue reading I love that you can Alter the speed and amount of characters per line Comfort reader is now my number one reading method. Its about visual quality for me Thx', 'Highly rated productivity app. It makes one focus on reading. You can speed up to to quickly skim or slow down to assimilate complex text. Thanks guys for saving the world, a book at a time.', 'Nice app with different configurations. The only issue is a bug occurring when trying to look at previous text while the current text is on "play", however the application can work just fine if you avoid to rewind while automatically advancing.', 'Helps me read faster. Helps me train to read more quickly in general. I prefer this method of flowing over of the text as opposed to the kindle word runner which insists on showing you one word at a time.', 'I love this app. Does what I want better than any paid app I can find.', 'itsna good app it helps you read quickly and easily', 'This is a very good app. I like it. I love it.thanks', 'Make reading speed faster than 1500, much faster please', "This is one of the best reading app I've downloaded so far, and I have nine of them. Three stars because it doesn't flow at the end of the line. It would end in the middle line without finishing the rest of the sentences down the line and would make the middle line the starting point.", 'Excellent. I notice setting BG to black, Color to dark,dark green, and Focus to very-light, saturated green is most readable for me (the eyes are most sensitive to green light). The way this app carries the highlighted region across is more natural than the "single-word" approach because the former closely resembles actual reading. Also, how it pulses as it scrolls across the horizontal forces the eyes to stutter, microsaccades strongly modulate neurons in the primary areas of the visual cortex.', 'I have been looking for a good free speed reader app for a bit now. And I finally settled on this. It can be a bit janky to set up but it works for my intended purpose and I have not found any better alternatives. Sometime the app will randomly crash, but since everything auto saves and it immediately opens to your book, all you have to do to resume is hit play.', "Absolutely tremendous app, much better than single word speed reading apps, allows the reader to bring the peripheral words in quickly. Only read one article so far but felt obligated to write a review! Can't wait to tell people about this!!", 'I wish I had known about this sooner. I have trouble focusing on text on screen and this app makes it way easier. Very simple app, you can alter the speed and the colors of the text etc.', 'This app actually lets you speed read group of words, unlike most speed reading app which stick to single words. The former is better for reading improvement.', 'Very difficult to find files. I tried to adjust the reading speed per minute but it always read the same speed, it was way to slow, and I am not a fast reader.', 'Please remove the sweeping effect. Also, prefer showing just a single line. Awesome though!', 'Excellent app. Exactly what i was looking for. Must download if you like reading lots of books.', "I'd love it if it could be; set to 1 line not 3 faster play and pause buttons were bigger", 'Could not even find a way to open a book. Weird interface.', "Clipboard support is confusing, and doesn't even work", 'I enjoy this app. I would enjoy knowing where I am in the text of the reading.', 'This app is perfect for deep reading', 'great and handy', 'It does everything you want it to do.', 'Just digging into it. Hoping to customize it more.', 'I think this app isn’t usefull', 'Amazing functionality', 'exceptional', 'I love it. Though it can be improved with bookmarks and search features. Maybe in next versions. I like reading books using this app and I would recommend it. Another suggestion for next version: the possibility of moving the app on the sd card. You did a great job. Thank you.', 'great app.', 'great app', "Love the app. Things that can be improved: Search text. I am swithing to this app midway from another app & don't want to read the whole book again on this app.", 'Hi.  Really love this app. Very original and an attractive interface. Thanks for the latest update. Is it possible to also include a word counter (how many words are in an article) and also a timer? Thanks once again.'], 'appId': 'com.mschlauch.comfortreader', 'url': 'https://play.google.com/store/apps/details?id=com.mschlauch.comfortreader&hl=en&gl=us'}
