{'title': 'Expo', 'description': 'Start building rich experiences with just your Android device and your computer. Expo is a developer tool for creating experiences with interactive gestures and graphics, using JavaScript and React Native.\r\n\r\nTo learn more visit https://expo.io. Some programming experience is recommended.\r\n\r\nBy downloading and running this application, you are agreeing to our Terms of Service at https://expo.io/terms.', 'descriptionHTML': 'Start building rich experiences with just your Android device and your computer. Expo is a developer tool for creating experiences with interactive gestures and graphics, using JavaScript and React Native.<br><br>To learn more visit https://expo.io. Some programming experience is recommended.<br><br>By downloading and running this application, you are agreeing to our Terms of Service at https://expo.io/terms.', 'summary': 'Expo is a free & open source platform to build apps using JavaScript and React.', 'summaryHTML': 'Expo is a free &amp; open source platform to build apps using JavaScript and React.', 'installs': '500,000+', 'minInstalls': 500000, 'score': 4.146032, 'ratings': 3198, 'reviews': 1006, 'histogram': [406, 111, 182, 406, 2091], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '63M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Expo Project', 'developerId': 'Expo+Project', 'developerEmail': 'support@expo.io', 'developerWebsite': 'https://expo.io', 'developerAddress': '624 University Ave\nPalo Alto, CA 94301\nUSA', 'privacyPolicy': 'https://expo.io/privacy', 'developerInternalID': '8143610498327843040', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/Bn-9LhsZ1P0z-ob_4pwvTF3aucymAzk6uqG7QIPkM7oo_ADkF1TJu_zJdxJswpkfU3Y', 'headerImage': 'https://lh3.googleusercontent.com/7l-bQADRV4PzxAz_9GH2aozV3jkHqdlUJbOsIf4Eu_bazCi6UH_UyiAeKer2-s9GafI', 'screenshots': ['https://lh3.googleusercontent.com/uWEvkEQdLSp--OxAOiVdtEZBqKI1KGLxVnmp_1Z_6NjZl1pYawbjE6ckZRyFqO0E_w', 'https://lh3.googleusercontent.com/Kdd4nuMco0ePejDv9I-Zx3gOd3VAV3FukQjuYnWpk4EOq5msdAA-9mdM5CQ-zxIqwQU', 'https://lh3.googleusercontent.com/uItt7MdQtOF_hyYLTaM3S43qw4xNUPYOE9-JBQmCyv0KomtTzZfxh4wTsYwPyFEu7w', 'https://lh3.googleusercontent.com/WPPTURV1Vd0pMw5ZQs-fnJKi4dPdQmwSWDNkGzrK8pgH3L8soswVsHi50tuUkJy_Pg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 8, 2015', 'updated': 1586890396, 'version': '2.15.4', 'recentChanges': 'Fix occasional issues with the development menu\r\n===\r\nAdd support for Expo SDK 37', 'recentChangesHTML': 'Fix occasional issues with the development menu<br>===<br>Add support for Expo SDK 37', 'comments': ["Using this for a year or so now.. Overall the idea and usefulness of expo is 5/5. Execution of product 3/5. Comments aren't wrong, tons of issues, for me worst is how horrible debug mode is, and how it screws up things even when you turn it off, to the point of needing to Uninst. And install to work again. But many connection issues ppl complain about can be easily solved with a few google searchs and making sure you are connected to same wifi router at home on devices.", "I've been trying to run my app for over 48hrs and I'm getting the Expo SDK not found. I can't even login on the app or use the explore tab showing network request failed. This is slowing down my development process, I already uninstalled this app and reinstalled but the same issue. Please I want an alternative if possible so I can get on with my development. Update: It was a vpn from my phone that was causing the connection issues. Thank you 🙏", 'This app is a highly buggy app . For God sake please resolve the problems in the app . I am experiencing the samr problems from such a long time.. after one time it scans the QR code correctly but the next time I open my system and try to scan it gives an error.. and then I have to uninstall the app install it again and then it again scans it correctly for only once.. please do something with it.', 'I can\'t open the developer menu on either a hardware device or in an AVD. Shaking the physical device doesn\'t work and sending adb shell input keyevent 82 doesn\'t work on either of them. Not being able to turn on "Debug JS Remotely" makes it very difficult to develop.', 'This app is not working at all always it says Session Timeout. Tried on the phone by scanning QR Code it is not working. Tried to access through Android studio on PC also it is also not working. Kindly look into this and try to fix this ASAP.', "Since the recent update, it has not been connecting via the QR scanning code... Always saying 'session timeout', and this wasn't an issue before. Please rectify, I have to pause projects because of this.", "I can't connect my React native application to my expo client. whenever I try to connect by scanning QR code it often shows me could not connect to exp://", 'It does not function properly, most times i have to uninstall and install again. Uninstalled and reinstalled 3 times in just one night', 'For five minutes that I have used this app it crashed like 10 times. Also when i clicked on send bug report it threw some error.', 'Horrible, since 2 updates its making a disaster with my app, its ignoring the status bar style and the keyboard is pushing everything up, even the tab bar from react navigation. I had to downgrade to 2.14.0. Please fix it!', 'After updated to 2.15, Notification.getExpoPushTokenAsync() never gets resolved on Android. Please help look into this issue. Thanks.', 'Worst experience in recent update. When there are warnings then the screen stop responding and we are unable to see warnings with full explanation. Please resolve this.', "App not reloading on saving files. Earlier it's working fine. Please fix this issue asap. And thanks in advance 😊", 'Something went wrong . Could not load .Network response time out. Problem reading the QR code .', "It's okay but sometimes it stops refreshing if screen is inactive for a while. Please fix it.", 'April 2020 - Reinstalled Expo recently for a new project; app instantly crashes on startup.', 'This thing doesnt work.theres only one way to enter a project and theyll keep saying theres an error but wont even dorect you to what the error is', 'The app is closing unexpectedly when trying to open project.', 'Trying to scan but everytime saying could not establish connection.. Fatal error.. What fetal error? Ridiculous..', 'Great tool ! Saved me lot of time downloading and installing Android SDKs .', 'Expo is great to kick-start a new React Native app easily and quickly.', 'Nice app for react Native development, but app is crashing, must solve this problem ASAP', 'Stuck on loading screen whenever I try to run a snack. Disappointed 😕', 'Always need to uninstall and reinstall back to erase the error while app developing', 'This app has some issue please resolve it I get tired of this because not working properly', 'Android push token not generating but the same time iOS is working fine', 'Works great for quick development and experimentation.', 'The app is not developer friendly at all. It is well encaminated though.', 'It crashes every time I run my react app', 'Not able to detect the QR code on my OnePlus 5', 'This App is not opening in my device. It is automatically closing', 'Totally fake app... Not getting connected..', 'Not working with scan', 'Developer mode is not opening by shaking', 'Great app to start your app development adventure', 'amazing experience for building APPs', 'Works great and easy to use', 'App doesnt works most of the time. Keeps giving me the "something went wrong" error at random. Just 15 min ago it was working, now I cant make it work. I tried tunnel, Lan, and local, but nothing seems to work. Its driving me crazy! Please, test the app before updating it, I just cant develop apps this way. Im seriously considering native app development because of this.', 'This app is just amazing thanks a lot expo team', 'Ridiculous app i have ever seen. My project is not running on expo client Android. I have tried more than 100 times nothing happened. The app automatically redirect me outoff the app everytime... Very bad experience'], 'appId': 'host.exp.exponent', 'url': 'https://play.google.com/store/apps/details?id=host.exp.exponent&hl=en&gl=us'}
