{'title': 'MusicBee Remote', 'description': 'Important! Application development is currently in hiatus. If someone is interested in picking the development please feel free to send me an e-mail.\r\n\r\nMusicBee Remote is an application that allows you to remotely control MusicBee using your Android device.\r\n\r\nIt is a third party application and thus it is not affiliated in any way with MusicBee or Steven Mayall.\r\n\r\nThe store listing uses content owned by ProleteR available at http://dustedwax.org/dwk123.html under (cc) by-nc-nd 3\r\n\r\nYou can find help and links to the plugin required for the application to work on http://kelsos.net/musicbeeremote/.\r\n\r\nBoth the application and the plugin are open source and distributed under the GPLv3 License.\r\nYou can find the source for the application on https://github.com/kelsos/mbrc and for the plugin on https://github.com/kelsos/mbrc-plugin.\r\n\r\nJordan Georgiadis is responsible for the logo concept.\r\nTasos Papazoglou - Chalikias is responsible for further refining the logo, creating the promotional graphics and designing a major part of the UI and assets. \r\n\r\nThe latest plugin requires at least MusicBee v3.0 to function.\r\n\r\nMusicBee Remote requires a device running at least Android v4.1 along with a wireless network connection in order to function.\r\n\r\n-Basic track information display (artist, title, album, year of release and artwork).\r\n-Basic player control. (play, pause, stop, next, previous, volume change, mute, shuffle, repeat)\r\n-Last.fm account scrobbling on/off.\r\n-Last.fm love/ban.\r\n-5 star rating.\r\n-Playback progress display and control.\r\n-Lyrics support.\r\n-Now playing list display, along with the ability to choose a track to play, search for a track to play, remove a track from the now playing list, or reorder the tracks.\r\n-Library browsing support with the ability to enqueue, or play the tracks.\r\n-Basic playlist support (list and press to play)\r\n-Option to reduce the volume, pause/stop playback on incoming call.\r\n-Lockscreen controls on devices running Android 4.0 or greater\r\n-Headset controls on devices running Android 4.0 or greater\r\n-Volume control using the hardware buttons.', 'descriptionHTML': 'Important! Application development is currently in hiatus. If someone is interested in picking the development please feel free to send me an e-mail.<br><br>MusicBee Remote is an application that allows you to remotely control MusicBee using your Android device.<br><br>It is a third party application and thus it is not affiliated in any way with MusicBee or Steven Mayall.<br><br>The store listing uses content owned by ProleteR available at http://dustedwax.org/dwk123.html under (cc) by-nc-nd 3<br><br>You can find help and links to the plugin required for the application to work on http://kelsos.net/musicbeeremote/.<br><br>Both the application and the plugin are open source and distributed under the GPLv3 License.<br>You can find the source for the application on https://github.com/kelsos/mbrc and for the plugin on https://github.com/kelsos/mbrc-plugin.<br><br>Jordan Georgiadis is responsible for the logo concept.<br>Tasos Papazoglou - Chalikias is responsible for further refining the logo, creating the promotional graphics and designing a major part of the UI and assets. <br><br>The latest plugin requires at least MusicBee v3.0 to function.<br><br>MusicBee Remote requires a device running at least Android v4.1 along with a wireless network connection in order to function.<br><br>-Basic track information display (artist, title, album, year of release and artwork).<br>-Basic player control. (play, pause, stop, next, previous, volume change, mute, shuffle, repeat)<br>-Last.fm account scrobbling on/off.<br>-Last.fm love/ban.<br>-5 star rating.<br>-Playback progress display and control.<br>-Lyrics support.<br>-Now playing list display, along with the ability to choose a track to play, search for a track to play, remove a track from the now playing list, or reorder the tracks.<br>-Library browsing support with the ability to enqueue, or play the tracks.<br>-Basic playlist support (list and press to play)<br>-Option to reduce the volume, pause/stop playback on incoming call.<br>-Lockscreen controls on devices running Android 4.0 or greater<br>-Headset controls on devices running Android 4.0 or greater<br>-Volume control using the hardware buttons.', 'summary': 'MusicBee Remote is a remote control application for use with MusicBee player.', 'summaryHTML': 'MusicBee Remote is a remote control application for use with MusicBee player.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.0194807, 'ratings': 1592, 'reviews': 651, 'histogram': [217, 72, 113, 248, 940], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '4.2M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Konstantinos Paparas', 'developerId': 'Konstantinos+Paparas', 'developerEmail': 'kelsos@kelsos.net', 'developerWebsite': 'http://kelsos.net/musicbeeremote/', 'developerAddress': None, 'privacyPolicy': 'http://kelsos.net/musicbeeremote/privacy-policy.html', 'developerInternalID': '8789416272005511303', 'genre': 'Music & Audio', 'genreId': 'MUSIC_AND_AUDIO', 'icon': 'https://lh3.googleusercontent.com/5IiPSFrLj7SlHkAlZZpwya8voOBFNSyEetzkTB_gktAnjfAFl9XkWSNa5DKFqaYPvg', 'headerImage': 'https://lh3.googleusercontent.com/olC5EQTo6JMZfNQnyzQRQ8T-81RpB722lJJmzM0JPf7efi7w3XYpR6N7L29QRbXJ5Nxv', 'screenshots': ['https://lh3.googleusercontent.com/-r1dtSK_qT6x9ZuX-IIXDl7GEXrwNXNDY01q03ZDYd6vBZdvJLtHH8HFRxVvOvioSA', 'https://lh3.googleusercontent.com/qKIXBAL1oP2YGHnN1JN_jTav256r0BEyIA66HW0DfpCFFXf2YYYsxS1czJOe_awUKfk', 'https://lh3.googleusercontent.com/_9NoAxgKZn7Z7HO0HTTpM5AkyhywrdMqc4Sag8mmaKp9sBEygp0JYVjrNgbASBV2XA', 'https://lh3.googleusercontent.com/f4MMvIxOYOyTX8WfhwMKZKA7fUxkW43zevuwpNqFFlanxvKledD_s17bJWmPzJmFxaNS', 'https://lh3.googleusercontent.com/j5Eg3xgQ6aEDLptrUN6wvM6VymHvhtjwnz8xonqH7DZxNgjWlFB-ebj5XT05yysrurU', 'https://lh3.googleusercontent.com/GMZjfcpAdBfSIFqtbku_9exuNYuocDQFR_oI1NlOZ9o88nzQmmQwf8F1oFYgM3jC9ABk', 'https://lh3.googleusercontent.com/N5BnfBn7mEtSPm9ajKj3g9y6rM0i4KDzTlJSJ8sv_6YJvp9HNwazuKy2gOR5mRWPHw', 'https://lh3.googleusercontent.com/VDc0cEdSTozgEMROuWOjcarFq1a08YgrIzo6vrbWDAARvmfHg1kFwKm0tJKCXQbDSg', 'https://lh3.googleusercontent.com/Qtw1oKpgW10rHq4BOG1a00Y62Ck5MFUjHD1OxF9Dy57k1eGF1mM779U57lWGdRMFiQ', 'https://lh3.googleusercontent.com/9Ck3qfjrbBSrRfAc7KvJ2-HKbUcrXl9AuEv5jiCj2ZnWKgyO8oeOZzO6IewZlqBnIT4', 'https://lh3.googleusercontent.com/qXQf73hklY8E9zRr5tFC79PFxKmjHdZ9Dnx3rIYFlE9tp-yjXZzTxjQN0MvLgBK_ULbl', 'https://lh3.googleusercontent.com/_WjhGSxDomhHfixgMIe1R1GOvEN3NaI58cCvDhU1ZbQdEp5B8LrhfaarYnlDc1awOIPe', 'https://lh3.googleusercontent.com/TUBdvvwAP0pLaa5y3sweKdFeq-f6voKXyRGrCIPBHbCmCvZWs2Hm3N3b9JCSCNAR_Q', 'https://lh3.googleusercontent.com/GiC0uWAC_orze1t6QQ-nkrwmr_bk1twoib3Ie88oX7Atpg5Mwsb8ihC-qZC7mzYlGAF-', 'https://lh3.googleusercontent.com/dbAONckg95gsX3w1nVH_0F5vXIgoSsWDbltHgqrUFvCb4KXfWWlsOVWLIG55_5Y2eg'], 'video': 'https://www.youtube.com/embed/pl8mz0ZzHOI?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/pl8mz0ZzHOI/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Oct 14, 2012', 'updated': 1486367330, 'version': '1.1.0', 'recentChanges': 'Refreshes the playlists along with the library data.\r\nChanges sorting to start with triple dash\r\nFixes library collapse\r\nReworks the default action option to affect only the track view.\r\nFixes the query for showing the albums of an artist.\r\nAdds option to show album artist only\r\nFixes automatic scroll on now playing\r\nFixes remote session volume slider\r\nFixes order on genres\r\nAdds fast scrolling to the library tabs.', 'recentChangesHTML': 'Refreshes the playlists along with the library data.<br>Changes sorting to start with triple dash<br>Fixes library collapse<br>Reworks the default action option to affect only the track view.<br>Fixes the query for showing the albums of an artist.<br>Adds option to show album artist only<br>Fixes automatic scroll on now playing<br>Fixes remote session volume slider<br>Fixes order on genres<br>Adds fast scrolling to the library tabs.', 'comments': ["I liked it but it lacks something very important for (to be honest, few players have this feature). I have around 2000 CDs ripped in my hard disk, nicely sorted by folder. Each folder is a CD (or point to a group of CDs). Browsing the library by genres/attics/albums/tracks never works for me because the app (any app actually) has difficulty categorizing or sorting my collection. I have several obscure CDs nobody seems to know, not even this app. MusicBee allows me to pick up a folder (CD) and play it, but this app doesn't have this feature (unless I'm mistaken). Other than that is a great app that work well with MusicBee.", "It works really great. I'm really surprised that you developed both the app and the plugin all by yourself. Currently the library can only sort by album artists so it would be better if library could sort with more tags like A-Z or year,.... Those albums with album artist like Various Artist don't show up in Artists tab, so the only way to access those album is via Albums tab. Also wish there could be more customization xD.", 'No folder option for a start having to rely on software tags which everything does differently almost. So big pain. Does not update very well after changes. Awkward user interface at best. 2 stars for the app, the remote leaves a lot to be desired.', "Difficult to set up, but I got it eventually. It seems like you can't use this to play music using the phone's own speakers? What's the headphone icon for? That doesn't seem to do anything.", "When it actually connects it's great. That is pretty rare, however. Sucks. Wish there was a good app for syncing music between android and windows, or at least a good remote control app. Anybody reading this have any suggestions?", "Firstly, fantastic someone finally made this! Only seen a few qualms so far:  1) When I browse an album and press a track to play it, it doesn't continue after that track, you have to press the side menu on the album itself and press play, for it to play all tracks on the album - which is rather fiddly. 2) It forgets where you are, if you go out of the library browser, and return (it'll just start you at the top again). 3) Finally one thing that is a major flaw a lot of music apps seem to miss, is not having visible covers when browsing your music - its the main reason I chose MusicBee over Foobar in the first place, because it has a nice cover-tile system. So either a full on cover-tile option when browins, or simply adding a small cover picture before the name of the album or artist, like you see at the bottom when a track is playing, would make the app vastly more nice to use! But stellar work so far!  Oh, and an iOS app would be great... if all of the above was fixed/implemented and I could have it on my iphone rather than my old tablet, I'd happily pay a bit for it too!", "Love this! It's small, it works, and it looks like a music player on your device. I expected it to be a stripped down but functional player. But it's slick and easy to use. Wish the tracks page had different formatting preferences but honestly that's nitpicking. Simple tool that does so much for my listening experience. Love it!", 'Great app, ways it can be better imo -There is no way to "shuffle all" music. Not even for a specific artist. You queue up the artist with shuffle enabled and it just plays the albums back to back. -Can\'t to see the actual queue, much less edit it. -The layout could be a bit better. For example, chosing the categories in the Library (or at least being able to change their order), or changing the sort parameters in Tracks (by artist, by album, title, etc) But hey, still works great!', 'Works great, and lyrics too. I wonder why the actual music bee player does not have a lyrics display feature like this app has. I suggest you update the link to help page, here and in the app. All I needed to do was download the plugin to my laptop and all good, the default configuration was fine for me.', 'Just what I needed. Music library on the laptop, bluetooth speaker in the bedroom and this app in my pocket to control my jukebox. Thanks.', 'Exactly what I was looking for and works perfectly. Thank you!', "Seems to be getting better! Still don't like the yellow though and I wish I could dismiss the notification without having to open the app, open the menu and select exit - for some reason I can't just swipe it away. Great support from the devs!", 'The app works perfectly, had no problems synching it to my pc, and the remote responds well. Thank you for your work, this is such a convenient app that goes along perfectly with the best music player out there.', 'Decent but different from how MusicBee organizes your library. List of albums is displayed alphabetically by artist, not by album title. Shows library by genre but not group. No star rating functionality.', "Works well. Only thing is 'now playing' is not working properly with shuffle. Its just showing what would be playing after the current track if shuffle was turned off instead of the true shuffled upcoming tracks list on the pc", "Could be useful, but doesn't seem to like big libraries. When I go to the artists tab, it stops finding results midway through the 'N's. So, not very useful to me.", 'Adding PAUSE & RESUME feature on call would be useful. Volume Level not syncing properly with the desktop application. Repeat 1 is missing on remote app.', 'Wonderful app from a wonderful open source developer! Purest recommendation for all MusicBee users.', "Works perfectly. Set-up wasn't difficult after following the Help section, but might be helpful to add an optional wizard feature for new users.", 'Excellent app, it would be perfect if in the next version you can include the album covers in the album view. Thank you!', 'Would absolutely love to see the list of song on my playlists before choose the son and not get one randome on. Just downloaded the app. Very nice.', 'Extremely useful app and very easy to use. Never thought this would actually work. Thank you for this. Now I can game in peace.', 'Works great, has everything you should need to control your MusicBee PC App.', 'music bee is best of all desktop music player apps & this is an awesome addition to it. working flawlessly. thanx dev.', 'Music could be accessed better but overall it worked without much setup & works well', 'Occasionally a little glitchy but overall works well and is very convenient', 'Didnt work, problem is not my network.', 'Improve interface. Add option like shake to change while locked phone', 'Excellent, but please can could you add a setting to stop the device volume buttons from controlling MusicBee volume ?', "Doesn't work at all. Music doesn't show up in the app.", "I googled and searched and read cryptic, sarcastic reddit messages. I'm just too dumb to get it hooked up. Even when I go to url for plugins, there are no plugins.", 'Would be cool if you could change the theme. ugly interface', 'Very good . Music Bee is my favorite few years already. Smart', 'I have spent way to many hrs trying to get this to work. But after 4 days! I have got it working', "Heyyyyy! I can't seem to connect the app to the program.. please help so I can rate it accordingly. Thanks", 'great remote mp3 player', 'Loaded onto some old devices and leave them where I listen to music the most. No need to carry me phone around.', 'no any update last 30 month??', 'Would not find any connections', 'Really awesome. Thanks for finally making this a thing.'], 'appId': 'com.kelsos.mbrc', 'url': 'https://play.google.com/store/apps/details?id=com.kelsos.mbrc&hl=en&gl=us'}
