{'title': 'MEWconnect: signing app for MyEtherWallet web', 'description': 'A ‘hardware wallet’ without all the hardware.\r\n\r\nMEWconnect is an official, free companion app for MyEtherWallet that helps you secure your funds as never before.\r\n\r\n* * *\r\n\r\nHARDWARE WALLET-STYLE SECURITY FEATURES\r\nMEWconnect stores your private keys safely in a local, isolated, and secure vault on your device to protect your account like the ELEVENTEEN GOOGILLION dollars it will one day be worth (probably).\r\n\r\nTWO STEP VERIFICATION TO PROTECT YOUR EVERY TRANSACTION\r\nIn the World of Crypto, you are your own bank. MEWconnect helps to ensure that you are you, and then that you are you again. You know, just in case.\r\n\r\nPHISHERS WILL HAVE TO PHISH SOMEWHERE ELSE\r\nNo one can obtain your private key.\r\nMEWconnect is official MyEtherWallet software. You can check the validity of the app yourself.\r\n\r\n* * * \r\n\r\n— No centralized servers for communication. \r\n— No data collection\r\n— Open source\r\n\r\nBuilt and maintained by the MyEtherWallet team, the team that brought you the Ethereum’s original and most trusted wallet interface.', 'descriptionHTML': 'A ‘hardware wallet’ without all the hardware.<br><br>MEWconnect is an official, free companion app for MyEtherWallet that helps you secure your funds as never before.<br><br>* * *<br><br>HARDWARE WALLET-STYLE SECURITY FEATURES<br>MEWconnect stores your private keys safely in a local, isolated, and secure vault on your device to protect your account like the ELEVENTEEN GOOGILLION dollars it will one day be worth (probably).<br><br>TWO STEP VERIFICATION TO PROTECT YOUR EVERY TRANSACTION<br>In the World of Crypto, you are your own bank. MEWconnect helps to ensure that you are you, and then that you are you again. You know, just in case.<br><br>PHISHERS WILL HAVE TO PHISH SOMEWHERE ELSE<br>No one can obtain your private key.<br>MEWconnect is official MyEtherWallet software. You can check the validity of the app yourself.<br><br>* * * <br><br>— No centralized servers for communication. <br>— No data collection<br>— Open source<br><br>Built and maintained by the MyEtherWallet team, the team that brought you the Ethereum’s original and most trusted wallet interface.', 'summary': 'A ‘hardware wallet’ without all the hardware.', 'summaryHTML': 'A ‘hardware wallet’ without all the hardware.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.321429, 'ratings': 5952, 'reviews': 2551, 'histogram': [526, 101, 364, 900, 4059], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '26M', 'androidVersion': '6.0', 'androidVersionText': '6.0 and up', 'developer': 'MyEtherWallet', 'developerId': 'MyEtherWallet', 'developerEmail': 'support@myetherwallet.com', 'developerWebsite': 'https://myetherwallet.com/', 'developerAddress': None, 'privacyPolicy': 'https://www.myetherwallet.com/privacy-policy.html', 'developerInternalID': '4875522386353244973', 'genre': 'Finance', 'genreId': 'FINANCE', 'icon': 'https://lh3.googleusercontent.com/25mGeArzn7N0Rh1F56M7smrLI9_RtngwcHGXqDkbjtGE3RXbIXbMTb6iZGDnzWl_UTLE', 'headerImage': 'https://lh3.googleusercontent.com/9h-ihU6n_SymfNWUvwoawd6JZeU1u5UlYPCxkWeHMScBcuzYpG7nZiNx4FLql6cYYXQ', 'screenshots': ['https://lh3.googleusercontent.com/Q0-BisdM1Cg4QTNb0EA9psZAhcdTs8V2hbsk0TbG-g6n6QyLjIONsPe1Pd3jNfBiwbo', 'https://lh3.googleusercontent.com/ilg_8A0LtOWrU25LFOVIZ_IZ_DiXvMjcSglmHRDsL97bK6AWw0hHXoTOKS8XlypoCnQ', 'https://lh3.googleusercontent.com/KcMoC7iFPntrPJ9y-uzzcywmR-8NXhzwH4LeikHrYfxXdfMp1wOV7R-5DL7Lz-a-I5c', 'https://lh3.googleusercontent.com/cSbPkFTETxln5P7wp3KeZy02Vca8cIHRp5iuMe2LRtFCnOlQ95K0mWuX2Y5OeG2fKPI', 'https://lh3.googleusercontent.com/xKM9yICHOVyaygDO_mnD5clVVBwqbE9H909dfHC3iWFgDoeF_5C_FhxLBkeTSrHGeYW7'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 7, 2019', 'updated': 1588751051, 'version': '1.0.14', 'recentChanges': '— Minor updates and improvements\r\n\r\nANNOUNCEMENT: Full-fledged MEW wallet app is now available!\r\nYou can now buy, hold and send Ether and tokens directly in the app, without having to connect to MEW web.\r\n \r\nUpgrade your MEWconnect app in just a few taps: download MEW wallet app, it will automatically detect if you are already using MEWconnect and offer you to import your account. \r\n\r\nLaunch MEWconnect after this update for more details.', 'recentChangesHTML': '— Minor updates and improvements<br><br>ANNOUNCEMENT: Full-fledged MEW wallet app is now available!<br>You can now buy, hold and send Ether and tokens directly in the app, without having to connect to MEW web.<br> <br>Upgrade your MEWconnect app in just a few taps: download MEW wallet app, it will automatically detect if you are already using MEWconnect and offer you to import your account. <br><br>Launch MEWconnect after this update for more details.', 'comments': ["So,far I wouldnt recommend this,app,to my worst enemy, fiery I downloaded the .MEWapp to my to upgrade so I almost all my ETH & ERC20, then I get to the MEW has a bug and peoples balances are sisapp however if I restore my account all will be fine and what you lost will be back in the account.....Guess the answer?,your right nothing in my account at all bear in mind this all happened within 5 mins of opening the account so until I see.serious results i can't recommend this to ANYONE BE CAREFUL", 'The experience with this app is extremely poor. The tokens most have no logos, and there is not even an option to send tokens. Also is a hassle to have to place the password in every single time you exit thr app, even for 1 second you still have to place the password back again.', "I had 1000 PRE coins in my wallet but you have changed the login method and I think I have lost all my coins in the wallet. Because the way I used to login to my wallet, has been changed and now I can't find the way to my inbox.", 'Easy to use, very light and minimalist interface with an awesome support base to help with any issues. Thanks!', "I installed this app and worked correctly. But Now it can't read QR Code and can't connect. I guess it is because of uninstalling an QR reader app. Is it true? What QR code scanner app should I install?", "Don't use this app will not work phrase recovery 24 word, are risk gone your wallet. \U0001f92c", 'What is this? Why is it very bad? I dont recommend this. There are a lot of good wallets out there. They better be taking this trash out of play store. I am not a designer but this is the kind of app that doesnt even look good. I wonder what eyes did they use while making critics for the visuals or maybe they dont have eyes after all.', 'Great app for exchanging from a wallet to another wallet using this wallet as a middle man between non- ERC tokens', "Easy to use, no issues, and it's pretty quick!", 'A good and easy mobile app for the MEW wallet.', 'It is okay but not good for my standards. It cant add custom token.', 'Wallet addresses are invalid for xfer... But hey, it looks good 😁', "Qr code scanner for private keys doesn't work", 'Very quick and easy to use', "Now it's a cryptocurrency wallet, it can receive send and store, just don't mess up like before, I'm watching", 'Super easy to set up and use. I was up and running in minutes!', 'I cant read qr code and access my wallet.', 'Goodwork easy to use', 'Transaction fee too high', 'Unhelpful and difficult to follow', "Won't let me scan my wallet. Garbage.", 'Quick setup seems hard to maneuver without keys', "It worked great for awhile. Now I can't see my coins on the mobile ap. The message says that this address doesn't currently own any tokens. I had to set it up on a laptop and my tokens are visible. Attempted reinstall twice. Still no tokens showing. It's done this a few times before and it usually resolves itself in less than a day. Not this time.", "My tokens are no longer visible on mobile app, says this wallet doesn't have any tokens. They used to appear there but not anymore. When I log on the computer I can see them. I'm worried using this wallet because of this issue. I see from some reviews that other users are experiencing the same thing. (UPDATE) My tokens are visible again, I would've given 5 stars but customer support never responded to my emails so I don't know what caused the issue in the first place or how it was resolved.", 'Great app! Everything as expected to be.', "You go through the purchasing process and THEN they tell you they need to verify your ID... and you lose all previous input. AND you can't get back to the ID verification page once you leave it to take image of the ID you need.... On top of that you can't login through the website. Aggravating waste of time. What 5yr old designed this process?", "Again the app scares you by stating that you have zero balance and 0 tokens. I can tell that others have the same problem. For this specific kind of app, that's unforgivable. Imagine if your bank tells you that you have 0 on your accounts.... Will re-rate again when fixed.", 'yup! having the same problems as these other people. I sent 1 coin to try and now it is stuck somewhere. I can not send it or move it anywhere. if! Im albe to get it back I will not be using this wallet.', "This app was good when it worked. It now crashes as soon as I click on it. I have fully updated my Pixel 2 XL and the app shows up to date too but still it doesn't work. I would give zero stars if I could. This app is garbage until it's fixed.", "Piss poor app. Doesn't allow use of private keys or json files. Doesn't show correct balances consistently. .....It does however facilitate the ability to buy crypto with a credit card.....seems legit, lol", 'I strongly urge that NO ONE use this app. The app will never let you exchange tokens or send them to another wallet. Worst of all it refuses to show your balance regardless of how many times you refresh it. Lost around 100 link to this Scam. Do yourself a favor and use a wallet that actually works and not this unresponsive garbage.', 'Managable n easy to use', "Loving the app. It's a piece of cake for anyone that is using the Crypto space. And I get a greater confidence using compared to the old version. Keep making it happen MyEther!!!!!", "Not really a wallet app. It's more of a private key storage system that you use to access mew on Chrome (on a desktop). Also, in my experience I could not send funds with it. Funds are stuck in account and I have not private key. Not a happy camper. I'm sure I'll get them out someday.", "I just installed it(3 hours ago actually) then made an account. then to test it, i transferred some TMT from TIME (5 TMT just to test) it's been 3+ hours and still i don't have the money. (And I am 100% sure that my public address is not wrong which i used for transferring it from my TIME cause i copied that mainnet public address for my MEW so there's no mistake) I want to transfer my TMTs to this place. but it's not working. please help me.", "The app is unable to send transactions without connecting to MEW on a laptop. My eth is currently stuck in a wallet I don't have the private key for, don't have a json of, and can't make a paper wallet of. 3/4 of the time the qr code won't connect to MEW on my laptop. and when I can get it to connect to the website it won't generate a transaction. This whole experience is a giant step backwards.", "Very excited by the install experience! Like that we only need a password rather than starting with a long series of words backup. Cool main page, could display one of 2 tokens just to show. Also a menu, even if it doesnt have much, is reassuring. Finally, while it's awesome to be able to buy Ethereum from the app, i'm less impressed by the rate and fees of simplex. Would also love to use to connect to Web3 in the future; food for thoughts :) Anyways, among the VERY TOP crypto apps!", 'I am devastated by this app. I setup a new wallet and used the mewconnect option and now I cannot send any tokens from my wallet because the send and confirm option is turned off. They literally wont let you send your own tokens. I cannot believe you guys did this! I have no private key so I cannot import the wallet and you wont let me send them out. Completely devastated!', "First of all, I love MEW. But MEWConnect doesn't support ERC-721 - I can't see my NFT token although it's visible on the site. And MEWConnect is just too complicated to use cos you have to type a long 24 word recovery phrase - no copy and paste since you're on mobile (unless you sync with PC) and there's no way for me to import other MEW accounts that I have, if I already have an MEWConnect account.", 'App is horrible. MEW desktop enter amount offline transaction it deletes the amount you input. Sign transaction you verify on mobile amount and eth address and then click confirm and it tells you to login again. No transaction happened! Garbage app'], 'appId': 'com.myetherwallet.mewconnect', 'url': 'https://play.google.com/store/apps/details?id=com.myetherwallet.mewconnect&hl=en&gl=us'}
