{'title': 'VPN Hotspot - tethering/Wi-Fi repeater', 'description': "Connecting things to your VPN made simple. Share your VPN connection over hotspot/system tethering or repeater. (root required)\r\n\r\nThis app is useful for:\r\n\r\n* Connecting things that don't support VPN like Chromecasts behind corporate firewalls;\r\n* Setting up gapps behind corporate firewalls;\r\n* Connecting to your mobile hotspot but you're not bothered to set up VPN on your device;\r\n* Identifying, monitoring and blocking (unwanted) clients;\r\n* Bypassing tethering limits by:\r\n    - (recommended) Use this app with a real VPN/socksifier; (ad-blocker may not work)\r\n    - (might or might not work based on your carrier) Use this app with TTL editor like\r\n      TTL Master;\r\n    - Try your luck and simply use this app.\r\n\r\nGet more information including FAQs on GitHub: https://github.com/Mygod/VPNHotspot/blob/master/README.md", 'descriptionHTML': 'Connecting things to your VPN made simple. Share your VPN connection over hotspot/system tethering or repeater. (root required)<br><br>This app is useful for:<br><br>* Connecting things that don&#39;t support VPN like Chromecasts behind corporate firewalls;<br>* Setting up gapps behind corporate firewalls;<br>* Connecting to your mobile hotspot but you&#39;re not bothered to set up VPN on your device;<br>* Identifying, monitoring and blocking (unwanted) clients;<br>* Bypassing tethering limits by:<br>    - (recommended) Use this app with a real VPN/socksifier; (ad-blocker may not work)<br>    - (might or might not work based on your carrier) Use this app with TTL editor like<br>      TTL Master;<br>    - Try your luck and simply use this app.<br><br>Get more information including FAQs on GitHub: https://github.com/Mygod/VPNHotspot/blob/master/README.md', 'summary': 'Share your VPN connection over hotspot or repeater. (root required)', 'summaryHTML': 'Share your VPN connection over hotspot or repeater. (root required)', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.2613635, 'ratings': 1801, 'reviews': 1005, 'histogram': [153, 92, 133, 173, 1248], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '3.1M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Mygod Studio', 'developerId': '6632046057295121100', 'developerEmail': 'contact-vpnhotspot@mygod.be', 'developerWebsite': 'https://github.com/Mygod/VPNHotspot', 'developerAddress': 'PO Box 9261\nBerkeley, CA 94709\nUS', 'privacyPolicy': 'https://github.com/Mygod/VPNHotspot/wiki/Privacy-Policy', 'developerInternalID': '6632046057295121100', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/_cFSWbnJNzU09Th2tqKaR_i4kdAaZc7WaUZJb8tT4XfpULEnWBbBZAu-rx4sqDRWgDk', 'headerImage': 'https://lh3.googleusercontent.com/DU8aJQRI0hDeq-27i_VvVhDyMOAYjvJnNxeRdk8WQ9ZhS5LInNap9kCspSRwZIXvclMO', 'screenshots': ['https://lh3.googleusercontent.com/XHyV_OT5H3D50bWOWNyC6yHMRQbP25NHuKiaZUf4iSlTHl8Mc0JLUPccivyD6DnDYrg', 'https://lh3.googleusercontent.com/-kCWifMNFbsgXn9h8fPAj3fGo-d9E32MOc9n1lTQgoMb3NJ1k37ihZZkLSXfDm1OKOU'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 22, 2018', 'updated': 1590252752, 'version': '2.9.1', 'recentChanges': '2.9:\r\n* Allow user to turn off safe mode on Android 10 Mar 2020 or newer to use short SSIDs. (#153)\r\n* Fixes including for Android 11 developer preview 2, 3, and 4. (known issue: #158, please report if you find more)\r\n\r\n2.8:\r\n* Fixes including for Android 11 developer preview 1. (#142)\r\n* Traditional Chinese translations by @bluehomewu. (#148)\r\n\r\n2.7: Add diagnosis information for bypassing tethering limitations. (#139)\r\n\r\n2.6:\r\n* Italian translations by @xicciodj; (#137)\r\n* Fixes. (#33, #126, #132)', 'recentChangesHTML': '2.9:<br>* Allow user to turn off safe mode on Android 10 Mar 2020 or newer to use short SSIDs. (#153)<br>* Fixes including for Android 11 developer preview 2, 3, and 4. (known issue: #158, please report if you find more)<br><br>2.8:<br>* Fixes including for Android 11 developer preview 1. (#142)<br>* Traditional Chinese translations by @bluehomewu. (#148)<br><br>2.7: Add diagnosis information for bypassing tethering limitations. (#139)<br><br>2.6:<br>* Italian translations by @xicciodj; (#137)<br>* Fixes. (#33, #126, #132)', 'comments': ["Just awesome! Sometimes it's very easy(baby level) to connected and sometimes it's very hard(gore level) to connected. I struggle to find a way to connected like install, uninstall, clear data, wlan0 etc the application but no luck. Maybe I must try to put this application to the system application. Any better suggestions?", "I am ROOT! App works as it should, small hiccup with the system tethering enable/disable option but I see that the developer proposed already some solutions, and of course it isn't a big deal.", "Its nice ,but i don't understand the error which occur when i chnged the nam of wifi repeater alng password Failed to create P2P group (reason: internal error) And where can I find this setting? I don't find this one setting", 'I have a rooted phone and whenever I try to use Wi-Fi tethering after enabling the hotspot it gives me "ConnectivityService: neither user has 10216 nor current process has android. permission. TETHER_PRIVILEGED" if anyone could please help me out here that would be nice', 'Great App. If face any problems using this app, please read readme file on GitHub. Especially on "IP Masquerade Mode" and "Tethering hardware acceleration"', "to much back n forth turn this on turn this off ,it cant even read when wifi is on , it's not for me", "Worked fine before, but now prompts 'Internal error' even the device passes SafetyNet CTS. A fix is in need. Edit 1: Not a vendor issue (Pixel 2, Android 10). If I reinstall the app and leave my hotspot settings untouched, it behaves okay, however if I change the name and the password of the repeater, the error occurs. An app side issue as far as I'm concerned. Giving back to 3 stars and a fix is in need. Edit 2: Thanks for the swift response. Hope that a fix is implemented soon.", "After upgraded to Android 10, all problems solved, thx for hard working. //The Ap's name and password change every time when I use repeat mode. Always display 'DIRECT-XX(two random characters)...' and using random psk. This app was my most useful tool.", 'useful app,solve my phone hotspot issue,thanks👍', "Been using this for half a year and it's been a great experience. Had a bit of an issue sometimes with the app suddenly turning off the WiFi-Direct by itself and sometimes, even the wifi on the device. Overall, it's really good. It works without VPN on Android 9.0 but doesn't work on 7.1.", 'Downloaded it on my Android phone so I can connect my iPad to a hotspot. It doesn\'t work. It shows full connection on my iPad but when I go to any app there is no internet connection. When creating the wifi hotspot I get the error: "Neither user 10360 nor current process has Android.permission. TETHER_PRIVILEDGED"', 'Phone A has app and adb root access. I was able to connect to VPN and access the internet on phone A before I installed this app. I installed this app on phone A to share the VPN connection from phone A with phone B. Phone B can connect to WiFi from phone A when phone A is connected to VPN but webpages and apps on phone B will not load. So, I checked phone A and phone A can connect to VPN but once it is connected to VPN, no webpage or app can load. So, my phone A is now broken.', 'Fantastic and Useful! Only one small issue: I cannot start the Repeater feature without first toggling "Wi-Fi Hotspot." I think su isn\'t being called at launch; if you don\'t follow that process. After, it works fine. Sony G8142, Magisk, Android 9', "As far as I'm aware only Samsung WiFi config allows users to change channel. That screenshot showing your app and WiFi channels doesn't appear on my end. App does work though.", "Superb app! Just the app I was looking for. It doesn't require client side application to be installed. It can extend your WiFi while connected to a Wi-Fi on mobile devices.", 'So good. But why i cannot change temporary wifi hotspot password. And it change every time i turn it off and on. It is so annoying👎. But the app works grate 👍👍👍', "Has been working for me for almost a year now - different phones. Allowing VPN running on phone, to run USB tethered (or hot spot) pc's traffic through it. Good product.", 'Developer can you please add data limit on users section for us to control data to tethered users', "It was a great app until the last update. Now can't share my internet connection. I even re+installed it to no avail. I'm going to try to roll back to the previous version", "Repeater is working but can't connect. No Internet access", 'Hey guys, congrats on the outstanding work, I had to edit my previous review because this software is working seemlessly now, good job..', "Best app of its kind. I'm usually skeptical about apps like this but it's the real deal. 5 stars easily.", 'Please add some autation. For example : upon detecting USB, activate tethering and USB monitor. This would really be huge. Thx', "This app let's me get around TMobile hotspot throttling using a VPN. Very nice, thanks.", 'An open source app and worked perfectly on a rooted mobile.', "I don't have words to describe thos app. Really awesome masterpiece. Love it", 'The app I was looking for so long . Great app for replacing your built in hotspot manager on AOSP', 'Bitvpn no bypass internet please check it and fix it new update. Other vpn works good but But Bitvpn why no work', 'Works perfectly, very useful app', 'When I start wifi reapter app show error pls fix this', 'Works like charm.. Thank you 😍', 'Works on rooted s.american S9', 'Wifi tether working fine on rooted device', 'Junk..does not do what it says..u need ut for the hotspot..mine ran out on my phone', 'I have been using this app for quite some time. I emailed before about issues with the app and developer solved it for me.Thanks. Now I would like to request a feature that automatically remember app settings triggers after a reboot.For example mobile data tethering through wifi Hotspot using VPN. There is option for repeater on boot but no option for wlan0 trigger followed by wifi Hotspot trigger', 'the repeater not works for full internet even have root', 'Why always error=13 can I connect to win 10', 'Very good app that works as described. Update: dev says that android 10 fixes the problem described below. My manufacturer is extremely slow with updates, so seems like this bug/feature will be sticking around for a few months (or year). But, when I turn on repeater mode, it changes ssid and password. When I set new SSID and password it turns off repeater. When I turn it back on it randomizes the SSID and password again. How can I get it to stop changing them from what I set?', 'Needs more time to grow. I want to hotspot only the 5GHZ radio, this is allowed for about 20 seconds, I want to be able to do this continuously. I think this is possible.', 'works on my phone however when i use wifi hotspot button on topright menu app shows this error : App not allowed to read or update stored WIFI Ap config ( uid= 10277) is there a solution or it is how it is?'], 'appId': 'be.mygod.vpnhotspot', 'url': 'https://play.google.com/store/apps/details?id=be.mygod.vpnhotspot&hl=en&gl=us'}
