{'title': 'MysteriumVPN: Free VPN', 'description': 'Connect to anything, anywhere.\r\n\r\nMysterium Network is reinventing privacy, starting with the world’s 1st decentralized VPN.\r\n\r\nUsing, multiple layers of encryption and blockchain technology we are building a peer to peer ecosystem where your privacy and access to content are priority.\r\n\r\nTry MysteriumVPN alpha and let us know what you think. Join the conversation on our alpha testing telegram group: https://bit.ly/2tuZmjr\r\n\r\n<b>Mysterium Network:</b>\r\nMysteriumVPN is powered by decentralized VPN infrastructure, built with P2P architecture with focus on highest privacy and anonymity using powerful encryption, reputation mechanisms, and layered protection protocols.\r\n\r\n<b>State-of-the-art Security:</b>\r\nMysteriumVPN secures your data communication channel by utilizing highest-grade AES-256 encryption with SHA384 cryptographic hashing.\r\n\r\n<b>Serious (Decentralized) Privacy:</b>\r\nOffshore privacy protection. Peer-to-peer (P2P) decentralized network on blockchain. Mysterium guarantees a strict no-logs policy, meaning that your activities using the VPN are NOT monitored, recorded, or passed to any 3rd party.\r\n\r\n<b>Available on macOS/Win</b>\r\nMysteriumVPN is also available on desktop. Visit our website to download macOS and Windows application versions.\r\n\r\n<b>Open-Source & Free:</b>\r\nWe have been open source from day one. Everything is transparent. You can check our source code and even contribute. \r\n\r\n<b>Legal:</b>\r\nTerms & Conditions - https://mysterium.network/terms-conditions/\r\n\r\n<b>About Mysterium Network:</b>\r\nWebsite - https://mysterium.network/ \r\nTestNet Metrics - https://testnet.mysterium.network/\r\nWhitepaper - https://mysterium.network/whitepaper.pdf \r\nMedium - https://medium.com/mysterium-network\r\n\r\n<b>Contribute: </b>\r\nBecome a Tester - https://t.me/joinchat/GOCr00z_3SBIPl6DubxxIA \r\nBecome a Node - https://mysterium.network/node-runners/run-test-node/ \r\nGitHub - https://github.com/MysteriumNetwork \r\n\r\n<b>Join the conversation:</b>\r\nTelegram -  https://t.me/Mysterium_Network\r\nReddit - https://www.reddit.com/r/MysteriumNetwork\r\n\r\n<b>Follow us on:</b>\r\nTwitter - https://twitter.com/MysteriumNet\r\nFacebook - https://www.facebook.com/MysteriumNet', 'descriptionHTML': 'Connect to anything, anywhere.<br><br>Mysterium Network is reinventing privacy, starting with the world’s 1st decentralized VPN.<br><br>Using, multiple layers of encryption and blockchain technology we are building a peer to peer ecosystem where your privacy and access to content are priority.<br><br>Try MysteriumVPN alpha and let us know what you think. Join the conversation on our alpha testing telegram group: https://bit.ly/2tuZmjr<br><br><b>Mysterium Network:</b><br>MysteriumVPN is powered by decentralized VPN infrastructure, built with P2P architecture with focus on highest privacy and anonymity using powerful encryption, reputation mechanisms, and layered protection protocols.<br><br><b>State-of-the-art Security:</b><br>MysteriumVPN secures your data communication channel by utilizing highest-grade AES-256 encryption with SHA384 cryptographic hashing.<br><br><b>Serious (Decentralized) Privacy:</b><br>Offshore privacy protection. Peer-to-peer (P2P) decentralized network on blockchain. Mysterium guarantees a strict no-logs policy, meaning that your activities using the VPN are NOT monitored, recorded, or passed to any 3rd party.<br><br><b>Available on macOS/Win</b><br>MysteriumVPN is also available on desktop. Visit our website to download macOS and Windows application versions.<br><br><b>Open-Source &amp; Free:</b><br>We have been open source from day one. Everything is transparent. You can check our source code and even contribute. <br><br><b>Legal:</b><br>Terms &amp; Conditions - https://mysterium.network/terms-conditions/<br><br><b>About Mysterium Network:</b><br>Website - https://mysterium.network/ <br>TestNet Metrics - https://testnet.mysterium.network/<br>Whitepaper - https://mysterium.network/whitepaper.pdf <br>Medium - https://medium.com/mysterium-network<br><br><b>Contribute: </b><br>Become a Tester - https://t.me/joinchat/GOCr00z_3SBIPl6DubxxIA <br>Become a Node - https://mysterium.network/node-runners/run-test-node/ <br>GitHub - https://github.com/MysteriumNetwork <br><br><b>Join the conversation:</b><br>Telegram -  https://t.me/Mysterium_Network<br>Reddit - https://www.reddit.com/r/MysteriumNetwork<br><br><b>Follow us on:</b><br>Twitter - https://twitter.com/MysteriumNet<br>Facebook - https://www.facebook.com/MysteriumNet', 'summary': 'Free decentralized VPN powered by P2P infrastructure & open source', 'summaryHTML': 'Free decentralized VPN powered by P2P infrastructure &amp; open source', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.73, 'ratings': 364, 'reviews': 196, 'histogram': [80, 25, 25, 14, 218], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '20M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'NetSys Inc.', 'developerId': 'NetSys+Inc.', 'developerEmail': 'support@netsys.technology', 'developerWebsite': 'https://mysterium.network/', 'developerAddress': 'PH ARIFA 9th FLOOR, WEST BOULEVARD, SANTA MARIA BUSINESS DISTRICT, PA', 'privacyPolicy': 'https://mysterium.network/privacy/', 'developerInternalID': '5477358562317575210', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/HmjD3ytHGXl4CeCVBjvdthPXgccerinGtXDZFheT2vXL_Cf6-425t8bqI6MROiYT1D8', 'headerImage': 'https://lh3.googleusercontent.com/Tx-oDkX6mLDNaLK-ijGBxA5wnEVNIHOVjgqxtVGCM4NpZLKSD7YiuX205U5mWUxOp1g', 'screenshots': ['https://lh3.googleusercontent.com/sJGRv3pkWxmQUHVhJFJXNKgdD7mNQbKl6idDnPgX697kx7c_Bki2ES7Ni-Qyu15RrDy0', 'https://lh3.googleusercontent.com/OgcvYVhP8NdIy7l4UjjDNZcXA3091Lr2qZVrl6ZfdYW5cNnlH5a6EKuMZG4YGqT0vj8', 'https://lh3.googleusercontent.com/QUskxjHHGhzc1CoQZz7g1_02M3PV0Gr5M2E6ob737YupyfYkcTYsgadiCyootbmhNO8', 'https://lh3.googleusercontent.com/VOHUYm9ROxDX8t8Yev77EyzQwae6x9GFoC5uNwJqKXiNLiv7AuYx_CRIx0lUdNAKxA', 'https://lh3.googleusercontent.com/c8Nclaw4emxJVZ9UVFpMBTelMu9EbWf-KLR56WgjJhvbcullrUh1ac8L1_UkLlkmfIg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 18, 2018', 'updated': 1589442286, 'version': '0.32.0', 'recentChanges': '- Updated feedback screen to allow insert optional email address which can be used to contact consumer.\r\n- Updated node binary to 0.32.0 with some fixes for max price ranges.', 'recentChangesHTML': '- Updated feedback screen to allow insert optional email address which can be used to contact consumer.<br>- Updated node binary to 0.32.0 with some fixes for max price ranges.', 'comments': ["What's happening with Mysterium? It used to be good, but now almost every server is impossible to connect to. I can't understand why apps get worse while releasing new updates.", "I previously rated this app as a 2 star app. However, after the latest update, I'm rating it with 5 stars. It's a lot more stable and the connections are a lot more reliable. Good Job team Mysterium. ----------------------------------------- It was a 5 Star program till about 2 months ago. Recently, I've been experiencing a data transfer freeze after a 2 to 3 minutes of connectivity. It shows connected, but the download freezes and I have to disconnect and reconnect.", "Unable to connect to any nodes for about a month now. Still needs a lot of work won't be cancelling my nord vpn sub anytime soon.", "This app keep messing up on my phone, I'm tired it's not showing where I would like to connect to, I have to uninstall it then install again so it will work again, I'm tired of this please fix it up, thank you in advance.", "Although there are some issues with the app, but I know you're trying to improve it and sure you can.", 'Excellent free vpn.. Better than paid ones.. Needs more functions like connect when system boots and kill switch', 'The Best Everything is great, but the loading part is a bit late Many Thanks', "It's free, you can connect free with the free registration credit accredited to you.", 'Ultra fast vpn ever used...', 'After researching this further and seeing the upcoming changes this is a complex money grab. There is a benefit to the users so I give you 2 stars, this could have been great and the changes you are making are such a shame.', "Fantastic, I don't usually leave reviews but this app has it nailed with simplicity for most users and for more tech savvy running a node gets you some extra pocket money", "It doesn't work for me servers haven't loaded for me and i can't connect.please help me", "It's fast in my experience bit app doesn't offer split tunneling for local traffic and it seems it won't run if you already have another VPN on your system, and if you do work around by installing another VPN after setting this uoy, in my case for fixed ip, which mysterium also don't offer, , it screws up the working of the other vpn even after uninstalling it.", 'It is a great idea ! but I would like the option to choose the dns (keweon, cloudfare, nextdns, etc) Good job guys 👏🏻', 'After last release app works much better. Also I see growing list of nodes to choose from. Totally love it.', "I only see a very, very small drop in speed, very miniscule loss compared to no VPN. For free, it's worth a shot. You might as well stick with it if you needed a VPN. You won't pay for a VPN again if you find you trust this.", "Never established connection! The connect button never worked for me. I tried connecting to different WiFis and even used mobile data but it never connects. I tried several virtual locations and got nothing either. I'm using LG G3 mobile. I even sent a report but still nothing has happened. I would love to try Mysteruim VPN But no luck so far!", 'Although theres a mix of openvpn and wireguard servers.. Connecting and disconnecting is slow and once connected,opening up web pages are also slow. Only 2-3 servers the speed are acceptable. (1 from australia 1 from usa and 1 from u.k) The saving grace is that the privacy policy of no log no data collected is good for the security concious.', 'Thank You!!!!! I LOVE using this free VPN tool Without worrying Gov spying on me. + Run on blockchain 💛💚', 'Installed in a split second. Connected to an IP instantly and stayed connected. Works exactly as a stated it would. Very easy to use interface. This is a professional grade application.Highly recommend this VPN app.', "Functions as expected. Appreciate the graphs to indicate latency to different VPN networks. One suggestion would be if network connectivity is lost to reconnect automatically once it's restored.", "It's my first review ever on Google play usually i don't give reviews but this app is amazing Loved it thank you so much for making a great app", '- asked for vpn permission upon opening which is not common in vpn apps - stuck on logo screen on the first run - after successful connection the ip stuck at updating - tapping menu button and then back button made the app crash - crashing app made other apps to close and showed the android home - there is no random servers selection', 'Its super fast, im impressed, there are a few bugs but its ok. I definitely recommend this over many of the paid VPNs.', 'Great app. Incredible speed and connectivity. Easy to use. Hope to see many more countries on the list in the near future. Way better than the paid VPNs.', "It used to work fine notwithstanding the occasional stopping. But today when I disconnected, I also deleted mysterium vpn's cache & data and restarted it. All the countries on the open vpn list suddenly dissapeared.", "Clean and user-friendly,but most of the routes can't be used in china. hope it wil be changed in next version.", 'Great app Devs replied quickly to a bug waiting for the update to fix it. But works as intended very good start.', "The app is very easy to use and works effectively. I'm located in Canada and had no issues connecting to various servers.", 'Adfree, Userfriendly, Simple, Easy to use, Excellent Connectivity, Free. Got EVERYTHING I Need. Thank you Mysterium for such a nice work.', 'The last update fixed connection issues for me. And the best part about this app is that it’s free!', 'One Of the best VPN I ever used. As a alpha app its awesome but needs more options in the future.', "on android 7.1.1 at the very start android ask me if the application is allowed to create connection request and the 'Ok' button won't work.", "all of openvpn servers are weak(exspt 1 server with 2 anttena)! and wiregard servers not working in iran! please improve your servers power... we don't have free access to internet in iran... improve your services please", 'I am not an IT. person at all,but being a parent it is so wonderful not being marketed,tracked ect,and I can access a server in my Country of choice and watch SPORTS while traveling ie. NHL STANLEY CUP PLAYOFFS Yes I Am Canadian.Great app.Keep up the Great Work!!! Redge.', "I lose a star because it doesn't connect to WiFi at all!", "really awesome i give more then one star....!!! i suggested my friends circle to use MusteriumVPN...Thanks team give a wonderful app for android. happy to download this app. previously using most of the vpn's but am not satisfied but this second am really enjoyed.....", 'not working properly, always gets disconnected automatically.', '"no proposals found", over half of servers are offline.', 'Fast, Adfree, Functional & Simple to use. Loving it.'], 'appId': 'network.mysterium.vpn', 'url': 'https://play.google.com/store/apps/details?id=network.mysterium.vpn&hl=en&gl=us'}
