{'title': 'Score Counter + 🎲', 'description': "Having troubles to find a pen and paper at your fingertips when playing? Score Counter + 🎲 will help you easily keep score in any games, sports or other activities.\r\n\r\n<b>Key features</b>\r\n◇ Easy to use \r\n◇ Great for on the fly score counting\r\n◇ Intuitive and simple design\r\n◇ Quickly adding any amount of points\r\n◇ Suitable for any game. Multiple counters on one screen\r\n◇ You can change the name, step and even color for any counter\r\n◇ Can't find a dice? There are d6, d8, d20, and even d88 :)\r\n◇ Shake to roll\r\n◇ Dark theme will save your eyes in the evening :)\r\n◇ No ads at all. NEVER\r\n◇ Open sourced\r\n\r\nI 💜 board games and appreciate your feedback. I regularly use my app for Carcassonne, Star Realms or even UNO :)\r\n\r\n◇   ◇   ◇   ◇   ◇\r\n\r\nIf you want to drop me a line, I'm happy to hear from you scorekeeper.feedback@gmail.com. If you like this app, please leave a feedback or make a donation– this will help improve it Thank you!\r\n\r\n◇   ◇   ◇   ◇   ◇\r\n\r\nNote for native speakers: if you find any mistakes  in translation - feel free to reach me via email.\r\n\r\n◇   ◇   ◇   ◇   ◇\r\n\r\nGithub – https://github.com/n-apps/ScoreCounter", 'descriptionHTML': 'Having troubles to find a pen and paper at your fingertips when playing? Score Counter + 🎲 will help you easily keep score in any games, sports or other activities.<br><br><b>Key features</b><br>◇ Easy to use <br>◇ Great for on the fly score counting<br>◇ Intuitive and simple design<br>◇ Quickly adding any amount of points<br>◇ Suitable for any game. Multiple counters on one screen<br>◇ You can change the name, step and even color for any counter<br>◇ Can&#39;t find a dice? There are d6, d8, d20, and even d88 :)<br>◇ Shake to roll<br>◇ Dark theme will save your eyes in the evening :)<br>◇ No ads at all. NEVER<br>◇ Open sourced<br><br>I 💜 board games and appreciate your feedback. I regularly use my app for Carcassonne, Star Realms or even UNO :)<br><br>◇   ◇   ◇   ◇   ◇<br><br>If you want to drop me a line, I&#39;m happy to hear from you scorekeeper.feedback@gmail.com. If you like this app, please leave a feedback or make a donation– this will help improve it Thank you!<br><br>◇   ◇   ◇   ◇   ◇<br><br>Note for native speakers: if you find any mistakes  in translation - feel free to reach me via email.<br><br>◇   ◇   ◇   ◇   ◇<br><br>Github – https://github.com/n-apps/ScoreCounter', 'summary': 'Easy to use. Suitable for any games or other activities. No ads.', 'summaryHTML': 'Easy to use. Suitable for any games or other activities. No ads.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.71, 'ratings': 594, 'reviews': 298, 'histogram': [17, 5, 17, 47, 504], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '2.1M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'napps', 'developerId': 'napps', 'developerEmail': 'scorekeeper.feedback@gmail.com', 'developerWebsite': None, 'developerAddress': '60-richchya Zhovtnya St, 23\nKremenchuk Poltava 39601\nUkraine', 'privacyPolicy': 'https://sites.google.com/view/score-counter-privacy-policy/home', 'developerInternalID': '4883243414968750558', 'genre': 'Entertainment', 'genreId': 'ENTERTAINMENT', 'icon': 'https://lh3.googleusercontent.com/N36SbwjxskLjw8COGIg-m6JjQigKVdLcg7c2ndDwugmqsvGpbY_zhowWn757ExXapp4', 'headerImage': 'https://lh3.googleusercontent.com/jD518WFhydloawP2e_YS33bVXgwAm1w7NSGD5_78dLM0hQiHuyEZAXtMMuFLvA_HmLI', 'screenshots': ['https://lh3.googleusercontent.com/99u2taYbegNaJpzMeRleF8o39fcNsqgZyrsK16zE-q0jsBctwyoyCI3JHB-p984HsXw', 'https://lh3.googleusercontent.com/gkWjVmnJN3NT8A-yt-ynisQhIDJB5eGU7nM4I9nEk2xjd6LSrvx1fCTtTSrBTlByrA', 'https://lh3.googleusercontent.com/ZQ2VODaugmz-0Nw7cSlxJ-3tkjEJDKVZ-jG0jMbGVgt7OYSRpBHmJTj6UhL2Yj01VzY'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 11, 2015', 'updated': 1590870784, 'version': '6.0.9', 'recentChanges': 'Romanian translation added. (Thanks, Andrei Iacob).\r\n\r\nHave a nice summer ☀️', 'recentChangesHTML': 'Romanian translation added. (Thanks, Andrei Iacob).<br><br>Have a nice summer ☀️', 'comments': ["I am very pleased it was the thing I needed. It works well.With a good amount of options. It is VERY useful for things like statistics. It's dice isn't nothing special but it is useful aswell. That is all from me thank u for reading.", 'Awesome counter with no ads and nice design. Covers almost 100% of basic needs in this kind of apps. Just as my personal wish, it would be so great to shake phone to reset points (same feature as dice roll shake).', 'Simple and easy to use. I also love the colors and the dark theme option.', 'Amazing app for score keeping! It even has the history of points! Thank you for creating this!!', "Used for King's Cribbage, excellent, thanks", 'Simple to use and just works. Above all, it is open source.', 'This app is almost perfect. I used to use pointedly on my old iphone, and this app most closely resembles it. I just wish there was an option to sort all scores from highest to lowest and vice versa (without manually dragging each one). Having multiple scoreboards saved would also be nice, but overall its a pretty nice app 👍', 'This app is beyond my expectation. I was fooled by how simple and compact it is, but it has saved me a lot of stress and effort in scoring my tests. I have to like open Google Sheets everytime just to input score until I stumbled upon this app, and it does even have scoring history! 10 stars is not enough for this app.', "Great app. Very customizable but still simple and easy to use. Seems to support an unlimited number of players, has a complete history view, and the dice roller is a nice extra. And it's open source!", 'Right on target for the next generation of tally counters, well designed and built on a good day', "Score counter is good i don't use it that much but when I do need to keep score on games it does the job 👍", 'Simple and versatile', 'Very intuitive, but still all the features needed. Quickly adding any amount of points is possible, making it an excellent life counter as well!', "There should be a possibility to prearrange different increases and decreases for a same counter, instead of having to set it up manually evdry time. Doesn't work for me", 'Great and simple to use app for keeping scores in tabletop and card games. Intuitive and takes seconds to set up.', 'Overall nice design. Would be even better if the list can be sorted in ascending / descending order.', 'Good and easy to use', 'Love that the app is super simple to setup and use. Just wish the history could be saved between app restarts.', 'Best score app for board games! Simple but also plenty of customization and useful shortcuts', 'Simple minimalist Customisable Exactly what I wanted', 'Good app, Dev fixed a minor bug and showed he cares.', "I like the interface and large font. This is a good app for scoring 1 or 2 points like in say cribbage. But for scoring rummy or other high points random scores having to click twice doesn't work for me. Option for behavior type would fix that issue, and then I'd use this app", 'Simple and awesome a few suggestions: colors of the cards are a bit legacy; plus button on the top is not ok for a large screen, maybe use swipe from bottom to add a new card; add slide from top or bottom animation on counter change, because sometimes you can miss click on a card (plus instead of minus and vice versa), and animation will allow you to see that', "This app's interface is clean and simple. It accomplishes it's objectives well. I only wish I could roll multiple dice at once. But free, add free, and does not ask for excessive permissions, which is great.", "If you want a simple, consider score tracker, this is it. I've tried a few others and they add unnecessary functions, require names be set etc. This app shortcuts a lot of unnecessary info, great for on the fly score counting", 'Very nice score counter. Does the job without the unnecessary bloat. Battery drain is minimal compared to other counters I have tried. It has a nice, simple user interface with intuitive features. Highly recommend.', 'Great app! I use this for score board games, can you add an option to save a list of friends so when I press the + I can choose either a random player or from the list of saved ones? Great UI!', "Very easy to use. Let's you provide a reset value. Ideal for D&D hit points, spell slots, etc. (Not for tracking coins, though.)", 'Really good app. Simple enough to be able to count whatever you want, excercise, board games etc. No ads. Dice roll is handy and is customisable.', "This app is amazing. Use it for scoring pretty much anything. I use it for Cornhole and soccer and it's been invaluable. Well done.", 'the best one in store! simple! quite features! dark mode! nice asthetic! loved it! and ad-free!!!!', "very clean design, easy to use, and versatile. i normally don't rate apps but this one is very well thought out!", 'Does the job, easy to use.', 'Exactly what i needed. good job!', 'Does what it says. Easy to use. Ad free. Large numbers. Looks great!', 'Simple and intuitive. Ad free as well. Highly recommended', 'Well these have cool features! But it would be better with more features!', "simple, well featured, realtively seamless interface, best of the apps I've tried.", "I use this for dice scoring. It's simple, no permissions either. Fantastic!", "The developer should make it so the font is changeable but other than that it's ok"], 'appId': 'ua.napps.scorekeeper', 'url': 'https://play.google.com/store/apps/details?id=ua.napps.scorekeeper&hl=en&gl=us'}
