{'title': 'TimberX Music Player', 'description': 'Material theme music player that works all form factors and uses latest tools.\r\n\r\nFeatures - \r\n- Material theme design\r\n- Browse songs, albums, artists, genres and playlists\r\n- Lyrics \r\n- Device folders\r\n- LastFM artist images\r\n- Create and edit playlists\r\n\r\nTimberX works across all devices including\r\n\r\n- Phones\r\n- Android Wear\r\n- Android Auto\r\n- Chromecast and other cast devices\r\n- Google Assistant\r\n\r\nTimberX is open source and available at https://github.com/naman14/TimberX', 'descriptionHTML': 'Material theme music player that works all form factors and uses latest tools.<br><br>Features - <br>- Material theme design<br>- Browse songs, albums, artists, genres and playlists<br>- Lyrics <br>- Device folders<br>- LastFM artist images<br>- Create and edit playlists<br><br>TimberX works across all devices including<br><br>- Phones<br>- Android Wear<br>- Android Auto<br>- Chromecast and other cast devices<br>- Google Assistant<br><br>TimberX is open source and available at https://github.com/naman14/TimberX', 'summary': 'Fully featured material theme music player that works across all form factors', 'summaryHTML': 'Fully featured material theme music player that works across all form factors', 'installs': '1,000+', 'minInstalls': 1000, 'score': 3.07, 'ratings': 206, 'reviews': 159, 'histogram': [45, 24, 45, 51, 39], 'price': 0.99, 'free': False, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '6.3M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Naman Dwivedi', 'developerId': 'Naman+Dwivedi', 'developerEmail': 'namandwivedi14@gmail.com', 'developerWebsite': None, 'developerAddress': 'EPT-39\nSAROJINI NAGAR\nNEW DELHI 110023\nINDIA', 'privacyPolicy': 'https://namand.in/Timber/privacy_policy.html', 'developerInternalID': '8333546714167232940', 'genre': 'Music & Audio', 'genreId': 'MUSIC_AND_AUDIO', 'icon': 'https://lh3.googleusercontent.com/fe2R7dG26bUa7ZfLsM02Qp6HABZvsUDy2NbEqLm9VgzhNv8HPnwYmyFrYLunJnwspCZY', 'headerImage': 'https://lh3.googleusercontent.com/GZRbvVNSve5r8Tl2McIsU7R0dK04Gj6IF-8G29CFSfV4hnL3gFbySXEgr34X-UcODg', 'screenshots': ['https://lh3.googleusercontent.com/n5QPZyJBm__SEES3CAPUtbgzCxWDWX4w17NkWsYZCKWt6tg7iJsPCvTr33Y2njOYMQ', 'https://lh3.googleusercontent.com/QTjxtY3Yoso2A1gS8-MA13FkO5ljKe6Dw3Bl2GtNLbn7yPkmmDUu3egvhTzMI78n6i0', 'https://lh3.googleusercontent.com/WVIVhF6sjSSInoCLXpY00S-LTQFmMunbuh_WgWti4_87dIvmoERM4X5IACJQvaK_7dY', 'https://lh3.googleusercontent.com/i1Gv_JlN5GIPW3pvBCvWnoFZ_Lo-ao6s41CY99VZPA62SdKxUd6EhHGlATkye4WTRNE', 'https://lh3.googleusercontent.com/dzYTlT7tws3FmPR-DznksCCXNVAWwNAeU1d2OHJQEwVDD1DGd9LiMK9y2Ya9wrgSRA4j'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Feb 1, 2019', 'updated': 1549712142, 'version': '1.5', 'recentChanges': 'Added Dark and Black themes\r\nAdded option to sort albums\r\nAdded option to set default page\r\nAdded option to toggle Last.fm images\r\nFixed cast not working', 'recentChangesHTML': 'Added Dark and Black themes<br>Added option to sort albums<br>Added option to set default page<br>Added option to toggle Last.fm images<br>Fixed cast not working', 'comments': ["To describe this app in it's current state I would say it's really got potential but it isnt quite there yet. The look and design of the app is incredible. The amount of band photos - even for very obsucre bands is very impressive. The downfalls are: Not pausing when other media plays, no recently added section and no option to turn off the album cover on the lock screen when music is playing. The ability to specify the genre of songs/albums and to be able to change the metadata would be amazing.", 'Definitely a potential player in the game. It\'s just started and it\'s already my most used player. Obviously there\'s a lot of things to be worked around. More features, more "basic" functionalities like ascending or descending sortings of songs etc. But that\'s the beauty of the player, that it has a lot of potential. All the best to the Dev!', "Has potential, but there are too many shortfalls and not enough features to justify making it a paid app at this point. Sorting albums is temperamental, the now playing screen cuts off the sides of the album art on tall displays, and the player doesn't automatically pause when other media starts playing. Feels like a beta version. Needs a lot more work to be worth paying for, and although 89p isn't much, it's hard to stomach when there are plenty of better players out there.", "TimberX gets 4 stars off appearance alone, because it looks far better than ANY other android music player I've used, but it currently has some MAJOR issues. Often, the first second of a song is just skipped. There is not ONE THING about the shuffle feature that works correctly. Music doesn't pause when watching videos. Album art isn't shown properly, it's being cropped horizontally. Sometimes, the notification bar stays on screen even if no music is playing and the app has been closed.", "It's a gorgeous app, but there's a couple underlying issues. My main one is the player just randomly stops playing and closes. Thats incredibly frustrating when I'm driving and trying to listen to my playlists, the other issue is also regarding playlists. Twice I've had them completely disappear. It hasn't been updated in a few months which normally isn't a problem but an app that's new and still has some bugs should be updated more. Honestly it seems like a cash grab.", "clean and smooth interface but one major thing I didn't like at all is the way of showing the album art on the now playing screen because I don't bother about the size of the album art but the player needs to show the full album art without cutting up and down as shown on the play store preview thumbnail. second is the dark mode (not that much important right now bcs there are so many things to improve.)", 'few suggestions for future updates (would give 3 stars only at the moment) 1. allow me to select which tabs i want to see (who uses genre and artist tab anyway) 2. more accent color options 3. filter out folders and audio files based on length (i dont want to see ringtone that are 1 min in length at max in my songs list) 4. pill shape below the active tab should be tapered at the ends.', "It's a good UI but when I search an album and i go into one result and come back to go into another, it's gone already. Please find a way to keep all the results even after opening one of them. Edit: This new update has slowed the searches. Also the songs don't load most of the time, I have to change the song and go back to it again for it to load. i wasted my 💰 money", "it's so nice when devs consider user reviews and update their app as fast as they can. Changing my review and ratings for that purpose too. This app is now great in looks and animation. There are still few features missing that I am sure developers will add and might be working on, as the updates I will update my review too. Now this app worth the price I think.", "A Great Start! the app's md theme is beautiful, the status bar notification is great, but since the app is just developing , it has lots of bugs, for eg - the next and the back buttons dont work, the 3 dot hamburger option doesnt work, however those can be solved in future updates . Expecting really great things from you , bhai!", "I have Google Home Mini. So, when I saw the cast button I was stoked ,but alas, it didn't play through home mini. The high point of this app is its consistent font with Google apps which I like . I would be glad if anything could be done about the functionality of vast button.", "Good concept, with a lot of potential. Thanks to XDA to show me this app. For starters, a different font would be nice. Then three-dot menu at the playing UI doesn't work. In future, if you could bring in metadata editor where on one touch all songs' metadata are updated. Looking forward to this app.", "this app looks good on the surface but it's got a lot of issues 1 lyrics to all songs are not available 2 doesn't pause on launching videos 3 many times the app doesn't show the songs list on starting 4 shuffling repeats the same 3 or 4 songs 5 can't scroll and look for songs first letter wise 6 adding songs in a created playlist is a pain in the ass since we have to put all the songs individually there are these and many more and on top of that it's paid🙄 hope the developer reads this", 'Good... not polished... it has some bugs but still the simple design is very cool... can you make navigation bar white while in the app like on google phone app? it will give a complete feel. and is this designed for 18:9 devices? because in my 16:9 device only a smal portion of the album art is showing.', "The application needs to be update a lot. There are many bugs, just after installation within 5 min I have found a lot. If this app gets updated I'm sure that this app will be the best of its kind. So I can't rate it with 5 stars until the app gets updated.", 'Currently it is very minimalistic, hope useful features and customisation options get added. All the best developer! On Nokia 7 Plus, on Pie, the navigation buttons are not visible. Also, music keeps playing even when some other app starts playing.', 'I bought it especially for the lyrics feature, which is below par. And lyrics of bollywood songs looks like a distant dream. The albums are not sort alphabetically. And other missing features have been cited by others. I hope you fix this.', "Good work, but needs some refining,Option to force add album art evrn over pre existing art, Better equaliser thats pretty much it Theres no scroll bar, is that on purpose? Well done man, you're listening to the community feedback", "cannot go to the previous song with the head phone buttons. there is no 'add to the queue ' button .cannot change the order of the songs in the playlist section", "Won't even open any more. This shouldn't have been released like this, it's got so much work to be done and is riddled with bugs. Has potential but developers aren't updating and seem not bothered so I am uninstalling", 'Crashes when deleting a file from the playlist.', "There's potential and I like it, but a scrolling feature is necessary, so finding a song is easier, other than that it's amazing.", 'Needs some work but a good intial release. like the three dot menu when we play a song doesnt work. Hopefully you will make this player perfect overtime. good job!', 'Really nice and simple. Good looking too. Shame it crops cover art on the playing screen, guess it must be designed for taller screens than mine (Nokia 5).', 'feature request : dark mode, playing speed control for podcasts, sleep timer. make UI more beautiful and fluid , i just bought it for its lyrics feature, phonograph is still my #1 offline music player.', "this app has a great interface, but it need much more. there's no favorites button and and add to favorites feature. also its not stop playing while i get a call or play in another app like YouTube", 'The only thing keeping me from loving this app is that it does not respect the album artist tag, so my artist list is full of multiple copies of the same album in many cases.', 'A really good music player. One of the issue that I found was that the "Play next" seems to be not working. Hope you will take a look on this.', 'great design but there is a bug: 1. the on screen navigation is hidden while using this app. also, please add a support for report an issue like feature on this app. BTW amazing app!', 'Love the simplicity of the player. Hope the dev continues to work on it, refine the experience even further and add more features.', 'I appreciate this great effort by the dev. Still I find a few features missing like ability to blacklist certain folders, equalizer, metadata editor, swipe actions to control music etc.', 'Feature list: - Swipe Gestures for next and previous - Now Playing play list queue - may be EQ setting - Tag Editor otherwise we are just paying for the negative space the app has. anyways design is Good', 'The app is really great and does everything a music player needs to do. It also uses the material theme really well. The only suggestion is it add more settings for the layout and theme.', 'In principle it would be a great tool. However, the folder view does not work. I give you five stars when that is fixed.', "Definitely a great app but there are certain things that developer didn't get right like the music keeps playing if I am playing any video with youtube and there is no option of sorting the tracks", "This app doesn't pause automatically when you play a youtube video or any other music player.. it's irritating that you have to always go to notifications and pause it manually. Please fix this🙏🏻🙏🏻 Otherwise loved the UI and dark theme🤘🏻", 'The overall app look is good but too many glitches, while jumping through playlist to folder it automatically shuts down. I have uninstalled it Please look into m looking forward for the fixes 😊', "app is good but I'm using Android 9 and it's not compatible with the size of my device i can't use it on gull screen, if i tried to do that my overlay button disappears.", 'very few settings or optimisations available. all the audio files will be into playlist like call recordinds, ringtones there is no control on this, like excluding folder.', "Everything good and satisfied, lyrics aren't found in most of the songs so please update the source of it."], 'appId': 'com.naman14.timberx', 'url': 'https://play.google.com/store/apps/details?id=com.naman14.timberx&hl=en&gl=us'}
