{'title': 'UT Utilities', 'description': "UT Utilities is a suite of tools for University of Texas at Austin students who want to easily view things like their Class Listing, Bevo Bucks transactions, Data Usage, and more in a native Android interface.  \r\n\r\nCurrently supported are:\r\n\r\nClass Listing (schedule)\r\n  --View detailed information about each class\r\n  --Export your schedule to Google Calendar (4.0+)\r\n  --Locate a class easily on a map with the press of a button\r\n\r\nBevo Bucks balance and transactions\r\nDinein Dollars balance and transactions\r\n\r\nCampus map\r\n  --Building search (both by building name and 3-letter code)\r\n  --Campus bus routes with upcoming times for each stop\r\n\r\nResnet/PNA bandwidth usage graph (last 24 hours)\r\n\r\nMenus\r\n  --Dining hours\r\n  --Tap an item for its nutrition information\r\n\r\nExam Schedule\r\n\xa0 --Locate an exam easily on the campus map\r\n\r\nIf you notice strange data appearing in the app, send me an email! I'd love to troubleshoot with you so that your issue doesn't happen to anyone else.\r\n\r\nFeel free to also email me at Chris_Roberts@utexas.edu for any other meaningful feedback!\r\n\r\nAlso, this app is quite unofficial, so don't expect any support whatsoever from UT itself.\r\n\r\nUT Utilities also happens to be open source! If any intrepid developers would like to see the nasty mess that is my codebase they can check it out at https://github.com/NasaGeek/utexas-utilities\r\n\r\nYay UT! :D", 'descriptionHTML': 'UT Utilities is a suite of tools for University of Texas at Austin students who want to easily view things like their Class Listing, Bevo Bucks transactions, Data Usage, and more in a native Android interface.  <br><br>Currently supported are:<br><br>Class Listing (schedule)<br>  --View detailed information about each class<br>  --Export your schedule to Google Calendar (4.0+)<br>  --Locate a class easily on a map with the press of a button<br><br>Bevo Bucks balance and transactions<br>Dinein Dollars balance and transactions<br><br>Campus map<br>  --Building search (both by building name and 3-letter code)<br>  --Campus bus routes with upcoming times for each stop<br><br>Resnet/PNA bandwidth usage graph (last 24 hours)<br><br>Menus<br>  --Dining hours<br>  --Tap an item for its nutrition information<br><br>Exam Schedule<br>\xa0 --Locate an exam easily on the campus map<br><br>If you notice strange data appearing in the app, send me an email! I&#39;d love to troubleshoot with you so that your issue doesn&#39;t happen to anyone else.<br><br>Feel free to also email me at Chris_Roberts@utexas.edu for any other meaningful feedback!<br><br>Also, this app is quite unofficial, so don&#39;t expect any support whatsoever from UT itself.<br><br>UT Utilities also happens to be open source! If any intrepid developers would like to see the nasty mess that is my codebase they can check it out at https://github.com/NasaGeek/utexas-utilities<br><br>Yay UT! :D', 'summary': 'Unofficial app for UT students', 'summaryHTML': 'Unofficial app for UT students', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.6, 'ratings': 487, 'reviews': 207, 'histogram': [14, 14, 24, 43, 389], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Chris Roberts', 'developerId': 'Chris+Roberts', 'developerEmail': 'Chris_Roberts@utexas.edu', 'developerWebsite': 'https://github.com/NasaGeek/utexas-utilities', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5492192114477413439', 'genre': 'Education', 'genreId': 'EDUCATION', 'icon': 'https://lh3.googleusercontent.com/532Uj7nj-jWZmtZXm0bELmjyT6Eym8o6_wkoqR64R4FJUPmG3DSG2x811IseJ4nwv5LK', 'headerImage': 'https://lh3.googleusercontent.com/WP0IrK0a-xw-ZwWvRr5BDWPS0K5i2azORbVWytFA49Km4LbdQm_IJx-CFdGFwrbYt84', 'screenshots': ['https://lh3.googleusercontent.com/LUQnIMMFtxUddkR8cIEaWxDqAAZrII-NVqggx2v9TGLjILhLA1qFCgwKYooIJr9Zhw', 'https://lh3.googleusercontent.com/LCX6k0onx8JyHJUrUq8A4nkSNfy9EEHrGJezRwkYegkuKWtBKWoz5ilTMwblpDpAQ1M', 'https://lh3.googleusercontent.com/g4v62gGMMvCtB6D_g9pUDVwIEC0Mwz_SwUK_4KxEcAKREsCQ-mf3-EZlf3LYSLjor98', 'https://lh3.googleusercontent.com/5Q4aTRSpHKjPytxJtkLuNznA2Q7kKzsJhICQTlA0vgp9v2_IqK_CVI6QnfGrBzmFXQ', 'https://lh3.googleusercontent.com/S1rtR7BB_EHsOkCHaMhQ0cqtMK4x3KhaOy982cAubbxkkBxDW-O9r6SOqTSM4y9p0Q', 'https://lh3.googleusercontent.com/ji1Y1bw1Jro4_KVWO37empsjjlcYOXUmL9AN-3D5rf4ozA1SD1dKw6uX03y76S1vFXxI'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'May 9, 2012', 'updated': 1541232478, 'version': 'Varies with device', 'recentChanges': '2.1.0\r\n-Update campus buildings and bus routes/stops\r\n-Fix bus stop arrival time fetching\r\n-Fix crash when exporting schedule to google calendar\r\n\r\n2.0.2\r\n-Fix Bandwidth login\r\n-Update dining location hours\r\n\r\n-Bus routes will be fixed one day...\r\n\r\n2.0.1\r\n-Fix some crashes\r\n-Fix 505 error\r\n-Remove garage support', 'recentChangesHTML': '2.1.0<br>-Update campus buildings and bus routes/stops<br>-Fix bus stop arrival time fetching<br>-Fix crash when exporting schedule to google calendar<br><br>2.0.2<br>-Fix Bandwidth login<br>-Update dining location hours<br><br>-Bus routes will be fixed one day...<br><br>2.0.1<br>-Fix some crashes<br>-Fix 505 error<br>-Remove garage support', 'comments': ["This is by far the most useful college app I have on my phone! Thank you SO much for creating this, Mr. Roberts - you've saved my butt from constantly having to log in to the UT site to check my schedule, and I can easily monitor the amount of Dine-In Dollars and Bevo Bucks at the push of a button. No frills, no fluff, just good, clear information. Honestly an incredible lifesaver for this first semester and I'm 100% sure for the rest of my time at college as well. :)", "Does what it says it's", 'the SAC (student activity center) has been renamed to WCP (William c powers), WRW building is no more, (aerospace and engineering mechanics has been moved to the new ASE building {previously named NOA}) and bevo bucks has been rebranded to bevopay. But these are minor outdated stuff. Must have app for UT students!', '(FORT2)', "The app works, except for the fact that it crashed every time I try to export my classes to my Google calendar. If this is fixed, it's an easy 5 star.", "Thank you so much for this app! UT's official one doesn't even come close in functionality.", 'Phenomenal app. Far better than the official UT app. It covers just about everything I need and more.', "I'm glad that all the features work again. Thanks!", 'UPDATE: 505 error fixed, thanks Chris for being so responsive and looking into this problem!  OLDER: Keep getting an error message when I try to update the app. Note 5 running Lollipop if that helps.', "App doesn't work on Samsung S8 Oreo beta. Can view map, but can't see schedule or bevo bucks. Will change to five stars when fixed.", "Tried to restart the app, relog, doesn't seem to work", 'Just discovered this app, its much more useful than the official one. Unfortunately, I can\'t seem to log in to the "data usage" function.', "look, i love this app and recommend it to everyone i know with an Android at UT. update broke it and now it says i am not registered for the semester. pls help me i don't know my schedule yet", "I have been using this app since freshman year and I love it!! It was so useful back when blackboard was a thing, but it still has lots of useful stuff especially schedule and bandwidth. It's still a must have if you live on campus, but I unfortunately don't anymore ):", 'This app was extremely useful, especially when I lived in the dorms and wanted to see my dine-in dollar balance. I also like seeing my classes on there!', "There should be an option to customize the schedule. It's honestly the best part of the app, but I'd use it more if I could add other stuff to it. Keep what you got, but make a customizable schedule tab.", "It may crash sometimes and whatever, but it's definitely an amazing app.", 'The app does not work for samsung 9. Please fix and I will update the \nrating to five stars.', "Bus routes don't show times anymore. They used to but not since one of the recent updates", "It would be awesome if the bus routes were updated with the new metrobus routes. The speedway and 21st stop isn't there anymore...", 'User friendly.  Functions nicely.', 'The app is working fantastic now, other than It is not correctly exporting to Google Calendar.', 'I have used this app for years and it has never failed me. This is a must have for all incoming students!', 'Man this app is super convenient, but you should probably add the new engineering building as a location.', "Is it okay/safe to login with my UT ID? Or no because it's not an official university app? Thanks.", 'Awesome app to have', 'Bus schedule no longer shows for at least 642 and 640 routes.', 'Should have named it UTilities :P', 'Great app for UT students before UT ever made an official app... and all for free!', 'Must have UT app', 'So helpful when I was in undergrad!!!', "The new update fixed all the bugs! It works amazing now, must-have app for anyone attending The University of Texas at Austin. It shows all your transactions, classes, and bandwidth usage on separate tabs, and it's easy to use and has the best map of the campus that I've seen. Thanks for the fix, I love this app.", 'finally an app for Android and it has a beautiful view of your schedule and dine in dollars transactions. Really well made, use it everday. Thank you for fixing glitches!', "The most recent update has sped up the app so much. It's another and cleaner too. Thanks so much for your hard work.", "This app won't even open anymore on my 6P, needs a fix", "It's great to use at the start of the semester and even throughout the year! I noticed some glitches, though. It says I'm not currently enrolled this semester on my schedule unless I restart the app every time.  Also, I can never access the courses button. It's always grayed out. If these get fixed, I'll definitely give this app 5 stars.", "Nearly everything about this app is perfect for me except for the schedule tab. Sometimes it works perfectly and sometimes it tells me that i am not enrolled for this semester. I have no been able to find any correlation between the network I'm on or restarting the app or even my phone to fix the problem, it just occurs randomly.", "This app has never worked right. Whether it's only kidding some of the features or crashing entire, it's never worked the way it's supposed to. And report the problems all you want, they won't fix it. Good luck", "For the last couple of weeks I've been unable to access the menu and bandwidth features. Otherwise, a really great and helpful app.", 'Hi, AT&T galaxy S6 is not installing the latest update. It down loads, but never installs. Just letting you know, love the app.'], 'appId': 'com.nasageek.utexasutilities', 'url': 'https://play.google.com/store/apps/details?id=com.nasageek.utexasutilities&hl=en&gl=us'}
