{'title': 'Sia', 'description': "This app serves as an Android client for the decentralized cloud storage platform Sia. With it, you can send and receive Siacoin with a wallet that you control, and store your files on the Sia network.\r\n\r\nSo why use Sia?\r\n\r\n• Completely Private - Sia encrypts and distributes your files across a decentralized network. You control your private encryption keys and you own your data. No outside company or third party can access or control your files, unlike traditional cloud storage providers.\r\n\r\n• Far More Affordable - On average, Sia's decentralized cloud storage costs 80% less than incumbent cloud storage providers. Storing 1TB of files on Sia costs about $2 per month, compared with $10 on Google Drive.\r\n\r\n• Highly Redundant - Sia distributes and stores redundant file segments on nodes across the globe, eliminating any single point of failure and ensuring uptime that rivals traditional cloud storage providers.\r\n\r\n• Open Source - Sia’s software is completely open source, with contributions from leading software engineers and a thriving community of developers building innovative applications on the Sia API.\r\n\r\n• Marketplace On Blockchain - Using the Sia blockchain, Sia creates a decentralized storage marketplace in which hosts compete for your business, which leads to the lowest possible prices. Renters pay using Siacoin, which can also be mined and traded.\r\n\r\nSource code: https://github.com/NickvanDyke/Sia-Android\r\n\r\nSia for Android is developed independently by me, and is not affiliated with Nebulous Labs.", 'descriptionHTML': 'This app serves as an Android client for the decentralized cloud storage platform Sia. With it, you can send and receive Siacoin with a wallet that you control, and store your files on the Sia network.<br><br>So why use Sia?<br><br>• Completely Private - Sia encrypts and distributes your files across a decentralized network. You control your private encryption keys and you own your data. No outside company or third party can access or control your files, unlike traditional cloud storage providers.<br><br>• Far More Affordable - On average, Sia&#39;s decentralized cloud storage costs 80% less than incumbent cloud storage providers. Storing 1TB of files on Sia costs about $2 per month, compared with $10 on Google Drive.<br><br>• Highly Redundant - Sia distributes and stores redundant file segments on nodes across the globe, eliminating any single point of failure and ensuring uptime that rivals traditional cloud storage providers.<br><br>• Open Source - Sia’s software is completely open source, with contributions from leading software engineers and a thriving community of developers building innovative applications on the Sia API.<br><br>• Marketplace On Blockchain - Using the Sia blockchain, Sia creates a decentralized storage marketplace in which hosts compete for your business, which leads to the lowest possible prices. Renters pay using Siacoin, which can also be mined and traded.<br><br>Source code: https://github.com/NickvanDyke/Sia-Android<br><br>Sia for Android is developed independently by me, and is not affiliated with Nebulous Labs.', 'summary': 'Android client for the decentralized cloud storage platform Sia', 'summaryHTML': 'Android client for the decentralized cloud storage platform Sia', 'installs': '5,000+', 'minInstalls': 5000, 'score': 3.72, 'ratings': 105, 'reviews': 61, 'histogram': [21, 6, 11, 8, 57], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '16M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Nick van Dyke', 'developerId': 'Nick+van+Dyke', 'developerEmail': 'siamobiledev@gmail.com', 'developerWebsite': None, 'developerAddress': 'Nicholas van Dyke\n439 East Campus Mall\nMadison, WI 53703', 'privacyPolicy': 'https://sites.google.com/view/sia-mobile-privacy-policy', 'developerInternalID': '5318656839810630251', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/feEH1LChBqHzdMTxx9s9NuLbMhFGVHWPoZBHzNgOXXcU-Ky85drzL1LG7uNqYs50E5k', 'headerImage': 'https://lh3.googleusercontent.com/CmpjSjQ6ef3iE4V-D6mNXrLwHAMITaOm8y3Dee24BrAviwfkjP4WzZ6hmVj816bdAVzv', 'screenshots': ['https://lh3.googleusercontent.com/J64zlWbzFUj-6Qli9HntQkPLUtH-2xdWWR2m_f_GQV2kumjIooILgGS6HquvVURMuyWN', 'https://lh3.googleusercontent.com/vH4iLQZJj3N1cXMz_0t-pGXMj9k6ZZaoLJn5ykLlX2bJ1kqyRZDlucSPyr-kwi1mGew', 'https://lh3.googleusercontent.com/78EvJOQAHEh44JoKlYgjOfaf3e6gR7V7gZa7zYHZjZpISkof2YhPF1T7WoWdPiq8ZyXe', 'https://lh3.googleusercontent.com/k4v7r2zrj9FNahjGzl5vK93O91ODPrQIt--OMBDiwVW-wVgy5QJjoCMhzt88zp6GmQ', 'https://lh3.googleusercontent.com/KwVsLbhCq_LTBA8P3JH9UgA1Ig9C5H_lgvMjjomj-qhij5w9iua2yHhbh_lTVVfnVHE'], 'video': 'https://www.youtube.com/embed/B4YGpWxyn6Y?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/B4YGpWxyn6Y/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Feb 2, 2018', 'updated': 1543954729, 'version': '0.3.10', 'recentChanges': 'Fix API password bug', 'recentChangesHTML': 'Fix API password bug', 'comments': ["I really love the Sia project. I even mine my own SiaCoin. However, the problem I'm having is the app crashes any time I want to retrieve files that I have uploaded. My phone is the Note 10+ 5G. I hope you can update the app soon so I can give it a 5 star!", "Okay look I've already sent my siacoin to this wallet before it synced up.. once the app finish syncing it stopped going to the wallet when I open the app it just goes to a screen telling me to subscribe sign up now for a free 7-Day trial and it will let me do absolutely nothing else this is completely ridiculous I need access to my funds immediately without having to pay a subscription you need to tell me how to bypass this feature so I can access my wallet without subscribing", 'This app is amazing! Sia is the future where normal people can create cloud storage for others and get paid! Definitely beats paying big money to big companies like Google for storage!', 'Very well apps.. But i just doing transfer my siacoin to another wallet, it taking to longtime.. How many hours normally the siacoin transfer process?', 'The app is ok. They really need to work on the syncing speed. It took 5 days to upload my coins.', "Wallet takes forever to sync! I downloaded last night and still synching! I transferred my coins, but fear that I may have lost them because I still don't see them in the Wallet! If the coins show up, I'm not sure of what else I may encounter trying to remove them. PLEASE DO NOT DOWNLOAD THIS APP!!!!", 'The app works fine, yes it may take a little time to sync but I\'ve found most blockchains do and it is only early days. However I tried to send some SC but I keep getting a msg "invalid addres"?. The address I am sending to is bittrex exchange and I copied and pasted it?', 'Long sync time (over one week with undependable internet connection), and had to subscribe to the cloud service to activate wallet...that done wallet works fine. Simple and clean user interface. Traded for my sia via CoinSwitchlPRO with no kyc or problem. GO SIA!', 'Been two day trying to sync only at 74%. The developer made the background light green with a white font. Very difficult to read in many light conditions.', "Once it's fully synced. Can i add funds? If i want to retrieve in different system after deleting should it be fully synced again", 'Why is this asking me to subscribe 99c a month now before I can even access my coins? How to I send my sia out of this? The stupid subscribe window appears in launch and cannot close it.', "Ther a bug in gui sidebar i can't see a thing when i tick dark mode ,it white making clicking anything impossible. But if i untick dark mode it all white on side bar", 'Almost impossible to create a wallet. Cant create a password. Any action results in API password error', 'Synchronization took long time to be done.', "First think first a transfer was made without my consent, it might not be much 49.9 SC but why woupd I lose them ? Then after a few days I couldn't access my wallet unless I accept the subscrition of £0.79 monthly ? why why why . Well let me tell you something Mr. Developer . People needs a wallet where they can store their funds and have access to it at anytime they want ! I had to get the subscription in order to access my funds, transfer all my funds to my favourite exchange account BINANCE then cancel the subscription and of course following uninstalling this app . Hate it !   No Mr Developer , I did not authorized that transfer, was made miraculous by your app . And no is not even fair to block the access to my funds unless I buy your subscription. Just a waste of my time .", "its take a long time like 2 days but after that it's much helpful A++++", 'This should be free', 'Garbage app. Trash app of sia coin.', "Can't send sia out", 'This Works.', 'Great App!', "I couldn't access to my siacoins. I emailed several times but nobody \nanswered. Where are my coins? Please someone help me. How could i create a \nwallet from my existing seeds?", 'Why does this app keep saying that the sai node isnt running ?', 'Application is taking too much to sync.', 'super usefull for me', 'Excellent. Found it difficult to create a wallet for an existing seed, \ncontacted the developer, and had the problem resolved in a quick and polite \nfashion.', 'App for free was working till i pay for app all my coin is missing and app \nsaid for pass 2 week sia note is not running', "I cannot use this app, until I subscribe. That's trebile. You are right \nsomehow. But my suggestion is to include a fee of 1% in transactions \nbecause, now I have 20 USD on sia coin, and in 20 months I lose all on your \nplan. It's not much 1 dolar pro month to be understood. Also, I think your \napp is not compile with GDBR. I'm from Europe.", "The app is free to download, but doesn't function without an active \nsubscription. Dev: If a subscription isn't necessary for usage, then the \nsubscription pop-up which covers the entire window should have a cancel \nbutton.", "Great app! I'm glad to see a sia wallet. Keep up the good work!", 'nice wallet..easy to understand', 'Finally, outstanding job!', 'Very Impressive I expected a reply by dev for a question to be the next day but got to me same night App works great I already subscribed SIACOiN and  there decentralized cloud is it with Guys Like The Dev leading the way saying Screw Dropbox and google drive their outrageous prices', 'This app is great and the developer answers your questions very fast and helped me recover 100k sia I had stuck in another wallet. If you own sia this app is the go to for sure!!', "Syncing does take a very long time, easy to use. Keeps my SC on ice, thanks.  In response to your question Nick, place a sell button that route you to an exchange, you can even use your own affiliate link to maximize profit 😉 thank me later, you're welcome.", 'Thank you! I will subscribe when I get the message again!', 'App does everything I need it to do. Great job on the App Mr. Developer', 'So far so good...', 'Excellent app and wallet!! Looking forward to the new developments', 'Is this the newer app? Better than the other one?..'], 'appId': 'com.vandyke.sia', 'url': 'https://play.google.com/store/apps/details?id=com.vandyke.sia&hl=en&gl=us'}
