{'title': '/u/app', 'description': "Welcome to danger/u/, textboard of the future!\r\nThis app provides you a fully functional version of Jill's phone, with all it's features you know and love from the game.\r\nAt it's core is danger/u/, a fully functional version of the textboard for the denizens of Glitch City. \r\nYou can listen to soundtracks from the jukebox, and read the latest news about the universe in the Augmented Eye.\r\nThe looks of the app can be altered using Nanocamo, where you can select your favorite theme. \r\nThe blog of famous cyberpunk superstar, Kira Miki, is also available, where she will post her life and hot-and-happenings around Glitch City.", 'descriptionHTML': 'Welcome to danger/u/, textboard of the future!<br>This app provides you a fully functional version of Jill&#39;s phone, with all it&#39;s features you know and love from the game.<br>At it&#39;s core is danger/u/, a fully functional version of the textboard for the denizens of Glitch City. <br>You can listen to soundtracks from the jukebox, and read the latest news about the universe in the Augmented Eye.<br>The looks of the app can be altered using Nanocamo, where you can select your favorite theme. <br>The blog of famous cyberpunk superstar, Kira Miki, is also available, where she will post her life and hot-and-happenings around Glitch City.', 'summary': "Welcome to the world's most hi-tech/low-life board!", 'summaryHTML': 'Welcome to the world&#39;s most hi-tech/low-life board!', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.69, 'ratings': 867, 'reviews': 345, 'histogram': [26, 26, 26, 34, 754], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '53M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'prefetcher', 'developerId': 'prefetcher', 'developerEmail': 'prefbaka@gmail.com', 'developerWebsite': None, 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '4633567594373779648', 'genre': 'Communication', 'genreId': 'COMMUNICATION', 'icon': 'https://lh3.googleusercontent.com/kJvYbCHJIlH7DeS8L5GpUkbQS-Be5xHrR5MffEFPfw6CbojLN1jJ_bCZA1Z1gw17aQ', 'headerImage': 'https://lh3.googleusercontent.com/fZqE0YxT4tvY-gNkerfxRb0D0qEqCfM8GVAuPBvUo6mPFBHWkR8jJWZthXvz2pj9T0I', 'screenshots': ['https://lh3.googleusercontent.com/aEUjpN3qzm48NnyvJeoTuexRcxi1lMHzbtTfgTGGtn_dVbcCeuVYaxj8wQNlK6OnvD39', 'https://lh3.googleusercontent.com/lNgo0NOt1wlWYrwOTQeH4y-vO_8-hI2ix3PXQHM73pkPub_guXDlbmUOrhqTVoUkCNQ'], 'video': None, 'videoImage': None, 'contentRating': 'Mature 17+', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 23, 2017', 'updated': 1536870021, 'version': '4.2.5', 'recentChanges': '- Fix bug where opening a thread from the thread watcher would not draw a bar or jump to the bar\r\n- Add panel to allow user to specify a custom bar color\r\n- Update settings UI to have actual toggles and allow updating a setting without scrolling back to the top\r\n- Add option to hide threads from the toolbar', 'recentChangesHTML': '- Fix bug where opening a thread from the thread watcher would not draw a bar or jump to the bar<br>- Add panel to allow user to specify a custom bar color<br>- Update settings UI to have actual toggles and allow updating a setting without scrolling back to the top<br>- Add option to hide threads from the toolbar', 'comments': ["A fun app when you know the game, I like all the features but I got ONE bug (only one so it's great): when I click on the music logo I got a black screen (but the auto music at launch works). I'm on the latest version of Android, could someone or a developer help me ?", "Hasn't worked in about a year. Music player in particular. The autoplay music doesn't start anymore and the jukebox is flat out unresponsive.", 'Great app. I wouldn\'t mind a launcher themed like this. I really wish there was an in-app "app" that was a duplicate of the BTC recipe book from in-game. That would complete the experience for me.', 'Great, satisfyingly immersive. only problem that after sometime it feels dull. maybe you could add minigames or something in there? btw looking forward to N1rV-Ann-A release. good luck guys!', 'It really is an excellent addition to the PC game but it seems to have limited support for the Galaxy S10, which is a shame', 'epic reading app, loved the addition of the music player still playing as well', "Amazing— one problem though, I can't comment on any thread. The app works wonderfully minsu that one issue", 'Great stuff. Really immersive; feels just like the game.', "can you fix the jukebox feature? when i open the jukebox it shows nothing and when i press back button, i can't press any feature. please fix it", 'I love it! It really nails the design from the original game! But how do I reply to threads on D!', 'Works on all my phones except my daily driver (note8) black screens and options are unselectable', 'wow such a good app. cannot believe how strong the fandom of this game is.', "great app, would definitely recommend if you're a fan of VA-11 Hall-A", 'Pretty good and faithful to the original game', "I found the game itself from this app. Can't thank you enough.", 'Fun app for fans of the game', 'Best App 10/10 would review again', 'A very fun app', "😼 I don't know where I am...I have no idea what this community even is, but it's cool and the ppl are nice, so thanks! 🖖", 'Filled to the brim with scum of the earth', 'Looking forward for further updates', "Brilliant. That's all you need to know.", "It's cool. I like it.", 'i love this app and i love you', 'A toast to this damn app', 'How can I support you?', 'epic app for epic reasons', 'Reol is my favourite artist now', '*reinstalls life.exe*', 'in love with this', "Love the app it's like a anonymous Reddit and lots of fun people to talk with. Not to mention my waifu Lain has her own theme. Only problem is on my new phone I can't submit text every time I click submit nothing happens. I'll refresh and my text didn't post.", 'Woah What This App is So Satisfying! But.. Notification is not supported yet for Android Oreo.. Btw the design are too neat and unfriendly. Still... Overall is great Please also add upload picture and private chat', '5/5! great app... lots of features... love the 8bit 80s/90s aesthetic... the app is a great look at cyberpunk/post dystopian technology themes of Glitch City... Sony Xperia XZ1 android 9.0.1', 'Hasnt worked in some time, probably because of the host provider change in december', 'KIRA.MIKI!', 'Broken', 'Pretty good', 'Good app', 'love it', "Awesome app, but the music player doesn't work on the Samsung S8+ (running 8.0). Just shows the previous and next track buttons, no track list and hitting the back button locks the app until you force close it and restart it.  Works great on my other devices (including a Samsung Galaxy Tab S3 running 8.0). Please fix it!"], 'appId': 'com.angryburg.uapp', 'url': 'https://play.google.com/store/apps/details?id=com.angryburg.uapp&hl=en&gl=us'}
