{'title': 'Lock Screen Notes', 'description': "With this app you can easily create notes that stick around for later!\r\nDesigned for you to be able to create and manage notes quickly without many interruptions. Notes are supposed to be small and not kept for very long as they are supposed to be used for reflections and 'keep for later' ideas, like grocery lists or anything that you need to be reminded of instantly.\r\n\r\nOptimized to be quick and efficient so that you can write down your ideas and notes in less that 2 seconds and only one tap of a button!\r\nOnce created, a note will stick around and be instantly displayed on your lock screen as a notification.\r\n\r\nNotes and the ways they are displayed are highly customization. You can decide if they are grouped together and displayed as a single notification or separate. You can also set if they are always displayed prominently or more subtle. (depends on the type of device).\r\n\r\nThis App is free and without any ads or tracking! This will not change in the future! Besides that, it is open source and the source code is publicly available on GitHub:\r\nhttps://github.com/NilsFo/LockScreenNotes\r\n\r\nPermissions explained:\r\n-Run on startup: To display the notifications once you restart the device\r\n-External storage: To read / write backups", 'descriptionHTML': 'With this app you can easily create notes that stick around for later!<br>Designed for you to be able to create and manage notes quickly without many interruptions. Notes are supposed to be small and not kept for very long as they are supposed to be used for reflections and &#39;keep for later&#39; ideas, like grocery lists or anything that you need to be reminded of instantly.<br><br>Optimized to be quick and efficient so that you can write down your ideas and notes in less that 2 seconds and only one tap of a button!<br>Once created, a note will stick around and be instantly displayed on your lock screen as a notification.<br><br>Notes and the ways they are displayed are highly customization. You can decide if they are grouped together and displayed as a single notification or separate. You can also set if they are always displayed prominently or more subtle. (depends on the type of device).<br><br>This App is free and without any ads or tracking! This will not change in the future! Besides that, it is open source and the source code is publicly available on GitHub:<br>https://github.com/NilsFo/LockScreenNotes<br><br>Permissions explained:<br>-Run on startup: To display the notifications once you restart the device<br>-External storage: To read / write backups', 'summary': "Create notes that are automatically displayed in the device's lock screen.", 'summaryHTML': 'Create notes that are automatically displayed in the device&#39;s lock screen.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.71, 'ratings': 129, 'reviews': 68, 'histogram': [28, 5, 6, 24, 64], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.3M', 'androidVersion': '4.2', 'androidVersionText': '4.2 and up', 'developer': 'Nils Fo', 'developerId': 'Nils+Fo', 'developerEmail': 'nils.foerster93@gmail.com', 'developerWebsite': None, 'developerAddress': 'Germany', 'privacyPolicy': None, 'developerInternalID': '5196216713918591455', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/2rB-Yzcvpgfl0TT1DXf5Ldys0G4EpALQenTNWlsKoTPwHURsaXw9GhHOoQCkpfvpJg', 'headerImage': 'https://lh3.googleusercontent.com/-nOsggAjx0pk_LU7MH-pLGLRO7l_zPN0y1c28r2_Ll1MZTw9DbrvxQpL9IgN_GROGA', 'screenshots': ['https://lh3.googleusercontent.com/B0EHpDbcxczlzG6PRUkbHtV9FgQ518pnatSXKWyKkZBUyYYEbeon1nJjh9fD4pvkaHiN', 'https://lh3.googleusercontent.com/_7PlZJALCVcl9yDUqvm8Q-xd0c2e36PXJR0j4N7V2zk0py_U-6qKD0NuTVURxo7RJg', 'https://lh3.googleusercontent.com/-3VeiVLU3ns9vjfbGcYxJnDgtRGBJVv89_cfOwWTgZ4K6ndzyrHz0v1W2rn-yr1AcyaS', 'https://lh3.googleusercontent.com/gLNxbrFfDrFJYQamU7OGcrT-C0D9aaRkFw0UmYZAQ-DJMcUdfvm1p2SA3MtjvoS04y8', 'https://lh3.googleusercontent.com/q_hxYeKYcZ9FwHPCFUuu5_qBwGTyw7XrpV2EIFrNYpaBtRYukEPTWFSKmkKSJKLLA3A', 'https://lh3.googleusercontent.com/8Lh-xorfYcqQ0eAzqIfS9Fe4tDemaNfOfxK0opa8mHyUiuerZDiM_EOZfWH9Ef4yXw', 'https://lh3.googleusercontent.com/ixqBvYNr3LKDBtFfyaAy0Q9KE4eC9PHCG5B50KY0kfA0Y0BRv2Zqw8SH0mTn1kgEIgw'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Feb 26, 2017', 'updated': 1578056599, 'version': '1.0.9', 'recentChanges': '-Supported Night mode (when supported and enabled by your device)\r\n-Added a preview to the date formation settings\r\n-Fixed typos\r\n-Updated localization files', 'recentChangesHTML': '-Supported Night mode (when supported and enabled by your device)<br>-Added a preview to the date formation settings<br>-Fixed typos<br>-Updated localization files', 'comments': ["Does what it's supposed to, easy to use and convenient to remind myself of things I have to do every waking moment I look at my phone👌", 'No option to display on lock screen ????', 'Very impressed. Use it daily. Thankful. Crashes when adding note manually just recently even before the last update.', "Very good and very useful! This is better than any similar app. It doesn't slow the phone and it is just simple! Perfect.", "It's been very helpful. I only wish it also supported alarms.", 'Just couidnt get my notes to homescreen no matter how I tried. Sorry, but very frustrating app.', 'Not a fan of the persistent notifications once unlocked, though I understand there might not be much to do about that.', 'Does not display one note, even after seting minimum lines.', 'Finally an app that does what it says also simple and easy to use', 'Does NOT display on lockscreen. Samsung j5. Uninstalled', 'doesnt display text even if set min lines to 1', 'Great app... extremely helpful...', 'Excellent application sir I requesting you this in more updates important and popular thank you', 'effective yet very minimal space', 'Been looking for an app like this for soo long. You guys are the best!!', 'It is a good reminder just gonna give it 5stars', "Don't work on my Samsung", 'thank you too bad s9 wont allow it', 'Good app', 'Great tool', 'Absolutely fantastic app! Very high quality and super helpful to anyone \nthat is forgetful. The notes are convieniently displayed and reminds you to \ndo things without draining battery life. 10/10 would recommend!', 'Would like to be able to edit or delete items in the notes from the lock screen', "Bug: even if disabled in the settings, you can swipe away the notification and disables the notes, rendering the app basically useless. The app can't create notifications that can't be swiped away .", "The only reason i gave you 4 is that this app doesn't have the options so that we can make our own proiority, It can be done by a simple drag and drop.", 'If this app gave a list of notes instead of saying 4 notes I would give it \n5 stars', "Doesn't show on lock screen", "Works for 15 seconds and then it doesn't show up on lockscreen anymore.", "It's great bc of how simple it is. You can quickly add or remove the notes. You can't swipe it away. You can create many notes and turn them off or on quickly via opening the app. I have ever note but I needed something quicker. This is a great app that I use daily. Thanks.", 'Only shows notes on the notification panel for S4 mini, please fix', 'Does not appear on the lock screen, which is what I was looking for (S3 Neo). Only in notification screen when you pull it down.', 'This has quickly become one of my most used apps. Possibly number 1.', 'Simple, works great. Displays notes on lock screen', 'Was ist das fuer 1 notizapp? Wie kann man sich nur so hart gönnen vong Notizen her.', 'It is no frills app, just enough for use. I made a list of often use reminder but deactivated it for standby and activate the one as necessary.', "Doesn't appear on lock screen nor in lock screen possible widgets list nor on lock screen notifications area. Android 4.2.2 Would be decent otherwise.", "Doesn't show notes on lock screen only notification bar", 'nice'], 'appId': 'de.nilsfo.lsn', 'url': 'https://play.google.com/store/apps/details?id=de.nilsfo.lsn&hl=en&gl=us'}
