{'title': 'Ministocks - Stocks Widget', 'description': 'Ministocks is a simple and powerful stocks widget, giving you quick and easy access to your stock information.  \r\n\r\nThe Ministocks stocks widget has the following features:\r\n\r\n• Four widget sizes available\r\n• Add unlimited widgets\r\n• Stock symbol search\r\n• Price change - daily and against buy price\r\n• Profit and loss - current valuation and total gain\r\n• High price and low price alerts\r\n• Foreign exchange prices \r\n• Data sourced from Yahoo Finance\r\n• Foreign exchange daily changes\r\n• Custom update schedule\r\n\r\nIn addition, Ministocks is:\r\n\r\n•  Free with no in-app purchases\r\n•  Open-source software\r\n•  No ads and no analytics\r\n\r\nMinistocks uses finance data sourced from Yahoo Finance, and recognizes the same symbols.\r\n\r\n• Note that this application runs as a widget only, please ensure that you understand this before you download and rate/review.  If the widget does not appear after install, try rebooting your device.\r\n\r\nThis application is open source and hosted at GitHub.  This should give you peace of mind about your data security.\r\n\r\n• There is currently a known issue with the data feed (used by many other stock applications) and Spanish/Indian stocks are currently unavailable, Yahoo have stated that they have no plans on supplying this data going forward.', 'descriptionHTML': 'Ministocks is a simple and powerful stocks widget, giving you quick and easy access to your stock information.  <br><br>The Ministocks stocks widget has the following features:<br><br>• Four widget sizes available<br>• Add unlimited widgets<br>• Stock symbol search<br>• Price change - daily and against buy price<br>• Profit and loss - current valuation and total gain<br>• High price and low price alerts<br>• Foreign exchange prices <br>• Data sourced from Yahoo Finance<br>• Foreign exchange daily changes<br>• Custom update schedule<br><br>In addition, Ministocks is:<br><br>•  Free with no in-app purchases<br>•  Open-source software<br>•  No ads and no analytics<br><br>Ministocks uses finance data sourced from Yahoo Finance, and recognizes the same symbols.<br><br>• Note that this application runs as a widget only, please ensure that you understand this before you download and rate/review.  If the widget does not appear after install, try rebooting your device.<br><br>This application is open source and hosted at GitHub.  This should give you peace of mind about your data security.<br><br>• There is currently a known issue with the data feed (used by many other stock applications) and Spanish/Indian stocks are currently unavailable, Yahoo have stated that they have no plans on supplying this data going forward.', 'summary': 'The popular and trusted open-source stock widget.', 'summaryHTML': 'The popular and trusted open-source stock widget.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.086207, 'ratings': 3065, 'reviews': 1488, 'histogram': [303, 198, 224, 541, 1796], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Nitesh Patel', 'developerId': 'Nitesh+Patel', 'developerEmail': 'nitezh@gmail.com', 'developerWebsite': 'http://niteshpatel.github.io/ministocks', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5328750079267100179', 'genre': 'Finance', 'genreId': 'FINANCE', 'icon': 'https://lh3.googleusercontent.com/XRlGqF4eMg-X3SYQP_4vEvXFoBEU0Z4zR_S9QmCcbYU6bvxF_vN0VS2X4r2CHcQsxQ', 'headerImage': 'https://lh3.googleusercontent.com/rf0NhNS6QrrwRmMYmGLOzrDupW8GG7RHckkKmdgQouN61jgyWv6TUgVtbqGPAD2q41U', 'screenshots': ['https://lh3.googleusercontent.com/tGCYATUkG_qNHMenV_xukCnZ0GekaJT0lxAwttxzii-d_3laxRF7vs7iHDWHIDzGSq4', 'https://lh3.googleusercontent.com/DvvjhUtVkr0WJM11FBcrnHjA9pNm47Nu1AvJgw3PdBZDELvL9mfFBsSzOtzQDYN6Aw', 'https://lh3.googleusercontent.com/6gE3bBPxOHxeWFdnVBaoSVB1iaM8EyCujWTVf9-1jmlqeFRgf4UloSeXjknUBrk5UZo', 'https://lh3.googleusercontent.com/NdGktM-yO48kuN6ufCJ_mPFF6oVnkzX5AM6fYtNqS41Qk1bQD6GQ_xi5OzDsSvLnKt0', 'https://lh3.googleusercontent.com/Z16m0qLHTNTW9OTtAC0qmHVjeWhsTP70Z-Mo2B0gKUS6HkAKDT3ErbL2N1lHz5L4tQ', 'https://lh3.googleusercontent.com/u6o_hKW28kAjQKBRruk17f8huV7MAFnu359ojUrRCkpEpXUQcJJpqsCxsvkr5un1sJw9'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 12, 2011', 'updated': 1557751189, 'version': 'Varies with device', 'recentChanges': 'Bug fixes:\r\n• Enable automatic updates on Android 8+', 'recentChangesHTML': 'Bug fixes:<br>• Enable automatic updates on Android 8+', 'comments': ["V good App. Widget views can be improved further. Right now second column shows 0, in Daily Change option, which con be used for portfolio change. Radio button to be used, whereas is multiple selection buttons, but result is for first clicked option only. Today, on 01-Apr-2020 Nifty showing yesterday's data but sensex latest. Probably, source of the data not properly updated.", 'This app worked fine before, but now it is not updating stock prices every 30min as I have instructed it to do. It sometimes takes days before updating. I am now using GalaxyS10, but earlier I had S7 where it somehow worked fine.', 'Nice widget. Automatically updates during weekdays, has capacity to view cryptocurrencies, and open source! Bugs are usually fixed in a reasonable time', 'Excellent. Exactly what I was hoping to find, and more: something to display a few stock tickers, real-time, without having to click on it. On top of that it includes a nice set of options. Would be happy to pay the author a few bucks for it. Re: those who say it stops updating prices, I have found if my phone is set to battery saver mode it blocks the widget, even if you try to update it manually. So, that might be the problem they experienced.', 'Worked great only for a short time. Hasn\'t been accurate or current since "the upgrade" and this happens regularly- it\'s unusable as is. Unfortunate though...it WAS great.', 'Great for my Android to set up a single page for quick check of my portfolio with fast response refresh and the essentials!', "Not updating. I've used this for years, however recently the data is out of date", "The application doesn't auto-update stock price... otherwise it's a good application. Suddenly, it stopped working 😔", 'This app is simple and functional. I wish the app supported tracking multiple positions in the sam stock separately in the widget. I can only figure out how to set a single price for each symbol. This seems strange because I can have multiple records of the same symbol. I have different concerns with different positions within the same stock.', 'Great app. I would like to see two decimal places on the daily percentage change view. In the future, it would be great to have a interday stock or index chart widget.', 'Have been using this app for over a year now and simply love it. Straight forward setup, has the most essential options and just works like a charm. Keep up the great work.', "Just says Loading Data and does nothing. Clicking on the widget does nothing. Manually opening the app from the list gives you a message but doesn't let you configure anything. Doesnt seem to work at all.", '4 stars for now. I wish currency is added in near future. Thank you.', 'Awesome - I wanted a resizable widget that could display multiple stock tickers within a single widget, and this works perfectly. Lightweight and simple to use.', "Looks great, but missing most of the world's indexes that I want to display: FTSE250, DAX 30, NIKKEI 225, CAC40, Hang Seng etc", 'Simple but very efficient app. BSE stock are also available and we can rename it to custom names !!! Very useful app', 'App is nice but increase max nos of stocks instead of only 10 stocks in widget, it wil be appreciated.', 'Great. Compact, multiple widgets on screen, simple and clean display. Reliable.', 'After some days it stops updating stock price... No help also, just stop working...but wgen wirjs it is great. Currenly stocks prices are not getting uodated...application owner, please checkbthe problem. All widgets are blank Application owner, are you fixing the problem or shoul I switch to some other application...it is still not working and not updating the stock price. still not working......nit uodatibg the stick price....switched to other app...', 'nicely done and easy. simple way to track a couple stocks on your phone without having to open an app. thank you!', 'Pretty good - although i cannot find any way to add gold or silver, using xau or otherwise, which is a bit of a bummer. Still, nice and small, works well!', 'Very useful widget that shows the ticker prices on homescreen', 'Light weight, functional, extremely customizable, and just THE BEST. Period. Thank you, developer!', "1 problem: cannot add M&M Mahindra and Mahindra NSE stock in the widget. It shows no data after adding. Rest- it's the best widget kudos to the developer team", 'good app. used it for years. No adds! Hope it updates soon to a Android OS that just was pushed onto my Gallaxy 8S.', 'Does the job precisely. No hustle and bustle of login everytime to check the prices. This is exactly what i wanted.', 'Impossible to read any line in the widget, because every line is cut in half (only top half visible). Totally useless, already uninstalled after 10 minutes', 'The Best Widget to place on the mobile screen of Investors! It keeps you updated on the top 4/ top 10 stocks without any efforts. The Best in this Category!!', 'Small lightweight and does the job perfectly. Monitoring 2x share funds and 2x currency rates.', "Why is this limited to 10 symbols? I can't possibly see how this app has so many 5-star reviews when it's so limited.", 'best. simple and clean look on the home screen. perfect.', 'very nice. developer is best. widget serves the purpose. please make sure that it must provide accurate data.', 'Really useful for a quick view, but sometimes the auto update is not working', 'the app simply did not work after installation. Samsung S8 Plus', "Rates for NSE stocks are not updating. Using M30. As a developer, request you to fix a bug and I'll re rate it.", "Prices don't update when pressing right side of app. I have that setting chosen in Advanced settings", 'Simple and helpful Hope the update was realtime instead of 5minutes', 'Easy simple Adfree No unnecessary permissions required', 'I like the ability to see the up and downs of the market with this widget on my home screen.', "Only in USD. Cannot find any option to list in other currencies. I guess you get what you (don't) pay for"], 'appId': 'nitezh.ministock', 'url': 'https://play.google.com/store/apps/details?id=nitezh.ministock&hl=en&gl=us'}
