{'title': 'NitroShare', 'description': 'Note: please visit nitroshare.net to download the desktop application.\r\n\r\nNitroShare simplifies the task of sending files from one device to another on a local network.\r\n\r\n• Automatic peer discovery\r\n• Support for transferring multiple files and folders\r\n• Transfers optimized for maximum bandwidth utilization\r\n• Compatible with the NitroShare desktop application\r\n• Light and dark theme\r\n• Fully open source and completely free of ads and trackers\r\n\r\nFiles can be sent directly from the app itself or using the share menu from within other applications.', 'descriptionHTML': 'Note: please visit nitroshare.net to download the desktop application.<br><br>NitroShare simplifies the task of sending files from one device to another on a local network.<br><br>• Automatic peer discovery<br>• Support for transferring multiple files and folders<br>• Transfers optimized for maximum bandwidth utilization<br>• Compatible with the NitroShare desktop application<br>• Light and dark theme<br>• Fully open source and completely free of ads and trackers<br><br>Files can be sent directly from the app itself or using the share menu from within other applications.', 'summary': 'Cross-platform network file transfer application', 'summaryHTML': 'Cross-platform network file transfer application', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.9, 'ratings': 186, 'reviews': 115, 'histogram': [29, 13, 11, 24, 107], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.5M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Nathan Osman', 'developerId': 'Nathan+Osman', 'developerEmail': 'nathan@nitroshare.net', 'developerWebsite': 'https://nitroshare.net/android', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8031010135518000723', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/H9jLP_Skh1oBaUX7YmbKznOxXBcgclDFSoNGuHSyonqc1fr9JtEf8uqm2ZIuKRgLfg', 'headerImage': 'https://lh3.googleusercontent.com/KYUfVQYQbhxolT6ayepnerGATVjedJgrmhdn7z5qVcLSTzZPjOYE9uZ5NNoH9lks', 'screenshots': ['https://lh3.googleusercontent.com/pI8r50oMVQADE2kYunbIQNOtV9Gyv5G3SxlDYwbwXsu5K3qMu06veqTyMz6RuNuhe8rD', 'https://lh3.googleusercontent.com/nJ9cAi_xjVoiwOUu26T2Y8ClpxJtzwMJvPif-PTQl7hTwXIq2XEBvAAhB_yfQkCbLuE', 'https://lh3.googleusercontent.com/vCPuREaMdkQeT7QdbVjtvAjuscK4hyeH57ddgihXuB-XIq10jK9-1t-GOY8qhgTPfwE', 'https://lh3.googleusercontent.com/Lg8JzvSuJdVvqEJ4u9lFOUbNS1acKEz6RfZyWAD_CuHDdvTYW0L39RG8DStnUGK2qfUy', 'https://lh3.googleusercontent.com/cT7ziOVwETqdaj_0QINX-dMBcsgsz8f4So4dSRbG2evWBGkYvXocqp5kqkpdjZPDb0Y', 'https://lh3.googleusercontent.com/oH6_3Xh3Ayh-HiDTNVz_JgUH0G3fscdeMqXlYLZAHFW1KCwuEiDVm_djp3WGjeh8Kws'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Oct 12, 2017', 'updated': 1524576444, 'version': '0.4.0.39', 'recentChanges': 'Fix s == null bug', 'recentChangesHTML': 'Fix s == null bug', 'comments': ["It's a great app, nicely worked in redmi, realme, Windows pc, Linux. I have used it all of it. I was very impressed with it until the last system update of realme l. After updating to android 10, if screen goes off, the file transfer cancelled automatically. Screen must be always on in order to complete the transfer. I don't know whose issue it is, whether realme's or yours, if its yours then I request you to fix the issue. I have reported bug to the realme community too. Let's see.", "Not working for me - set up on Ubuntu 18.04 and Android 7.0, can't find either device whichever way I try to get it to work. Looks like it needs some fixing :-(", "If it could only see my LInux machine this would be ideal for me. But desktop side nedes version 0.3.4 and it seems only 0.3.3 is available. Works great between two android devices. UPDATE: 11-23-19. Got 0.3.4 built on Ubuntu - STILL can't find Android device :( Appears linux version needs qmdnsengine and qhttpengine at build from source to work. Any chance the dev could build a .deb or Snap package for Ubuntu?", 'very great app supports for all platforms but plz add the file name that is transferring as it makes easier to manipulate which file is transferring.At present it only shows the device name.', "Can't receive files on my phone, but I can at least send them to computer Was working fine before, very useful app", 'App cannot detect my linux desktop. Works fine between my computers running linux mint, but none of my computers can detect the android phone, and likewise the phone wont talk to my computers. Hopefully in the future it will detect android devices, till then prefer other apps that are truly cross platform.', "Works fine between Linux & Windows machines. Android version doesn't talk to Linux & Windows. Android version does seem to talk among Android devices but I have yet to find the 'received' items on smartphone or tablet. Hoping next release gives me choice where to put received items.", 'It is not possible to send from Mac to phone. Near the name of the phone - Operating system: Unknown. When I try to send the mistake appears: Failed: Host Unreachable. From Android to Android it works.', 'Works good between Linux devices, but it cannot connect to my Android. If it worked I would give it 5 stars. I would love to see this fixed. Otherwise very nice and simple app', "Unfortonately it's not working on my phone. I'm using Android 10 and Linux on my laptop and both devices can't see each other", "Can't get it to work. It says Unable to listen on port 40818 then closes. I searched for a solution and tried a few suggestions, to no avail. Would love to have something like it.", "DON'T USUALLY REVIEW!!!! , \U0001f92f👺💀 but this dev deserves a round of applause for giving you free software free of any hidden agenda. everything works for myself but I am sure that negative reviews exist. Not sure about their ability to use a application or read, but anyone drawn to the above emojis probably won't read this, so to those people, don't breed please.", 'The application is must have for me, because I have a real zoo in my local network: Android devices, Ubuntu, MacOS and (I know its weird) Windows. Nitroshare really rocks!', "The Android app can't discover my PC and the PC version can't discover my phone. Works great between PCs.", 'Great program but needs 3 features. Disable auto-start on boot ,TLS Certificate support on android too and SD memory card support.', 'Works like it is supposed to... Kudos to the Dev. Great Job bro and Thanks a ton!', 'The best app to share files across all operating system platforms and your android or apple devices.', "Works great between my three Linux laptops, but Android to Linux doesn't work at all.", 'Works fine for Win7↔Win10 and Win7↔Android7/9 transfers. Super fast.', 'Excellent, please add Android TV compatibility.', 'Best cross-platform file sharing app :))', 'Unable to send files from Android device to Windows 10 PC', 'did not comunicate with other computer. I use the desktop version and is much better.', 'App is unable to access storage on android Q', "Couldn't find my pc from android and vice versa.", "doesn't work for me android + ubuntu 18.04", 'Can easily share files from my phone to either my PC or Linux laptop.', 'Awesome. Lightweight & Fast.', 'Awesome app we now huge share files very quickly at my work place', 'Well done!. Nice app.', 'Not working with linux pc to android', 'Some bugs dected ...', "Didn't work :(", 'Best app for linux', "1) Unfulfilled Use Case: User should be able to see what files he received in the session. 2) Why can't I see and then approve before receiving any file ?? (I too use desktop application, the same question to go there as well). I PERSONALLY LOVE NitroShare fullfiling my Need.", 'My laptop (running openSUSE) cannot listen on the default ports, but I can \nchange them. But there is no obvious way on my android phone to change the \nports. So would like, no love to use it but the app it not usable at \npresent.', "Works ok, but I can't set my microSD card as the receive folder and there's \nno option for disabling autorun. Otherwise, it's decent but it won't be my \nfirst choice for file transfers until those are fixed.", "At first I gave 5 star, now it is 4. Because, it can't store received files in sd card and also there's no way to to stop autorun.", "Why no option to disable auto start on boot? I don't need this 24/7", 'It is not working for my linux deepin 15.5😭'], 'appId': 'net.nitroshare.android', 'url': 'https://play.google.com/store/apps/details?id=net.nitroshare.android&hl=en&gl=us'}
