{'title': 'Bubble', 'description': 'Simple and beautiful app for all your offline comic books. Enjoy distraction-free reading experience (no ads, no bloated features, easy and intuitive settings)\r\n\r\n* Optimized for tablets and smartphones\r\n* Supports CBZ/ZIP, CBR/RAR and folder based comics\r\n* Advanced zoom and scaling modes\r\n* Comics/manga reading mode\r\n* Library management with automatic bookmarks\r\n* Simple file browser\r\n* Free, open-source, no ads, gluten-free\r\n\r\nsource code available at https://github.com/nkanaev/bubble', 'descriptionHTML': 'Simple and beautiful app for all your offline comic books. Enjoy distraction-free reading experience (no ads, no bloated features, easy and intuitive settings)<br><br>* Optimized for tablets and smartphones<br>* Supports CBZ/ZIP, CBR/RAR and folder based comics<br>* Advanced zoom and scaling modes<br>* Comics/manga reading mode<br>* Library management with automatic bookmarks<br>* Simple file browser<br>* Free, open-source, no ads, gluten-free<br><br>source code available at https://github.com/nkanaev/bubble', 'summary': 'Comic book reader', 'summaryHTML': 'Comic book reader', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.16, 'ratings': 590, 'reviews': 277, 'histogram': [82, 11, 35, 59, 401], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.1M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'nkanaev', 'developerId': 'nkanaev', 'developerEmail': 'nkanaev@live.com', 'developerWebsite': 'https://github.com/nkanaev/bubble', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5882483760362997141', 'genre': 'Comics', 'genreId': 'COMICS', 'icon': 'https://lh3.googleusercontent.com/MAayYZBe4zY7eNZEzXxWTTU2VChMF5-xTieINdkLEP_KsrTfrzIuz9VnGf8RXOvmk_8e', 'headerImage': 'https://lh3.googleusercontent.com/NAlPXSjlBDlLlAJnHKmTOoqVuD3WjBvi3MZAlVnE0mlthXceJchaHox4gQv6bwM9pXc', 'screenshots': ['https://lh3.googleusercontent.com/6Gj-ExIEygxrZsOyC0Aj_EuSrTltBjEgEiJGRJNdcxMmGmfZ-uhfhFD8NOL9T9v_yyqz', 'https://lh3.googleusercontent.com/581y8ooV6ijnS4poHcB6jNWCOMMal9NVAE2uJQ7PRPgowmvLc0ruSwldrNbhMtWJSf0', 'https://lh3.googleusercontent.com/CCmd1emMHnNQLD7CvjKizwrxTTf6tzuxWwKy1DVLYeNV_RkXvJ1c-khfT1DD4bB3rQ8'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 30, 2016', 'updated': 1469719134, 'version': '1.6.0', 'recentChanges': None, 'recentChangesHTML': None, 'comments': ['Really good app, super simple and clean layout. A shame its not being developed anymore, but more than usable in its current state', "Amazing. I have tried many different comic book readers. This gets the job done really well. Plus it's ad free! Thanks, developer!", 'Am currently using an old Samsung Galaxy Tab which is still on Jelly Bean (no updates at all) and I use it to read books. This app is very smooth to read and am thankful that you still support old OS versions. Thanks and keep up the good work!', 'Good app. I would just like to have the capability to add multiple paths.', 'This app is underrated. Nice and simple. AD Free!', 'Best comic viewer for Android despite it now being abandoned.', 'no other free and upto date comic reader on play store that too with no ads.Best app to read comics on the go. Open source and according to your needs', 'very easy and practical to use. thank you😊', "Surprisingly good comics reader. It's simple, small, easy to use and no ads. Works great so far.", 'Small and too good to use. Arranges all my comics in a perfect manner.', 'Great app! Simple to use and works well. Would like to see cloud support in an update :)', 'I have been using this for 5 months and experince is good. The only is that selecting comics btw it is good.', 'Simple and awesome, i hope more features or setting will be added soon!', 'Brilliant. Quick loading each time. Simple to use.', 'Pls make a support version for more displays ratio like 18:9 18,7:9 21:9 20/9 Plus all other functions of this app is awesome Thanks for the development', "just add a feature to have folders in grid view and it'll be perfect.", 'Just works! Beautiful working open source app: great.', 'Need more simple menu like zoom fit screen and quit button', 'can you make page scrolling vertically as well as make it continue to next file by continue swiping it after it reach end page?', "All the non 1star comments must be fake. This is the single worst app i have ever seen. Totally non functional, it's a beta1 with nothing else but bugs.", 'Simple and lightweight.', 'Beautiful and ad free.', 'Worked well on my cbz comics', 'App crashes way too much', 'immediate crash on startup', 'Great.Great. The best.', 'Didnt read from internal memory', 'Great app. Simple and efficient. No ads. Being able to quickly switch \nbetween manga reading sense and comic reading is neat. If I have to nitpick \nit would have been nice to have more options for browsing through the \nlibrary. Can read from SD (but finding the SD is a bit tricky to do, and \ngoing to root folder crashes the app).', 'So far so good. I tried other comic readers and my perennial favourite Comicrack but all these comic readers somehow have difficulty reading from SD card. Not sure if it is due changes made in Android. This one reads comics with no difficulty. And so easy navigation and very intuitive.', 'Only one thing needed to make this perfect. If we could just enter our files folder app, and click on the cbr or cbz files then - voila! The file would open in Bubble.', "I am able to read the comics that even established comic readers failed to. And cherry on top is that it's completely free without any ads. It's very light weight and there's no distractions while reading. Kudos to the developer for this amazing comics reader.", "Great app! But it has issues opening some comics, it just shows a broken image. I can't switch to this app fully because of that one problem. Hope it's eventually fixed.", "Dead simple. All the basic features you need, none of the fluff. Lacks the kitchen sink approach of Perfect Viewer and Challenger, but it's still useful, ad free, and open source. Would definitely recommend if your files are stored on device and you just want to start reading without adjusting any settings. Essentially, it does everything it means to well.", 'the app is pretty good, as worded it is a basic reader app. there is room \nfor improvement though 1. if a zip is corrupted in the reader folder, the \napp would crash and you have to spend time hnting down which zip is at \nfault. 2.lack of file management in the folder, similar situation, when you \nhave read a zip and you want to remove it, only way is to use another \nexternal program to do so.', 'But it has major problems with large images :( pixelates the heck out of them, which can make small text unreadable, and it stays pixelated when zoomed in.  No other reader does this, which is a shame because I like bubble better than the others :/', "Can't tell whether the app is any good since all my Comics are on the phones sd card and the reader won't open it.  And while trying to open a file it crashed and won't open any more.", "Thank you so much the the developer and or developers! This is one of the best comic book readers I've come across and it ease of use make it even better! Love the material design and I can see this being my number 1 comic book reader!", 'Gave me what I wanted, a simple, well-designed (and completely ad-free) comic book reader without the bells and whistles and the unnecessary amounts of extra space the other readers seem to come with. But I would appreciate it if you could include reading files from an SD card in a future update.', "clean layout (in comparison with all others readers in android marketplace), but it doesn't HOLD the comic you're reading... The minute you switch to another app and back, it returns to library. That makes it unusable.", 'It will be better if it keep only one recent file... Or its quite lengthy process to browse through files twice...'], 'appId': 'com.nkanaev.comics', 'url': 'https://play.google.com/store/apps/details?id=com.nkanaev.comics&hl=en&gl=us'}
