{'title': 'Chord Reader', 'description': 'Search the web for guitar chord charts to your favorite songs. Then, Chord Reader will automatically analyze the chords and allow you to transpose, add a capo, etc. It\'s great for guys like me with a limited vocal range.\r\n\r\nYou can also click a chord to see the suggested guitar fingering.  Multiple fingerings are shown, with the most common one first.\r\n\r\nAdditionally, you can import your own chord charts into Chord Reader. Simply copy the files you want (in plain text format) from your computer to the "/sdcard/chord_reader" folder.\r\n\r\nThis is free and open-source software, so any bug reports or contributions are appreciated.\r\n\r\nRock on, fellow Android guitarists!', 'descriptionHTML': 'Search the web for guitar chord charts to your favorite songs. Then, Chord Reader will automatically analyze the chords and allow you to transpose, add a capo, etc. It&#39;s great for guys like me with a limited vocal range.<br><br>You can also click a chord to see the suggested guitar fingering.  Multiple fingerings are shown, with the most common one first.<br><br>Additionally, you can import your own chord charts into Chord Reader. Simply copy the files you want (in plain text format) from your computer to the &quot;/sdcard/chord_reader&quot; folder.<br><br>This is free and open-source software, so any bug reports or contributions are appreciated.<br><br>Rock on, fellow Android guitarists!', 'summary': 'Search for guitar chord charts, then transpose or add a capo to change the key!', 'summaryHTML': 'Search for guitar chord charts, then transpose or add a capo to change the key!', 'installs': '50,000+', 'minInstalls': 50000, 'score': 3.77, 'ratings': 355, 'reviews': 145, 'histogram': [56, 31, 35, 42, 188], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '128k', 'androidVersion': '1.5', 'androidVersionText': '1.5 and up', 'developer': 'Nolan Lawson', 'developerId': 'Nolan+Lawson', 'developerEmail': 'nolan@nolanlawson.com', 'developerWebsite': 'http://nolanlawson.com', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5822261441264587656', 'genre': 'Music & Audio', 'genreId': 'MUSIC_AND_AUDIO', 'icon': 'https://lh3.googleusercontent.com/Dvd9G_OUKVOia2BbdVe-5ad-b5VD5ijA5yqPcJ0dTXwFCGbjxrSEvX6CVjrgAyzSny8', 'headerImage': 'https://lh3.googleusercontent.com/d5LBWaamFYhGM8EVkurZMmbYgtUy1weHYI5VUtrLtBAKstfyxeuGsLUV0iI6TfbpOA', 'screenshots': ['https://lh3.googleusercontent.com/bBTbz1tJ2Pas7VP0pEL9jZz2KfiN6ttgGRXeccWNBVAgku_jp7Ih8aV32W9MdSp73tQ', 'https://lh3.googleusercontent.com/RtzY46Mpym6yGZ6YnCY8qxTRpeG7CN8S0U2ch9kGSHTdzs3jp6Od_HDhfS-0Dwm3EA'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Oct 13, 2010', 'updated': 1331661485, 'version': '1.0.1', 'recentChanges': 'v1.0.1\r\n- Fixed a small typo.\r\n\r\nv1.0\r\n- Open-sourced the app.\r\n- Removed ads.\r\n- Added multiple note namings: English, Northern European, and Southern European.\r\n- Popup now shows multiple guitar fingerings.', 'recentChangesHTML': 'v1.0.1<br>- Fixed a small typo.<br><br>v1.0<br>- Open-sourced the app.<br>- Removed ads.<br>- Added multiple note namings: English, Northern European, and Southern European.<br>- Popup now shows multiple guitar fingerings.', 'comments': ['Its a really great app, but i could not afford to pay for it, i wish that i could, its will be awesome!!', 'for anyone who cant use it anymore, use chord scrapper/ ultimate chord save. the app have same features like this', 'Note that the version as at Mon11feb13 does not work with Nexus 7 and Nexus 10. When you a choose chord you always get back a Blank Screen.  It appears to work on Android 2.3.5 phone.  Pity.   Gave 2 stars as probably its quite good from other comments.', 'I tried this app several times and got the Google results, however, they were not imported or incorporated into the program, despite numerous attempts. If anyone has any suggestions as to get better results, I am willing to listen. And, May be willing to revise my rating:.', 'Genius :) but now its not working-wont show any files but i can access downloaded songs through my file manager on phone-but not the same..  PROBABLY MY CRAP PHONE!', "This is one of the best app ever. I have finally found what I was looking for. Thanks you you are a life saver. One last thing if we could save the  chords and music into an account in case we switch phone or when our phone has been reset it would be PERFECT because we won't have to look for all the songs we have saved before. Anyway thanks a lot for this app", 'It worked perfectly a coule of years ago... (htc incredible s, lenovo p780). Currently i am using a Zenfone Max and it does nothing!', "I had high hopes for this app. What a complete let down. Wouldn't open anything. The search function worked wonderfully, but clicking on links? Nope. Opening chords? Nope. Complete fail. Uninstall. In less than two minutes... That's got to be a record...", "Very nice app, small size. Surprising tool to get the chords straight from the Internet! But the inability to select a custom folder to keep the lyrics makes it unusable: I have more than 2000 lyrics/chords separated in a folder \\Lyrics and sub-folders A, B, C, etc (same standard as Evil Lyrics), and sync this folder with other devices via Dropbox. And other applications access the same folder for the lyrics. I can't move the 2000+ files to the app's custom folder.", "Loved this app had it on my tablet and my old phone was brilliant and easy to use. Unfortunately since I got my Galaxy s5 it works to the point of finding songs and letting me edit them but I can't find them once their saved as there is no where to access the menus. Was 5 stars on my other devices", "I haven't been able to get it to work. Every time I try to get chords it gives me an error. Great concept if it worked.", "Great app.. but recently i'm facing a problem with loading searched sites..", "A brilliant app, exactly what I was searching for and more. Great to have a few songs lined up for when someone whips the guitar out at a party and you can't quite remember everything you know. Very intuitive controls and some neat features.", "Before i can open my file but now i cant browse the file folder? Any advise guyz what's the problem?", 'has been excellent.until recently. does not link to any chord sites anymore...  :-(', 'I love this, search using Google, save to SD and transpose; all I need. But crazy battery usage for some reason', 'If you are looking for that app to transpose the chord, this is the app. As a bonus, it has web chord detection feature and allow you to save the chord. Superb little app! Consider this one of my staple!', 'So far I imported 3 songs without any problem. This is very nice app. Thanks a lot !', "16 is the largest size for fonts and I still can't read the text as clearly. Pls include a larger text size nxt time for your update. Thanks in advance :-)", 'Will not open any web pages to find songs. He should pay us to install this thing. 0 stars.', "I really liked this app, but now i can't open search menu, transpose, save, etc on my new phone. Please fix and i'll give you 5 stars", 'Hey guys I just love this app but just if ull could get the auto scroll facility in this app it would be the best app I ever had n except that its THE BEST APP !!!!!!!!', "This used to be my favorite chord app, but it hasn't updated in years so it won't work anymore on my Pixel. :'(", 'used to work beautifully but has stopped all of a sudden', 'Absolutely no results for any song I search for. Worked before ROM update. Toshiba Thrive, ICS 4.0.4 ROOTED', 'Would love to have ability to create a setlist. Would be willing to pay for features including sharing and saving to alternative formats in the future.', "Doesn't work on my Note 10.1 tablet.", 'Good job,just a little bit fix about backround art,font & auto scholling......', 'It does what it says but the feature to add your own songs with tabs is missing.', 'Mejoren transposición de acordes,  es muy torpe la herramienta,  gracias', 'Working great on Samsung Galaxy Young gt-s5360', 'This app is not working, plz help this app is not showing chords', "Nice and simple. Would be excellent if  combined with Guitar Songs' features.", 'I personally use it in my music class instead of sheet music.', 'The app is awesome, I use it to transpose and manage the chords for capo', 'If only its not so hard to figure out how to save it', 'See above.', 'I have beginner level in guitar playing.  I loved this app', 'Install this app guys:)', 'Recommend it to every musical person!!'], 'appId': 'com.nolanlawson.chordreader', 'url': 'https://play.google.com/store/apps/details?id=com.nolanlawson.chordreader&hl=en&gl=us'}
