{'title': 'Expenses: Simple Tracker', 'description': 'The open source finance app - free, quick and powerful. Track your expenses with minimalistic interface. \r\n\r\nFREE: Expenses is designed to be free with no distracting ads. It is fully open source and supported by donors. \r\n\r\nQUICK: Expenses provides only essential features. You can track your budget easily, even offline.\r\n\r\nPOWERFUL: Expenses gives you the power of managing your spendings by tags. Customize the app to your needs. \r\n\r\nOther features:\r\n• Expenses filtering. Spent today, this week, this month or all time.\r\n• 100+ available currencies.\r\n• Exporting to Excel (.xls).', 'descriptionHTML': 'The open source finance app - free, quick and powerful. Track your expenses with minimalistic interface. <br><br>FREE: Expenses is designed to be free with no distracting ads. It is fully open source and supported by donors. <br><br>QUICK: Expenses provides only essential features. You can track your budget easily, even offline.<br><br>POWERFUL: Expenses gives you the power of managing your spendings by tags. Customize the app to your needs. <br><br>Other features:<br>• Expenses filtering. Spent today, this week, this month or all time.<br>• 100+ available currencies.<br>• Exporting to Excel (.xls).', 'summary': 'Beautifully simple finance app for tracking your expenses for free 👍', 'summaryHTML': 'Beautifully simple finance app for tracking your expenses for free 👍', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.27, 'ratings': 165, 'reviews': 85, 'histogram': [13, 4, 8, 36, 102], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '7.6M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Nominalista', 'developerId': 'Nominalista', 'developerEmail': 'the.nominalista@gmail.com', 'developerWebsite': 'https://github.com/Nominalista/Expenses', 'developerAddress': 'ul. Grodzka 42/1\n31-044 Kraków', 'privacyPolicy': 'https://github.com/nominalista/expenses/blob/master/privacy_policy.md', 'developerInternalID': '5752771178972609704', 'genre': 'Finance', 'genreId': 'FINANCE', 'icon': 'https://lh3.googleusercontent.com/b6WrgW7EsxQ3iA4wyR1Gr8vzqczsBB-3jkWQ8roG6f0yEyJlNjqfWa82RNjxch5fZRc', 'headerImage': 'https://lh3.googleusercontent.com/0P5AbVaAbXrxcuuZQZt5hD5MgzxW0td1yMRin8uqMDW2W8AD21nosYOXEFE9UYLQMQ', 'screenshots': ['https://lh3.googleusercontent.com/iI_vWaCGIZLdmbZ6vyCGwNPl0IRCJXnm3YLaXW3qLAb-y6X2Mpvwx80P-gfKAOU1PQPh', 'https://lh3.googleusercontent.com/BLoS6FfD-n_IdrPw6r6q50ciZQKT9_NTEvCpmyxv8kQwKI7xWVl-DK9dmzjD-xGvbw', 'https://lh3.googleusercontent.com/6xRpQOnYDvHAErmaoIgb7HW_qB8BPt29rcjiAWiXXRiBsyo0mpPGYuOnAuPFQqavM6E', 'https://lh3.googleusercontent.com/u1OL_wDVtRA0xCl0MaIhKvI79P62-3jSfzN5OC0oe0CXYqWobxNd5PDd8fP6ddkYVg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 19, 2018', 'updated': 1580845811, 'version': '0.4.3', 'recentChanges': 'Fix crashing the app when trying to delete all expenses.', 'recentChangesHTML': 'Fix crashing the app when trying to delete all expenses.', 'comments': ['The "bare bones" nature of the app is pretty great. I just wish there were a few tiny additional things in it. For example, you can choose to display only expenses from Today, This Week, This Month, or All Time. Why not add a Last Month option so one could easily compare what was spent Last Month with This Month? If you decide to edit an expense to add another tag, it will clear out all the previous tags you had on the expense, which obviously is annoying. It\'s up to the user to create tags, which is fine if you have some categories in mind. But it wouldn\'t hurt to perhaps have a few groups of tags that one could decide to install (i.e. general categories and more details categories). That may be helpful to those uncertain about the best categories to use.', 'Really smooth UX and simple design. Really recommend if you just want to know how much you spend without spending hours understanding how the app work. it took me a second to figure out how to do all the main actions. 100 out of 100✨🤓', 'Fantastic! Simple yet powerful expense tracker, a breeze to use and entering expenses is quick and painless. Thank you! PS,. One request: ability to edit existing tag names (ie change tag name yet keep existing tagged relationships, without having to go thru numerous expenses to retag)', "Where's my money gone? Simply input everything you spend in a shop etc at the end of the month I transfer data to excel. Helps highlight where I've wasted money. Not really for bills more for your pocket money.", "Good app for tracking expenses but the app doesn't show previous monthly expenses. It shows only present month, day, week and all time.", 'Nice and simple but facing crashing app quite a couple of times...also need some improvements like search function to find some old entry, add image of invoice against a new entry for better experience', 'We want you to add the obtion of selecting a particular month or week to show what we paid at this period', 'Love it. Use it see where my cash disappears to. Begining of ,week, $$$ - end of week 0. Where did it go?! Now I know .', 'Very nice, simple and straight app but needs a "Deposit" and "Balance" to be a perfect one.', 'Clean and simple. Helps when on the road and expenses pop up with every move.', 'Very useful app with a neat ui. @dev can you look at the possibility of implementing sort by descending order of cost and filter by items greater than a specific cost.', 'Been looking all over to find a simple app to keep track of my expenses for a project im doing and this was perfect!', 'I need to edit tags names. Problems with exporting to excel sheets', 'Please fix crashing as soon as you open...I need to access my expenses', 'App getting crashed after clicking " Delete all Expense "', "Can't save data. No income option just expenses", 'Simple and ad-free', 'Simple and easy to use', "Absolutely love it, minimalist expenses tracking app that's perfect if you just want to track your spending. Spend 3€ on coffee? It takes 2 seconds to add it. Thank you for developing this!", "A truly well done expenses tracking app. I'm currently studying user experience/user interface design in school, and I have to say the simplicity and easy of use this app provides far exceeds the countless other budget apps I have tried, including those from large commercial entities. It is certainly a pretty simple app at this point (not a bad thing) and could use some careful expansion into things like cloud sync, auto-adding from text messages, and a negative entry feature for things like partial refunds, credits, etc. But still overall a keeper at this point.", "Thank you for sharing this, simple app, I like it. It would be cool to have a sum of the expenses when using multiple currencies, there's probably some free api for that. Also it would be cool to have landscape layouts. Cloud saving might be complicated, but import from xls would also be a cool feature for backups. Extra points for open source.", 'Nice app! Simple, easy to use. Great for tracking expenses over different periods of time. And for another use, I personally I set it to "This Month" and enter only my normal monthly bills and keep track of which monthly bills have been paid each month and how much for each/total.', 'Only supports Excel import/export but not any other financial-specific files (ie. QIF)', "I wish I could give this app 4.5 stars. This is exactly what a expenses tracking app should be. Only thing I'd like to see added is an account feature so that your expenses can sync for example if you were to buy a new phone. Great app.", "Love it!! It's bloody amazing. And simply easy to use. No necessity to learn the app and it's intricacies - just simply enter amount spent, enter item spent on, and everything else is optional. KISS. I absolutely love it! Cheers guys. Kuntong Knight", 'I like how simple and fast it is, only two essential options missing in my opinion. Widget, so the expenses can be added without starting the app and cloud sync in case of data loss.', 'Have just tried this app and love the simplicity. I am however struggling to find the excel file that I have just exported, will continue to search and will update this review when I locate it.', 'Nice app for day to day expenses', 'Excellent program just as I wanted just expenses that I can categorize and watch my weekly and monthly basis. Print out would be nice but not imperative', "Love it very good service it's help me to manage my expenses and lots of things", "Simple, easy to use purchase tracker. Ideal for keeping note of contactless purchases where you don't get a receipt", 'Easiest and Swiftest Expense recording app. Tags based organisation is great. Has spreadsheet export. Needs data backup into G Drive.', "I don't have Excel. So I can't export my expenses for the month. Not good. Otherwise very simple and easy to use.", 'Lost almost two weeks of data. If you use this app back up everyday and do not update . Not for seriuos use. Made a big mistake trusting this app.', 'The best I have ever experienced, it helps me a lot with personal expenses. As I am a college going student it helps me a lot. Thank you for you cool application.', 'Its an Nice app.. the interface is so clean.. One thing missing is adding Income', 'Simple, easy to use and it does what it says it does.', 'This app is awesome. Good expense tracking app', 'The best app for tracking your expenses!', 'Simple and straight to the point. Love it!'], 'appId': 'com.nominalista.expenses', 'url': 'https://play.google.com/store/apps/details?id=com.nominalista.expenses&hl=en&gl=us'}
