{'title': 'Null Launcher', 'description': 'Null launcher is a launcher that does nothing. Yes, really. It\'s useful when combined with Wave Launcher, Swapps, and similar.\r\n\r\nAfter installing, press your home button. Then, depending on your Android version, either check the "Use by default" box and tap Null launcher, or tap Null launcher then tap "Always."\r\n\r\nIf you\'ve accidentally switched to Null Launcher with no way to get out, pinch-zoom on the wallpaper and you can change back to your old launcher.\r\n\r\nNull Launcher is open source: get the code at .', 'descriptionHTML': 'Null launcher is a launcher that does nothing. Yes, really. It&#39;s useful when combined with Wave Launcher, Swapps, and similar.<br><br>After installing, press your home button. Then, depending on your Android version, either check the &quot;Use by default&quot; box and tap Null launcher, or tap Null launcher then tap &quot;Always.&quot;<br><br>If you&#39;ve accidentally switched to Null Launcher with no way to get out, pinch-zoom on the wallpaper and you can change back to your old launcher.<br><br>Null Launcher is open source: get the code at .', 'summary': 'A launcher that does nothing.', 'summaryHTML': 'A launcher that does nothing.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.99, 'ratings': 937, 'reviews': 343, 'histogram': [187, 9, 46, 74, 618], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '12k', 'androidVersion': '2.2', 'androidVersionText': '2.2 and up', 'developer': 'Michael Howell', 'developerId': 'Michael+Howell', 'developerEmail': 'michael@notriddle.com', 'developerWebsite': 'http://www.notriddle.com/', 'developerAddress': 'Michael Howell\n934 West Morelos Street\nChandler, Arizona 85225', 'privacyPolicy': 'https://notriddle.com/privacy.html', 'developerInternalID': '8989509321799811616', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/3Jv3TK2rpQwiOZLOkuhgr8JSMy4N1c7GbLwX_9LuO-xFec6hjic_sJM5z-8Q1L46XME', 'headerImage': 'https://lh3.googleusercontent.com/nkjlcDh_TuBDY8yUB2EF3nP6NiWBYUK_b5wqaROLpDTW-XZ0Iq6mVf8g-FDQtqP0hh2L', 'screenshots': ['https://lh3.googleusercontent.com/n9n088J_hcRorzZ-Cj-fnW1tchT1Vz7FgcjQc8AebEySIIGBrx7yCdlVJ77MCiGPVSE', 'https://lh3.googleusercontent.com/kIOU5jMwd4Ni_coesytJPrpTBbCY1BjtLP__XLhSrQ9i4b6kS-Km_cnHNTPto64itA', 'https://lh3.googleusercontent.com/Ypy5bFVsDrD1l7k3_IJWN4NAQnzToGEWNpcIruvgZZgQNY59QxUU-pWo8IKBmUOOvA', 'https://lh3.googleusercontent.com/z5eoTdqXZVURAk4mBBpwncgr9hMccbmAWS1BhAsnYwYVXngpsmF0lSI4n17ctjArtg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'May 27, 2013', 'updated': 1394927572, 'version': '1.3', 'recentChanges': '1.2:\r\n - Android 4.4 KitKat transparent system UI.', 'recentChangesHTML': '1.2:<br> - Android 4.4 KitKat transparent system UI.', 'comments': ['Please update to the latest SDK, I need it very much, and it reminds me how simple it was back then.I searched a lot for a launcher like this and found it more than half a decade ago. I appreciate your work.', "Description doesn't do it justice. It says this launcher does nothing - However, I did manage launch Apollo 2019 from my back garden, wirelessly. I know the first mission computers were no more powerful than a pocket calculator, but Michael, you stripped this right back and still pulled out all the stops for first contact. Stellar effort!", 'much better than the old version but still need to make nav bar & status bar tranceparent', 'bug: always open recent app after unlock. req: give some setting to change 1. wallpaper and adding widget (need one for big clock and date). 2. gesture. overall: fantastic, this is what i need.', 'Nice. As described, & seems to use no background memory.', 'works 100% Better On Moto Than LG OR SAM', 'Please fix being shown on recents.', 'Everytime after unlocking the phone it showed recent apps list.', 'This version is better than the old one !', 'useful for destop os like phoenix or remix os etc..', 'get rid of resants make it a true black screen', "Doesn't support android 9 gestures", 'Brilliant companion to Jina Sidebar.', 'Pls add support for live wallpaper interaction', 'This game sucks! I cant even open it!', 'froze zone! not good!', 'literally nothing? that is what it is made for though so 5 stars', 'damn the very best app that DOES NOTHING!!!!!!lol', 'almost ruined the features of my phone', "doesn't do anything", "very kak experience.( don't try)", 'screwed up my phone.', 'made my phone stop working', 'this app ruined my phone', 'get rid of resents', 'Wonder full app', "eh i don't know", 'no app instructions', 'ruined my phone', 'bad app I hated 😡', 'No ram usage, perfect for older devices or devices you wish to squeeze the ever living performance out of. Its perfect, i use it with Systemui disabled as well and with gmd it is perfect to get your devices full screen realestate and increase battery life.', 'Best way to keep your home screen clean and the resource usage low. Very useful when combined with alternative launchers (Home Button Launcher, SwipePad, etc.). What I would like to see is an option for portrait wallpaper and for disabling the zoom launcher choise menu but whatever.', "Coupled with GMD gesture control, it's awesome.  Someone suggested having some gestures by default, that is an costly event in terms of ram (compared to pure this). I say make a sticky notification to launch the stock app drawer instead", "Does what it says, but it would be nice to have some options. Hitting the menu button does nothing. I'd like to be able to hide the notification panel entirely. Not only this, but my device supports a transparent notification panel and it doesn't work in this app. Also holding the menu key to perform a Google search stops working I'm this launcher.", 'Hey, love your apps, but I was wondering if you could maybe add the option to hide the status bar? Thank you. Preferably with a gesture to display it again. Forgot to add :)', "installed these one, set it at Home, disabled both of Samsung TouchWiz packages, and only that way device will reboot normally without stucking on samsung logo at boottime with refusing to load any GUI. As stupid stock ROM just need something treated by it as the Home launcher to be activated to boot user's and system's stuff that seating in autostart list and providing an advanced way of use.", 'Its good. But the problem is that it always shown in the recent tabs. And also please remove the pinch gesture. Put totally nothing. We can change it by going to settings.', 'This launcher works great and serves its purpose well, the only issue I have is that every time I unlock my phone it defaults to the task switching screen. If this is fixed, it will be flawless.', 'One problem recents keep popping  up after u turn phone off than back on', "With the bar launcher, and my device's built in search this is perfect.  The ability to long press would be great however.  Maybe nest that in an add-on module"], 'appId': 'com.notriddle.null_launcer', 'url': 'https://play.google.com/store/apps/details?id=com.notriddle.null_launcer&hl=en&gl=us'}
