{'title': 'Budget with envelopes', 'description': "Avoid overdraft fees, unexpected shortages, the minimum payment treadmill, and that sinking dread when you realize you actually couldn't afford to go out.\r\n\r\nThat's what Budget is for, and it's easy. You put money into the envelopes at payday, and take it out as you spend. An envelope can represent anything — a bank account, money set aside for groceries, or the cash you're saving to buy that new Android phone off-contract. Think of a checkbook, only more flexible.\r\n\r\nManaging money is a drag, but it doesn't have to be painful or difficult.\r\n\r\n\r\nHOW TO HELP OUT\r\n\r\nBudget is currently unsupported, but it is open source: get the code at .", 'descriptionHTML': 'Avoid overdraft fees, unexpected shortages, the minimum payment treadmill, and that sinking dread when you realize you actually couldn&#39;t afford to go out.<br><br>That&#39;s what Budget is for, and it&#39;s easy. You put money into the envelopes at payday, and take it out as you spend. An envelope can represent anything — a bank account, money set aside for groceries, or the cash you&#39;re saving to buy that new Android phone off-contract. Think of a checkbook, only more flexible.<br><br>Managing money is a drag, but it doesn&#39;t have to be painful or difficult.<br><br><br>HOW TO HELP OUT<br><br>Budget is currently unsupported, but it is open source: get the code at .', 'summary': "Take control of your money. It's easy.", 'summaryHTML': 'Take control of your money. It&#39;s easy.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.02, 'ratings': 171, 'reviews': 78, 'histogram': [11, 5, 30, 42, 80], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '288k', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'Michael Howell', 'developerId': 'Michael+Howell', 'developerEmail': 'michael@notriddle.com', 'developerWebsite': 'http://www.notriddle.com/', 'developerAddress': 'Michael Howell\n934 West Morelos Street\nChandler, Arizona 85225', 'privacyPolicy': 'https://notriddle.com/privacy.html', 'developerInternalID': '8989509321799811616', 'genre': 'Finance', 'genreId': 'FINANCE', 'icon': 'https://lh3.googleusercontent.com/1054OwsTk9G5hZiY6GRTNbKfnzxiF04nqZivLawqRyIQ6dJgz3WQgY8NrjhFCpjH2ac', 'headerImage': 'https://lh3.googleusercontent.com/1G98wgNBQ-cZ2wc_dh5R5NXYjwlCNHQW1b_3M4s3ZPvD4nz4uLwMmlqihrBlPhoJR5g', 'screenshots': ['https://lh3.googleusercontent.com/iXoSBIDVenWn8-oPqQDc7-1Qxn_UIeoPAYK0iQ2YcRnUfRpLBinGelFJ78MWpCShLbs', 'https://lh3.googleusercontent.com/EL_ahWUNvUt2JJx3RkPTY4FTyZIGJDlhy2Qn-0csoe2QKesRE7IhtFkalkAVs8yQXQA', 'https://lh3.googleusercontent.com/A-yDog8ua_zViS1ibx_LAjr10QNvbRh0-VVVbYa_JuRdjeTeqa7nFxwppeoLG5M0CQ', 'https://lh3.googleusercontent.com/AOTGUjOmI656v9hNz3815VfSCtCK84pIs99Qde4LRMUlFbi1EMyyEmQjw2Z779gST8Q', 'https://lh3.googleusercontent.com/zPvh4S_YNyMoVAoKz7w8ld-K5MIlA9ayyXAn-atRAjYQdpDS0HbWL12_Y4n5z31Fn20', 'https://lh3.googleusercontent.com/i3AdDwsNdFomN1SUyBoui3KO6zq_NQ80jrzKLf-LySNLNt4OcQqSpqLPxkq1G8tfAOU', 'https://lh3.googleusercontent.com/cxNUwdxYpKlNg9xG0MXAr1epD3hRQ-HQmIskHj8cnZrqFlepmzo-xA6DC5YgUPoFloSZ', 'https://lh3.googleusercontent.com/BCz3NXXzk4BDsgUfH-5sfWAwzB4kwhe6WGswia2dWJGaAoJraZHCRSjnpmyRQ1r0GA', 'https://lh3.googleusercontent.com/4laTzxsMPB9KXY7shAVJy-Rtrv--5poFEz7SGuT3hVXTXq9ze4HcYGbcEmpzcXYkWQ', 'https://lh3.googleusercontent.com/hPMRO6ReopgJD1R1oc587FlmGNv8WuOUHOL2B_QpJi1FZ04dyUPOc5IxIjNCO4JeJj8'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 9, 2013', 'updated': 1465610543, 'version': '4.3', 'recentChanges': '4.3:\r\n\r\n* Redone navigation and interface cleanup.', 'recentChangesHTML': '4.3:<br><br>* Redone navigation and interface cleanup.', 'comments': ["I use this app to track day-to-day expenses. You put your budgeted items and amount on each envelope and add or subtract daily as needed. Great to use with debit or credit cards to know quickly what you have on hand. It's simple, easy and just what I wanted for an envelope system on my phone. There are no updates, you get what you see... Simplicity.", 'Oh my god....I am such amazed to use this small 100kb apps, Somedays ago My uncle advised me to buy a khata and write down day by day expenses so that I can manage budget. I found this app while installing your another app *CleanMusic* and checked apps. At first I was confused how to use this app but after some times now the application is in my control. But you should add some features like backup in google drive , Recycle bin... Etc. Anyway this app is so cool', 'I love this app. I needed a simple way to track separate budgets like groceries and gas money that was in my bank account for future use. I would give it 5 stars if the app could be shared with my husband and updated real time. Then we could both update the app and be aware of each others spending. It would also be great if I could manage more than one account with separate envelopes in each account (eg. checking: grocery, gas, clothing. savings: vacation, car repairs, emergency)', "Lovely app. However looks like it has been abandoned. My envelopes just wouldn't match with my cash. After using for a month thinking I was doing something wrong, I went back to GNUCash and all my accounts started to tally which probably means there is some bug in the app or I was making some mistake. Enjoyed the simplicity and design but will have to uninstall.", 'One of the easiest app I have used. However, not able to share with anyone to keep up with all transactions.', 'Works great for me.', 'I have tried kinds of envelope budgeting apps and I have lost count of how many of them I have uninstalled. This one is clear, easy to set up and sooooo not complicated. You add your money to the envelopes and enter what you spent. BAM! Done. No figuring your budget based on when you get paid and all that complicated stuff. Just you and envelopes. Plus if you have a question or problem, the creator of the app will actually reply to you and very quickly. Thsns so .much for making this app!', "This app doesn't crash, which puts it ahead of some other envelope apps i've tried. However, its features are really lacking. Settings don't work, envelopes can't be edited, the interface is so streamlined that I can't features I need. This app is half finished.", 'love how simple it is. Easy to edit payments or remove, once u play around with it a bit to work it out. Graph only works if u go into envelopes and hit the paint bbrush to assign a colour to each envelope. Took me ages to work it out.  Needs a simple tutorial or q&a', "I love this app! Here is my tutorial of what I learned so far. Budget screen - + button let's you add envelopes ( type in name, paintbrush lets you change colors) up arrow let's you put in paycheck, side arrow lets you  transfer funds between envelopes. swipe left to delete any envelopes you don't want. They will be in alphabetical order unless you capitalize one and it will be first Paycheck screen- put in the amount of your paycheck. If the envelopes have an amount in it already delete the amounts and put in your amounts. When you have it all distributed hit ok Envelope screen- down arrow lets you put in an expense, up arrow lets you put in an earning , paintbrush changes the color. Any thing you want deleted swipe it away. Hopefully this helps someone I actually deleted it and started over before I figured out how to do the paychecks😁", 'I HAD to review this app. I was not looking for a budget/finance app with all kinds of bells and whistles like so many out there even ones that say "Envelope Budgeting". What I needed was tracking cash in actual envelopes which is pre-budgeted, as in $150 for groceries for half the month (pay day is 1st and 15th). This works beautifully and simply. I almost deleted it though in frustration when I entered an expense and needed to delete it and couldn\'t figure out deleting. Swipe left worked. Yay.', 'Just what I needed! The only reason I give it 4 stars instead of 5 is because occasionally I will delete an envelope by mistake and unless you\'re quick to click the undo button, it is lost! If you forget the balance in the envelope you\'re up the creek! Would be nice to have a confirmation pop-up "Are you sure you want fo delete "X"?" to ensure that accidental envelope deletion is less likely. The swipe left feature WITHIN the envelopes is great, though!  Such a simple yet elegant app. With one minor tweak, I\'d give it 5 stars.  Also, EXPORT function doesn\'t seem to do anything for me, though not a dealbreaker.', 'Good app, exactly what I wanted to replace a spreadsheet. Wish I could turn off the graph though waste of space. Nice simple app for those use to a simple system', 'I have been looking for an "envelope budgeting" system, and this is the best! It is so easy to stay within my budget, because I see how much I\'ve spent, and how much is left. A wonderful money management.  I have been using this app for several years now, and would be lost without it! Thank you for such a simple yet very effective money management tool!', "Love this app. Has helped me soooooo much. Only wish there was more colors \nfor envelopes. I have envelopes for like everything and I Have more then \nthere are colors. Just don't change the format please or it will totally \nmess me and probably others up", 'Good app, but I think you could reach more users if it had a dark theme and an option to disable the graph.', 'Excellect app does the job i was looking for. Can handle every account yet \ngive u an overview balance standing. Salutations for the developer!', "Ok in paychek to distribute doesn't work...why?", 'Good app to track budget without being over complicated. Would love it mpre if the graph can be customised.', "I like the app. I just wish thee was a way to move the 'envelopes' around so I can have the ones I use the most at the top.", "Won't open.", 'I love the simple ease of use. Perfect fit for me.', 'I really like this app because it looks good and is just simple to use.  It would be nice if envelopes could be set to automatically refill based on the month. And in case anyone is wondering, to delete an envelope just swipe left. That wasnt immediately clear.', "Cash is the way to go for budgeting and I tried Good Budget for several months and it's just over kill. This is simple and easy. Add the money, take it out or transfer it. Please don't add a whole bunch of other features. The beauty of it is that you can add lots of envelopes. When you think about it, paying your bills didn't get you in trouble with the budget, it's the other ways you spend your money that are the problem. Really happy to have finally found something that works!", "I haven't worked out how to delete envelopes or mistaken entries yet (I don't think you can) but otherwise it's working great. You can color code envelopes, add a note to any input or out put and it doesn't pressure you to keep to a schedule like some other apps. A handy way to record where your money is going and where you want it to go.", "This is the only app of its kind. There are many budgeting apps, but this is the only one that very simply does one thing. No connection to your bank accounts, no dropbox sync, no default list of 150 spending categories. You put money into an envelope, you take money out of the envelope when it's spent. Plain. And. Simple. And, it looks good too!", 'I use this App to keep track of my money. It always gives me a clear conciousness of my finances. Also, discrepancies between the values in this app and my wallet/bank account will alarm me of unforseen/overlooked transactions. Many thanks to Michael!', 'This essential feature is missing. Also, long-clicking an area should bring up options to delete it. Very unpolished.', 'I would give it 5 stars but it seems to be missing one important (to me) feature. All of my envelopes work on %. So when I get a paycheck it would be nice to automatically divide it into my envelopes instead of manual entry.', 'Just what I need a nice simple app. Would give 5 stars but needs a zero button so I can start from scratch at the beginning of each month. It would also be nice if you could sort or rearrange the envelopes.', 'Fantastic app to track out goings....but....Please update and add features like the option of be able to Add salaries or money coming in the bank. Also the option of reaccuring bills or expenses. Just a few improving sugestions. Well done so far!', "Seems like it could be a useful app, although I haven't really gotten the hang of it yet. If the UI was a bit more polished and modern I would be included to use it more.", "It won't work for me without a way to sync it with the app on my partners phone. Guess I'll keep looking.", "...widget isn't updating (I've Xperia SP). Please fix/advise? Thank you.", "I like its simplicity.  It's a glorified checkbook register.  I'd like to see a way to delete entries,  reset the envelopes,  and widget updating.  Simple is better!", "This app is very simple and works great. It's exactly what I need to stick to my budget.", 'Just wish I could change the distribution amount each paycheck. good app overall. Does the job.', 'Ad free, simple to use, and works great.', 'A simple and easy way to keep budget on track.', 'This is a very nice app and very easy to use....I love it'], 'appId': 'com.notriddle.budget', 'url': 'https://play.google.com/store/apps/details?id=com.notriddle.budget&hl=en&gl=us'}
