{'title': 'HedgeCam 2: Advanced Camera', 'description': '* Flexible photo and video settings.\r\n* Support for focus modes, scene modes, color effects, white balance, ISO and exposure compensation.\r\n* Customizable user interface.\r\n* Advanced selfie mode. Start shooting by timer, face recognition, or voice commands.\r\n*Control by hardware keys. Separate settings for each key.\r\n* Display the angle of the device.\r\n* Face detection support.\r\n* Automatic image alignment based on accelerometer data. Now your photos will never be overwhelmed by the horizon.\r\n* Support of exposure bracket.\r\n* HDR (High Dynamic Range) and DRO (Dynamic Range Optimization) photo modes.\r\n* Flexible settings of sounds: the ability to turn off the sound of the shutter, select the sound of the shutter (not supported by all devices), adjust the volume of sounds.\r\n* Location of the interface for the right-hander or the left-hander.\r\n* Widgets that allow you to take a single click to take a photo or start recording a video.\r\n* Support for Camera2 API: manual focus distance; manual ISO; manual exposure time; manual white balance temperature; * RAW (DNG) files support.\r\n* Focus bracketing mode.\r\n\r\nThe source code can be downloaded here - https://sourceforge.net/projects/hedgecam/\r\nBased on Open Camera source code.\r\n\r\nIf you want to translate the application to your native language, just send me the language file via email. In the archive with the source code you can find english language file (values/strings.xml) and unfinished language files that were parsed from Open Camera source.', 'descriptionHTML': '* Flexible photo and video settings.<br>* Support for focus modes, scene modes, color effects, white balance, ISO and exposure compensation.<br>* Customizable user interface.<br>* Advanced selfie mode. Start shooting by timer, face recognition, or voice commands.<br>*Control by hardware keys. Separate settings for each key.<br>* Display the angle of the device.<br>* Face detection support.<br>* Automatic image alignment based on accelerometer data. Now your photos will never be overwhelmed by the horizon.<br>* Support of exposure bracket.<br>* HDR (High Dynamic Range) and DRO (Dynamic Range Optimization) photo modes.<br>* Flexible settings of sounds: the ability to turn off the sound of the shutter, select the sound of the shutter (not supported by all devices), adjust the volume of sounds.<br>* Location of the interface for the right-hander or the left-hander.<br>* Widgets that allow you to take a single click to take a photo or start recording a video.<br>* Support for Camera2 API: manual focus distance; manual ISO; manual exposure time; manual white balance temperature; * RAW (DNG) files support.<br>* Focus bracketing mode.<br><br>The source code can be downloaded here - https://sourceforge.net/projects/hedgecam/<br>Based on Open Camera source code.<br><br>If you want to translate the application to your native language, just send me the language file via email. In the archive with the source code you can find english language file (values/strings.xml) and unfinished language files that were parsed from Open Camera source.', 'summary': 'Advanced photo camera and camcorder app', 'summaryHTML': 'Advanced photo camera and camcorder app', 'installs': '500,000+', 'minInstalls': 500000, 'score': 3.9629629, 'ratings': 4123, 'reviews': 2100, 'histogram': [570, 203, 407, 570, 2371], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '2.3M', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Caddish Hedgehog', 'developerId': 'Caddish+Hedgehog', 'developerEmail': 'caddish.hedgehog@gmail.com', 'developerWebsite': None, 'developerAddress': None, 'privacyPolicy': 'https://paste.ubuntu.com/26054932/', 'developerInternalID': '8259738867597986166', 'genre': 'Photography', 'genreId': 'PHOTOGRAPHY', 'icon': 'https://lh3.googleusercontent.com/8B0MC6_3pCnQHnY-QJFZ_eYKPdreCePbr53z8dJjT_nqqIgoyRzJzekRYpOXmB_OVA', 'headerImage': 'https://lh3.googleusercontent.com/IFF15GjpB7LdvSl-EU5m3xoqvV06DI0wCm1UPGu37a40RorfVSVmbSczIqRTcI01Ago', 'screenshots': ['https://lh3.googleusercontent.com/iQsXc9Wf56ATNgfNjxIAXlKkXKkJTjuXDGTJfsl0ptsRE0XrpWAfUnmsj8iJuXYju7Wl', 'https://lh3.googleusercontent.com/kZbM3Jr-vII8mWV7VEHo1rrPDHw6XEl7MWRtcLFCCu71TOQDnkMROWgIMtCw-kXJlSuz', 'https://lh3.googleusercontent.com/ALp1I7CxDt8XS_QY2tSfB4Qab6t2FobOHOUNYTCxP8v-ESCfsTyZUk8xhNwBBLMDEAk', 'https://lh3.googleusercontent.com/Zlu2auOykf5pAJAvATzFZl4KJiqS1VzQpqjhAqFmf71JuRUJJRG-GzHlPudXThEIEfw'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 26, 2017', 'updated': 1575613818, 'version': 'Varies with device', 'recentChanges': 'Updated Portuguese (Brasil) translation (thanks to Ricardo Pereira da Costa)', 'recentChangesHTML': 'Updated Portuguese (Brasil) translation (thanks to Ricardo Pereira da Costa)', 'comments': ['It is a clean ad-free app with relatively simple GUI but nothing "Advanced" here, my built-in camera app has more features than this (anything you install/uninstall leaves junk on your phone slowing down the phone over time so i feel irritated getting fooled by false advertising/misleading name). I\'m happy to buy if an app proves itself with the trial/free version and is reasonable price. It doesnt let you choose lenses on Samsung a70 phone.', "Great application but ill buggy. The application cruses in manual mode when I change settings. Also in a changing from camera to video and vice versa. It sometimes can not detect the camera. I have to close and relaunch the application for it to work. At this stage its not reliable. You never know when it's's going to freeze on you.", "Tell the dev you worked with that this version works better than Open Cam. I was able to see myself on the front cam and while the video screen res did seem to change on its own in the flash menu, it didn't screw up anything. Everyone else? You HAVE to download this app! It has just about all the features a regular camera has--with some exceptions of course. You tinker with whatever settings you need, color and everything, press record, and...FLAWLESS VICTORY!", "A lot better than the stock camera app that came with my phone. The only reason why im giving it 3/5 is because on a few rare occasions the app doesnt saves the photo correctly, and the photos came out pitch black or sometimes only part of the photo was saved. But im hoping this are just minor bugs that can go away with an update. I'll update my review if anything changes.", "Why can't I disable shutter sound? my default camera and several random 3rd party camera apps allow me to disable the sound - here, no matter what option in settings I choose, it just always produces the sound. mi max 3, android 10, miui 11. It's too bad because this app seems to be promising and convenient once you set it up properly.", "Exceptional. I was looking for an app to shoot log and all others including opencamera failed to help me. This is great. Amazing app. I don't have enough money for patreon but I'm willing to give a one time donation(not so large amount) via google pay. How to do so?", "This app, is great because once you enable the API the camera performs really well and it pushes the boundaries that your normal camera can't do. The only downside of this app is once you enable the API, in doesn't shot 1080. I wish to include that 1080..for your next update...", "2 steps away from perfection: step 1 please add a QR reader! It's a basic in 2020 no point having 2 apps for a simple task like this ; step 2 the preview is thighter than the final image , it would be nice to see exactly the final crop.", "This is great, I'd highly recommend this app. The video stabilization doesn't work on my device, unfortunately. Every other camera apps I tried were able to utilize the video stabilization feature. I can't figure put how to get it to work.", "up until now i would have given the app five stars.because it was flawless.i hate bad reviews.but..suddenly we've decided to get stuck in limbo with some unwanted selfie photo stuck on my screen with all of the controlls that lay within its borders unworkable .. ..now today it seems to entertain itself by sticking in macro mode and self firing picture after picture and totally consuming all the memory on my device . Still self firing..forced delete i guess..weeks later still useless..too bad!", 'The interface is better than other app. But 3 is stars is due lie about film in 60 fps. Other app (procam x lite) filmed in 60 fps in the same condictions ans settings.', 'Can\'t find an option to put pictures and videos on SD card. Update: found option to put files on external SD card. Only when I navigate to the card I get a message that says "can\'t write to this folder". All my other apps have no problem accessing the SD card. Updated again: Used Storage Access Framework to change to external SD card. Worked perfect. Now I\'m happy.😀', "For whatever reason, this app can not actually record at 25fps. I'm on a Samsung s10+ (exynos) I set the frame rate to 25 FPS. All other settings are at default. It says in the interface that it's recording at 25fps. But examining the file shows it to be 30fps. I wish I could transfer this low rating to Samsung, who I think is largely responsible for this incompatibility.", 'Would be pretty useful to have an "Output format" quick option on the pop-up menu which would allows the user to choose between JPEG, JPEG+RAW or RAW only, for photos. Or even just an option in the photo settings menu where users could opt to RAW only, given that right we\'reforced to JPEG+RAW or no RAW at all. The app is very well feature packed and the high amount of options it gives the user is indeed a pretty useful and attractive trait!', "Simply the best camera app on the play store. Hands down. I was a avid user of Opencam before giving Hedgecam a shot, and I'm not regretting it at all. You won't find an app that'll give you as much control over your phones lens than this one right here. Worth at least one go... You'll probably never leave.", 'Works fine with back camera. While using front cam, as soon as you start video recording, screen turns darker. Request developer to fix this issue.', "Very natural looking photos, less digital noise than open camera. I use it at 100% jpeg quality. My Galaxy S7 stock app over-sharpens and over-saturates the colors. This is the #1 camera app I've tried.", 'In noise reduction mode taking 50 pictures works, but taking 100 does not. It just waits in an endless loop. Like it actually stores all 100 pictures in RAM. Makes me want to learn android programming. Often creates completely black pictures. Or simply exits.', 'I was loving all the settings, then I find there is no PAUSE button when recording video. So no good.', "The absolute best camera app I've tried on Android. Exceeds all expectations and offers extensive manual control.", "Deserves 5 stars.Only problem is the app always failing at saving photos (it saves videos tho.) Well my device is old and runs on android 4.2 maybe that's what causes the problem. Anyways.... I hope that can be fixed. If that happens im gonna give it 5 stars (does it matter though?)", 'good functionality but power consumption is high.Download this app for its low fps and bit rate opyion(I recorded with 8fps and 2000kbps). but it seems jus consuming the sam battery using original camera app tecording at 60fps and highg bit rate', 'Good but have some flaws. Log is not working properly. Its working only in preview but when video is made it goes back to rec709 limited. Log profile adds even more contrast then usual rec 709. Also strange choppines when using frame rates other than 30fps. MiA3 camera2api enabled!', 'Nice set of features. No control of shutter speed, or aperture.', 'People if you are looking for a high quality Photography app, This is it. I installed and uninstalled about 15 apps before I found this. My Note 8 screen looks amazing viewing thru this app. Full featured, high quality settings. and wonderful results. Honestly. Thanks. Finally.', "Free and full of features. The best option I've found to let me record square video.", 'Worst camera app ever, slow start, crashes often, settings unresponsive, focus realy realy bad, to name a few. AVOID!', "I love the interface and controls. This is a great build of Open Camera. It lost two stars because it just wasted half a day of video shooting. My tests worked, then 5 very long, irreplaceable videos all saved as empty files. It seemed to be working. This happened on external storage, then it happened in the default internal storage. What a bummer. This is a problem I have with all versions of Open Camera on my g900p.04 Sprint Galaxy S5, but it may be Samsung's fault, so try the app anyway", "I won't delve on the other reviews (just smh), but will say this: if you are serious about taking control of your camera you need this app. If your phone has camera2 API support this will give you access to all those regular manual settings, but also will let you adjust noise reduction and edge enhancement. That makes it possible to override overzealous post processing in default camera apps. You can make photos that look more like classic analog ones with noise instead of digital patterns or make overprocessed video (like on LG G6) look really natural, which is amazing.", 'great ui... althrough missing some help and tips at beginning... few bugs here and there.. quality is good.', 'This is great, I use it on my P20 pro, i find it awesome that I can use the 3x lens of my phone and still get 40MP jpeg files, and it is also awesome that it switches to the dedicated lens much more often than the stock camera app the. Images are detailed than the stock camera app which is awesome. It would be great if the UI is tweaked a bit more as it kind of looks a bit dated. Also, it would be awesome if you can have an option to have zoom shortcut step buttons (2x, 3x, 5x etc) that way we no longer have to use the slider that much.', 'Seems like a decent app but i cant figure out how to adjust the shutter speed.', "🌟🌟 So far. Need access to the flash in manual mode and access to 'shutter speed' when the flash IS enabled. The live screen is way off when working in manual; there is no way that the image should appear so dark with the ammount of light and setting combinations. I noticed that there has been no feedback to a number of legit reviews thus far. I want this app to work as it has a lot of features that would be very helpful. Thx", 'More manual control and other features than paid apps. very very impressed. If you are serious about photography with your smartphone, this is THE app!', "it's a very good app, I can recommend it, this app help me to improve my photos, it has a lot things that you can adjust, it's important to have Google camera API unlocked for this.", 'Crop overlay does not work... Must have fix. Without this app is a bust. Back to open camera were it works.', 'A good power up for open camera. But lacking "focus assist" feature.', 'Never took a single picture, just "serious camera error" message.', 'Awesome picture quality with great resolution and auto balance.', 'There needs to be low light mode that uses image stacking to improve detail in high iso.'], 'appId': 'com.caddish_hedgehog.hedgecam2', 'url': 'https://play.google.com/store/apps/details?id=com.caddish_hedgehog.hedgecam2&hl=en&gl=us'}
