{'title': 'DMS Explorer (DLNA Player)', 'description': '<b>This is a DLNA player featuring displaying server and content metadata.\r\nDMC function is also implemented and can be make play back to DMR.\r\nSource code is published under the Open source license (MIT license). </b>\r\n\r\nThis app\'s feature is to information display about DLNA server (DMS) and its contents.\r\nSince the playback function uses the codec of the device, which file can be played depends on the device.\r\nFor example, in the case of movies, if it is a format compliant with the Android standard such as H.264 / VP8 / VP9, it seems playable on almost all devices.\r\nSome devices may be able to play MPEG 1 / MPEG 2 / WMV / DivX, etc.\r\nIf you can not play it, you can launch the external application in settings so please try it.\r\n\r\nAs one of the playback methods, the DMC function is implemented.\r\nIf you have a TV with DMR function on the same network, you can make DMS contents play back to DMR.\r\nIf the DMR supports it, DTCP-IP content playback is also possible.\r\nAlso, if you have a SONY recorder such as nasne, or Panasonic recorder, you can use chapter jump function.\r\n\r\nAlthough it carries the minimum playback function of movies, still images and music, it features a metadata display function of server and contents rather than usability as a player.\r\nSince information on ARIB extension tag (arib:longDescription, etc) is also displayed, detailed program information can be seen if recorder etc is compatible.\r\nAlso, if the program information contains a URL, it will automatically act as a link.\r\n\r\n<b>Remarks</b>\r\n- Although I can not guarantee to incorporate opinions, I will wait for troubleshooting reports and requests for functions etc. from time to time.\r\n- Since 0.7.6, I have introduced Firebase SDK (Analytics, Crashlytics) for collecting crash information.\r\n- It does not correspond to playback of copyright protected contents (DTCP-IP). And there is no plan of correspondence\r\n- Because of development in personal hobby range, equipment is not able to procure sufficiently. It would be greatly appreciated if you have any problems, please contact me with details of the equipment and details.\r\n- Because the chapter jump is not a standard function (it is the manufacturer\'s own specification function), Implementation is required for each manufacturer. Currently this only support Sony and Panasonic products owned by the author. It would be greatly appreciated if you can contact me if you have other manufacturer\'s information.\r\n- The source code of this application and the UPnP library is published under the MIT license at GitHub.\r\nDLNA Player for Android\r\nhttps://github.com/ohmae/DmsExplorer\r\nUniversal Plug and Play (UPnP) ControlPoint library for Java\r\nhttps://github.com/ohmae/mmupnp\r\n\r\n<b>Abount Permissions</b>\r\nThis app is displayed as requesting the following permission.\r\nThese are used for Wi-Fi, DLNA communication and Firebase-crash reporting. And "prevent device from sleeping" is used to continue the Wi-Fi connection during playback.\r\n- Wi-Fi connection information\r\n  - view Wi-Fi connections\r\n- Other\r\n  - receive data from Internet\r\n  - view network connections\r\n  - full network access\r\n  - prevent device from sleeping\r\n\r\n<b>Equipment investigated</b>\r\nDMS:\r\n- SONY nasne\r\n- SONY BDP-S6700\r\n- SONY BDZ-AT 970 T\r\n- SHARP AQUOS LC-40U30\r\n- SHARP AN-WLTU1\r\n- Panasonic DMR-BRZ1020\r\n- Synology DS 216j\r\n- Kodi (Windows)\r\n- Universal Media Server (Windows/Linux)\r\n\r\nDMR:\r\n- SHARP AQUOS LC-40U30\r\n- ONKYO TX-NR 646\r\n- Kodi (Windows)\r\n- SONY BDP-S6700\r\n- Panasonic DMR-BRZ1020\r\n\r\n<b>For those who can cooperate in providing information</b>\r\nYou can use the following tools (PC with Java installed is necessary) to suck out all information of the DMS. Please send this information to me. However, please be aware that it also knows what content is contained in the server or recorder.\r\nhttps://github.com/ohmae/cds-extractor/releases/download/v.0.0.3/cdsextractor.jar', 'descriptionHTML': '<b>This is a DLNA player featuring displaying server and content metadata.<br>DMC function is also implemented and can be make play back to DMR.<br>Source code is published under the Open source license (MIT license). </b><br><br>This app&#39;s feature is to information display about DLNA server (DMS) and its contents.<br>Since the playback function uses the codec of the device, which file can be played depends on the device.<br>For example, in the case of movies, if it is a format compliant with the Android standard such as H.264 / VP8 / VP9, it seems playable on almost all devices.<br>Some devices may be able to play MPEG 1 / MPEG 2 / WMV / DivX, etc.<br>If you can not play it, you can launch the external application in settings so please try it.<br><br>As one of the playback methods, the DMC function is implemented.<br>If you have a TV with DMR function on the same network, you can make DMS contents play back to DMR.<br>If the DMR supports it, DTCP-IP content playback is also possible.<br>Also, if you have a SONY recorder such as nasne, or Panasonic recorder, you can use chapter jump function.<br><br>Although it carries the minimum playback function of movies, still images and music, it features a metadata display function of server and contents rather than usability as a player.<br>Since information on ARIB extension tag (arib:longDescription, etc) is also displayed, detailed program information can be seen if recorder etc is compatible.<br>Also, if the program information contains a URL, it will automatically act as a link.<br><br><b>Remarks</b><br>- Although I can not guarantee to incorporate opinions, I will wait for troubleshooting reports and requests for functions etc. from time to time.<br>- Since 0.7.6, I have introduced Firebase SDK (Analytics, Crashlytics) for collecting crash information.<br>- It does not correspond to playback of copyright protected contents (DTCP-IP). And there is no plan of correspondence<br>- Because of development in personal hobby range, equipment is not able to procure sufficiently. It would be greatly appreciated if you have any problems, please contact me with details of the equipment and details.<br>- Because the chapter jump is not a standard function (it is the manufacturer&#39;s own specification function), Implementation is required for each manufacturer. Currently this only support Sony and Panasonic products owned by the author. It would be greatly appreciated if you can contact me if you have other manufacturer&#39;s information.<br>- The source code of this application and the UPnP library is published under the MIT license at GitHub.<br>DLNA Player for Android<br>https://github.com/ohmae/DmsExplorer<br>Universal Plug and Play (UPnP) ControlPoint library for Java<br>https://github.com/ohmae/mmupnp<br><br><b>Abount Permissions</b><br>This app is displayed as requesting the following permission.<br>These are used for Wi-Fi, DLNA communication and Firebase-crash reporting. And &quot;prevent device from sleeping&quot; is used to continue the Wi-Fi connection during playback.<br>- Wi-Fi connection information<br>  - view Wi-Fi connections<br>- Other<br>  - receive data from Internet<br>  - view network connections<br>  - full network access<br>  - prevent device from sleeping<br><br><b>Equipment investigated</b><br>DMS:<br>- SONY nasne<br>- SONY BDP-S6700<br>- SONY BDZ-AT 970 T<br>- SHARP AQUOS LC-40U30<br>- SHARP AN-WLTU1<br>- Panasonic DMR-BRZ1020<br>- Synology DS 216j<br>- Kodi (Windows)<br>- Universal Media Server (Windows/Linux)<br><br>DMR:<br>- SHARP AQUOS LC-40U30<br>- ONKYO TX-NR 646<br>- Kodi (Windows)<br>- SONY BDP-S6700<br>- Panasonic DMR-BRZ1020<br><br><b>For those who can cooperate in providing information</b><br>You can use the following tools (PC with Java installed is necessary) to suck out all information of the DMS. Please send this information to me. However, please be aware that it also knows what content is contained in the server or recorder.<br>https://github.com/ohmae/cds-extractor/releases/download/v.0.0.3/cdsextractor.jar', 'summary': 'This is a kind of DLNA player.', 'summaryHTML': 'This is a kind of DLNA player.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.61, 'ratings': 412, 'reviews': 259, 'histogram': [90, 20, 53, 41, 206], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.0M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'OHMAE Ryosuke', 'developerId': 'OHMAE+Ryosuke', 'developerEmail': 'ryo@mm2d.net', 'developerWebsite': 'http://www.mm2d.net/', 'developerAddress': None, 'privacyPolicy': 'https://github.com/ohmae/DmsExplorer/blob/develop/PRIVACY-POLICY.md', 'developerInternalID': '5250599545196808513', 'genre': 'Video Players & Editors', 'genreId': 'VIDEO_PLAYERS', 'icon': 'https://lh3.googleusercontent.com/o6EcNoeIIzEn5wToyi7xIZmuMudTb5kQLuM1z96d7XCJe5yf_aaQh0aNWx5oOipO8A', 'headerImage': 'https://lh3.googleusercontent.com/lbhIYtCczz5c1tPNXVNzRjrD9XwNKHrLCxx3JZ-inY6DY7mEsOgbU7DY2ZkodmZvhg', 'screenshots': ['https://lh3.googleusercontent.com/mE2hkx74iL6fO8xSlJrLrPo_eOiFTO62vbixtQXUfCtjcvqYQzN5a3jR9cby8TiGTQk', 'https://lh3.googleusercontent.com/5C601sW2lLfU9kKxIGaRHBeoU1C6kQSQLURsN3BxRDC5ggi9JK9Nz5oYGPu5pimy8w', 'https://lh3.googleusercontent.com/WnaAJOf3W6FIrMYqYYGappIBGLLFIKHZMXpLdRLL5JZoOcHbpgP1AeKH98IBAAE6v30h', 'https://lh3.googleusercontent.com/D2Gedc7iXPGYX7jLTTCKmGLlA1Z1t7hksuKy5CVDoyj1VBm0f3QmezA32lvyaEzrdA', 'https://lh3.googleusercontent.com/QM8dKC5NEjBz_ngEUK6wKNZPgOvKEMPRu90b7qAw-QPF8n8cVoerJyswxPhnBr4NZg', 'https://lh3.googleusercontent.com/dg9KQo3u_OjpJshZcpa7gB6EZ5P-eiVgKh_vnOa-xPzah8FAIPWxdHW0MtdlfJ6kM8Y', 'https://lh3.googleusercontent.com/NNSvbgEHILwtgyaftthSPiSva4IKxsd-R-kdc8H98rCoc1WF5gJJpY-ixUGekaRnuQ', 'https://lh3.googleusercontent.com/LYS2ilXqk2FrjTsTZSPYilvzLCUYy_COYVkhazGS8d1zy5Lz6f-AjTgN0DFZzqcVjA', 'https://lh3.googleusercontent.com/TjfAqsNi6rO3v4ftxBur15y7izRM8AsZ8rTp8jjIDTbvhMeQsw0EYO6TaWSB8PngP4U', 'https://lh3.googleusercontent.com/LCBYEuU4COg7UidTya8_e1c1rvVTv5vhE3BBjGH5YsOEJx9Wzpbog-8iqHZ0DM_qJn0'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Apr 30, 2016', 'updated': 1579006766, 'version': '0.7.55', 'recentChanges': '- Drop support for Android 4.4 and below', 'recentChangesHTML': '- Drop support for Android 4.4 and below', 'comments': ['Hey, this app is great! I wanted to be able to access my home dlna media on my phone without a bunch of B.S.; this app does exactly that!! Thanks!', 'Beautiful UI, Easy detect all dlna appliances but it hangs severely till need to pull out the power plug', 'Works like charm, simple and beautiful UI I tried a few before trying this one none of them were up to my expectations. Thanks devs!', 'Using this app I can play files from my Linux PC with minidlna on my Samsung Q95T TV.', 'reinstall: now the server is found :-) play movie is ok , but no srt subtitles :-(', "Simple, Fast, and doesn't crash! Seriously, I've been trying various DLNA/UPNP players and servers for nearly a month now, trying to strike a perfect balance between free, stable, able to play continuously without crashing, and easy to use and manage across devices. I was almost at the point of giving up, when I stumbled across this app, and it hits all the marks! While it's native player doesn't have all the options of say, MX Player, most of those are easily fixed with a gesture overlay app.", 'No sound when playing avchd files', "First app, after trying about 6 and reading about more, that actually did what I needed...to play back videos from my PVR's. Once I worked it out, it works beautifully...though I did have to disable default video playback by the app, but it gave me the other options on my phone for playback and worked great.", 'This is great app. But unfortunately it shows incompatible in play store with my android TV Pie os (MI TV 4A Pro). This tv has inbuilt chrome cast. I have installed through apk but not showing the app in app drawer. Developer kindly look on this matter.', "Need some improvement, should be possible to browse no just the DLNA servers but the host for media, this feature is the one I missed the most. I like the interface's design, please keep it.", 'So far this is fantastic app for browsing network DLNA servers. Clean and fast.', "Works with popular dlna clients, but I can't hear audio on videos", 'Works well on phone, however on TV box no indication of what item is selected so nearly unusable', "Great app. But I miss a 'Random mix' button when playing music. Also it woud be nice if the app resumed to last played media when restarted.", 'Thanks - very simple, clean UI that lets you get on and do what you want to do.', 'Was working great. Upgraded to 7.47 now doesnt find servers if it aint broke dont fix it.', 'needs default remote control like ones that come with andriod box or firestick 4k. it also needs firestick 4gen 4k support. ones you make update for this i give 5 starts.', 'Great app, works very well but should be on f-droid. Thanks.', 'App tries to connect to many weird servers, but not to my local network. Possibly spyware.', 'Nice app. However, would be nicer with built-in search by title.', 'Stalls, not possible to change audio track, sub track.', "Works in the TV box but doesn't work on the phone (S9+ player, Serviio dlna server)", 'great ux design. works as advertised. no ad clutter. thumbs up', 'Nice DLNA player application..Works great..Thank You so much.', 'Very nice app. Does what it says. How refreshing!', 'Needs a stop playback button.', 'Does what it is supposed to Lists and plays all my MP4 files perfectly', 'It keep searching for devices for eternity, do not recommended', 'Simple, eligant and it works, thanks', 'It plays fine Serviio media on Galaxy S8+', "Can't find my Chromecast.", "Dlna player doesn't play my mkv files", "It won't load", 'Wow works perfect!', 'Fast and Furious 😃', 'Works likes charms', 'It is working with Jio Giga fiber', 'did not find my tv.\U0001f928', "Having reviewed this a couple of years ago I'm happy to see it works perfectly now! Great app", 'perfect'], 'appId': 'net.mm2d.dmsexplorer', 'url': 'https://play.google.com/store/apps/details?id=net.mm2d.dmsexplorer&hl=en&gl=us'}
