{'title': 'List My Apps', 'description': "<b>Question:</b> Hi, I'm new to Android. Which apps must I absolutely have?\r\n<b>Answer:</b> Uhm, give me a minute to pen down the list (again)\r\n\r\n\r\nEver found yourself in this situation? Your friend, uncle, aunt, etc. recently converted to Android and you, being the local tech guru, are now suppose to tell them what to download? \r\n\r\n\r\nSifting through the app drawer is a hassle. What should you recommend? Why? and most importantly: how? A list with appname, market link and optionally a comment would be great, but is no fun to compile manually.\r\nWith <i>List My Apps</i>, the task becomes as easy as checking the app(s) you want to recommend and sharing them as:\r\n\r\n• Plain text\r\n• HTML list (e.g. for blog comments)\r\n• BBCode list (used by many forums)\r\n• Markdown list (e.g. for Reddit)\r\n• Market URL (e.g. for direct sharing via barcode scanner app or importing in Raccoon: http://www.onyxbits.de/raccoon)\r\n• Any custom format, defined through the build-in template editor.", 'descriptionHTML': '<b>Question:</b> Hi, I&#39;m new to Android. Which apps must I absolutely have?<br><b>Answer:</b> Uhm, give me a minute to pen down the list (again)<br><br><br>Ever found yourself in this situation? Your friend, uncle, aunt, etc. recently converted to Android and you, being the local tech guru, are now suppose to tell them what to download? <br><br><br>Sifting through the app drawer is a hassle. What should you recommend? Why? and most importantly: how? A list with appname, market link and optionally a comment would be great, but is no fun to compile manually.<br>With <i>List My Apps</i>, the task becomes as easy as checking the app(s) you want to recommend and sharing them as:<br><br>• Plain text<br>• HTML list (e.g. for blog comments)<br>• BBCode list (used by many forums)<br>• Markdown list (e.g. for Reddit)<br>• Market URL (e.g. for direct sharing via barcode scanner app or importing in Raccoon: http://www.onyxbits.de/raccoon)<br>• Any custom format, defined through the build-in template editor.', 'summary': 'For taking an inventory of your installed apps and sharing with your friends.', 'summaryHTML': 'For taking an inventory of your installed apps and sharing with your friends.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.4074073, 'ratings': 1657, 'reviews': 543, 'histogram': [102, 40, 122, 204, 1186], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '259k', 'androidVersion': '2.3', 'androidVersionText': '2.3 and up', 'developer': 'Onyxbits', 'developerId': 'Onyxbits', 'developerEmail': 'android@onyxbits.de', 'developerWebsite': 'http://www.onyxbits.de/listmyapps', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '6813402359070758301', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/HgDpguOH0OWjEqDvtgohub_zpe1JjhTAx16WIYdEqhfppu0JKFowPra_ycn9kiNi7J8', 'headerImage': 'https://lh3.googleusercontent.com/IFkyRpCl00jOO-5l0UMR2MZtgwH45Gw5_o_rU0KIxWQhiMv5m2cmQ8cc92FG3HhPbBc', 'screenshots': ['https://lh3.googleusercontent.com/YPYD40jphRugxVA_x0Xw5txNEQqNlVfNE7C89yiJNjZIjcYBrCBnppzaxD_X5bHGVyA', 'https://lh3.googleusercontent.com/tjkLcrexIm6ue34u8CQ53M_bQSKIBjNpX7bWt9suNbCuRTKzmr0ot7mKCZd6zFjPYA', 'https://lh3.googleusercontent.com/3G7x0JEHblDavI3-gffoftjSydQ-CpMi1NuSdZkbZjAUm_oPddbqTiiswgWhF7IGQsjQ'], 'video': 'https://www.youtube.com/embed/0PtD8RG8HJ0?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/0PtD8RG8HJ0/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Aug 28, 2013', 'updated': 1469028532, 'version': '3.7', 'recentChanges': 'Deprecated the "quid pro quo" app recommendation feature (it never really worked as intended); Put Raccoon in it\'s place.', 'recentChangesHTML': 'Deprecated the &quot;quid pro quo&quot; app recommendation feature (it never really worked as intended); Put Raccoon in it&#39;s place.', 'comments': ["I love this App. When you have so many apps it's hard to remember them all. Especially since they're all not displayed on your screen. I just open this app and I can see them all. It's convenient to be able to uninstall them right from this app.", 'Did exactly what it said, did exactly what I wanted, and provided an actually useful link to a privacy app that downloads .apk files directly instead of from Playstore, facilitating automation in the process.', 'Had been searching for ages for such an app. Had found a few but this one is *the best* for my needs. Tags, annotations, templates - it has all that I need to try apps, categorize them, and store personal comments to help me search for the perfect app for a purpose, and to share app recommendations with my friends. Autocomplete for tags, option to merge list with other lists and with installed apps, and online sync of list would make it perfect.', 'Makes a list of all of the apps on the phone so that if the phone breaks, is lost or replaced, i can rebuild the apps and not have to remember them.', 'Great way to list apps. If you have a lot of apps, this is a must have!', 'mar 2020 - quite clever app list app. very flexible and easy to use. allows you to define the format of your app list using predefined variables. Bravo👏🏼', 'This app is amazing one of the first apps I install everytime I get a new phone. I use it to list my apps on reddit. No ads, open source, easy to use.', 'Great free app that I use to keep track of my enormous app collection, most of which I never or rarely use. This one I actually do use periodically, and I have done for several years.', "This keeps up whatever after you've ever downloaded in put on your device and have to restore the ones you paid for I recommend everyone to get one of these apps and it's free", 'I typed a long message, but play store decide not to take it, so heres a shorter version - your target user base is smart enough to navigate a directory tree, and they need the save to file feature, which is why it is top of FAQ. Just launch a directory picker and export the file to the selected one, or at least allow exporting to your own directory in the base folder. Everything else is perfect.', 'Very handy for finding installed Apps. Like the sort options.', "Amazing app! Just wish you could filter out the Google native apps to only User Installed. I also wish you made this for the Nvidia Shield. It's not in the store for the Nvidia Shield.", 'Does not allow to list system apps, just user installed apps. As such, it fails to do what i need it to. I have already read your statement about this in on your support site, but it sounds lazy. A simple toggle in the menu, or hidden a little deeper in a settings section would have been a much better solution.', "Neat, wish though it also included version numbers. I've got like 10 apps I keep at a PREVIOUS version because the new ones lost functionality or break things. (Back button, I'm looking at you. STOP it with the noisy ads -- OTOH the earlier version I run doesn't have them.)", 'Great utility to get a list of installed apps. Used it when resetting my phone to know what I needed to get back.', 'Does EXACTLY what I was looking for. Awesome. I had a free Tarot app by the name of "Tarot" and was looking for the full name (the technical bla.bla.bla one ;)). This app provided me with it so I could then find the Tarot App website in the play store. Great piece of work! Thanks.', 'Working for me on Android 10. Sweet, am about to change phones, so reference backup. Not all my apps are from Google Play', "Well between this (select all feature just there perfecto) and plaintext notepad app, I can't remember why I ever wanted titanium backup. Idk why it's so ghastly getting an app like this on iOS someday I hope to buy premium not.enough coffee many that's all there is? Factory reset list.em. well now we can", 'Not found way to export a txt file RATHER THAT COPY TEXT, DEVS, UPDATE!', "Absolutely brilliant. Neat low footprint doesn't snoop and try to sell. I've used this on every phone and rebuild. Mail yourself a list and compare what's missing or no longer used. a definite keeper!", 'I love that the app can make a list of all my apps and can help me relaid any of them. Plus I can categorize them so I can find all my movie apps or music shops etc. I is really great.', 'If it had a displayable list of all the apps with annotations even those uninstalled (and a way to modify it by deleting items of it) it would have been perfect. Very good to export a list with part of your apps and also to keep annotations related to them', 'Needs to include the app store link in default plain text template. By default ${source} app link is not there even though the box is checked in the main page. This causes confusion.', 'I have only used this a few times BUT it has really helped me so much already! If you have a lot of APPS like me I strongly suggest you need to get this!!', 'This app helped me find an invisible scam app that kept spamming me with pop ups. Very useful for managing and dealing with situations like this. Thanks!', 'I seldom do reviews, but this is great! It even has a template editor, you can add your own export definition. Perfect!!!', 'I use this as a backup record of all my apps which I save as email. Both in the event of a system reset or a new phone I have a record of all the apps kept on my phone. I recommend it', 'very useful when one has more than a few apps. helpful when you want to uninstall apps.', 'too limited and outdated. there are plenty of better options.', "As someone who is constantly setting up new devices, this is fantastic for when I don't or can't restore from a backup.", 'So stupid App ist es! I want to sort my Apps by last recent Access time and by the time spent with this Apps', 'Nice straightforward layout, general UI, & User Manual/ Info, with other more specialized options also avail.', 'Does show list of apps but does not allow removal without hunting down the apps found a different way... why not? What is the point?', "It would be great if there's an option to print with app icons (for next installation).", 'This has been very useful to document when my phone will "lose" apps between restarts.', 'Quick and easy, save as text, html, and other stuff. Thank you.', 'Perfect if you constantly install and evaluate apps or manually backup phone.', 'Thank You developers for creating this app. I was in need for an app like this that can make and export the list of all my vast number of app which includes non playstore ones too. Very useful.', "great game quits moving I just wish I could do a little better on it seems like I just can't get the game down yet but I will", "Very, very user-friendly. Easy to use, and beneficial for me. If you don't have it and use it now, get it."], 'appId': 'de.onyxbits.listmyapps', 'url': 'https://play.google.com/store/apps/details?id=de.onyxbits.listmyapps&hl=en&gl=us'}
