{'title': 'OI Notepad', 'description': 'OpenIntents accepts student applications for Google Summer of Code 2012\r\nhttp://www.google-melange.com\r\n\r\n\r\nOI Notepad is a full-featured open source note taking application. With it you can tag, search, and send your notes, in addition to basic functionality such as creating, deleting, and editing notes. Advanced features like encryption, import/export, and voice memos are all available through extensions. All of this functionality is brought together in a simplistic and efficient layout, customizable through a variety of themes. \r\n\r\nThis application is ad free and does not require the internet permission. \r\n\r\nThe source code of this free and open source application is available at: \r\nhttp://code.google.com/p/openintents\r\n\r\nFor the complete list of changes and a list of frequently asked questions, please visit: \r\nhttp://www.openintents.org\r\n\r\nYou can help to improve the translation into your language at Launchpad: \r\nhttps://translations.launchpad.net/openintents/trunk\r\n\r\nFeatures: \r\n* Add, edit and delete notes.\r\n* Long-press on notes to add tags.\r\n* Change font size and sort order.\r\n* A clearly arranged layout with a variety of themes.\r\n* Quickly search through notes.\r\n* Send notes as MMS or SMS.\r\n\r\nAvailable extensions for "OI Notepad": \r\n* Record and attach voice memos to notes\r\n* Import/export notes from the SD card.\r\n* Show the license information.\r\n* Insert the date and time into notes.\r\n* Turn text upside down.\r\n\r\nInternational versions: \r\nBloc de notas OI, Bloc de notes d\'OI, ແພ່ນຂຽນ OI, OI 메모장, OI Blocco Note, OI Blokčić, OI Notatblokk, OI Notatnik, OI Not defteri, OI Notepad, OI Notesblok, OI Notitieblok, OI Notizblock, OI Piezīmju bloks, OI Poznámkový blok, OI Talaan, OI المفكرة, OI خاتىرە دەپتەر, OI يادداشت, OI Σημειωματάριο, OI Бележник, OI Нататнік, OI नोटपैड, OI ਨੋਟਪੈਡ, OI メモ帳, OI记事本, פנקס OI', 'descriptionHTML': 'OpenIntents accepts student applications for Google Summer of Code 2012<br>http://www.google-melange.com<br><br><br>OI Notepad is a full-featured open source note taking application. With it you can tag, search, and send your notes, in addition to basic functionality such as creating, deleting, and editing notes. Advanced features like encryption, import/export, and voice memos are all available through extensions. All of this functionality is brought together in a simplistic and efficient layout, customizable through a variety of themes. <br><br>This application is ad free and does not require the internet permission. <br><br>The source code of this free and open source application is available at: <br>http://code.google.com/p/openintents<br><br>For the complete list of changes and a list of frequently asked questions, please visit: <br>http://www.openintents.org<br><br>You can help to improve the translation into your language at Launchpad: <br>https://translations.launchpad.net/openintents/trunk<br><br>Features: <br>* Add, edit and delete notes.<br>* Long-press on notes to add tags.<br>* Change font size and sort order.<br>* A clearly arranged layout with a variety of themes.<br>* Quickly search through notes.<br>* Send notes as MMS or SMS.<br><br>Available extensions for &quot;OI Notepad&quot;: <br>* Record and attach voice memos to notes<br>* Import/export notes from the SD card.<br>* Show the license information.<br>* Insert the date and time into notes.<br>* Turn text upside down.<br><br>International versions: <br>Bloc de notas OI, Bloc de notes d&#39;OI, ແພ່ນຂຽນ OI, OI 메모장, OI Blocco Note, OI Blokčić, OI Notatblokk, OI Notatnik, OI Not defteri, OI Notepad, OI Notesblok, OI Notitieblok, OI Notizblock, OI Piezīmju bloks, OI Poznámkový blok, OI Talaan, OI المفكرة, OI خاتىرە دەپتەر, OI يادداشت, OI Σημειωματάριο, OI Бележник, OI Нататнік, OI नोटपैड, OI ਨੋਟਪੈਡ, OI メモ帳, OI记事本, פנקס OI', 'summary': 'Create and share your notes with OI Notepad.', 'summaryHTML': 'Create and share your notes with OI Notepad.', 'installs': '500,000+', 'minInstalls': 500000, 'score': 3.83, 'ratings': 4398, 'reviews': 1204, 'histogram': [703, 351, 395, 483, 2462], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '993k', 'androidVersion': '2.3', 'androidVersionText': '2.3 and up', 'developer': 'OpenIntents', 'developerId': 'OpenIntents', 'developerEmail': 'support@openintents.org', 'developerWebsite': 'http://www.openintents.org/en/notepad', 'developerAddress': 'Suarezstr 41\n14057 Berlin\nGermany', 'privacyPolicy': 'http://www.openintents.org/privacy-for-apps/', 'developerInternalID': '8863194235050084579', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/Bn-qgBGvgRqWpZZDSUYoXOaw5LrvuotvN2qA9SyNVrF9ef9PeS7DpKM98GOAUWO-Tg', 'headerImage': 'https://lh3.googleusercontent.com/plQ6TpPghDkhryTB1MkJqwptx5gHXPBfPvlruT5Ws5kJsbQBIBk9iGxfNGgK2uI6f24', 'screenshots': ['https://lh3.googleusercontent.com/uMu-2dhSOo9KtO2sSkhTIn3p7PNf8kiRdAKL0QW1Le4-kKo0XC4WMXR3LkrbLy3_z3R8', 'https://lh3.googleusercontent.com/jXLyL64tgGg3AFmjX9JGL9dQaqs8u6ar0E5Z3hc3qa5Jjqb0jwJa6vV9rA-idTcVSZ8'], 'video': 'https://www.youtube.com/embed/GXtA8Rhy3-s?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/GXtA8Rhy3-s/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': None, 'updated': 1486987901, 'version': '1.5.4', 'recentChanges': '- Fix crash, add fling gesture\r\n- Fix permissions\r\n\r\nPLEASE READ: The font size got adjusted for HD devices.\r\nUse menu > settings > font size to set the desired size.\r\n\r\n- Integration of Box OneCloud (Online storage via Box app)\r\n- Instructions adapted for action bar (patch by Alok Sharma)\r\n- Spinner in NotesList is updated after editing tags (patch by Ganesh V R Kumar)', 'recentChangesHTML': '- Fix crash, add fling gesture<br>- Fix permissions<br><br>PLEASE READ: The font size got adjusted for HD devices.<br>Use menu &gt; settings &gt; font size to set the desired size.<br><br>- Integration of Box OneCloud (Online storage via Box app)<br>- Instructions adapted for action bar (patch by Alok Sharma)<br>- Spinner in NotesList is updated after editing tags (patch by Ganesh V R Kumar)', 'comments': ['What happened??? This product used to be great! I could save documents on my phone as straight txt files, and move them around as well as back and forth between devices. Not anymore. Now files get stored in some invisible location. Huge disappointment!', 'Functional but not the most intuitive of UI designs. Still, if your device is strapped for resources, this app just might be for you. I appreciate it.', "I am an artist and i have stored my lyrics in OI Notepad. i have atleast 200 plus songs and medleys either hand written or copy-pasted from various sources. Am now changing my device and i cant move my notes from my old device to the new. it is such a stuggle. i dont know what to do and how to go about moving such bulky content coz OI Notepad doesn't give a backup n restore option. Plz help me or suggest me how i can fix this situation. Love the app but stuck in a hole right now, plz help, thanks", "You didn't at all fix crashing. It does nothing but continuously crash!", 'will not work on Samsung s9. the moment i try to import a file from SD card it crashes', 'Awesome works....but where is data stored for recovery?', "Used for years with OI shopping. Now it just crashes on the LG G7 thinQ I'm", 'No light theme, only dark. Not all of the OI Notepad users are undertakers.', 'been using it for years', 'I like this app 👍', 'very good app', 'Used OI Notepad for about 7 years, 2010-2017. Easy to use. Good for taking quick notes or writing long texts. Everything you write can be exported to PC in text format. No ads. Few permissions. Loved it! Unfortunately, the developer abandoned this product after 2015. It still works well, but no updates. So performance on newer Android systems is buggy. Nevertheless, I still use OI Notepad occasionally on my KitKat Nexus 7. It works perfectly.', 'Great app but 2 suggestions UNDO feature and a "SAVE" feature in case you need to move notes over to a new phone. Update: No word from developers after years of dedicated usage. Sharing 100 notes individually to my email with no way of importing into my new phone is tedious. Seeking a new app.', "Was good but crashes every time I try to import notes made on marshmallow phone onto a S7 nougat. CSV has password protected notes secured with excellent oi safe & haven't been able to access them since lost marshmallow phone. Shame, I now use Google keep.", 'Loved this and have used it for years. Just upgraded my Note 5 to a Note 9 and it crashes trying to access the SD card. Searching online shows many with the same problem but no solution. No way to import all my notes! Looking for a new note app that can import my saved notes from CSV.', 'Update 5/4/2019-- OI convert does not work on Samsung Note 9. VERY DISSAPPOINTED!! Used to be best app on my phone. Now useless since I cant convert the file to back it up to my pc.', 'App crashes everytime I try to save to internal SD card on Android Nougat. Fortunately I can paste the text into a document in another app. Would be 5-star worthy if it could save directly.', 'Used to be good, but crashes when trying to read or write to SD card. Makes backups and import/export of notes not possible. Lost too many notes when phone had to be wiped. Uninstall.', 'Takes notes well but does not store them in an accessible fashion unless you manually export them to the SD card. Worse, from time to ti me, it deletes all your files - seemimglt when it updates (which us fortunately not too often)', 'Only drawback is, not able to edit files saved in memory card.  12/16/17: after long time uninstalling app due to crashing by using oi folder app...', 'Simplicity! Been using since I got my first android phone, roughly 6 years and I have no plans to stop using it yet. Enough said?', 'Big trouble when upgrading to an Galaxy S6. Trying to import to the new phone, but the app keeps stopping. Can you help?', 'App keeps crashing when I try to Open from SD card.', "It used to work fine but with my new phone ZTE Z max pro it won't let me load from SD cards", 'Love this app! Indispensable.  Easy to share notes as texts or emails.', 'Encrytpion does not work. Amdroid 7 s7 edge. Been using it for ever. Loved it. Pls fix.', 'Crash on start both android 5.1 And 8.0', 'Always Crashing on Oreo. It was a good useful app,now is utter garbage', 'Does not save to SD card on Android 7.1.1.', 'simple text editor ... works as advertised', 'perfect little notepad application.', 'Easy to take quick notes.', "best one I've had", 'great app', 'scam', "I'd love to love this, it's simple, has few permissions and no network permissions, but it's awkward to use, and has no real options except text size. No capitalisation. Can't set up a default storage location, means you have to search to open and save notes every time if you want them on SD card. Crashed every time I tried to use in conjunction with OI Safe, and at other times. Desperately needs some options. Android 4.2.2", 'Saving text files to SD card was the biggest feature I liked in this app. But it stopped working after the first or second run. I even installed OI File Manager but every time I try to save files to extSdCard it gives "Error while writing file". Please address this issue. I desperately need an app that autosaves my notes to external microSD card so that I don\'t lose anything while factory reset. And it gets worse. No response from the devs for about 1.5 months.', 'Lightweight, simple, no-BS notes app.  Would be perfect if I could take all the 100s of .txt files exported from my previous notes app and import them here in one fell swoop.  Very disappointed that it lacks this.', 'I am using both OI safe and and OI notepad,  I have encrypted note pad files using OI safe. Now when i try to open OI note pad file is crashing and i am not able to view the encrypted files. I am getting the following error " Decryption failed due to changes in Operating system ( Android) \'.   Kindly help me fix this issue', "I've used this app for years and relied on being able up back up notes to MyBackup Pro.  This functionality doesn't seem to work anymore.   Wrote to developer and never got response.   Will need to find alternative."], 'appId': 'org.openintents.notepad', 'url': 'https://play.google.com/store/apps/details?id=org.openintents.notepad&hl=en&gl=us'}
