{'title': 'Oversec', 'description': '<b>Oversec transparently encrypts and decrypts any text in any app</b>\r\n\r\nYou can use it to exchange private encrypted and covert chat- or email messages or store your own encrypted notes on your phone.\r\n\r\nSee our demo videos:\r\nIntroduction: [https://www.google.com/url?q=https://www.youtube.com/watch?v=VHZ9dA5ELXE]\r\nEncrypting Emails: [https://www.google.com/url?q=https://www.youtube.com/watch?v=jZ_-5X2tiAo]\r\nEncrypting Images: [https://www.google.com/url?q=https://www.youtube.com/watch?v=laq7SGwiuAw]\r\n\r\nOversec is completely agnostic of the subjacent app, it works with Whatsapp™, Line™, Snapchat™, Instagram™ or any other chat app. It also supports sending and receiving PGP encrypted messages with the Gmail™  or any other Email app.\r\n\r\nEnd-to-End Encryption was yesterday. Oversec introduces "Eye-to-Eye" encryption. <b>Encrypted data is only decrypted while it is shown on the screen!</b> No clear text is ever persisted and thus cannot be extracted from the file system or accidentally be backed up into the cloud.\r\n\r\nWe also carefully designed Oversec so that it doesn\'t require internet access. Because of that, you can rest assured that no decrypted information can ever leave your device.\r\n\r\n<u>How it works:</u>\r\n\r\nOversec constantly monitors the text on your screen. When it finds an encrypted text, it tries to decrypt it and then shows the decrypted text as an overlay in place of the encrypted text. Conversely, it can read text out of an input field, encrypt it, and then put the encrypted text back into the input field.\r\n\r\nIn order to encrypt a text, Oversec shows a button next to an active input field. After having entered the secret text, tapping that button makes Oversec read the text, encrypt it and put back the encrypted text into the field. It is now ready to be sent in the subjacent app as usual - the app doesn\'t even know that it is sending encrypted data!\r\n\r\nOversec also features a unique way of encoding the encrypted messages. It stores the encrypted text in invisible (zero-width) characters and let\'s you add decoy text at the end. That way, a message will just show e.g. "The sun is shining!" with no visible sign of any encryption, whereas in reality it contains a hidden encrypted message.\r\n\r\nYou may also encrypt and send photos through Oversec - its unique camera mode even allows you to take and send an encrypted photo without ever storing the original photo on the device.\r\n\r\nOversec encrypts your data either using symmetric keys  (using ChaCha20 cipher + Poly1305 MAC ) or using asymmetric PGP encryption (making use of the OpenKeychain app [https://www.google.com/url?q=https://play.google.com/store/apps/details?id=org.sufficientlysecure.keychain]).\r\n\r\nOversec is now open source and the code can be found here: https://github.com/oversecio/oversec\r\n\r\nThis app uses Accessibility services.', 'descriptionHTML': '<b>Oversec transparently encrypts and decrypts any text in any app</b><br><br>You can use it to exchange private encrypted and covert chat- or email messages or store your own encrypted notes on your phone.<br><br>See our demo videos:<br>Introduction: [https://www.google.com/url?q=https://www.youtube.com/watch?v=VHZ9dA5ELXE]<br>Encrypting Emails: [https://www.google.com/url?q=https://www.youtube.com/watch?v=jZ_-5X2tiAo]<br>Encrypting Images: [https://www.google.com/url?q=https://www.youtube.com/watch?v=laq7SGwiuAw]<br><br>Oversec is completely agnostic of the subjacent app, it works with Whatsapp™, Line™, Snapchat™, Instagram™ or any other chat app. It also supports sending and receiving PGP encrypted messages with the Gmail™  or any other Email app.<br><br>End-to-End Encryption was yesterday. Oversec introduces &quot;Eye-to-Eye&quot; encryption. <b>Encrypted data is only decrypted while it is shown on the screen!</b> No clear text is ever persisted and thus cannot be extracted from the file system or accidentally be backed up into the cloud.<br><br>We also carefully designed Oversec so that it doesn&#39;t require internet access. Because of that, you can rest assured that no decrypted information can ever leave your device.<br><br><u>How it works:</u><br><br>Oversec constantly monitors the text on your screen. When it finds an encrypted text, it tries to decrypt it and then shows the decrypted text as an overlay in place of the encrypted text. Conversely, it can read text out of an input field, encrypt it, and then put the encrypted text back into the input field.<br><br>In order to encrypt a text, Oversec shows a button next to an active input field. After having entered the secret text, tapping that button makes Oversec read the text, encrypt it and put back the encrypted text into the field. It is now ready to be sent in the subjacent app as usual - the app doesn&#39;t even know that it is sending encrypted data!<br><br>Oversec also features a unique way of encoding the encrypted messages. It stores the encrypted text in invisible (zero-width) characters and let&#39;s you add decoy text at the end. That way, a message will just show e.g. &quot;The sun is shining!&quot; with no visible sign of any encryption, whereas in reality it contains a hidden encrypted message.<br><br>You may also encrypt and send photos through Oversec - its unique camera mode even allows you to take and send an encrypted photo without ever storing the original photo on the device.<br><br>Oversec encrypts your data either using symmetric keys  (using ChaCha20 cipher + Poly1305 MAC ) or using asymmetric PGP encryption (making use of the OpenKeychain app [https://www.google.com/url?q=https://play.google.com/store/apps/details?id=org.sufficientlysecure.keychain]).<br><br>Oversec is now open source and the code can be found here: https://github.com/oversecio/oversec<br><br>This app uses Accessibility services.', 'summary': 'Privacy for All Apps!\r\nEncrypt and Disguise Messages in All Your Apps!', 'summaryHTML': 'Privacy for All Apps!<br>Encrypt and Disguise Messages in All Your Apps!', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.98, 'ratings': 214, 'reviews': 116, 'histogram': [32, 4, 21, 34, 121], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '5.2M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'oversec', 'developerId': 'oversec', 'developerEmail': 'support@oversec.io', 'developerWebsite': 'http://www.oversec.io', 'developerAddress': 'oversec.io\nP.O. Box 3444\nRoad Town\nTortola\nBritish Virgin Islands\n', 'privacyPolicy': 'https://www.oversec.io/policy.html', 'developerInternalID': '4725612340439074155', 'genre': 'Communication', 'genreId': 'COMMUNICATION', 'icon': 'https://lh3.googleusercontent.com/30vrE2QcSWHEQ_BEI0_JnTCvrjqlxDGQRQaHcrgnwDo1ZJeAh06a3nc9QBUgW7YQeJI', 'headerImage': 'https://lh3.googleusercontent.com/_cMbuuNCdcy6dtakDDdBJtHlBoCeLl1pJJlvco5pFrPD0EoGGozAijyOCJD5p2Ensw8', 'screenshots': ['https://lh3.googleusercontent.com/9O2dkNKLR3Pmr8aBlGnX4olK1zRG0RF7okDJyqDCm5po6hJztG3K2vVJ5PHC9MhQmDk', 'https://lh3.googleusercontent.com/lbmQM99_6jfe5vm4lYtD-w_uUQ-KLcEYOS-cUOZj4sQ50G5vkGYNxLzPtaX637WlvXQ', 'https://lh3.googleusercontent.com/3y1mc0-vT7sdKhrHbrnhbsGcNQEGedFS5w6WnvgtpXaHqrAfGSB3WbdRuctdt-HjLiQ', 'https://lh3.googleusercontent.com/qNHsHkxTe48Ea1zZ0PaklIhyQFF2_slhMQf7bMt3mPKr-XJJS-gjIqpFB_-bSmIikFc', 'https://lh3.googleusercontent.com/pAPrvmhmC0veo-ipV1K0NnOuZBF1wrx2407tyU2yyhwdmnQO_hLA7AITHgnX9DyYEME', 'https://lh3.googleusercontent.com/athaIu0KkoKDmQuREPBRv9waPZutj5Qr4_GKGyuq6yey5bt2JAz7v3N8Y6EXVwqPWQ', 'https://lh3.googleusercontent.com/PKDdfugurbP4luPoX4EjyphpAVp6bzk0SKzvVH-EJlCQptrolqAdxLguZIIdITDkJwam', 'https://lh3.googleusercontent.com/TJK3Pg-f9IKsen1IRJNOHz6bfVPv3Oa0IOa0FD1xCk5nU8tJ3prxAKBIEQTYDPcHuUU'], 'video': 'https://www.youtube.com/embed/VHZ9dA5ELXE?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/VHZ9dA5ELXE/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Aug 16, 2016', 'updated': 1553571743, 'version': '1.5.15', 'recentChanges': '- fixed some more crashes \r\n- corrected vertical mis-alignment on some devices', 'recentChangesHTML': '- fixed some more crashes <br>- corrected vertical mis-alignment on some devices', 'comments': ['Very sweet app. F-Droid version told me to upgrade when attempting to decrypt images, deleted the F-Droid version. I downloaded the Play Store version and upgraded. It still tells me to upgrade and only gives me previews, not full image decryptions. The other upgrade features work. Message overlays do not seem to be working in Facebook Messenger for me, disabled chat heads and overlays for that app, Oversec has overlays enabled. I do not regret upgrading, keep up the good work, devs!', "Oversec just can't connect to OpenKeychain or import from key file. It needs to either generate it's own PGP key or capture one from another phone.", 'I am in general not very happy with oversec, because it looks like an unpolished product. on the other hand, I do appreciate the idea and the huge effort you have put in developing the app. 1. The input box does not align with the app input box in WeChat 2. the encrypted messages are not automatically translated in WeChat 3. I always receive picture too big in the camera function 4. the annoying user guide appears every time when i try to use the camera', 'not working on Poco F1, even after granting accessibility permission, overlay of oversec is not showing on Whatsapp , or other messaging platforms, neither persistent notification is showing in the notification bar.', "A bit clunky UI but it is doing it's job.", 'Constantly glitchy, to many confirmations for simple use', "Great app but after an update (or transition to Android 9),I can't import my PGP key, only create a new one, which kinda defeats the purpose.", 'tested it with discord, messenger and MIUI sms app, only in sms app it was able to decrypt text, so "privacy in all apps" is kinda false advertising.', 'excellent app but lacks support for ECC PGP keys, which limits my usage.', 'Excellent app. Now encryption is everywhere.', 'I wrote CrypticSMS ages ago with a similar intent. I love how you taken this to a whole new level!', "Doesn't decrypt, only encryption works", 'Yet to use. 5* app idea. Will update after using if needed.', 'still kind of beta, but wonderful all the same', 'Nice. Easy end to end for any app)', 'This app is insanely awesome. I was not even remotely prepared', 'You had me at \'Eye-Eye"', 'Thanks I hate it', 'Great!', 'PGP works. Was hoping it used ChaCha & encrypted symmetric key using pgp xD. Certain passphrase combinations above 89 chars give weak strength indicator.', "This app is going to save the battery on my mobile device now so I won't die where the cables are plugged into it with white earbuds for apple and smart devices", 'Helps keep my messages safe! Very useful.', 'Not open source therefore not trustable.', "A bit finicky to get working with some apps, but that's more die to stability issues in those apps, rather than integration with this one. Android messenger, for example, doesn't work with this, but it wasn't ever meant to support this. FB messenger works well if you turn off chat heads. Hangouts has the most seamless integration, from what I've found so far.", "Nice concept but very power hungry. App has been running for less than 5 minutes and already hogging up 200 mb of memory. Kind of a waste because despite its look, this has potential. Also, not hard to use for human beings. Most monkeys here need their hand held when going to the toilet so a lot of unfair reviews are being written. Lastly, the floating buttons are kind of a bad choice personally. I'd rather have a bar overlay at the top or bottom of the screen", "Your app got me pregnant, well, at least, it led me to become pregnant, through a narrow sense of broad security. Also I'm a guy.", 'A bit complex to use...', 'Freaking awesome!', "Can't get it to work with Evernote. Something about not being able to write the text back into the field. Any ideas on what I might be doing wrong?", 'This is the encryption app everyone has been waiting for. It makes every app an encrypted app.', "Perfect. It's low-key and well thought-out", "I really don't like Google proprietary code and apis and Google internet access for inapp puchase in my privacy apps. If you need donation why not use a donation or proapp. Can't use all features without Google in app purchase? Not feeling secure How can in app purchase work with out Google confirmation api", 'Edit: ah yeah that would be the reason. Installed the .9 version clean (and lost all my settings :( ) installed .10 clean and it works.', 'We send messages to each other in numerous ways and adding security with the web of trust is the not always made available by the developers. But this augments the whole phone to use pgp and that is amazing and useful.', 'Does exactly what it says. Use it with OpenKeychain for GPG.', 'Works like a charm with WhatsApp. What a cool idea! Will try it with other apps too. Thanks.', 'Awesome app thanks for it!', 'Love it. Provides privacy regardless of the transport layer. Finally makes PGP possible with GMail (inline only, no PGP/MIME)', "That's what I was looking for. Get privacy whatever the messaging I choose.", 'Very unique concept, love it!'], 'appId': 'io.oversec.one', 'url': 'https://play.google.com/store/apps/details?id=io.oversec.one&hl=en&gl=us'}
