{'title': 'NetGuard - no-root firewall', 'description': 'NetGuard provides simple and advanced ways to block access to the internet - no root required.\r\n\r\nApplications and addresses can individually be allowed or denied access to your Wi-Fi and/or mobile connection.\r\n\r\nBlocking access to the internet can help:\r\n\r\n• reduce your data usage\r\n• save your battery\r\n• increase your privacy\r\n\r\nFeatures:\r\n\r\n• Simple to use\r\n• No root required\r\n• 100% open source\r\n• No calling home\r\n• No tracking or analytics\r\n• No advertisements\r\n• Actively developed and supported\r\n• Android 5.1 and later supported\r\n• IPv4/IPv6 TCP/UDP supported\r\n• Tethering supported\r\n• Optionally allow when screen on\r\n• Optionally block when roaming\r\n• Optionally block system applications\r\n• Optionally notify when an application accesses the internet\r\n• Optionally record network usage per application per address\r\n• Material design theme with light and dark theme\r\n\r\nPRO features:\r\n\r\n• Log all outgoing traffic; search and filter access attempts; export PCAP files to analyze traffic\r\n• Allow/block individual addresses per application\r\n• New application notifications; configure NetGuard directly from the notification\r\n• Display network speed graph in a status bar notification\r\n• Select from five additional themes in both light and dark version\r\n\r\nThere is no other no-root firewall offering all these features.\r\n\r\nIf you have a question or problem, you can send an e-mail to marcel+netguard@faircode.eu\r\n\r\nIf you like to help people less fluent in English, you can help translate NetGuard in your language: https://crowdin.com/project/netguard/\r\n\r\nIf you like to test new features, you can participate in the test program: https://play.google.com/apps/testing/eu.faircode.netguard\r\n\r\nAll required permissions are described here: https://github.com/M66B/NetGuard/blob/master/FAQ.md#user-content-faq42\r\n\r\nThe source code is available here: https://github.com/M66B/NetGuard', 'descriptionHTML': 'NetGuard provides simple and advanced ways to block access to the internet - no root required.<br><br>Applications and addresses can individually be allowed or denied access to your Wi-Fi and/or mobile connection.<br><br>Blocking access to the internet can help:<br><br>• reduce your data usage<br>• save your battery<br>• increase your privacy<br><br>Features:<br><br>• Simple to use<br>• No root required<br>• 100% open source<br>• No calling home<br>• No tracking or analytics<br>• No advertisements<br>• Actively developed and supported<br>• Android 5.1 and later supported<br>• IPv4/IPv6 TCP/UDP supported<br>• Tethering supported<br>• Optionally allow when screen on<br>• Optionally block when roaming<br>• Optionally block system applications<br>• Optionally notify when an application accesses the internet<br>• Optionally record network usage per application per address<br>• Material design theme with light and dark theme<br><br>PRO features:<br><br>• Log all outgoing traffic; search and filter access attempts; export PCAP files to analyze traffic<br>• Allow/block individual addresses per application<br>• New application notifications; configure NetGuard directly from the notification<br>• Display network speed graph in a status bar notification<br>• Select from five additional themes in both light and dark version<br><br>There is no other no-root firewall offering all these features.<br><br>If you have a question or problem, you can send an e-mail to marcel+netguard@faircode.eu<br><br>If you like to help people less fluent in English, you can help translate NetGuard in your language: https://crowdin.com/project/netguard/<br><br>If you like to test new features, you can participate in the test program: https://play.google.com/apps/testing/eu.faircode.netguard<br><br>All required permissions are described here: https://github.com/M66B/NetGuard/blob/master/FAQ.md#user-content-faq42<br><br>The source code is available here: https://github.com/M66B/NetGuard', 'summary': 'A simple way to block access to the internet per application', 'summaryHTML': 'A simple way to block access to the internet per application', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 4.211739, 'ratings': 18383, 'reviews': 8715, 'histogram': [2208, 514, 1018, 2077, 12564], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '2.5M', 'androidVersion': '5.1', 'androidVersionText': '5.1 and up', 'developer': 'Marcel Bokhorst', 'developerId': '8420080860664580239', 'developerEmail': 'marcel+netguard@faircode.eu', 'developerWebsite': 'https://www.netguard.me/', 'developerAddress': 'Van Doesburg-Erf 194, Dordrecht, The Netherlands\n', 'privacyPolicy': 'https://www.netguard.me/privacy/', 'developerInternalID': '8420080860664580239', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/XEd1PsXgOSNNpD2hlZMvigIOJ9e5JCL2KhCJ4X984Az5EFw6YiecDebqdsZ12VNU2kPu', 'headerImage': 'https://lh3.googleusercontent.com/qnSfpXhpzbcvmdEjaqQIrrmRvkO5Qvn8DF3iVP0flKizzNhb6Eo6LT-XWQNEpNeFV98', 'screenshots': ['https://lh3.googleusercontent.com/aVFfQpb8KfuKangXyZgP70s0zfSPSBV-6FDl0GclSsgT4839zfn0doygH1AL0f-VeabX', 'https://lh3.googleusercontent.com/ScSwNHobwbJGRZugkEBsYL_F4jYnwHrE4zDZMSXVjjw1dxypbBDptcuIGdL4UMZ0UA', 'https://lh3.googleusercontent.com/ij3IpfZG0V9i2AxBXXqtEWQlF1KMqP4irQqwopfalOd4PT35sROSdP7yckwpQ9kTcg', 'https://lh3.googleusercontent.com/hWG69TXysgoK4okB3GVUYfHx87YlfbVp9li6TQeCNi5bi2Sd-ZnlxDndl5lp5UekhZI', 'https://lh3.googleusercontent.com/0pqe3z4T5MgBEKZHyw9Fkg819642ulgl393mz11Q6xmJktMyjZlzKO09ED6Z5eBCckRn', 'https://lh3.googleusercontent.com/u6_tk4ShpG5pSJ2if1U0KAuD8LGaA3AwmsfQ9FITyPd2mdySdnYXhaBFvYf1NmNO9kU', 'https://lh3.googleusercontent.com/hfYw4s4O4Lnd8qbuM3KiFtP83l_fYtDDUfUH0Gqk9jUZg4CTfmNN2NZaiJI5sKn04Q'], 'video': 'https://www.youtube.com/embed/sQlSHsdGR3g?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/sQlSHsdGR3g/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 3, 2015', 'updated': 1589809638, 'version': '2.281', 'recentChanges': '* Fixed subscriptions\r\n* Small improvements\r\n* Updated translations', 'recentChangesHTML': '* Fixed subscriptions<br>* Small improvements<br>* Updated translations', 'comments': ['Works, and has great advanced features, but missing the key ability to blacklist all, and then have "allow"/"deny"/"advanced rules" buttons in the actual notification window as each app accesses the internet. Maybe I\'m spoiled by rooted firewalls.... But why don\'t any of these noroot firewalls have an "allow once" option. Many programs need an activation connection, then I want deny it further access. I feel my review is objectively accurate, relative to the competition.', "When you're tired of all your apps and processing spying on you...there's NetGuard. Accept no substitutes. This app is the real deal. I've been kicking the tires on this and quite enjoy it. I set Netguard to block ALL traffic and then i allow on an individual basis the apps I wish to have internet. 100 STARS!!", "Blocks selected apps while giving others normal access. (Thanks for the heads-up from the developers about managing system apps [Advanced options]. Just about every 2 days, I'd been finding that the Play Store was updating Google apps, even disabled ones!, despite my blocking these via both the Play Store's settings and Android's settings.)", "Great app! I was looking for something to secure and block access to other app without rooting my phone and this is great ! Also it doesn't share info like other app do!!! Amazing I will probably buy the pro version to support the dev", "Absolutely stunning app performing so well on my device I'm feeling the difference in bandwidth and speed also i will highly recommend this app it doesn't show any ads that's best point and doesn't send any data to any server that's why i love this app", "It's working well until I realized some apps are't listed, such as my cloned whatsapp app. It seems like I'm not qualified enough to reach the devs on this issue. In the meantime I'm trying to look for alternatives.", "Let's you CONTROLE WHAT APPS USE YOUR DATA, has a lot of battery and data saving options. Great if you realize your battery is empty and you don't know what app was wasting it", 'Apparently this app works, but not without problems. Most of the file sharing apps are rendered useless when netguard is on. Edit.: e.g. when I use KDE connect (or similar apps), and netguard is on, and all permissions are given; I am still not able to connect to other devices via WiFi. Same is true for other apps such as MiDrop, Share it etc.', 'Love it. Installed and configured NetGuard with no fuss. It now blocks two annoying apps that used to bug me with adds. Nice one.', "I'm a Pro user of this app. It works what it says... @Marcel, continue ur great work... Edit: Can you add block background connections for apps which we allowed to use wifi and mobile internet?", "App is great, but it doesn't block internet for apps in Samsung secure folder, both playstore and github versions. I want to grant the app root access but cannot because the latest version is not requested for it at all. I'm of the feeling that granting root access might block internet access to Samsung's secure folder. #Edit Samsung secure folder does not permit running most apps same time on the folder and the base software. but I'll check it out, I'd love if you will check it too. Great App!!", "Very useful app. Paid the $8.50 for pro after 10 mins. Overall, it can be a little confusing at first as the instructions are a bit muddy and there are no Youtube videos that demonstrate the pro features that I could find. In Pro mode, if you want to control a specific app, you have to CLICK ON the IP address in the log under the app. I didn't see this anywhere in the instructions but now it makes sense. Dev seems to put a lot of work into this and has a sassy attitude. Kinda like that :-)", 'This app has helped me go from using 500mb a month to 30mb. 94% reduction in unnecessary data usage! Not to mention the pro version is only $8.50 FOREVER. Such a helpful app for free and you pay pretty much nothing for extra features. Improvements could be a way to identify linked apps. When you disable or enable some of the apps access it applies to more than just that one because they are linked via the system. I mostly just want to know about it since you might not see it do that.', 'Best app on the market. I used NoRoot Firewall for years, but this app is better supported, much more powerfull and well documented. I almost gave up on the app at first because various caveats were difficult to catch. For instance, that "Block conns without VPN" must be disabled, or that notifications of blocked connections happen once. Better in-app explanations would make more new users to stay. Feature request: a tab with all blocked apps to quickly decide whether allow connections or not.', 'Doesnt work any more. No matter how many apps i allow i get only one effect. Block completely. And my task bar says 0allowed. I cannot use this anymore.', 'Some of the "advanced features," are somewhat counterintuitive, there\'s no explanation as to, why or whether, to enable aspects,or not. If you tic a box, you may be shifted to an in app purchase. I purchased one part of the seemingly redundant, multiple in app directives, and it didn\'t make any difference in the way the app works!!° The boot on start-up option is slow, and rarely on start-up. 3 stars, pay for evry line item, and the vpn of other aps shuts it down leaving you unprotected.', "This app is absolutely excellent at doing exactly what it says it will do. If you want to stop random apps from going out and sending/grabbing whatever they're sending/grabbing without your knowledge or approval, BUY this, and turn it on! BUT...if you're NOT concerned with your privacy, well 1st off you're a fool, but if you are, get this app installed and use it... AND people, you don't need a VPN on your phone, use this instead!", "Very good alternative for AFwall+, if you don't want to root your phone.", 'Believe me this app is superbly wonderful. Now we can temporarily shut the internet door for those data hungry apps in the background without a glitch...Huge applause for developer for this creation.', 'Works great and the notifications and logs in the pro version are a real eye opener.', 'The GirHub version does not work on Samsung phones. It hangs, crashes and terminates network access altogether. It requires restarting the phone up to several times daily. The Play store version is more stable but lacks some of the pay-for features... Re the dev response: You forget one half of the story: the customer who paid a good price for the software and also wants to keep motivated for their purchase... While I think NetGuard is a great idea, I have paid for it, I cannot use it anymore...', "Don't like that it has to use its own VPN instead of letting me keep my own... So basically I wont continue to use this app. Thanks I would just like to be able to continue to use my paid for VPN I have relyed on for a couple of years now. That's all. Still did. Great job on the firewall app. It's a good one. Just not for me that's all.", 'One of the best app to stop apps using internet probably recommend you guys who play pubg mobile and having pings issues i personally used it and it gives me great performance alots of thanks to the developer of this app', 'its working but the internet connection it receives on my mobile data is slower than when i turn it off so as a result, when i play online games, it is more lag when i turn this app on than when i turn it off (even though i checked that game so i can open it and play it) pls fix the issue where if i turn on this app, my games will be smoother than when i turn off because it will receive more data signal to my games than to my other apps because of restrictions thanks to this app.', 'It starts a separate vpn. does it provide no log policy. Its says to disable battery optimisation', "Works OK but keeps blocking net access for apps that are 'allowed' Samsung S20 Ultra OneUI 2 (Android 10) Apps keep saying no network when connected to wifi or mobile data. Turn Netguard off, problem resolved? Help? Edited: Apps set to be able to go ON net using Netguard, keep being blocked BY it. Message when trying to open an App 'no network' Turn OFF Netguard, network works. Strange", "Shifted from NoRootFirewall to NetGuard and I don't regret it at all. Good app!", 'Does not work with any installed VPN! Developer must integrate compatibility with expressvpn and the other big vpns as a user should be able to hide their ip and also have a firewall to block designated app traffic. Common sense!', "Very cool app to figure out and control what's going on on your Android devices. I am using it both on my phone and an old Amazon Fire tablet running Fire OS (that I added Google Play to).", "This app does EXACTLY what I wanted it for. I am on a limited data plan, and this app allowed me to turn off data access app-by-app, with the simple tap of a slider. It's been fantastic for what I needed.", "Totally recommend it! I purchased all pro features a few years ago and I don't regret it! You can't use a VPN simultaneously with the firewall, but therefore no root is required.", 'Love it. Was looking for an app to specifically block net traffic for individual apps. This does that with ease without crazy permissions and routing traffic through other servers.', "Fantastic app to block anything from accessing the internet. Been using firewalls since Android came out. Just can't do it through root anymore 👍Thanks", 'Superb app that delivers exactly what it claims would be delivered.', "THIS APP....simply Wonderful! I really appreciate the work the Developer put into it. It's a must have for any phone I own. It works as described.", 'This is great - exactly what I was looking for my new phone. Not sure why this capability is missing from current versions of Android.', 'Good control over application access to internet. However, slows down phone significantly.', 'Works like a charm, but pro features abit costly..', 'Best app for protecting privacy , saving data. Big thumbs up to developer team😊. Thank you !', "Best Android firewall I've found. Enables micro management of every app including system apps. Great work, do you have a windows version?"], 'appId': 'eu.faircode.netguard', 'url': 'https://play.google.com/store/apps/details?id=eu.faircode.netguard&hl=en&gl=us'}
