{'title': 'DroidFish Chess', 'description': 'DroidFish is an Android port of the very strong Stockfish chess engine, combined with a feature-rich graphical user interface.\r\n\r\nFeatures:\r\n- Opening books: Internal, polyglot, CTG, ABK\r\n- Clocks\r\n- Analyze mode\r\n- Two player mode\r\n- Edit board\r\n- PGN import/export/edit\r\n- FEN/EPD import\r\n- Adjustable playing strength\r\n- One Touch Moves\r\n- Blindfold mode\r\n- Color themes\r\n- Animated moves\r\n- Scid DB support using "Scid on the go"\r\n- Highly configurable\r\n- Third party UCI engines\r\n- Configurable UCI engine options\r\n- Support for "open exchange" engine apps, such as texel and komodo 8.\r\n- Gaviota endgame tablebases\r\n- Syzygy endgame tablebases\r\n- Free, GPLv3\r\n\r\nSource code is available from my web page.\r\n\r\nThe following permissions are used:\r\n\r\nModify/delete SD card contents\r\n  To save games to SD card\r\n\r\nFull internet access\r\n  To optionally communicate with network chess engines\r\n\r\nControl vibrator\r\n  To optionally vibrate after computer makes a move', 'descriptionHTML': 'DroidFish is an Android port of the very strong Stockfish chess engine, combined with a feature-rich graphical user interface.<br><br>Features:<br>- Opening books: Internal, polyglot, CTG, ABK<br>- Clocks<br>- Analyze mode<br>- Two player mode<br>- Edit board<br>- PGN import/export/edit<br>- FEN/EPD import<br>- Adjustable playing strength<br>- One Touch Moves<br>- Blindfold mode<br>- Color themes<br>- Animated moves<br>- Scid DB support using &quot;Scid on the go&quot;<br>- Highly configurable<br>- Third party UCI engines<br>- Configurable UCI engine options<br>- Support for &quot;open exchange&quot; engine apps, such as texel and komodo 8.<br>- Gaviota endgame tablebases<br>- Syzygy endgame tablebases<br>- Free, GPLv3<br><br>Source code is available from my web page.<br><br>The following permissions are used:<br><br>Modify/delete SD card contents<br>  To save games to SD card<br><br>Full internet access<br>  To optionally communicate with network chess engines<br><br>Control vibrator<br>  To optionally vibrate after computer makes a move', 'summary': 'The Stockfish chess engine combined with a feature-rich graphical user interface', 'summaryHTML': 'The Stockfish chess engine combined with a feature-rich graphical user interface', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 4.6376505, 'ratings': 15586, 'reviews': 5638, 'histogram': [661, 220, 419, 1500, 12784], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '6.5M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Peter Österlund', 'developerId': 'Peter+%C3%96sterlund', 'developerEmail': 'peterosterlund2@gmail.com', 'developerWebsite': 'http://hem.bredband.net/petero2b/droidfish/index.html', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '6464224124539144234', 'genre': 'Board', 'genreId': 'GAME_BOARD', 'icon': 'https://lh3.googleusercontent.com/kZpgwXA7xGkdTz-RmCxlr4JeBNkTaQvb9M9XeoQycxwCA_DE_4iCUOD6Jy4tQMJ3TEXS', 'headerImage': 'https://lh3.googleusercontent.com/EY6Jn_Di_7nJAkaH8TleFKt6ZsObbwJ8JoSB_-VeQT79CX_El0X09fEwafYc9coCZmQ', 'screenshots': ['https://lh3.googleusercontent.com/cnaDh92wii9XonJsFZIyoRZSBT0A-DhP9NiswJ_4bPXenyA8soqcJpTWkXovTfeOdyM', 'https://lh3.googleusercontent.com/vcOn3-kV9Zp3OmI7Zkv5BMcwS82G9fqochou5zO4SKC0v_uuc4EHFD7tvBpv8RuIlw', 'https://lh3.googleusercontent.com/xVSTEsBmbsQI9VDFewwaFA-T-fF0wIt9GD0BHF-QiChAUmsgNJS3cO5Xfrew9A0u9Tk', 'https://lh3.googleusercontent.com/b5QuGFHrE0LuUy4WwNo5wZ6upnSb5mwWQCSbe0r19PeiocGU3-j76UMyxKc2bBDhfDge', 'https://lh3.googleusercontent.com/zYDggnZ3h5YUqnprnLsk7eJkwe5xRpKgyz9nZ7hjJbYDMvu--7rq6_8gt4rVVsiX5Xo', 'https://lh3.googleusercontent.com/E7nIU99zI5SN_cW4rJ4cLXl736IiKaKVfVdSv3MNShuqOxqttI9MclSytd_uPx23hjG4', 'https://lh3.googleusercontent.com/wJx3AF27MoI0adIGiPVDte8CZ3LR1lafuHO5cZGmfaRaxP5qDLGBMluniAshTLNdWx0U', 'https://lh3.googleusercontent.com/0e9jPGHiJzXA6YH78TVTOO7VVEslbScSWND8-4DVnOLhX2TTkpkAQRSlexVZHmKzVg', 'https://lh3.googleusercontent.com/Ey7rvjaO92umE2Zt2dA2MLXT6kpAPiV3TJQy_mZIsTM3lplFF1_HCliHuFxFTFEqKOU', 'https://lh3.googleusercontent.com/D4GuhOJ75sQdUo7ofNl-fFS5gS6hLYz4_DSkoYWh0ihj15OXFUh7dKep-yErJlI7nDw'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 11, 2010', 'updated': 1590003487, 'version': '1.82', 'recentChanges': 'Version 1.82\r\n- Set engine strength in terms of Elo. Available in left drawer menu for supported engines.\r\n- Support for ABK (Arena) opening books.\r\n\r\nVersion 1.81\r\n- Fix layout problems in color picker for some screen sizes.\r\n- New configurable button action: Load game from PGN file.', 'recentChangesHTML': 'Version 1.82<br>- Set engine strength in terms of Elo. Available in left drawer menu for supported engines.<br>- Support for ABK (Arena) opening books.<br><br>Version 1.81<br>- Fix layout problems in color picker for some screen sizes.<br>- New configurable button action: Load game from PGN file.', 'comments': ["Some suggestions. 1. Kindly introduce 'play' button to make us navigate through a game easier rather pressing 'next' button again and again. 2. Kindly make it possible for us to rename certain games that we store within a file. For example i wanted to study certain lines of Caro Kann. I can save all the games within the file 'Caro' but i could not name the games i saved within that and so i could not differentiate the variation in caro kann lines. 3. Camera option to directly bring position.Tq", 'Awesome app. The very best. I would suggest that the stockfish chess engine be updated (via the latest Stockfish Development Version) during each new version, instead of updating the Stockfish chess engine for Droidfish only when there is a new Official Stockfish release. This will help android users be on the same page with Windows PC users. Thank you.', "Excellent.. But want your advice Peter sir !!! i plays with 2048 mb hash.. 100% book recommendations.. In one minute per move with 2850 Elo.. With other players in instant chess Then also i lost some matches on android.. Why this happened and what's your suggestions for change", "It's an amazing aap, only one concern faced i.e. after 60 moves it slow down considerably. Are you planning to add more moves in future update. I tried Whole game option also but invain. That is the reason for 3 star..I will give 5 star once this is resolved.", "Playing strength was gone in settings. I think you should keep that feature for using the other chess engines e.g komodo, texel, laser etc. because their limit strength feature isn't supported.", 'With your latest update, now i know you are using a weak engine (only 2850!). Prior to this update, i thought 100% strength was the present strength of stockfish 11 which is at 3700+. To this, from 5 stars i am giving you one', 'This is so awesome! Im terrible at chess and feel self conscious when playing real people. Playing the engine is a great way to build up some skill', "Almost perfect, but there is a issue that I found. (It doesn't show any comment in positions without king.) For example: there are lots of pgn out there that author want to speak about pawn structures and they show just pawns without even kings. and after that they come to analysing couple of games. You can see such a pgn in analyse this app but not here.", 'Almost perfect, if only there was a small gap between the buttons and the movement list. In many occasions when using the arrow buttons, accidentally touched movement list, and the game jumped to that step. Had to manually get the game back to the step I had been watching. It is a bit distractig. I changed the button size to Larger in Settings, but did not help as my finger-tips are big. Need some more space around the buttons. Thanks.', 'All I wanted was to go back to playing chess. Picked this app. It really does have a dozen of fatures that advanced players will appreciate but for me it lacks one fundamental feature, the layout. I am more focused on avoiding touching the field with list of moves that accidentally takes me into the twilight zone than on the game itself. Surprisingly the field is where my thumbs are. How about a swap? Maybe there is such option already available but got lost in the long list.', 'I like this app a lot. Wonder if it would be possible to implement voice control (both human vs machine and when the machine moves). This would permit to play with a normal board, rather than on devices...', 'Playing strength has changed. It is not anymore (100%.) In percentage. It is weaker now.', 'Very Impressive update, Now we can easily determine the strength of engine regarding its elo rating, job well done, i rate it 5 star for greatest update. Thank you and God bless. 😊😊😊', 'Excellent and just getting even better! After every update droidfish is becoming even better "best" chess app!', "I don't like the clock setup. I would prefer more options than just the Fischer increment. Including the Standard delay and Bronstein would be awesome. I personally prefer the Bronstein system when using western chess clocks. I also enjoy the byo-yomi system of Shogi and Go, and I do occasionally play real life chess games with that system, but honestly don't expect to see it in any kind of western chess program.", 'Recommended chess game...nicely built with smooth gameplay.', 'Only lacking is, there is no indication of check, kindly add this option But if there could be some indication on the chess board, eg circling the king piece, or changing the box color would be more easy for amatures to play.', 'great chess app. my problem is i cannot open my save game. can you help? thanks', 'Almost perfect. But if you can show the estimated ELO of the different strengths of the stockfish or the ELO of the player i.e. myself, it would help us to estimate our chess skills better.', 'Version 1.80 is an better like this version. Because this version Engine speed is slow compare with Version 1.80. i like that Droidfish Version 1.80. That is Great Please Improve the Speed of Engine', 'The DroidFish Chess app is awesome. This is the only chess app in the play store that find the mistakes of leela chess zero. Thanks sir for making this unbeatable game.', 'This is a really amazing app. It has the greatest chess engine in the world, I can practice my chess games. I absolutely love it.', 'Strongest chess engine... But cant place the pieces manually to analize any situation... One has to play from the scratch and reach out to the position... 🙄', 'Very nice app early updated stockfish 11 thanks a lot.please add more things so that we can make impressive chess game video for you tube uploads.', "I enjoyed playing...and it's hard...but I really need a harder level please send me.... please do reply me and tell me how I can join a harder Level.. I gave 4 star. If you tell me how I can join harder level I will rate you 5 star.. After edit.... Thanks for reply..... Now I give you 5 star", 'Marvellous feature-rich app. Should help anybody to enjoy chess and improve their game.', 'Awesome app. And please include the Komodo chess engine as well.. Thanks..', 'Best app to use, simple and detailed with amazing power of stockfish 11 and leela chess zero (if installed). Exporting pgns is great too', 'Best app for analyzing chess , but we cannot save position of pieces', 'Great app really. Many functionalities and it plays very strong', 'Its a superb chess game. No adverts and very difficult', 'Very difficult to defeat I did it only once when droid was also on my team', 'I am using droidfish in my redmi k20 pro android. Chess book opening directory and syzygy endgane table bases not working. Please suggest solution', 'in current time 2020 houdini is the most powerful and the strongest chess engine. please add that if you dont have rybka... top chess engines of all time- 1. houdini 2. rybka 3. stockfish', 'Please add a feature in next update,showing the attacked piece like arena gui..', 'Perfect but improve on the themes and outlay and cuchoo engine its weak', 'I can not find threads in settings but it was installed before updated version.On holding light bulb button there is only two option stockfish and cuckoochess but where is 3rd option?', 'While watching pgn database, there is no move sound....', 'Excellent app!! Latest development built is +17 Elo!! Is there any way to get the latest built for android?!', 'Almost perfect, but can you highlight those available moves ?'], 'appId': 'org.petero.droidfish', 'url': 'https://play.google.com/store/apps/details?id=org.petero.droidfish&hl=en&gl=us'}
