{'title': 'Shelter', 'description': '<b>This app requires Device Admin permissions to work. If you question what it does with the permission, please read or audit the source code, you can also build from the source code on your own.</b>\r\n\r\nShelter is a Free and Open-Source (FOSS) app that leverages the “Work Profile” feature of Android to provide an isolated space that you can install or clone apps into.\r\n\r\nShelter comes with absolutely no advertisement / statistics / tracking SDKs bundled with it. All source code is available in at https://git.angry.im/PeterCxy/Shelter or mirror https://github.com/PeterCxy/Shelter and the sources are licensed under WTFPL.\r\n\r\nThis app depends on your Android system’s implementation of Work Profile. Some vendor / custom ROMs may have a broken implementation that may cause crashes and even bricking of your device. One such example is MIUI from Xiaomi. I currently provide no support for such ROMs because I personally do not own any of these devices. If you are running Shelter on these ROMs, you are on your own. If any developer out there own these devices and could make Shelter run on these ROMs, please send pull requests and I’ll be happy to merge them.\r\n\r\nFeatures / Use Cases\r\n===\r\n\r\n - Run apps inside the isolated profile so they cannot access your data outside the profile\r\n-  “Freeze” (disable) background-heavy or seldom-used apps when you don’t need them. This is especially true if you use apps from "some company".\r\n -  Clone apps to use two accounts on one device\r\n\r\nCaveats\r\n===\r\n\r\nShelter is not a full sandbox implementation. It cannot protect you from:\r\n\r\n-  Security bugs of the Android system or Linux kernel\r\n-  Backdoors installed in your Android system (so please use an open-source ROM if you are concerned about this)\r\n-  Backdoors installed into the firmwares (no way to work around this)\r\n-  Any other bugs or limitations imposed by the Android system.\r\n\r\nAlso, Shelter cannot create more than 1 work profile on one Android device, and cannot co-exist with any other apps that manages a Work Profile. This is due to the limitations of the Android system, and I can do nothing about this.\r\n\r\nFAQS\r\n===\r\n\r\nQ: Why not use Island by OasisFeng, the creator of Greenify?\r\nA: Simply because it is not an FOSS app and it bundles with non-free SDKs. Note that this doesn’t necessarily mean that Island has anti-features like tracking (and I don’t think it has either), it’s just that I wrote Shelter as an FOSS replacement of it. There is no other reason why one would prefer Shelter over Island except for this one.\r\n\r\nQ: Why does Shelter always run in background?\r\nA: Please try removing Shelter from “Recent Apps” every time you close it. If it still persists in your notifications and eating up battery, you might have encountered a bug. Please file a bug report.\r\n\r\nQ: How do I uninstall Shelter from my device?\r\nA: 1) Go to Settings -> Accounts to remove the work profile; 2) Go to Settings -> Security -> Advanced -> Device admin apps to remove Shelter from Device Admin apps; 3) Uninstall Shelter normally.\r\n\r\nQ: If I encounter bugs, how do I report them?\r\nA: You could file an issue on either the main repository at https://git.angry.im/PeterCxy/Shelter or the mirror repository at https://github.com/PeterCxy/Shelter. Please include your system information as well as a logcat if possible.', 'descriptionHTML': '<b>This app requires Device Admin permissions to work. If you question what it does with the permission, please read or audit the source code, you can also build from the source code on your own.</b><br><br>Shelter is a Free and Open-Source (FOSS) app that leverages the “Work Profile” feature of Android to provide an isolated space that you can install or clone apps into.<br><br>Shelter comes with absolutely no advertisement / statistics / tracking SDKs bundled with it. All source code is available in at https://git.angry.im/PeterCxy/Shelter or mirror https://github.com/PeterCxy/Shelter and the sources are licensed under WTFPL.<br><br>This app depends on your Android system’s implementation of Work Profile. Some vendor / custom ROMs may have a broken implementation that may cause crashes and even bricking of your device. One such example is MIUI from Xiaomi. I currently provide no support for such ROMs because I personally do not own any of these devices. If you are running Shelter on these ROMs, you are on your own. If any developer out there own these devices and could make Shelter run on these ROMs, please send pull requests and I’ll be happy to merge them.<br><br>Features / Use Cases<br>===<br><br> - Run apps inside the isolated profile so they cannot access your data outside the profile<br>-  “Freeze” (disable) background-heavy or seldom-used apps when you don’t need them. This is especially true if you use apps from &quot;some company&quot;.<br> -  Clone apps to use two accounts on one device<br><br>Caveats<br>===<br><br>Shelter is not a full sandbox implementation. It cannot protect you from:<br><br>-  Security bugs of the Android system or Linux kernel<br>-  Backdoors installed in your Android system (so please use an open-source ROM if you are concerned about this)<br>-  Backdoors installed into the firmwares (no way to work around this)<br>-  Any other bugs or limitations imposed by the Android system.<br><br>Also, Shelter cannot create more than 1 work profile on one Android device, and cannot co-exist with any other apps that manages a Work Profile. This is due to the limitations of the Android system, and I can do nothing about this.<br><br>FAQS<br>===<br><br>Q: Why not use Island by OasisFeng, the creator of Greenify?<br>A: Simply because it is not an FOSS app and it bundles with non-free SDKs. Note that this doesn’t necessarily mean that Island has anti-features like tracking (and I don’t think it has either), it’s just that I wrote Shelter as an FOSS replacement of it. There is no other reason why one would prefer Shelter over Island except for this one.<br><br>Q: Why does Shelter always run in background?<br>A: Please try removing Shelter from “Recent Apps” every time you close it. If it still persists in your notifications and eating up battery, you might have encountered a bug. Please file a bug report.<br><br>Q: How do I uninstall Shelter from my device?<br>A: 1) Go to Settings -&gt; Accounts to remove the work profile; 2) Go to Settings -&gt; Security -&gt; Advanced -&gt; Device admin apps to remove Shelter from Device Admin apps; 3) Uninstall Shelter normally.<br><br>Q: If I encounter bugs, how do I report them?<br>A: You could file an issue on either the main repository at https://git.angry.im/PeterCxy/Shelter or the mirror repository at https://github.com/PeterCxy/Shelter. Please include your system information as well as a logcat if possible.', 'summary': 'Isolate Apps / Multiple Accounts', 'summaryHTML': 'Isolate Apps / Multiple Accounts', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.99, 'ratings': 427, 'reviews': 215, 'histogram': [76, 12, 29, 25, 281], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.5M', 'androidVersion': '7.0', 'androidVersionText': '7.0 and up', 'developer': 'Paper Airplane Dev Team', 'developerId': '5783913542139019388', 'developerEmail': 'peter@typeblog.net', 'developerWebsite': 'https://git.angry.im/PeterCxy/Shelter', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5783913542139019388', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/HnzlspUd3uJcmJP83Ei0qmQLFMpW4TvSB8OUdWWLG-daVbeVw1VRDxBAx8nsk906iA', 'headerImage': 'https://lh3.googleusercontent.com/41HCM0evOzdt_FqU7jNfZIv7K52AAR9YPoLC02mEafRRxhRp5UywDu3szX_eP3tY5A', 'screenshots': ['https://lh3.googleusercontent.com/LYZNt93xHX92aGIcAOP4Eoc4g2EHHiOH5fGcOE73tVZ7plrF6mrBfZgGsIN-p0mmxziT', 'https://lh3.googleusercontent.com/iDUnETiCZIDIHbkuiTCDzs8_6aKUtM4DaI_jK9d3Ic61ebniKB_1L9OkjXSm2sFcbwbD'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Aug 25, 2018', 'updated': 1568094391, 'version': '1.5', 'recentChanges': "Initial support for Android Q (10). This version may have also fixed the setup on some Huawei / Xiaomi devices, but there is no guarantee that it would work.\r\n\r\nNote that the initialization process has changed. The app will show a notification that you should click on during initialization. If it is not clicked, the initialization process cannot finish.\r\n\r\nPlease also be aware that FileShuttle isn't currently available on Android 10. It needs a total rework, which I do not currently have time to do.", 'recentChangesHTML': 'Initial support for Android Q (10). This version may have also fixed the setup on some Huawei / Xiaomi devices, but there is no guarantee that it would work.<br><br>Note that the initialization process has changed. The app will show a notification that you should click on during initialization. If it is not clicked, the initialization process cannot finish.<br><br>Please also be aware that FileShuttle isn&#39;t currently available on Android 10. It needs a total rework, which I do not currently have time to do.', 'comments': ['I like the concept of this app, but for some unknown reason it just keeps loading while saying "Please wait while we prepare Shelter profile for you", I let it go on for over a hour but still made no difference. The device I am using us OnePlus 7T', "it worked fine on oukitell, and i believe also on my sony device(s) but don't need it there, on ulefone armor 6e it triggered the 未写入Google key overlay . but i could get rid of that by using adb. If you encounter that Google: xda t3794521 The app did warn when installed, but i did not expect this, but at least it works. on (rooted) ulefone devices, most people should not risk it. The app is good, some phones less...", 'Good application, i installed it my android one phone , but there is a problem which i have faced , and I have to format my phone , so i give only 2 stars. When I all setup this app , It will work properly and I use it when I need otherwise I will keen turn off it (I always use turn off and turn on feature when I need) , but after some day when I want to turn on this app to use it can\'t turn on and show in a popup window "Setting keeps stoping" that\'s why I need to format my phone', 'Wonderful app. Does as it says it does. Just wish I could move files from my personal profile to work profile, but I understand it might be an (Intentional) Android restriction. grateful to have an FOSS app alternative! Do donate to the devs guys', 'Awsome. It is exactly what i needed. It integrates with the system soo well. You cannot even feel like you are using a 3rd party app.', "Shelter is awesome (not flawless but awesome)  I have tried a few other apps of this nature and could not always get them to behave 100% of the time. Shelter so far has been flawless. The UI is pretty minimal but does make it easy to understand what is going on. The Dev(s) have added features and fixed bugs since I started using it and I'm hopeful will continue to as well.", "After working for a few apps it stops working. Island works on miui. But this won't.", "This app is great! I can't overstate that. It can be a little tricky to figure out at first (took me maybe 5 minutes), but once you get the jist of how it works it's amazing. Let's you create a whole different atmosphere that you can build how you want to build. Tip: Make sure you put everything needed in workspace like Chrome, email, etc etc Took me a while to find this, but it's perfect!", 'Very useful app!! Can be used in many ways- 1. For creating second WhatsApp account 2. Removing Distractions: Install apps that can be distracting, in shelter. Now, when you turn off the work mode from notification shade, notifications from those apps get turned off. Also, work apps are shown in different section in app drawer, which helps you separate the work & entertainment apps.', "This app is fantastic, but has issues with Android 10. With the v1.5 release nothing happens when you try to clone an application to the work profile. Tested on a Pixel 3. EDIT: I was able to get cloning apps working by manually giving Shelter the storage permission and allow Shelter to install unknown apps via the Settings app. Though it doesn't always work and I have to close and reopen Shelter and then try again to clone the app. So something is off, but at least it's working now.", "Install it if you value your privacy. I use it to isolate all Facebook owned apps which I need use because of work. This way Facebook cannot pry on what's going on in my phone once the FB apps are frozen. The only downside is for a non-tech savvy person, this app will be hard to use specially if the task involves using file manager because files from main profile won't show here and vice-versa, thereby necessating an install of all apps through which you create/download media files or documents.", "Excellent and light. Works better on clean Android ROMs like Android One and the Moto's", 'I tried five different cloning apps before this one. Unfortunately, everything else had various degrees of success. I was able to split screen work and personal apps using Shelter with no issues whatsoever. I highly recommend this app.', 'Works exactly as described. Would be nice to have a dark mode.', "Can't transfer files between shelter and main in Android 10. Appears project has been abandoned :( Was an amazing app.", "Best app cloner by far! Also able to Sandbox and freeze apps. However if you use VPN or Blokada, cloned app won't use the VPN unless you cloned the VPN into work profile also, but then problem back to main app not able to use the VPN since Android only allow one VPN active per device, not per profile. This like Android limitations.", "Worked. Wasn't working for me so I uninstalled it. I can't uninstall the duplicate system files it made. Please help.", 'Unfortunately it does not work on one ui 2.0. I enabled device admin and storage permission but it cannot clone apps to the work profile', "It's a great, reliable FOSS App. I love it. Only minor issue is that when I clone Snapchat to the work profile, Snapchat crashes upon launch in both main and work profile. Probably a snapchat issue though", 'Please Fix File Shuttle For Android 10 This Option Not Available:((', "great alternative app! - I cloned this one app that required access to my photos, but the cloned app says I have no photos available, I've checked the permissions on it and storage is enabled. not sure what's happening", 'Kept crashing on android 10. I downloaded the new version.', 'Excellent app to separate work and personal data. For privacy folks like myself, this is a great tool to sand box applications that seek your personal data.', 'Good implementation of the work environment. File sharing between environments still needs some work but I understand that this is not simple due Android limitations.', "What I was always looking for but didn't know it was available. This app enables Android for Enterprise locally so that untrusted apps or work apps can run within the Work workspace. This is unbelievably useful. No more WeChat listening into my phonebook information.", 'I left five stars just to write this Say you could have com.abc.123 and then have multiple copies of it on the mode, does it do that?5', 'I was having trouble with facebook app. Even if you limit its background usage and background app it still prevents my phone from deep sleep. Thanks to this app I was able to auto freeze facebook when not being used. Suck on that Suckerberg!', "Doesn't work with KBC Mobile app, the app just crashes maybe checks if in working state or this app has been added tot thier blacklist to crash the app, can you add a random name changer for the app like magisk manager? Their KBC sign app work with shelter. KBC mobile app used to work through Island but now says I'm rooted.", 'Great！I do need it to separate apps from Chinese company to freeze them from running in background and block them to access my "real" contacts, photos and other things that belong to my privacy.', 'I have installed the app, however I cannot use it. I understand the idea of the app and I am already using another app "parallel space" for the same purpose. I am enthusiastic to use this app, but I cannot deal with it and I couldn\'t find any tutorial or whatever to explain. Thanks.', 'This app is amazing, i love how it so simple and assists you in setup and automatically clones the essential apps. Great work DEVS', "Not working for me on Pixel 4. Can't install some apps what is annoying. On Pixel 3 it was actually working but it was Android 9... Will change the score when it is fixed.", 'Works perfectly. Would rate it better than Island! My apps run flawless. Its the best app for application sandboxing. No doubt!', 'Perfectly fits in my needs. The additional option to install apk only in work place is fantastic 👍🏻', 'i loved the app, im giving a 4 star ratings due to Viber app not functioning properly (no connectivity issue) keep up the good work 💪, Cheers.', "this app created clone of play store on its own and then both apps didn't work.. ruined 1 hour", 'Liked the idea, butmost of the apps on work profile wont run, it just soft reboots my phone. Device: Moto G5s plus ROM: Resurrection Remix (android pie)', 'Love this app so much, provides great solution to simply install and launch second account on same device!', 'Perfect for my need; Just one thing can be improved and that is APP-ICON 😅', 'It does exactly what I need it to and lets me have two accounts running at once — with notifications!'], 'appId': 'net.typeblog.shelter', 'url': 'https://play.google.com/store/apps/details?id=net.typeblog.shelter&hl=en&gl=us'}
