{'title': 'SmartNavi - GPS independent Navigation', 'description': "SmartNavi offers GPS independent and step-based OpenSource navigation for pedestrians.\r\nSave up to 80% energy and become independent from GPS.\r\n\r\nThe app recognizes every step and its direction by using internal sensors. So you can save a lot of energy and navigate much more efficiently. After reaching your destination your battery will last much longer. \r\n\r\nUse SmartNavi's background service (GPS Fake) to provide location data for other navigation apps.\r\nSo you can navigate with your favorite apps stepbased and energy saving. \r\n\r\nYour feedback is highly appreciated and keeps this project running!\r\n\r\nWebsite: https://smartnavi-app.com", 'descriptionHTML': 'SmartNavi offers GPS independent and step-based OpenSource navigation for pedestrians.<br>Save up to 80% energy and become independent from GPS.<br><br>The app recognizes every step and its direction by using internal sensors. So you can save a lot of energy and navigate much more efficiently. After reaching your destination your battery will last much longer. <br><br>Use SmartNavi&#39;s background service (GPS Fake) to provide location data for other navigation apps.<br>So you can navigate with your favorite apps stepbased and energy saving. <br><br>Your feedback is highly appreciated and keeps this project running!<br><br>Website: https://smartnavi-app.com', 'summary': 'Save 80% battery with GPS independent navigation for offline maps', 'summaryHTML': 'Save 80% battery with GPS independent navigation for offline maps', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.28, 'ratings': 622, 'reviews': 210, 'histogram': [43, 37, 24, 111, 404], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Christian Henke', 'developerId': 'Christian+Henke', 'developerEmail': 'info@smartnavi.app', 'developerWebsite': 'https://smartnavi.app', 'developerAddress': 'London, United Kingdom', 'privacyPolicy': 'https://smartnavi.app/privacy', 'developerInternalID': '6339154429119321814', 'genre': 'Maps & Navigation', 'genreId': 'MAPS_AND_NAVIGATION', 'icon': 'https://lh3.googleusercontent.com/9UPRoux2OBkX5ZYJaLrit_wCXVdBDkKQb7srhdhMPQmsnVg6RfTGntzqIBKmb0qCdw', 'headerImage': 'https://lh3.googleusercontent.com/S1kuNcF5itkfg8Z43l6l7sPdoidGd1UrHmyiC_uc-Qnq0WRL6vEmMNqDMiZHKhg2CMQ', 'screenshots': ['https://lh3.googleusercontent.com/dKLZQzPjSN9WXjkxbUTh-6Nk7NjergjFYXnB4T1ZTn9bPoS5H9y0StLXyB6w4GLdcXle', 'https://lh3.googleusercontent.com/ZYu_cKSbPOMFr6Cjv1Mzz-RWA6hlTLHjtn5XSokuehspplaGiOp8pYfABAeJum1skeE', 'https://lh3.googleusercontent.com/K3Kbj3PsIZCOrScmfWoaNiqDO5xiNww1ybBFHID32BmUw-dLj3U6-MgCqOweFmbe0GaP', 'https://lh3.googleusercontent.com/AJc5-kmAanv6fURnzn06ddvceYPnQRnNSQeuYSepFSxJVpAaURU2FkPRc3iDSlZnEFE', 'https://lh3.googleusercontent.com/Q8Mn-rr3HTZ6l-_QL5csyIvhb3iLwoWbFfYTdmQdNlvfljGvR8JNr1UyIr_LJNAZ3Qo', 'https://lh3.googleusercontent.com/sWXI8GsqcGj3CTsYaXeroPo1w3TervdqZ3nd3QxFbL-pv2_p7_iHyTyKm_GbPn6BHDHI'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'May 4, 2012', 'updated': 1569175172, 'version': 'Varies with device', 'recentChanges': 'Happy Autumn! :)\r\nSome improvements for you!', 'recentChangesHTML': 'Happy Autumn! :)<br>Some improvements for you!', 'comments': ['great', "Haven't tried it yet", "It doesn't give the accurate location and gives wrong directions", 'Great app. With obd integration it can be really useful as a driving aid also', 'Fun and functional, but limited by device gyroscope precision.', 'Fun and great for battery life!', 'Friendly user', "It's not precisely accurate but it's close enough. I don't use it everyday, it's a just-in-case app that I stumbled upon. I can't believe there isn't more navigation apps like this! Well done. Just one question though. Could there possibly be a way to not have mock locations checked for background location service to be used? Maybe in a future update? I'd love for this battery saving step based navigation to work along side pokemon go! It could make the game run twice as long or more on a full charge.", 'Helps to find next bus if you know your transit system.', 'Fun little app.', 'Fun little app', 'This corresponds to inertial navigation old wide body jets used to use. Makes me feel like a concorde; still cool, slick and functional,  although outdated! 😎', "I walk a lot and I need this type of app. Great idea of creating such a wonderful application and that is free too. I don't have PayPal account but I'm happily agreed to pay for this app. Great job.", "In the instructions it says to always hold your phone in front of you. Doesn't seem really practical if you are walking. It is natural for your arms to swing. Seems pretty uncomfortable if you are going to be walking a couple miles.", "Finally an app for those of us that walk allot. I live in New York City and we walk allot out here,  I don't always need a big,  clunky app that thinks I'm driving because it doesn't give me a choice for walking directions, and if it does its usually off... Thank You Mr. Hence :)                                                  (Just a suggestion,  maybe in the future you guys can add subway &  bus stops)", 'Cool quick for less battery nav, can it work with no cell signal??field junkie me...', 'GOOD BUT ONLY SHOWS WALKING SO FOR AS DISTANCE', 'Works as described. Energy saver relative to similar apps.', 'But keep forgetting I have it. ARG.', 'Fabulous app this guy is smart get it works great up near Scotland', 'Thank you for bringing a research lab technology to Android users! Five stars - for making a concept a real thing that works pretty well.  Navigation accuracy surpassed my expectations: the error for a 2 mile curved path with about 5 90 deg turns and more gradual turns resulted in a typical  length of a shopping mall.  This can be reduced even further by tweaking the height setting. Background service is not usable though:( It works only for 2 min or less with Google Maps, even less with OSMAnd.', 'Danke dafür!', 'This app will be awesome if internals off a building could be mapped', '(Earlier version) liked the idea of inertial navigation (because my phone gps isn\'t always very accurate),  and the app says it\'s gps independent. However, after the initial gps reading (for starting location),  I turned off my gps (to save battery power). The app said I needed to leave my gps turned on.  I don\'t understand the point of a "gps independent" app that tells me to leave my gps turned on. I stopped using it - I guess I\'ll try the new version and see if it\'s any better.', 'Needs a live track', 'Awseom to use and too userfriendly', 'Like', "This app sure is a reply to a cry for help from the battery junkies and the users with non GPS devices. It seems very well built and it does what it is suposed to. Great app! Of course there are always some aproximation errors but we all know that android devices aren't build for location applications only, for that get a real GPS.", 'Very nice and useful. To make it more accurate & useful kindle add option to update map interval in Seconds / Minuts.', 'Good', "i don't have gps installed on my phone pls reply fast", 'Looks interesting. Will try it out for sure this spring when its warm again', 'Nice', 'Quite inaccurate, but good idea', 'Dead reckon with GPS off works reasonably well, drifts after a while though of course. You can fake moving by shaking the phone when its facing the way you want to go :-)', "It says I'm in Oklahoma when I'm in Nebraska =( sad", 'Sony Ericsson SK17i, installed and appeared to work. However, in New Zealand, I was talking North, and it thought I was walking South. Longitude seemed fairly accurate however.  There a setting to change this?', "Its a brilliant idea where whe can't connect to the gps", 'With GPS enabled it barely kept me within the big blue shaded bubble. Without GPS on reverse trip. It tracked my forward progress fairly well, but bubble veered 1 1/2 blocks right. After a turn it showed final dest 2 blk s away', 'On S5 w up-to-date os.  Opening screen is boogered  up and will not do anything.  Have tried to load 3 times.'], 'appId': 'com.ilm.sandwich', 'url': 'https://play.google.com/store/apps/details?id=com.ilm.sandwich&hl=en&gl=us'}
