{'title': 'PSIAndroid', 'description': 'PSIAndroid is a phpSysInfo client for monitoring your systems\r\n\r\nRequire phpSysInfo on the server: http://phpsysinfo.sourceforge.net\r\n\r\nFeatures:\r\n- Operating System Information (Version, Uptime, ...)\r\n- CPU, Memory and Disk usage\r\n- Multi-host\r\n- HTTPS\r\n- Basic/Digest Authentification\r\n- Temperatures (MotherBoard and IPMI)\r\n- Fans speed (MotherBoard)\r\n- Network informations\r\n- PSStatus\r\n- SMART\r\n- RAID\r\n- UPS\r\n- UpdateNotifier\r\n- Printers (SNMP)\r\n- Auto-Refresh feature (experimental)\r\n- Other plugins (coming soon)', 'descriptionHTML': 'PSIAndroid is a phpSysInfo client for monitoring your systems<br><br>Require phpSysInfo on the server: http://phpsysinfo.sourceforge.net<br><br>Features:<br>- Operating System Information (Version, Uptime, ...)<br>- CPU, Memory and Disk usage<br>- Multi-host<br>- HTTPS<br>- Basic/Digest Authentification<br>- Temperatures (MotherBoard and IPMI)<br>- Fans speed (MotherBoard)<br>- Network informations<br>- PSStatus<br>- SMART<br>- RAID<br>- UPS<br>- UpdateNotifier<br>- Printers (SNMP)<br>- Auto-Refresh feature (experimental)<br>- Other plugins (coming soon)', 'summary': 'PSIAndroid is a phpSysInfo client for monitoring your systems', 'summaryHTML': 'PSIAndroid is a phpSysInfo client for monitoring your systems', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.3, 'ratings': 472, 'reviews': 130, 'histogram': [42, 9, 47, 37, 335], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Erkan Valentin', 'developerId': 'Erkan+Valentin', 'developerEmail': 'erkan2005@gmail.com', 'developerWebsite': 'http://rk4an.github.com/psiandroid', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '4837809783816066074', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/JScGGY3l6zVr5US1ZKU80nwjVQ44uTl0YIOtzLE4MWp63OAEdToWYSkN29PjHB09TA', 'headerImage': 'https://lh3.googleusercontent.com/5702gBjAiM52y_1iMt9RonDCToNiH77amek_o8vMUknYdTfvpgflPBCBeL7ikKH-_nI', 'screenshots': ['https://lh3.googleusercontent.com/_eDwLJWxsSJnLHe2s-VCBaIL4HkY_yBaBFBk5ruIVDJ0ezVNLxpQJj1x1BhDUFvfm3Tb', 'https://lh3.googleusercontent.com/XLOcFTnnQDGBrheoEgwIOIhfaTMNrg6YrdpaTiDEA_l45E0nHDAP6ipb24BnxPmOcg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 19, 2011', 'updated': 1533650232, 'version': 'Varies with device', 'recentChanges': '0.92 (920)\r\n- Add GR translation', 'recentChangesHTML': '0.92 (920)<br>- Add GR translation', 'comments': ['I set up my computer with Wampserver. This happened to have phpSysInfo pre-installed. I really find this app useful for viewing the stats of my computer from my tablet.', 'Программа со своими задачами справляется отлично. Спасибо!', 'ببخشید این برنامه واسه چه کاريه؟', 'Done', 'like', 'بسیارعالی ست', 'How to use it guys pm Me please', 'I like this app', 'Nice', 'I love this apps', 'Goooood', None, "This app works great in conjunction with phpsysinfo, but it's a bit simplistic, and doesn't have all the features of the web interface. Please keep implementing features, and I will gladly donate money.", 'I just want and this app more and more', 'Great working', 'Cool', "phpsysinfo v3.2.2. It's working now on my etrayz xTreamer. It was never running but now with the timeout up tot 45 seconds it works. Possible you can give a max of 60 seconds for slow arm processor mini server. Cool and hold up your super work. Mike.", 'This program is great, and I got it to work on two web servers I own (10.0.0.180) and (10.0.0.185) on the LAN (yes I know it won\'t work outside LAN without port forwarding), but I have tried entering the URL into the "Host" section of this app and I keep getting the error "[XML_PARSER_ERROR] At line 1, column 0: unclosed token"... Any ideas? :)', 'how to use it...not understand....need host?who will be host!! i think dota...haha', "Used for monitoring my Linode VPS. Clean design and very easy to use. It's even Material-aware for Android 5.0 Lollipop devices.", 'I want know where is file configuration? Because i want to backup my configuration to another smartphone.', "This is obviously new, but the layout is very poor. For example, mounted drives do not show the whole path, even in landscape mode. It also lacks a lot of the information that phpsysinfo gives in the browser. This app has a lot of promise, but it needs more development to be really useful. At this point you might as well open the browser on the phone and point it to your website.  EDIT: A little over a year later, this app has improved tremendously and was updated to address my gripes--something every user should respect, as developers don't always have the time to wade through wave after wave of us just to address our critique of their work. Super double A+, the app is simple and highly functional with a very workable UI.", 'Tang na', '😅', 'Great app. Excellent feedback from developer.', 'Great way to monitor your systems on your phone!', 'Works great.  Simple to use.', 'The only other things I would want from a remote system status app would be a widget for my home screen.  Bravo.', 'Easy to configure. Would like the option for it to auto refresh ever minute or so.', 'Allows me to see all my servers and monitor them individually.', 'Same as title. Simple but does its job well.', 'Works great', 'Nice simple interface, providing critical information about your server - uptime, load, users, memory and disk usage, critical processes (whether running or not).  Very simple to configure - just pass the URL of your phpSysInfo install on your server - and even simpler to use.  I had a problem with my configuration and could not get the app to load the data from my server, so emailed the developer. He responded within minutes and the problem was sorted within the hour - down to a typo in the configuration on my behalf.', 'Literally getting better by the day, I emailed the developer about a feature request and not only did they respond to me same day, but added my request within hours.  Great app, even better developer...', 'Constantly getting better. Awesome! Now it only needs a nicer UI.', 'I found this app very useful to have a quick glance at the status of my servers, directly from the phone. Too bad it looks ugly on my old Android 2.3...', "I really like this app. PSI itself is a really handy web-based system information tool, but this app makes it easy to check on things whilst being mobile. I like how the interface is really simple, intuitive, and fits in well with the Android design principles. It shows just about everything that the web-based version does, but I'm sure the app will be feature complete soon. Great work!", 'Easy to setup, works as expected, no issues that I can see.', 'This app is a very handy tool for anyone who likes to keep tabs on their servers. PhpSysInfo is very easy to setup to begin with, and it just makes it even easier from your mobile device. Very responsive dev! Emailed with a feature request and 3 days later an update was pushed out with my request!!', 'Great app, waiting for the other cool options (Temperatures, Networks information)'], 'appId': 'com.phpsysinfo', 'url': 'https://play.google.com/store/apps/details?id=com.phpsysinfo&hl=en&gl=us'}
