{'title': 'Homescreen Playlists for Spotify', 'description': "Totally free. No ads.\r\n\r\nDon't like navigating the Spotify UI just to open a playlists? This widget will solve your problem. Adds a widget that will put your playlists right onto the homescreen.\r\n\r\n<b>Usage</b>\r\n1. Find the widget in the widget listing and drag it to the homescreen.\r\n2. Select which playlists should appear in the widget.\r\n3. Arrange the playlists.\r\n4. Done!\r\n\r\n <b>Notes</b>\r\n- App will fetch playlists of the spotify user who is currently logged in.\r\n- If you are not logged in, a login prompt will be shown. \r\n- Once placed, the widget does't update. (Accessing spotify data might involve login prompts and such, so it't hard to update the data in the background).\r\n- Some low-spec phones might have trouble opening a playlist sometimes. The widget instructs to open a playlist. If that instruction doesn't reach the spotify app for whatever reason, there's not much I can do about it.\r\n- Make sure you have some free space for the images and such.\r\n- There is probably a limit on how much stuff you can have in one widget. Might not work if you add thousands.", 'descriptionHTML': 'Totally free. No ads.<br><br>Don&#39;t like navigating the Spotify UI just to open a playlists? This widget will solve your problem. Adds a widget that will put your playlists right onto the homescreen.<br><br><b>Usage</b><br>1. Find the widget in the widget listing and drag it to the homescreen.<br>2. Select which playlists should appear in the widget.<br>3. Arrange the playlists.<br>4. Done!<br><br> <b>Notes</b><br>- App will fetch playlists of the spotify user who is currently logged in.<br>- If you are not logged in, a login prompt will be shown. <br>- Once placed, the widget does&#39;t update. (Accessing spotify data might involve login prompts and such, so it&#39;t hard to update the data in the background).<br>- Some low-spec phones might have trouble opening a playlist sometimes. The widget instructs to open a playlist. If that instruction doesn&#39;t reach the spotify app for whatever reason, there&#39;s not much I can do about it.<br>- Make sure you have some free space for the images and such.<br>- There is probably a limit on how much stuff you can have in one widget. Might not work if you add thousands.', 'summary': 'Widget that instantly launches your playlists from the homescreen.', 'summaryHTML': 'Widget that instantly launches your playlists from the homescreen.', 'installs': '50,000+', 'minInstalls': 50000, 'score': 3.81, 'ratings': 368, 'reviews': 153, 'histogram': [88, 7, 14, 33, 224], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '4.7M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'BiitSoft', 'developerId': 'BiitSoft', 'developerEmail': 'parikkapetteri@gmail.com', 'developerWebsite': None, 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8373146019904523967', 'genre': 'Music & Audio', 'genreId': 'MUSIC_AND_AUDIO', 'icon': 'https://lh3.googleusercontent.com/lJJrakUCFaHmArkbHLEY0LI6iC_oQK4OgjxBj_35B0B0axmWs-U5kAPGMOJwwhXDjHM', 'headerImage': 'https://lh3.googleusercontent.com/bOLXGvk60dAFeDhHhRlGvvw9QYNtO61zMnq7qHdXHGzOKLasYWCriS7bY8u0u9j990HL', 'screenshots': ['https://lh3.googleusercontent.com/jhlJHQ7vpvMYS2iJIbTs39FsmcOX53N1T52xyb_Ug19v0Fhc69ztCZnJ3ms05rHzZlQ', 'https://lh3.googleusercontent.com/3jD3CeQT2PMaJf0L_YtUiklcPRBdC0rg7vUMj4ZU5SplGSMnovSnqaUnVKFzSGCDNNGU', 'https://lh3.googleusercontent.com/FLs0ktKih8g8Ns1GOoBpDxeatKBSyz7YTv01e2QyLgKffhAtMmRsj5Lhhgyly-LNuA'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 19, 2017', 'updated': 1588972722, 'version': '2.0', 'recentChanges': 'Fixes.', 'recentChangesHTML': 'Fixes.', 'comments': ['This app is just a quick shortcut to your playlist... no big deal... It would be nice if it would also let you view the songs and artists in the selected playlist and not just the playlists only. The old Spotify Widget allowed us to do that...', "It does its job, but it isn't what I wanted. I was hoping to find something to replace the widget spotify retired so i xould easily manage my music from the home screen, however this widgett only lists the playlists you have selected.", 'Fantastic... No crashes in 3 yours and virtually no memory use all things considered', "The widget won't update when the next song plays, it just shows the song I was playing when I put the widget on my screen. Please fix this, I'm in a Samsung Note 8", "It's something Spotify should have in it. I just wish it was editable so we don't have to remake the entire list every time we make a change.", 'Love it. Would like to edit the playlists without having to set up a new widget every time, otherwise perfect.', 'Fantastic, has made me listen to a lot more varied music!', "Widget doesn't show up in my widget list even after removing and reinstalling it.", "You can't play music like you used to bE able to. This makes me SO angry. I hate the new update.", 'didnt work kept giving me an authentication error.', 'does not connect to spotify.', "∆ 'how to' pin a playlist to start? please let me know.", 'Doesnt work with Spotify Lite', 'I am not able to use it', "Don't work", 'So far so good', 'Emma 7', 'ওকে', 'It sucks', 'Mehboob', 'Quite impressive.', 'cool', "Widget doesn't scroll after Oreo update...please fix, was very good before that!", 'I guess', "Can't edit widget once created. Pulls playlists from Spotify which is convenient unless you have a lot of playlists and there is no search. I have over 600 play lists. Would also like to see which lists I have downloaded which are the ones I would likely add to the widget for quick access while traveling. No transparency for the widget. Again no way to further customize add to reorder widget makes this not practical.", "It sucks 👎 I don't know how to use it.. It wont open. I restarted my phone just to see if it would work and nothing happened", 'Awesome. Thank you so much for developing this simple and brilliant app, the features of which are inexplicably not baked into the Android Spotify App in the first place. Yes, it could be more refined, but it is simple and it works. Bear in mind you can create as many widgets as you like and they will all still work. Brilliant app. 5 stars.', "Used to be so awesome but now appears to be broken!! Please please fix it, \nI rely on this every day and it's criminal that Spotify itself doesn't \noffer a similar widget", 'Would be great if we could edit the opacity of the widget in order to make it transparent, that would be perfect for most of us.', 'Great app but would give 5 if I could have transparent background', 'Great app. Does exactly what it claims. I had to restart phone on install, but everything worked great after that', 'Game changer! Thank you so much! Would be nice to be able to change playlists after the widget is added though...', "Please add transparent widgets as well and I'll give you 5 stars! ❤️", "It doesn't work for me", "It sucks doesn't even let me put it on home screen", 'Quick and easy way to play any of my playlists.', "Needs adjustable transparency other than that it's great", 'Transparent background and autoplay would make it perfect. Still does everything I need.', 'This sucks never use it', 'Says what it does 😝'], 'appId': 'com.wavy.spotifyplaylistwidget', 'url': 'https://play.google.com/store/apps/details?id=com.wavy.spotifyplaylistwidget&hl=en&gl=us'}
