{'title': 'Chroma Doze (white noise)', 'description': "Now you can sleep soundly with the soothing algorithms of Fourier analysis.  Just sketch your favorite spectrum, and listen to a generated stream of white noise (or more precisely, colored noise).  If sleep's not your thing, you can also use it with headphones to drown out neighbors, or tweak the settings to erode eardrums and frighten small children.\r\n\r\nNotable features:\r\n- No ads or weird permissions\r\n- Doesn't just play a looped sample\r\n- Relatively power-efficient\r\n- Runs in the background\r\n- Save your favorite sounds in the Memory list\r\n- Contains math\r\n- Open Source / Free Software (GPLv3 license)\r\n\r\nIf you'd like a sleep timer, this apps is compatible, and (the last time I checked) free with minimal permissions:\r\n- https://play.google.com/store/apps/details?id=robj.simple.sleeptimer", 'descriptionHTML': 'Now you can sleep soundly with the soothing algorithms of Fourier analysis.  Just sketch your favorite spectrum, and listen to a generated stream of white noise (or more precisely, colored noise).  If sleep&#39;s not your thing, you can also use it with headphones to drown out neighbors, or tweak the settings to erode eardrums and frighten small children.<br><br>Notable features:<br>- No ads or weird permissions<br>- Doesn&#39;t just play a looped sample<br>- Relatively power-efficient<br>- Runs in the background<br>- Save your favorite sounds in the Memory list<br>- Contains math<br>- Open Source / Free Software (GPLv3 license)<br><br>If you&#39;d like a sleep timer, this apps is compatible, and (the last time I checked) free with minimal permissions:<br>- https://play.google.com/store/apps/details?id=robj.simple.sleeptimer', 'summary': 'Generate white noise by sketching a spectrum on the screen.', 'summaryHTML': 'Generate white noise by sketching a spectrum on the screen.', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.75, 'ratings': 938, 'reviews': 421, 'histogram': [18, 0, 46, 65, 806], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.1M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Paul Marks', 'developerId': 'Paul+Marks', 'developerEmail': 'paul@pmarks.net', 'developerWebsite': 'https://github.com/pmarks-net/chromadoze', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '6759352647244034304', 'genre': 'Music & Audio', 'genreId': 'MUSIC_AND_AUDIO', 'icon': 'https://lh3.googleusercontent.com/DIohOgz1dptse-HHBKbGNeouB8GjcAt6untVs8byNsXJoZyrccxR4MRlU_Lkiolg1g', 'headerImage': 'https://lh3.googleusercontent.com/1UFrl4Z5j9-QhiyLzRyPMjoiU-TQabuSrwbTAOYgSNcRghIF37TsM_-LF_6T3RJQk-J2', 'screenshots': ['https://lh3.googleusercontent.com/b3A4CPUUOcEUyg8a5xuOeYZo8YAReO8G_SHjlEK2tDsYwF5iT2KyMLRpBOh3RHwGRQo', 'https://lh3.googleusercontent.com/tcsaUKvsg3uVryWcrXeEuB6XkqYQXFnYoKDuyNplvAXMNPmjXip6QXUcj5wa5dBKqmD-', 'https://lh3.googleusercontent.com/LidNmvVLUz0rO2QC56pgzJv6kLNWz68cKnoOeAGprp5Szb0DPS0mgAni6kAWlknEnH8'], 'video': 'https://www.youtube.com/embed/9MZmwkn-2rw?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/9MZmwkn-2rw/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Feb 7, 2010', 'updated': 1568677752, 'version': '4.1', 'recentChanges': 'Fixed some service lifetime bugs related to the new Android SDK.', 'recentChangesHTML': 'Fixed some service lifetime bugs related to the new Android SDK.', 'comments': ["I have been using this app for a few years now, I love being able to adjust the frequencies to make the perfect noise. It's become part of my nightly bedtime routine to help fill silences with sounds like waves or can noise. Great job Paul!!", "Barely drains my battery at all. Best white noise generator I've seen. The developer certainly knows what he's doing in terms of CPU and memory optimization. I love how you can customize the noise, I use it to turn up the bass.", 'Excellent simple app with a totally customisable noise profile - and not actually based on loops like some of the more popular/paid apps. Also has the option of playing in the background and in standby. Superb.', "Drowns out my husband's snoring, an EVEN BETTER, will play while I also play music player, or even YouTube. So I can listen to my sleep songs playlists and still have a white noise background to completely block all external sound. Now I'm sleeping like a baby, and my kids have to walk all the way across my bedroom and wiggle my feet if they want to talk while I'm sleeping. Which seems to be decreasing the # of early morning questionnaires lol", 'Absolutely Amazing. Works so much better than any other similar app. Fun to use, lightweight, and effective.', 'I really enjoy this app, you can create so many variations of white noise. The only downside is there is no built in sleep timer, you need to download "simple sleep timer" in the app description. That app works for turning chroma doze off though... So I would put this at 4.5 stars', "This app is amazing. I know you might not see this since you stopped updating a while ago but I'm wondering if we can get an option to export the audio in wav format? Thanks.", '1. Excellent and customizable white noise 2. Opensource 3. Ad free 4. Less battery consumption 5. Works in offiline mode', 'Best. White noise app ever. Completely customizable, anything the other white noise apps can do, this one can do better and probably more. Thank you. I needed this. Simple, straightforward, user friendly.', 'It keeps stopping "mysteriously" according to the notice that comes up. I\'ve had it for years and haven\'t had this problem before.', 'Only TWO permissions! The app itself is very small, takes up about 2MB. Totally adjustable to higher or lower sound preferences. This is what all sounds apps should do. Thank you. Pixel 2 XL', "I love this app so much. If you listen real hard to each different sound. DAMN It's eery. I fill like there is something living in that sound. Awesome 4 meditation.", "Can be tuned for the sound you want, no ads, does exactly what's needed.", "Awesome no nonsense white noise generator. Even better it's FOSS! THANK YOU!", "Love this app and experimenting with sounds, it's fun. I finally got the perfect brown noise to block out annoying city/neighbor sounds while still being able to listen to my podcasts and audio books.", 'I wish I could export the sound to mp3 or wave or so.', 'Great app, easy to tune and experiment with different volumes across the frequency spectrum. helps me sleep without my fan when I travel.', "Finally, an ACTUAL white noise generator. I must've downloaded at least 5 apps that just loop crappy samples before I got to this one. Thank you.", 'I have been using this app for a while and recommend it but lately it will stop and start through the night for some unknown reason. Please fix this.', 'Might be my favorite app. Have used it for years now. No dumb redesigns - consistent and simple.', 'Great for sleeping white noise without hearing a loop blip on the sound!', 'Love it. Customizable sound.', 'it keeps stopping mysteriously after 2 minutes.', "You must have changed up the app so that I can't play two apps at the same time I liked it better before", 'Fantastic app. Thank you Dev. Greatly appreciated.', 'Simple and easy', 'Thank You Paul!!! Awesome app.', 'found your app on stackexchange, app is good', 'This is the best app in the Play Store', 'This app is the 8th wonder of my life. Beautiful 😊', 'This is so good it deserves a nobel peace prize!', 'helped me sleep when housecwas near expressway...', 'simply the best', 'still the best', 'perfect for sleeping', 'Simply the best way to sleep! Constant noise i hook my music bullet in headphone jack amplifies the noise! No screwy ads, not a battery pig. Fantastic! 7 years later and still Loving the app!!!', 'Awesome app!!', 'Very nice', 'would be interesting to see filters for the sound. ex: the noise becomes flowing water, wind, or something. also saved settings that you can select and load. that needs added, i would love that. edit: above review is from 6 years ago. save settings were indeed added, which was great. not much else has been done feature wise, but it gets the job done. also for all this time this app hasnt had any ads. ad-free white noise apps are as rare as it gets, so kudos to devs.', "The BEST basic white noise app out there! There are no looped sound recordings, just white noise. You can customize the sound hiss generated and save multiple presets - example: loud covering TV hiss, low 'wind noise', etc. If I could donate to support the Developer's other work, I would throw a few dollars their way in appreciation."], 'appId': 'net.pmarks.chromadoze', 'url': 'https://play.google.com/store/apps/details?id=net.pmarks.chromadoze&hl=en&gl=us'}
