{'title': 'Mythmote', 'description': "MythMote is an open source android application that controls MythTV frontends. Control is obtained through the frontend's raw text-based TCP socket interface.\r\n\r\nNOTE: You MUST have a functional MythTV setup and mythfrontend network remote control enabled.\r\n\r\nFeatures:\r\n * Manage multiple frontends\r\n * Basic navigation and media control\r\n * Keyboard input passthrough to frontend\r\n * Wake-On-LAN\r\n * Customizable Keybindings\r\n * Supports small and large screen devices\r\n\r\nKnown Issues:\r\n* New material themes do not always look correct on older android versions.", 'descriptionHTML': 'MythMote is an open source android application that controls MythTV frontends. Control is obtained through the frontend&#39;s raw text-based TCP socket interface.<br><br>NOTE: You MUST have a functional MythTV setup and mythfrontend network remote control enabled.<br><br>Features:<br> * Manage multiple frontends<br> * Basic navigation and media control<br> * Keyboard input passthrough to frontend<br> * Wake-On-LAN<br> * Customizable Keybindings<br> * Supports small and large screen devices<br><br>Known Issues:<br>* New material themes do not always look correct on older android versions.', 'summary': 'Mythtv frontend control interface.', 'summaryHTML': 'Mythtv frontend control interface.', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.14, 'ratings': 759, 'reviews': 306, 'histogram': [83, 37, 22, 159, 455], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.7M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'TKj', 'developerId': 'TKj', 'developerEmail': 'tom8oe@gmail.com', 'developerWebsite': 'http://pot8oe.github.io/mythmote/', 'developerAddress': None, 'privacyPolicy': 'http://pot8oe.github.io/mythmote/MythMotePrivacyPolicy.html', 'developerInternalID': '8015372113474819213', 'genre': 'Video Players & Editors', 'genreId': 'VIDEO_PLAYERS', 'icon': 'https://lh3.googleusercontent.com/Wn9kRZyvnAJr6QljjDtuUUyUSqLJh355JhqFFMG5RCSXE4GP0IdjhNnWLlrXLZ1FJ9s', 'headerImage': 'https://lh3.googleusercontent.com/UN_zLQMkMrmwj_0uAcA-nmHwoCWt91nRUZgxbqB4xFCsTTkoiMBK17I5WC7Jlm3uZQ', 'screenshots': ['https://lh3.googleusercontent.com/1oEwwFp_m0qs53x5nidRYL7KPIWl3SDZomi77-FRrG05-xpjXXquppwBSt8Ybvg7i2hX', 'https://lh3.googleusercontent.com/StvCLcUC7LfRemkotcZ3J1vNlAj85ihLZBsqsZx0Ap-KeCAbXF-vyTwJhUF-_9nhcqA', 'https://lh3.googleusercontent.com/clj9E_LlNuHihDW-wPuxZFt6IYwlpSjvtM7YN6ssXT3cQpPFGWfNIXzrMuBF5hCahU61', 'https://lh3.googleusercontent.com/lj3kd75L_JsTd5KdFnWi7YAwvCPMNVfaJ65W3esQiuC6YMmA6LvegSD3JcIjb7BWO05B', 'https://lh3.googleusercontent.com/-Hep6u4IGZF9k9VEP8RxS9Zrw_ZqZyPqIGoSkf1CJH6Lf-teD59EV9wR8-4f2qpwVA', 'https://lh3.googleusercontent.com/Ve1V4Gkd4zVZvdRfJm9eXQPsAzSm7UygqvKdCQlPKK8wT-XegDjg10QOoL8IsBNG56E2'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': None, 'updated': 1559850918, 'version': '1.11.0.0', 'recentChanges': "1.11.0\r\n* Removed donate menu item as it violated Google's Payment Policy", 'recentChangesHTML': '1.11.0<br>* Removed donate menu item as it violated Google&#39;s Payment Policy', 'comments': ['simple, clean, does what it advertises and does not spy on you', 'Found this by accident when my lirc broke and so pleased I did. Great remote and so much easier to setup than lirc. Would be even better if you could use it on Mythwelcome but thats only a minor issue. Overall Im really pleased with this app. reply to dev. 20/08. Ah that makes sense. Glad to see the app back on Play 😁', 'My goto app for mythtv control. Simple and clean interface', "works well mpst of the time... I've an old phone", 'Works really well.', "Once you use this you won't need it.12/7/16 Sad that the latest update has removed what had become a familiar UI. Although I know where the buttons are, I keep catching myself checking to make sure I have the right key. At least bring back the old colors! Pretty please. 15/7/16 Thanks for the old theme back again!!!", "I liked the old colourful buttons, the new ones with tiny monochrome symbols are harder to identify at a glance. By all means add new designs and let us choose, but please don't force new designs on us when we've gotten used to how it looked. Update: The ability to change theme has corrected this nicely, the Legacy - Dark theme is excellent, back to five stars!", 'Legacy buttons are back 😀', 'Works perfectly to control mythTV over the network from my phone. Excellent!', 'Works as described with mythtv v0.27.', 'Thanks for the great remote!', 'The new design is just terrible to use since all the buttons look identical without carefully studying the screen.', "They updated the look of the interface.  Not very intuitive to use - despite the fact buttons are in the same spots, I can't remember what some of the buttons do.  They are also way too small for my eyes.  Dropped my rating from a five to a three.", 'Yup.', 'An excellent addition to any MythTV setup.', 'Loving the new look.', 'Forget regular remotes. The kids lose them anyway. I usually have my phone when I watch TV so this is great. I did have a small issue but worked through it fairly easy. There was a box in the Myth frontend general setup that was not checked on my frontend that allows network control. I checked it and connected fine after that.', "Saved me when my remote had batteries leak in it. Not as good as a well configured IR remote (especially my Logitech which controls multiple devices in the living room) but great as a backup and stop gap. Very easy to configure.  Except WOL isn't working for me... Tested WOL on front-end from laptop ok...", 'Easy to set up and works great on mythbuntu 14.  New skin would be awesome though, like make it look like a real remote with black background.  The white is distracting in a dark room.  Great job!', 'This app does a great job of controlling MythTV. It was difficult to configure. Did not find a lot of help online. Final Solution found through trial and error. Had to change IP address in myth TV back and to actual IP of the computer.', "It's great , although recently it's started taking a long time to load sometimes - frustrating if you just want to hit pause quickly! But overall it's a good app. Running on a HTC One", 'Using a Samsung tablet, this was working in 5 minutes. The response is very quick and key repeat works well for scrolling lists of shows. I wish I had found it before I purchased an infred remote.', 'Only just got it working but seems to work great. Few notes: 1. It will be much easier if the frontend you want to control has a fixed IP. 2. Make sure you check "Enable Network Remote Control Interface" in the frontend General settings. 3. I have a Mythbuntu combined backend/frontend. I had to change the backend IP to the actual IP address of the system instead of the default 127.0.0.1 4. The Mythbuntu Control Center has a check box to enable Android & iOS remotes. There is currently a bug where this doesn\'t do anything. It doesn\'t seem to affect anything though.', 'To get this to work on Fedora, use ifconfig -a to get your ip & mac address, and use system-config-firewall to add an exception for TCP port 6546, and turn on network remote in frontend settings general.', 'Works really well. Could be designed a bit better for 10 inch tablets, a small complaint', "I had been putting off getting a proper remote for my front end, but with Mythmote... I don't need one.  I have this installed on my phone, and have it installed on my wifes tablet.", "I've used this app on many phones over the years (and many versions of MythTV).  It's always been stable and it's super easy to use. 6.5 stars!", "Doesn't work on my Nexus4", "Looks nicer now but now I am getting the io exception fault issue and can't connect anymore.", "Haven't used it for long, but was impressed by how easy it was to get working. From download to controlling my combined fe/be took less than five minutes.", "I'd really like a cleaner icon for the app and more modern/cleaner/simpler button icons. App works great though.", 'Easy to configure. Enable the remote network control on the front-end and it works... Simple', "I've replaced my phone 3 times, my MythTV a couple of times and this app still works.", "Been using this a long time and it's a great remote for a MythTV setup.", 'Cannot connect to 0.26 and unable to troubleshoot. Is this great idea still live?', 'thanks for this app', "Great app for when the remote's not within easy reach.", "I'd give it give 5 stars if it had a widget. Awesome remote though.", 'Works as described, never had an issue.', 'Works well.'], 'appId': 'tkj.android.homecontrol.mythmote', 'url': 'https://play.google.com/store/apps/details?id=tkj.android.homecontrol.mythmote&hl=en&gl=us'}
