{'title': 'DTube Client', 'description': "Please be patient. There were some recent changes made to some of the services I was using that caused some functionality of this app to stop working. I am working to resolve these issues.\r\n\r\nThis is the unofficial Android App for the Android TV and phone. The DTube unofficial Android app is an open source app created to serve as a client for the revolutionary crypto-based decentralized video platform DTube. More info on how DTube works can be found at https://about.d.tube/\r\n\r\nThe DTube Unofficial App aims to provide a simple and beautiful way to explore and interact with the DTube platform. \r\n\r\nFeatures\r\n•Sync app with your Steemit account\r\n       •Subscriptions sync\r\n       •Subscribers count sync\r\n       •Subscription feed sync\r\n      •Comment/reply to comments/like/dislike/subscribe using your account\r\n•Secure login\r\n       •This app stores your password securely using AndroidKeyStore and RSA encryption\r\n•Privacy\r\n      •This app is completely free from tracking of any sort! See our privacy policy for more info.\r\n•Search Steemit database for videos using the asksteem API\r\n•A beautiful & fast UI\r\n•Feeds\r\n       •Subscription feed\r\n       •Hot videos feed\r\n       •Trending videos feed\r\n       •New videos feed\r\n       •Watch again feed (with removable history)\r\n•it's a small 3mb app\r\n\r\nMore and much more to come as development continues. We are in early stages of development so please be patient as development continues.\r\n\r\nJoin our discord: https://discord.gg/3h88GDb\r\n\r\nOpen Source GitHub can be found here: https://github.com/powerpoint45/dtube-mobile-unofficial", 'descriptionHTML': 'Please be patient. There were some recent changes made to some of the services I was using that caused some functionality of this app to stop working. I am working to resolve these issues.<br><br>This is the unofficial Android App for the Android TV and phone. The DTube unofficial Android app is an open source app created to serve as a client for the revolutionary crypto-based decentralized video platform DTube. More info on how DTube works can be found at https://about.d.tube/<br><br>The DTube Unofficial App aims to provide a simple and beautiful way to explore and interact with the DTube platform. <br><br>Features<br>•Sync app with your Steemit account<br>       •Subscriptions sync<br>       •Subscribers count sync<br>       •Subscription feed sync<br>      •Comment/reply to comments/like/dislike/subscribe using your account<br>•Secure login<br>       •This app stores your password securely using AndroidKeyStore and RSA encryption<br>•Privacy<br>      •This app is completely free from tracking of any sort! See our privacy policy for more info.<br>•Search Steemit database for videos using the asksteem API<br>•A beautiful &amp; fast UI<br>•Feeds<br>       •Subscription feed<br>       •Hot videos feed<br>       •Trending videos feed<br>       •New videos feed<br>       •Watch again feed (with removable history)<br>•it&#39;s a small 3mb app<br><br>More and much more to come as development continues. We are in early stages of development so please be patient as development continues.<br><br>Join our discord: https://discord.gg/3h88GDb<br><br>Open Source GitHub can be found here: https://github.com/powerpoint45/dtube-mobile-unofficial', 'summary': 'An unofficial, fully functional, beautiful app for DTube', 'summaryHTML': 'An unofficial, fully functional, beautiful app for DTube', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.15, 'ratings': 202, 'reviews': 142, 'histogram': [60, 24, 22, 14, 80], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '5.1M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Lucid Dev Team', 'developerId': '7725486445697122776', 'developerEmail': 'lucidlauncher@gmail.com', 'developerWebsite': 'https://2314472.wixsite.com/adtubeclient', 'developerAddress': '315 N Greenville Ave Apt 824\nAllen, TX 75002', 'privacyPolicy': 'https://2314472.wixsite.com/adtubeclient/privacy-policy', 'developerInternalID': '7725486445697122776', 'genre': 'Entertainment', 'genreId': 'ENTERTAINMENT', 'icon': 'https://lh3.googleusercontent.com/n0N0EFBN2Kd3xm4yUUITURwKpVpTJYUb8N-WYNbBk6oyetYTbND3spuApflPU3Aunn8c', 'headerImage': 'https://lh3.googleusercontent.com/vsUBGwSOzrsLCYhOhld2ovghiM7jv47_e4mXDaGL32tVRLar7pHqKfSc3xuK7BR8hk8T', 'screenshots': ['https://lh3.googleusercontent.com/uNgJwnIFMiF0YPuxJA0XnmcOE_OMVXWNSaN09XTngnqmFqcA54QORdiWjPRgiO5S9g', 'https://lh3.googleusercontent.com/sDLAjbaT3_l8ctSn7k_hy-fjCkLzmIvKE5c-XMnuUILNObY8lUF9qdxia2kT2cEr2Q', 'https://lh3.googleusercontent.com/g5lTgFpYAVp4Nm2XmFarX8rsj8Fn05JVdFcylnkWwgxyt9TtefaPG4CVZFPt4_Opid4', 'https://lh3.googleusercontent.com/pVn5kEjd5YZukxf14rT_PLx4nOQzdK9Z4vrWEcolsY6AgUfDA9UW-IKaU6_KOPFQNJ8', 'https://lh3.googleusercontent.com/l7GC0AWi-EepJ_B1bOAiVZ_vIcMZEoZnqdycS5ZiLn1uLQk0NUsfHVwx9Y0B8RifK8hs', 'https://lh3.googleusercontent.com/dz4t85En9PV4QyGowHW_rW9tiUP-ClWy0KZ_KbbKUxUGsNlz6SgRPXhWRp7U2TW2q7s', 'https://lh3.googleusercontent.com/R97jL__WnL1kDqJB_8kMNALDXw-rx8mDRrV9mFQj6t4LFeVfbKz_fzWfxzyi8uTH6PZr', 'https://lh3.googleusercontent.com/32tJK_gAg6SZ7TfvBgXM75w-GieBgm-eU-HZ6XSdh1rw_XDZ5wQq5WwbMd92olxsikSM'], 'video': None, 'videoImage': None, 'contentRating': 'Mature 17+', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 17, 2018', 'updated': 1591122215, 'version': '2.98', 'recentChanges': 'New:\r\n*Bug fixes\r\nOlder:\r\n*Ability to upgrade for Picture-In-Picture support for compatible devices\r\n*Bug fixes', 'recentChangesHTML': 'New:<br>*Bug fixes<br>Older:<br>*Ability to upgrade for Picture-In-Picture support for compatible devices<br>*Bug fixes', 'comments': ["I can't signup to your account, the Steemit account is not responding.", "Continue with this great work. 5 stars for the idea of replacing YouTube with all it's annoying advertisements.. please continue development. This has great potential! Don't give up!", "Dtube is everything I have dreamed of. A YouTube alternative worthwhile. For me it's perfect. There's only one problem. There needs to be a easier quicker sign up option. Maybe you guys could make it only take 1-2 weeks for those who wish to upload and those who only desire to view could get in quicker? I'm just saying. I wish for this app to go mainstream big time and the sign up process is what's going to stop it. There has to be another way, a solution!", "Videos will not play on app just like website. im using a lg g6 on a T-mobile network. **update** it seems only 1/4 of the videos will play. Ive been told each individual account on dtube has 'bandwidth' limitations. Is that true? perhaps that is the problem im encountering. Maybe lower rep and newer users have a smaller bandwidth allowance as I am able to watch the high earning videos from high rep people no problem. is there a way to turn off the screen to my phone with out stopping the vid", '5 stars because i like the idea of this and an alternative to the turd show cash grab youtube has turned into. when using the search feature, clicking enter doesnt do anything, meaning i literally cant search for things. ive submitted a request for an account. i hope it has something to do with that.', 'search feature does not work on this or the website. videos I uploaded 6 months ago no longer play. this has potential but it is never going to take off because of all the bugs, not saying the app is bad the service from D tube is broken and I have a feeling it will remain that way for a long time', "Had such potential. Unfortunately it's such a pain to use that it's unlikely to ever gain traction. Two stars for the concept.", 'I like the layout. Looks good but still has plenty of work to be done. Search does not work for me yet. My videos or info from my account do not show up. Ill give updated reviews with each and every update.', 'Really nice dapp, development team is very receptive to ideas . Most of the bad reviews are from people not understanding private keys. I have tested for months and the app pairs well with well pinned videos.', 'Logging in seems to be impossible. Nothing works without being able to log in. A waste of time.', 'love the app but still tons of buggyness. battle to upload. battle to watch vids. constant buffering. really wish they could get it right. still love it though.', "My posting key not working when I copy. I've been trying to login for over a month. I've tried everything still nothing. The steps given doesn't help.", 'Very good, looks to be the future of YouTube. Looking forward to adding feature to play audio with app on background.', "I can't install my desktop Dtube account onto my phone... really sucks that I can't have my account on my phone since the app won't take my steemit key!", "I'm unable to search for anything, rendering the app almost completely unusable. Looks like the AskSteem API has been discontinued as of January 1st.", 'even tho it\'s not working you did say so in the title "under maintanance" but I looked into how this app was made and its open source and can be cloned for anyone wanting a steem app without a wallet but if it had a steemconnect wallet it would work great', 'please improve so that 1. the phone will not sleep during playback. 2.dragging video down will minimize viewport . usefull then navigationg between search results', "EDIT: Duh! I didn't check, thanks for clarifying!  Orig comment: SUBSCRIBE and LIKE buttons don't work.", 'Love the decentralised concept. Could the app have a background playback function for all day listening with the screen off?', 'DTube sound s to much like a p*rn app. the videos never play even on desktop browers the site has a hard time playing videos.', 'Working great now!!! The problem is who controls Android. Android has become a disappointment!', 'Not able to login with my credentials, says password wrong: guess what its not, coz i can login and use it on my pc but somehow this stupid app says pass wrong... bs app', "can't even sign in. It says make sure you are typing the right user and pass. butI am. i even tried to sign in with myQR code. useless.. Fix the sign in", 'when i am try to login in app its not working but in chrome its working czn you please suggest what was the reason behind it.', 'Great app! Would be even better when we can upload :) cheers to the team!', 'I have not uploaded in this video this site. showing for errors why', "Can't login without steem account, no D.Tube account access. Hope it has chromecast", 'cant and wont replace youtube.like ever..it cant even load a video..not one!', "bad app there is a upload option at the right corner but whenever I click it opens a blank page . why ? don't download this app", 'The App needs to work by streaming videos, first, before I can rate any higher.', 'absolutely useless. downloaded app and can only access blank homescreen even after setting up steemit account.', 'Disappointed with no option to. Upload kindly work for the same overall ui is good', "When I want to upload a video through Dailymotion's link to DTube, it does not upload it", 'This app is okay, but I think this app charges money for subscriptions.', 'I cant log in without a steem account to unfair to people who cant have one till this gets fixed i wont reinstall this', 'what a bummer cant upload videos. qhat good use is this app if cant even do this simple library to share videos like youtube.', "What the hell is this ap? I was expecting YouTube videos with no ads. Yet its a cruddy solo site that has about 50 of ITS OWN VIDEOS, which are awful. This is a total waste of time. Don't get it", 'works great. should be better than YouTube one day', 'Nice and most importantly for a public key', "Can't upload videos. Almost doesn't make sense if you can't do this"], 'appId': 'com.powerpoint45.dtube', 'url': 'https://play.google.com/store/apps/details?id=com.powerpoint45.dtube&hl=en&gl=us'}
