{'title': 'ykDroid', 'description': 'ykDroid is a USB and NFC driver for Android that exposes the challenge-response feature of YubiKeys for use by other Android apps.\r\n\r\nykDroid is free and open source software. The source code is available at https://github.com/pp3345/ykDroid.\r\n\r\nYubico and YubiKey are registered trademarks of Yubico.', 'descriptionHTML': 'ykDroid is a USB and NFC driver for Android that exposes the challenge-response feature of YubiKeys for use by other Android apps.<br><br>ykDroid is free and open source software. The source code is available at https://github.com/pp3345/ykDroid.<br><br>Yubico and YubiKey are registered trademarks of Yubico.', 'summary': 'YubiKey challenge-response USB and NFC driver', 'summaryHTML': 'YubiKey challenge-response USB and NFC driver', 'installs': '1,000+', 'minInstalls': 1000, 'score': 4.0882354, 'ratings': 34, 'reviews': 21, 'histogram': [6, 0, 1, 5, 22], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '47k', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Yussuf Khalil', 'developerId': 'Yussuf+Khalil', 'developerEmail': 'dev@pp3345.net', 'developerWebsite': None, 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8347119022631210436', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/NNSRh9E8i_BeqL2MNjA0izgmJBRBoKhShwIJqmE1aio9we-LLuhLV8-PBAzKU1_o4F4', 'headerImage': 'https://lh3.googleusercontent.com/npHJmoC8s8t4lsm1bqZxROVQawmEf2cMnVlENXBoh4wYdGuzqvMeZ22vIAwW7_VvaQ', 'screenshots': ['https://lh3.googleusercontent.com/R2IypB03RnMGqzMzxB7ovEv_FL_-jogeMGNp9O8ihQfgAeWC3SGhJzq8XtMGLlwM5_F5', 'https://lh3.googleusercontent.com/7JZERdd3h-eS1WWjJpxUYSBY2WzVsIACYKdSufp8Aq8WG7a3cj98PEsdNJkGI_5-fg', 'https://lh3.googleusercontent.com/3Z6FlAI19nNQhqqZoKQyKzVxHXD6eZZypdFw-7q_dSVbxvH7pkWCsILT8HHY-RU0YDk'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 23, 2018', 'updated': 1538689087, 'version': '1.1.1', 'recentChanges': '* Fixed compatibility with some YubiKey NEOs that are veeeeery slow via NFC', 'recentChangesHTML': '* Fixed compatibility with some YubiKey NEOs that are veeeeery slow via NFC', 'comments': ['Works perfectly. I had an issue at first, but it turns out that was because the NFC reader in my phone was in the camera...', "I originally reviewed this with 1 star and why it wouldn't work. Turns out neither this app or KeePass2Android have instructions for this new feature, so here's the details for those who are confused or think it's not working, like I initially did.   You keep the normal selection for your challenge. It'll ask you to select where the xml file is, normally in the same folder as your KeePass database. After it reads the file, it'll quickly recognize the format and ask you to select which slot on your YubiKey to scan from. It's 4 stars now because it does work, but due to no instructions, it's a little confusing. However I like it so far.", 'This app works well IF you set it up right.  The problem is knowing what to do as there is no guide for setup with a YubiKey as mentioned below.  In case it helps others out there, this is what my setup was on a device running Android 9 with a YubiKey 5 NFC.  I used KeePassXC to set-up the challenge response function with my YubiKey along with a strong Master Key.  If I did the same with KeePass 2.40, the database just would not work with Keepass2Android and ykDroid.  Also, as another reviewer mentioned, make sure the Encryption Algorithm is set to AES-256 and the Key Derivation Function is set to AES-KDF (KDBX 4) in database settings.  Then with the Keepass2Android app, make sure your Master Key setting is set to "Password + Challenge-Response for KeePass XC".  I couldn\'t even start the database unlock with any other setting.  Once these things were done with the respective software and database file, the app worked seamlessly.  With better instructions for the less patient among us, I would give it 5 stars, but without, I\'ll give it 4 for effort and forward thinking.  Thanks for laying the groundwork for a great way to better secure our sensitive information on a mobile platform', "Doesn't work! I just went to the trouble of fixing a bug in YubiChallenge and had everything working and now Keepass2Android goes and removes support 😑. I have a Yubikey Neo and the nfc challenge/response takes longer than the OS default timeout for a nfc transaction. Please see YubiChallenges bug tracker for more info.", "It works great but I've almost given up on getting it work just before I read other reviews saying that the database type must be KDBX 4.", 'Works well with a KeepassXC created database. (Make sure your database type is KDBX 4, which can be changed in the DB settings) Using with Keepass2android, a Yubikey 5 NFC, Android 9.', "Works great! If you're using it with KeePass2Android, just make sure your database is saved with KDBX 4 key function. Thanks Yussuf!", 'the app asks for permission to access the usb device everytime even if you tell it to remember. i found out this happens when you unplug and replug it', 'Does what it is created for. I needed a few tries to figure it out but if you know your yubikey and know at least how it works there should be no surprises. I am using an usb otg cable with a oneplus3.', 'Useless yubikey neo support. After many trials it was impossible to open a keepassxc database that works without problem on linux and mac os.', 'Works fine. Keepass2Android, Yubikey neo, NFC', 'Works as desired with my Yubikey and KeePass database!', 'Supposedly works with KeePass2Android, but hell if I know how! K2A stupidly insists on NFC whether this is installed or not.', 'Does its job perfectly.'], 'appId': 'net.pp3345.ykdroid', 'url': 'https://play.google.com/store/apps/details?id=net.pp3345.ykdroid&hl=en&gl=us'}
