{'title': 'Stocks Tracker Widget (open-source)', 'description': "Stocks Widget is a home screen widget that displays stock price quotes from your portfolio\r\n\r\nFeatures:\r\n★ Completely resizable, it will fit the number columns base on the width you set.\r\n★ Scrollable, so you don't have to worry about adding more widgets\r\n★ Stocks are sorted by change in percent (descending), or you can rearrange them yourself\r\n★ You can set custom refresh intervals and start/end times\r\n★ You can import and export your portfolio from a textfile\r\n★ Add multiple portfolios to multiple widgets\r\n★ View recent news for your tracked symbols\r\n★ View graphs for your tracked symbols\r\n★ Open sourced here https://github.com/premnirmal/StockTicker", 'descriptionHTML': 'Stocks Widget is a home screen widget that displays stock price quotes from your portfolio<br><br>Features:<br>★ Completely resizable, it will fit the number columns base on the width you set.<br>★ Scrollable, so you don&#39;t have to worry about adding more widgets<br>★ Stocks are sorted by change in percent (descending), or you can rearrange them yourself<br>★ You can set custom refresh intervals and start/end times<br>★ You can import and export your portfolio from a textfile<br>★ Add multiple portfolios to multiple widgets<br>★ View recent news for your tracked symbols<br>★ View graphs for your tracked symbols<br>★ Open sourced here https://github.com/premnirmal/StockTicker', 'summary': 'A home screen widget that displays stock price quotes from your portfolio', 'summaryHTML': 'A home screen widget that displays stock price quotes from your portfolio', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.605, 'ratings': 2019, 'reviews': 748, 'histogram': [50, 30, 121, 262, 1554], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '5.0M', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'Prem Nirmal', 'developerId': 'Prem+Nirmal', 'developerEmail': 'stockswidget@gmail.com', 'developerWebsite': 'https://github.com/premnirmal/stockticker', 'developerAddress': '140 A570\nSouthport\nUK PR8 6LR', 'privacyPolicy': 'https://github.com/premnirmal/StockTicker/blob/master/PRIVACY_POLICY.md', 'developerInternalID': '5859285960560756574', 'genre': 'Finance', 'genreId': 'FINANCE', 'icon': 'https://lh3.googleusercontent.com/4E63Lza7PlWybv9pN_aMqk7w2huLvckoUw9O0eDbioTsnucYFZFI0O3nDXcy3g_S8I4z', 'headerImage': 'https://lh3.googleusercontent.com/m3DWkj0jMlSHdPngZewN-gzI27TY1vzhAHlYanpmqcJ2uhKiwNhCCKJKaCyC3Zc0EeQ', 'screenshots': ['https://lh3.googleusercontent.com/R9khJ5kNzXHUjO4BxNw1cNKTx62grZ7FtLRT_F2H0BhC99iuMWDxvuGTYvyydtqE3w', 'https://lh3.googleusercontent.com/uxQfuEmietfmyq4e-xNEAXfwtkWFE9iVbJYpMtc55yKqOYTv25ViSGS1dTf6qrncXIo', 'https://lh3.googleusercontent.com/fQZFK93aeUVMr0BDNIuk8Ol9i-HC4d7GCtk01VtKr2-qcdtpmR8gO3-DJMCPbTwsCA', 'https://lh3.googleusercontent.com/U3Vi6-v9Rx37ED4k-Mhm4c-vUNx0mNtV0bXJX1JsBAryafJYZS393X6zlDxuaGpMfs0', 'https://lh3.googleusercontent.com/gZeSkKTP4zT0wvgKnyimP7H_GMzzihak-wDPwIO38wATxEMie4bdiTiIjODNfeS2wcY', 'https://lh3.googleusercontent.com/kpCX9Aor2sPz3EdbUwtKzoP_i_fK70Y0h_FTtGv5hHx9LfnMCeiHX0_unrK1oYQkgDp-', 'https://lh3.googleusercontent.com/s1lJR3IOeTi6TVQvf_8sU5Pxptl5Gk4XSlIeoeGTDwXHP67dpi8FAFhOvdhnYuHqSa4', 'https://lh3.googleusercontent.com/BIv7JrLvUJOC7wGhIxTPucwSMZzWEOh7m3U-TxRXhOj-PS0yeRy6uk6Bwpha1Ie492o', 'https://lh3.googleusercontent.com/ctJeabCbVnM9KU3ilZcmTY74mSEsa3yjWNdOg9cEB9uqPe2g5-JoiLVirpni4eWBWekS', 'https://lh3.googleusercontent.com/mCZZ_h5obc2pjA4BJHS7unMCJiazjK4q3YPNM6iOyrxkK0eVnAf3vicUI3Do4JIgOvc', 'https://lh3.googleusercontent.com/vFC3WallohoO2QNOdUxMaxVFfxdqerFSZzg0Vlpd8H0avK8hvk6MvwJ8YnIi55AvSw', 'https://lh3.googleusercontent.com/qaAquy-hPVCt_18zHs4J_MUENpGf63488rUG8Otwlo-uC6g9dKdficMLzBiWfBEphmnD', 'https://lh3.googleusercontent.com/YmcuMNqyTidmDciSAoFZxySpM9iBR2tI1YTBAoqV--HES2z0LqYoM5rEnx6Fe3RLu0xQ', 'https://lh3.googleusercontent.com/aC_8xXU1iFbkpQOGm7pAmguIehf4Vu8-NCfZ3NJWEtbhJgrNPrEzpccgdB3wAy3uVmI'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 22, 2014', 'updated': 1590060851, 'version': '3.8.5', 'recentChanges': None, 'recentChangesHTML': None, 'comments': ['Fairly easy to use. Very versatile. Can setup multiple widgets to represent different accounts or watch lists. Can enter shares and trade price to track how the account is doing.', "Had issue with widget not loading because had to hit home button to get back to home screen. Worked with developer to try and get around, he put out update within 24 hrs instead. After update 3.7.4, I'm able to get widget to work again. Love the simplicity of the app and ability to load multiple widgets with different data. Only suggestion for future update, would be great to have the stock name show instead of the abbreviation code. Otherwise Love it!", 'Just short of one more star to make it the perfect app. It will be great if they also have the option to add the news feed into the widget instead of going into the app. Also, a suggestion will be an option to add forex pairs and news in the widget to make this the ultimate app for traders.', 'This is the best widget can be found on play! I would like to thank the developer for his effort and his time! Recommendation: It would be great if we could have crypto prices in the same app. Thanks!', "The 2dp config should be at the level of individual ticker, not global config. Some stock might be ok to be rounded up to 2dp, but for other ticker like exchange rate 2dp is not ok. Make display label customizable instead of using ticker code. In some market ticker code doesn't represent the stock name so the widget just shows useless text. Allow user to control the width of each column instead of just distributing it evenly. Some ticker are longer than 4 characters which now get truncated.", "Best widget app - super clean interface. Just wish it allowed you to see dollar change and percent change in the widget. Don't want to knock off a star for that though because this is a 5 star ad free app", 'I downloaded this only for the widget, not realizing that it had so much more. Fast, simple and informative. Just as it should be. 👍🏻👍🏻', "Some stock's will not update. If you go to info the chart is correct but for days no change on widgit. See if you can fix it. Try using NAK", "Best stock widget out there. Looks good and all the customizations you could ask for. On top of everything It's even open source. Thank you for all your hard work", 'Interesting, genuinely useful. How to build the portfolio widget could be better illustrated.', 'Phenomenal app!! Simple and gives you what you need to know!! Simple clean effective.', "The widget doesn't show up in the widget menu. I am scrolling back and forth but I can't seem to find it. I hope the Dev reads this. Model: LG g8s.", "I've tried many others, always come back. It's simple and not intrusive, perfect for me!", 'Works great and is free! The widget allows for checking your stock values at a glance.', 'Pointless as a widget. Does not compare position numbers. Only current price.', "Best stock widget out there. Looks good and all the customizations you could ask for. On top of everything It's even open source", 'Accurate and very quick especially if you create a portfolio', 'Very clean and intuitive UI. The best stocks widget. Puts ministocks to shame!', 'Free and open source with no in app purchases? This app is bests all widgets!', "Some people don't know how to use an android phone and give this app a bad review. This app is perfect for the tech savvy and the financially responsible. 5 stars!", 'Does not work with Wi-Fi connection - on Monday at 5 pm shows stocks from Friday 10 am.', 'Very good UX, very quick and simple to set up', 'Love it, idk why it was confusing to a 25 year UI developer', 'Open source makes this great! There is no excuse for leaving bad reviews - if we see something not working then we should submit a fix :)', 'I had installed ministocks until I found this app. I was shocked at how much this app is better than ministocks. 5 stars!', "Great app...DESERVES 5 STARS! Don't be greadies users,they made an excellent and very useful job.", 'Good for tracking stocks and news', 'Love the backup feature, makes it so easy to set up', 'Clean interface and easy to use.', 'Love the effort that has gone into the app, and it does EVERYTHING I need it to do. However, it is nearly impossible to configure. I\'ve just spent nearly an hour trying to get it to display a list of nine stocks. This took me less than five minutes in another app\'s widget. In this app, I finally had to give up. Constant problems with the UI. Not being able to add stocks. Not displaying the stocks I already added. Sorting incorrectly. Not changing the boldness of the font. It was warfare with the GUI from the first moment. For instance, adding a stock is easy. but then it\'s not clear how to accept your additions and go back to the list of added stocks. (Only the back button seemed to work.) Then the newly added stocks don\'t show up. Trying to re-add them gives an error that they are already in the list. Unless you add and delete repeatedly, which will eventually work, it seems. It sorts them exactly as it feels like. You can change the order on the widget page, but that rarely has any effect on the widget itself, even after refreshing.I often had to just delete the widget and start over. I can go on. And maybe with a lot more detail the developers could address the issues, but they are so apparent, that It doesn\'t seem needed. In short, it just shouldn\'t take this much effort to make an app do what it clearly is designed to do. ** Note ** While the developer publicly thanked me, this was his snarky private reply: "Since you\'re so confident that it doesn\'t take effort to make an app like this that does everything it is designed to do, why don\'t you show us how? The app is open source, you are more than welcome to show us with your confidence how easy it is to do what you described :)" As the developer\'s response indicates, he is more focused on his damaged feelings than on improving the app. I gave sufficient detail to indicate a significant setup problem, and would have been glad to explain further or try different steps. I\'ve done so for many open source projects. I\'m just reporting on a genuinely bad experience and at least doing so with some detail rather than giving a punitive one-star review and just saying it stinks. We all routinely see thoughtless one-star reviews that attentive developers still respond to professionally and ask the reviewer to contact them on so they can follow up. I said nothing about how easy app development is as this thin-skinned developer suggested. Mainly because I\'ve been a professional programmer for 25 years and know a thing or two about interface design. If someone had this poor an experience with one of my projects, I would want to know about it immediately and figure out how to correct the situation.', 'Simple, easy to use, exactly what I was looking for.', 'Ok app but the big green circle with the "+" sign blocks the change information for the stock in the bottom right corner. Need to relocate the "+" to the top of the page. It\'s pointless to even have a stock in this location. Update: useless app. Doesn\'t even update most stocks on list.', 'I trust this app because it is open source. This makes me trust the developer with my data', "Wish it could be possible to import tradingview's quotes", 'There is something funny with the portfolio valuations. One value when inputting, then different value on the widget.', "A bit difficult to configure but really handy once it's set up. Plus it doesn't seem to be mining your data like most other apps.", "Doesn't work most of the time. Every month my portfolio disappears and reverts back to the default portfolio. After that I would have re enter all the stocks in the portfolio. And the widgets doesn't show the percentage anymore. Very Disappointed.", "Doesn't update even though permissions granted, have to manually pull and refresh to see changes, layout is better than other apps I've tried. update: to the salty response, the items in the portfolio screen do not update according to the update interval in the app settings (last fetch/next fetch), that clear enough for you?", 'How come the charts do not show up for me?', 'Great tiny app with nice and simple widget. But why should we need to see up to 4 numbers after the decimal dot (on stock value)? i.e stock value = 1.2345. I think that 2 number should be enough. Thanks anyway! Edit - I missed this setting option. Awesome!'], 'appId': 'com.github.premnirmal.tickerwidget', 'url': 'https://play.google.com/store/apps/details?id=com.github.premnirmal.tickerwidget&hl=en&gl=us'}
