{'title': 'Calendar Import - Export (ics)', 'description': 'Import, export your Android calendars using ics files without the Google cloud!\r\n\r\n<b>Features</b>\r\n• Export/Backup to ics file\r\n• Import from SD card or server\r\n• Supports ics (iCal, iCalendar) files\r\n\r\n<b>Source code/Bug reports/Translations</b>\r\nhttps://www.schuermann.eu/android/\r\n\r\n<b>License</b>\r\nGPLv3', 'descriptionHTML': 'Import, export your Android calendars using ics files without the Google cloud!<br><br><b>Features</b><br>• Export/Backup to ics file<br>• Import from SD card or server<br>• Supports ics (iCal, iCalendar) files<br><br><b>Source code/Bug reports/Translations</b><br>https://www.schuermann.eu/android/<br><br><b>License</b><br>GPLv3', 'summary': 'Import, Export & Backup your calendars using ics files', 'summaryHTML': 'Import, Export &amp; Backup your calendars using ics files', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.69, 'ratings': 318, 'reviews': 200, 'histogram': [76, 12, 19, 34, 174], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '628k', 'androidVersion': '2.2', 'androidVersionText': '2.2 and up', 'developer': 'Sufficiently Secure', 'developerId': 'Sufficiently+Secure', 'developerEmail': 'play-schuermann@mail.de', 'developerWebsite': 'https://www.schuermann.eu/android/', 'developerAddress': 'Schuermann\nSophienstraße 40\n38118 Braunschweig', 'privacyPolicy': 'https://www.schuermann.eu/android/privacy-policy', 'developerInternalID': '8955834567786048583', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/C8YqWcaih24NiR5aDKxLF5ElRfc2YZDB2o-Xa48OHNvXtMJNdCYWmAHZGL2IFyNRmw', 'headerImage': 'https://lh3.googleusercontent.com/0D8Paq8LhPzmj5xEbfQW0cgzF-A7XU46cXiG30HD7HZPeZPqsPwmWQBcJELSgCgxB_Q', 'screenshots': ['https://lh3.googleusercontent.com/1zj96GsCCblF04e_dbYK0epZ5qHuuIHzLV0aKZvQUQa_WmglfIffz9vovN6bqeezdNA', 'https://lh3.googleusercontent.com/Z7jve5moPItvsdCihEJ30BRN2rdbVFdFcG0StQGpvbSsOJGnH9s2Io-kVU-V2zVv-A', 'https://lh3.googleusercontent.com/_cGFZ8fKWRaQBTJ9Wkt6Y_QuzoKYdDnaOmHaguu7VbwO2YhUv5vC0zWSj5iWOiN2zp5Z'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 14, 2015', 'updated': 1506505421, 'version': '2.6', 'recentChanges': '## 2.6\r\n  * Fix another issues with all day events\r\n\r\n## 2.5\r\n  * Fix issues with both all day event export and import\r\n\r\n## 2.4\r\n  * Automatically refresh calendar information when changed outside the app\r\n  * Suggest filenames when saving to reduce required typing\r\n  * Developer mode changes for debugging user issues\r\n\r\n## 2.3\r\n  * Fix importing calendars from emails (thanks to Fred Dupont)\r\n  * Fix an exception when exporting on some systems\r\n  * Use Android 6 runtime permissions\r\n\r\n## 2.2\r\n  * New icon', 'recentChangesHTML': '## 2.6<br>  * Fix another issues with all day events<br><br>## 2.5<br>  * Fix issues with both all day event export and import<br><br>## 2.4<br>  * Automatically refresh calendar information when changed outside the app<br>  * Suggest filenames when saving to reduce required typing<br>  * Developer mode changes for debugging user issues<br><br>## 2.3<br>  * Fix importing calendars from emails (thanks to Fred Dupont)<br>  * Fix an exception when exporting on some systems<br>  * Use Android 6 runtime permissions<br><br>## 2.2<br>  * New icon', 'comments': ["Doesn't look pretty but does the job! I downloaded an ical file with 12 meetings listed. All I had to do was choose which Google calendar to import to at the top of the page and then at the bottom of the page import file, then load. A minute later I loaded my calendar app and they are all there in the correct timezone. Thanks!", 'Its just brilliant believe its exquisite...excellent...cant find the best vocabulary to describe how wonderful the App is...download and use it to find out more...you will enjoy, fast, cheap, reliable and out of this world experience', "Didn't seem to be able to find an .ics import function on Google Calendar app in Android, so I used this and was done in 30seconds. UI could be better, usability is just fine.", 'required access to my contacts in order to use the apo. pass. you can just "import calendar" in Google Calendar to open the file.', 'App instantly crashes starting from second launch. I took a guess that using the Offline Calendar app also by them would solve it, and it does indeed work. It feels more convenient importing or exporting the offline calendars made there.', "Brilliant, the only app capable of exporting Google's calendar to ics, not even Google calendar has such option on Android app.", 'App is shutting down immediately after opening the home page', 'Performs better than the paid apps. Thanks to the developers,my weeks long issue resolved.', 'Brilliant app! solved my problem perfectly - not the sexiest of interfaces but who cares? Best to keep it simple and functional. Give me a plain looking app that works over a polished turd any day.', 'very good app. I tried hard to find which backup calendar from old phone and restore to new one. thank you', 'Extraordinary app! It helped me a lot! Thank you so much for making such an useful app. The interface is simple. Easy to use. Works perfectly!', 'A bit clumsy but does the job of importing ics file into Google calendar. Credit to the dev for something Google should have done natively', 'Wonderful app. It does exactly what it was said. Very Quick and efficient. Thanks alot', 'Simple and quick, does what it needs to. Love it!', 'simly best with minimal MB coinsuring app... very easy to import export. ics files in calender. a 5 star for me', 'Excellent - I was able to quickly export my Samsung Calendar from my GS7 to an .ics file then import it into my Google calendar.', 'No instructions or explanations. But somehow it worked!', "Doesn't do s**t! I simply wanted to save my calendar entries to my sd card.", 'Had to backup a calendar, worked flawlessly.', 'It does exactly what it says on the tin -- and it does it flawlessly.', 'Crashes as soon as it runs.', 'Great Apps. I solved my problem by this Apps .', 'Not working. Unable to read ics file.', 'Does what it says! Perfect to get Huawe "phone" calendar to Google calendar', 'loaded the entries at first placr but aftet 3 minutes loaded content disappeared', "finally an app that worked. iCal import. would makw the file, but wasn't usable.", "Where is it?!! I exported the calendar successfully but can't find the exported file anywhere on my device!", 'Unhelpful. Difficult to use.', "Does not find ics files. I have ics on my phone in SD Card but the app does not find them so it can't import them. If it can't do that what can it do?", "can't get it to work.", 'Did not work coretly.', 'Does what it should. Re-import to different account successful. GUI a bit \ncumbersome, which is ok for open source. Note: A function to delete all \nevents from an account would be useful.', "This is a nice patch of Google calendar's lack. But It'd be better if I could see ics file content before inserting to the calendar. Plus, it could easily had a feature to start by taking an ics file from the file manager", "After the first import, crashes when launched, that's unfortunate. Other than that, this app does what is expected. Clearing app data does the trick but it's a bit of a hassle.", 'I have exported my calendar files. Then I reset my phone to factory \nsettings. I downloaded the app again to complete my back up.. and it kicks \nme out of the app!! please debug it..', 'Does what it says it does. Crazy that Google calendar does not allow to import ICS... This app does. But the UI is painful...', 'This app does exactly what it says it does! After hours of trying to work \nout why my calanders wouldnt sync to my new phone this fixed tge problem in \nseconds!! Thankyou.', 'Fake app. Doesnt work', 'Very useful, however recently discovered exported file includes events which have been deleted :(.', 'Saved my day! Thanks!!'], 'appId': 'org.sufficientlysecure.ical', 'url': 'https://play.google.com/store/apps/details?id=org.sufficientlysecure.ical&hl=en&gl=us'}
