{'title': 'My App List', 'description': "With 'My App List' you can save installed applications in a list to restore them after flash or install a new ROM.\r\n\r\nFirst you create a list of your installed applications. You can select which applications do you want to save. The application create an XML file in your external storage.\r\n\r\nNext you make a fresh install of your favorite ROM.\r\n\r\nFinally install 'My App List', load the XML file and install the applications from the list.\r\n\r\n'My App List' is not a substitute for backups applications like 'Titanium Backup' or 'My Backup'. 'My App List' only save a XML file with your installed applications and allows you to install the applications one to one.\r\n\r\nYou can share your application list with your friends and your friends can import the list with the device. The formats are text, html and XML.\r\n\r\n'My App List' is designed to perform clean installations of all your applications. It has a clear interface based on Holo Theme from ICS.\r\n\r\nRoot access not required\r\n\r\nPermissions explain:\r\n  * WRITE_EXTERNAL_STORAGE: Generate list files in sdcard\r\n  * RESTART_PACKAGES: Start applications from 'My App List'\r\n  * KILL_BACKGROUND_PROCESSES: Stop applications from 'My App List'\r\n  * ACCESS_NETWORK_STATE / INTERNET: Send anonymous statistics", 'descriptionHTML': 'With &#39;My App List&#39; you can save installed applications in a list to restore them after flash or install a new ROM.<br><br>First you create a list of your installed applications. You can select which applications do you want to save. The application create an XML file in your external storage.<br><br>Next you make a fresh install of your favorite ROM.<br><br>Finally install &#39;My App List&#39;, load the XML file and install the applications from the list.<br><br>&#39;My App List&#39; is not a substitute for backups applications like &#39;Titanium Backup&#39; or &#39;My Backup&#39;. &#39;My App List&#39; only save a XML file with your installed applications and allows you to install the applications one to one.<br><br>You can share your application list with your friends and your friends can import the list with the device. The formats are text, html and XML.<br><br>&#39;My App List&#39; is designed to perform clean installations of all your applications. It has a clear interface based on Holo Theme from ICS.<br><br>Root access not required<br><br>Permissions explain:<br>  * WRITE_EXTERNAL_STORAGE: Generate list files in sdcard<br>  * RESTART_PACKAGES: Start applications from &#39;My App List&#39;<br>  * KILL_BACKGROUND_PROCESSES: Stop applications from &#39;My App List&#39;<br>  * ACCESS_NETWORK_STATE / INTERNET: Send anonymous statistics', 'summary': 'See, manage and share your device apps withs this opensource application', 'summaryHTML': 'See, manage and share your device apps withs this opensource application', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.3523808, 'ratings': 1082, 'reviews': 323, 'histogram': [82, 51, 20, 175, 752], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.9M', 'androidVersion': '2.3.3', 'androidVersionText': '2.3.3 and up', 'developer': 'Fede Fernández', 'developerId': 'Fede+Fern%C3%A1ndez', 'developerEmail': 'info@fedefernandez.es', 'developerWebsite': 'http://fedefernandez.es/apps', 'developerAddress': 'Otoño 2, Local 6\nUtrera - 41710\nSevilla', 'privacyPolicy': 'https://github.com/projectsexception/MyAppList/blob/master/LICENSE.txt', 'developerInternalID': '7839505573466069507', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/k4QH7WOk1uM_xTOoF8gXiOWPErl_iiouvt4jBBF2mVLxi9lGVakhoeAlf-M9kDSK3GY', 'headerImage': 'https://lh3.googleusercontent.com/FmRWWtChGvgkCVI5TFx31TtBjE78IISSQkAtsnN7hg-4NchdZfE5HcADIDS1-sFxg44', 'screenshots': ['https://lh3.googleusercontent.com/-V01H8VgTOlYyBjz9tajGQuH8wN2vYyuC1B3Z2zGzQ25VwacZxE7gBhYJpbhgWNVrX8', 'https://lh3.googleusercontent.com/p9oRzpYMndP8HnR7bYC6Zxs1upuTn96xned-Wsv98QBVwE45hS2kxWs9AVQbXsYygdOA', 'https://lh3.googleusercontent.com/U-exps0IjM_b7Gkbnxx_m77MIV5tyDFCdf1DLfsRI7tWUDij3esSaHD7goImtGFZ5x4', 'https://lh3.googleusercontent.com/9oZAPuYrhvXYw5QslDw2wqABStmWsPB6hViDCuiBK7wyLXrQwVBYT4mAu9WG-dy08w', 'https://lh3.googleusercontent.com/tbAUYOwoKVT1ZNAUw_TeKjSR1tJ5ML_fGdVfJIHdoSuS4UObp0tF06uTmvB-ZkTIzw', 'https://lh3.googleusercontent.com/nrkm_oERZk-CX_r1rOeAJLHyTV_MA5XR9yKRh20HiEvpQ_2jhMnBIJYcFZm2aCqkrw', 'https://lh3.googleusercontent.com/NuZC3YQqYaVKeEOcYoe4yGRoEYjQObpzTIrHUdr7OXRvNo58YGScGm8DVRbFudd19Fm9', 'https://lh3.googleusercontent.com/iUa5D-lO8ZQol4Hk2hOZIYmhgkSV80d3vWRwhSKHnZ4beCsJayxLI0bdtiqnmd1M1fE', 'https://lh3.googleusercontent.com/WqjMMrCTJqoyEOu4_s6PBVm9AJP_wJ1aIcn-U3_ICKT_4Eyz_H7di1He334jLGNSng', 'https://lh3.googleusercontent.com/g9l6Vl4MRjjAIAjZ-_kX64luoEaLVm42LnLcGAcSiR3jXWsTyjkWoKRdEQ2OaU_Shg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Apr 20, 2012', 'updated': 1407495270, 'version': '0.8', 'recentChanges': 'Kit-Kat style\r\nAdded some improvements\r\nNow you can search in your application list', 'recentChangesHTML': 'Kit-Kat style<br>Added some improvements<br>Now you can search in your application list', 'comments': ["More then just a list, I installed it just because my screen is broken and I couldn't open some apps. But this is more than just a list and I love it because I can delete some stupid Google system apps that can't be deleted. There's much more so I recommend it!", 'Excellent with no glitches for my Note 10+5G w/10 OS... Just wanted a printable list of apps I installed and Systems apps pre-installed.. can send to Gmail or save on SD card... Thank you 😁😷', 'Actually, I only looked for an app, which could make a list of my installed apps. This one surprised me with its features. Automatic list creation in the background, possiblity to have several separate backup lists, and best of all, how easy it was to re-install the apps after a factory reset.', 'Close to perfect. Please optimise for Android 10. Please reduce time between Installations to 1seconds or 0,5seconds. Thanks So mich for this App, very helpful!', 'Best on market, fit for purpose. would be nice if you were able to sort by install date without having to individually go into each app tile, where that information is provided. otherwise, meets my requirments of tracking what apps are on my phone over time.', 'BEST !!!... can show system apps, e.g. Google text-to-speech engine, than u can uninstal, disable or force stop...', 'Does what it needs to do, but I hope the delay in automatic play store redirection for every app is reduced as 3 seconds makes the whole process slow.', 'Intuitive to use and one-step - makes xml list file for you including urls. Great for people who love doing many things on mobiles & accumulate many good apps. No more handwritten app lists! Thank you for your time making this app for us!!', 'Works fluently a pure delight gives both system information about an app and also takes you to the Google play store to its address for info and uninstall etc , search option is very satisfying , overall this app is pure delight', 'Excellent app, keep list of your installed app with link . You can save / send this to anywhere on email/ Wapp/ drive and later when require just touch the link to reach google play store to install it. Very good for keeping collection of your favourite apps.', 'Great little app to keep a record of your installed apps. Could be improved if you could save to cloud storage, but still very useful.', "As a longtime user I've always found this app to be my go to for managing content across all of my devices. It's an Essential & Perfect, Thanks 🙂", 'Sorry, but that is just a clone tons of other similar Apps. What I really need is the ability to sort by install date! Makes sense function for such App right?!', 'Super useful. Would give it 5 stars if the design was better', "Anyone know why YouTube doesn't show in list? Are there other apps not showing?", "You're at makes it easier to find your apps you're very helpful company thank you very much", 'simply genial. next step will be auto-download of apps once loaded the xml file maybe', '"can\'t write on the selected folder" on the external sd card', 'No (re)sort option. Still looking for a better app to sort by install date etc', 'Exactly what I needed. Great app!', 'Can be used with MacroDroid to restore previously installed apps', 'Ads pop up over everything', 'Just want to get rid of unused apps not all of this finger tapping on a screen', 'One of must-have apps when you switch phone', "this is the perfect app i've ever seen", 'Cool and simple', 'I need help canceling my HBO free', 'Trying to download hangout app', 'wished it would be updated...', 'Work as advertised.', 'INSTALL ALL APP PLEASE', "Excellence app I'm looking nice", "I don't know", 'This does exactly what I wanted: save a list of my installed apps into Evernote in a format that I can easily scan and click links to reinstall the app. (The default Text format works perfectly for this.) I tried several other app listers and they all fell down on this simple task.', 'Very nice app. I suggest that you allow the user to predefine his own default description of the app list when he goes to share it, and that you let him include the date automatically, if he wishes (or he could select a format from a drop-down menu.) For example, instead of "Check this applications," he could change his default description to "My Galaxy Grand Prime apps, 2018.01.31". (By the way, "Check this applications" is not really good English, to be honest. It should say, "Check out these applications" or "Check out these apps")', "Useful, especially with the auto backup feature. Could really use cloud upload of the exported file though, in case the device is lost or damaged. Currently I'm having to backup the destination folder with FolderSync as a workaround. Maybe this app could target the Android M backup API.", "After doing a factory reset, this shows the apps now. (Before reset, it showed 0 apps, but that is when I really needed to make the list.) One good thing this has, it automatically updates the XML file. But the info is very limited. Only the name and package URL. Another app (List my apps) is customizable with more information and output file formats, but it doesn't automatically update the output file. While this can include uninstalled apps, it doesn't seem to indicate which are still installed.", 'This app is a HUGE HELP!  Especially if you are an app junkie like me, have many apps by the same name, or just want more info about the apps you have.  I use this app frequently, i love it! UPDATE 010418 (from 041717) - This app should be STANDARD software for ALL Smartphones. It makes my life so much easier.  I love it!', 'Application backups are overrated.  When I changed from a Razr-M to Galaxy s5, I did not want to restore  all of my old apps.  With this wonderful app I could have access to all my apps and pick and choose.  My contacts were copied by another app.  Life is good.', "I was fed up keeping apps just so that i don't have to forget search again from scratch on Google play. Here is an alternative*remembering* just the way i wanted."], 'appId': 'com.projectsexception.myapplist', 'url': 'https://play.google.com/store/apps/details?id=com.projectsexception.myapplist&hl=en&gl=us'}
