{'title': 'LibreTorrent', 'description': 'LibreTorrent is an original Free as in Freedom torrent client for Android 4 and later, based on libtorrent. Download and share files directly on your device.\r\n\r\nhttps://gitlab.com/proninyaroslav/libretorrent\r\n\r\nFeatures\r\n\r\n* DHT, PeX, encryption, LSD, UPnP, NAT*PMP, µTP\r\n* IP filtering (eMule dat and PeerGuardian)\r\n* Ability to fine tune (network settings, power management, battery control, UI settings, etc.)\r\n* Supports torrents with large number of files and big files\r\n* HTTP\\S and magnet links support\r\n* Support proxy for trackers and peers\r\n* Ability to move files while downloading\r\n* Ability to automatic movement of files to another directory or to an external drive at the end of download\r\n* Ability to specify file and folder priorities\r\n* Ability to select which files to download\r\n* Ability to download sequentially\r\n* Material Design\r\n* Dark and Black theme\r\n* Tablet optimized UI\r\n* Scheduling\r\n* RSS manager\r\n* Android TV support\r\n* Ability to create torrents\r\n* Streaming of any selected files\r\n* And more', 'descriptionHTML': 'LibreTorrent is an original Free as in Freedom torrent client for Android 4 and later, based on libtorrent. Download and share files directly on your device.<br><br>https://gitlab.com/proninyaroslav/libretorrent<br><br>Features<br><br>* DHT, PeX, encryption, LSD, UPnP, NAT*PMP, µTP<br>* IP filtering (eMule dat and PeerGuardian)<br>* Ability to fine tune (network settings, power management, battery control, UI settings, etc.)<br>* Supports torrents with large number of files and big files<br>* HTTP\\S and magnet links support<br>* Support proxy for trackers and peers<br>* Ability to move files while downloading<br>* Ability to automatic movement of files to another directory or to an external drive at the end of download<br>* Ability to specify file and folder priorities<br>* Ability to select which files to download<br>* Ability to download sequentially<br>* Material Design<br>* Dark and Black theme<br>* Tablet optimized UI<br>* Scheduling<br>* RSS manager<br>* Android TV support<br>* Ability to create torrents<br>* Streaming of any selected files<br>* And more', 'summary': 'Download and share files directly on your device', 'summaryHTML': 'Download and share files directly on your device', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.4847326, 'ratings': 2650, 'reviews': 1161, 'histogram': [171, 50, 60, 404, 1962], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'proninyaroslav', 'developerId': 'proninyaroslav', 'developerEmail': 'proninyaroslav@gmail.com', 'developerWebsite': 'https://gitlab.com/proninyaroslav/libretorrent', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '6343224901405631979', 'genre': 'Video Players & Editors', 'genreId': 'VIDEO_PLAYERS', 'icon': 'https://lh3.googleusercontent.com/Oc3dBMCzOpVE1hD31o-_8Ywnuh7pV_AVbm7Dm55DmJ406zSjiKVohnssX_XcJ6S9FQ', 'headerImage': 'https://lh3.googleusercontent.com/xoT510qxktZMYWx5XYvXrhCmlx8x6AoE60owRcielNx8m9NgGlLFZF9GBQkg4Io_Kw', 'screenshots': ['https://lh3.googleusercontent.com/xdQ0ABgU4l-p34cyqnPYTSZZI16BkpgxDh2vUBtcPo8yYF0Bx4HZ6s4E8s_NLgfkb_cY', 'https://lh3.googleusercontent.com/Mn67aiLYryB_gyCTV_mrbg_JYrqsT-R-mVWfp6w58zoOoR1TlixWiyWsA7QXNN3KaIaE', 'https://lh3.googleusercontent.com/9ghrq5UviAcwhWHWEH4vpi1qEhuPolqLllg5aNETw_BEZtNO1O3fG32hEe1C5MEuGmWH', 'https://lh3.googleusercontent.com/9jgkl_uFMQPrCnt1GWH38PkkU6CoqaMGZHzd4twYmm6qoYLxxWgKj61cNQ_qi3tWmUA', 'https://lh3.googleusercontent.com/mwsOXl_f3k1eoauA5KhR26oXELCackevVsw3rIPiFFRxmam_jS-PmlzNsr5dKc2wVmg', 'https://lh3.googleusercontent.com/Z9Bk9KWo8ieZWEbZreWuqKF6FTMhUa6Z0R2lxGP9R7nd5PhUztQ3GCCtFE8dBZBu9VU', 'https://lh3.googleusercontent.com/rQxgbH3_u9SDNopoV3NaP0FCi_SYp3Lleu99hXhwSFAXPl2-AxyiJ_o0rFxpaaatsTQ', 'https://lh3.googleusercontent.com/snOwAEqESXpnx6QLmOEb7KZusXIat2t7DudquAQywbDOnLyArHiUIgHqGGKx12-mJw', 'https://lh3.googleusercontent.com/o3IgMwsTCkKifVbC3uav7PDtn88--ApaFwV8s2aNoE8xEaMd8fl0SUWxK9EjnfpLrcc', 'https://lh3.googleusercontent.com/xmbHhZ1jXyi_jN7ThigY3Q8SjSbCLO_3NAEjzK5F01c3wzjF2fgEuLPKYM-hKlzWFQ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Oct 18, 2016', 'updated': 1587463467, 'version': '2.1', 'recentChanges': "* Added:\r\n    - Multiple filters support in the add feed dialog\r\n    - Displaying folders first in the file manager\r\n* Using the parent folder as the download folder for the created torrent\r\n* Improved dialog for opening downloaded files\r\n* Bugfixing:\r\n    - Crash on Android 4.x\r\n    - Adding trackers\r\n    - Cache settings, that affect download speed (may need to reinstall)\r\n    - Some ANR's\r\n* New translations:\r\n    - Basque\r\n    - Catalan\r\n    - Chinese Traditional\r\n    - Swedish\r\n    - Ukrainian", 'recentChangesHTML': '* Added:<br>    - Multiple filters support in the add feed dialog<br>    - Displaying folders first in the file manager<br>* Using the parent folder as the download folder for the created torrent<br>* Improved dialog for opening downloaded files<br>* Bugfixing:<br>    - Crash on Android 4.x<br>    - Adding trackers<br>    - Cache settings, that affect download speed (may need to reinstall)<br>    - Some ANR&#39;s<br>* New translations:<br>    - Basque<br>    - Catalan<br>    - Chinese Traditional<br>    - Swedish<br>    - Ukrainian', 'comments': ["Update: I apologise. I had tinkered with this app to much and that had caused the issue below. It's the best. I always support OpenSource and FOSS but this isn't how it's supposed to work. Even on 200 seeders this app can't download consistently. Checked with another torrent app and removed it immediately.", "Very good App Gives every other details, but it is crashing all the time ,its bug. I can give you scenario Basically if individual file selected is finished download, later it can't handle file operations, just crashes. Why app can't run in background, when we minimize the app it stops working. If we maximize, it start checking each and every torrent then starts downloading Even we check run in background option", "No lags, no ads, no worries, As it is an open source app. The only thing keeps bugging me is that 'when you check a sub file to be downloaded after adding the main link, it doesn't catch up. Have to do it thrice or four times to include the sub file to download'. Except that, brilliant work!", "This application does everything promised with the minimum of fuss. Down and upload speeds are on par with or superior to any other torrent client I've used recently. No ads and no nag screen. Many thanks to the developer. * * * * *", 'App is fine, no ads, but files cannot be downloaded on the sd card. You cannot select anything but phone memory. Big disadvantage for me', 'After using uTorrent for many years I switched to this app and I can say that its truly amazing. Works like a charm and recommend it to everyone.', "Don't normally leave reviews on the play store but this app is awesome. Came from using bit torrent and fluid but this app is so minimal and clean, the dark mode is awesome too", 'Lots of love and 5 star for the developer for keeping this app ads free. And yes it can get the things done. Best app.', "The best minimal torrent client for android, except for the missing feature which is the most important feature for me is adding default tracker list which automatically adds it to the current downloads. Hope you'll bring this feature.", "These app doesn't have high download speed like utorrent. I don't know what might be the problem, coz i didn't tweak any settings. Still it wasn't working as intented. Not at all recommended, you'll regret it!", 'Highly not recommended. Very poor download speed, not hours this application takes days to download any file. Download speed of this app is max 15kbps when download speed on other apps is 200kbps Shame on you developer.', 'Bug report. Limitations settings requires to be changed every session before it takes effect.', "Very good. Lots of nice settings and no ads. Tried 4 other torrent apps, this is by far the best and is the one I'm keeping.", 'Its the best torrent app for mobile,although it restarts automatically;But i got 3x(roughly) speed incrase than flud paid', 'Free, No ads, Fast, Clean UI.. the best Torrent Client. Even much better than BitTorrent and UTorrent.', "After fully download, the app shows still in progress and continually uploaded the data. But otherwise it's a good application", "The best torrent client which is fast, has a good UI and is completely ad free. You're looking for a torrent client Libre is the one I'd recommend hands down", 'Great UI change. Its clean, minimal and it is very stable. Also speed is too good. Very consistent. Best adfree torrent client to use. Thanks dev!!!', 'I like this app. Works well. Not sure on speeds if my connection or app.', 'Has all you might want from a torrent downloader, including sequential download. And no ads. Superb!', 'Clean and minimal UI, open source and ad free . Best torrent client for android. Kudos to the devs !', 'It has a download speed. But it takes a lifetime to complete at least 0.001%. The app is cute though.', 'Absolutely fantastic app. Has all the bells and whistles of paid apps BUT NO ADS!! Best android torrent app i have used by far', "Clean UI, ad free, best torrent client with lot's of information about torrent while downloading and much control on each connection.", 'I never had a problem with this app. Highly recommended torrent app!', 'Add auto shutdown when the app is in background and no torrent are running.', 'I have tried most of the major torrent clients and I think it is the best.', 'The new update is really worst. The downloading speed is very slow in this though the internet connection is High', 'Perfect on the OnePlus 8 Pro! Beautiful design, no fuss, clean, stable. Thank you.', 'downoads and uploads, works with local files , just as many settings as needed', "This is a beauty! Works like a charm! I couldn't ask for more.", 'Its good for me I download all the latest movies I needed & they came nice and clear', 'Cannot download private trackers your client is not whitelisted. Useless. IDM+, zeta torrent pro work.', 'Awesome open source app It has all the options I need with very nice interface', 'After pause it is not working.i downloded one movie after 90% it is not downloding.total waste of mb.', 'Very poor app, once you delete a link it automatically delete a video so be careful and it aboserve enromous data', 'Latest version pauses downloads often for no reason', 'Well designed and very handy. Minimalistic.', 'Cleanest torrenting experience on Android. Big thanks to the developers!', 'Simply the best torrent app that could ever exist and need.'], 'appId': 'org.proninyaroslav.libretorrent', 'url': 'https://play.google.com/store/apps/details?id=org.proninyaroslav.libretorrent&hl=en&gl=us'}
