{'title': 'DeckBox for Pokémon TCG', 'description': '<b>DeckBox</b> is now open source! Check it out, make changes, or submit issues here: <a href="https://www.google.com/url?q=https%3A%2F%2Fgithub.com%2Fr0adkll%2FDeckBox&sa=D&sntz=1&usg=AFQjCNH0sJ90bnIvXQWFLr_LkGbVmoTjTA">https://github.com/r0adkll/DeckBox</a>\r\n\r\n<b>DeckBox</b> is an unofficial deck building app for creating and managing your Pokémon TCG decklists. Whether you are building and tweaking the top decks in the meta or just experimenting with some spicy rogue decks, search through a large collection of Pokémon cards that span from the latest expansion to the original base set\r\n\r\nDownload card data to build your decks offline.\r\n\r\nEnter and track your card collection enabling you to view what decks you can build or what cards you need to finish building.\r\n\r\nSeamlessly integrate with your Pokémon TCG Online game by importing and exporting decklists in a compatible format.\r\n\r\nSign in with your Google account to build and edit your decks across all of your devices, or just continue without one and link it later.\r\n\r\n<b>Disclaimer</b>\r\n\r\nDeckBox is an unofficial, free fan-made app and is NOT affiliated, endorsed or supported by Nintendo or The Pokémon company in any way.\r\nSome images used in this app are copyrighted and are supported under fair use.\r\nPokémon and Pokémon character names are trademarks of Nintendo.\r\nNo copyright infringement intended.\r\n\r\nPokémon © 2002-2019 Pokémon. © 1995-2019 Nintendo/Creatures Inc.', 'descriptionHTML': '<b>DeckBox</b> is now open source! Check it out, make changes, or submit issues here: <a href="https://www.google.com/url?q=https%3A%2F%2Fgithub.com%2Fr0adkll%2FDeckBox&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNH0sJ90bnIvXQWFLr_LkGbVmoTjTA">https://github.com/r0adkll/DeckBox</a><br><br><b>DeckBox</b> is an unofficial deck building app for creating and managing your Pokémon TCG decklists. Whether you are building and tweaking the top decks in the meta or just experimenting with some spicy rogue decks, search through a large collection of Pokémon cards that span from the latest expansion to the original base set<br><br>Download card data to build your decks offline.<br><br>Enter and track your card collection enabling you to view what decks you can build or what cards you need to finish building.<br><br>Seamlessly integrate with your Pokémon TCG Online game by importing and exporting decklists in a compatible format.<br><br>Sign in with your Google account to build and edit your decks across all of your devices, or just continue without one and link it later.<br><br><b>Disclaimer</b><br><br>DeckBox is an unofficial, free fan-made app and is NOT affiliated, endorsed or supported by Nintendo or The Pokémon company in any way.<br>Some images used in this app are copyrighted and are supported under fair use.<br>Pokémon and Pokémon character names are trademarks of Nintendo.<br>No copyright infringement intended.<br><br>Pokémon © 2002-2019 Pokémon. © 1995-2019 Nintendo/Creatures Inc.', 'summary': 'Build and edit your Pokemon Trading Card Game Decks', 'summaryHTML': 'Build and edit your Pokemon Trading Card Game Decks', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.87, 'ratings': 634, 'reviews': 359, 'histogram': [82, 38, 63, 145, 304], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '10M', 'androidVersion': '5.1', 'androidVersionText': '5.1 and up', 'developer': 'r0adkll', 'developerId': 'r0adkll', 'developerEmail': 'support@deckboxtcg.app', 'developerWebsite': 'https://github.com/r0adkll/DeckBox', 'developerAddress': '510 Saluda Ave.\nColumbia, SC 29205', 'privacyPolicy': 'https://deckboxtcg.app/privacy_policy.html', 'developerInternalID': '7955083586908783875', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/FkC5zYUP4T295j904s8J8esDpBacK2oGSVIvbcgP1wgmDhU-hj0_VEFh_ERKQlnVR0o', 'headerImage': 'https://lh3.googleusercontent.com/8Fig7XpfXf-VUuVL-MZmhB7tXkOGBFt1tPFZKFESLBbys4Vp9giqocdsSxCjSa1aZA', 'screenshots': ['https://lh3.googleusercontent.com/L4CyquqGtUKFftsiJTMFl2Of_7xk5EilvZN1wu_oUjR8R3aWg05obOBL9_YhDwmktCI', 'https://lh3.googleusercontent.com/-9rhoDOt1MUgP0GIdwZGi6mykjtTyhDFvilJfA_eWVlTeO0P4JEYXP6B6ZsjG3PchxY', 'https://lh3.googleusercontent.com/BQPNXFesupg9Y3Kly2Zg-C-GByBtd-doU70u3YZzKarq_mv9M7XIxuHz89vdX2AlzHw', 'https://lh3.googleusercontent.com/c2nIXwtCV3EQ5g3IJx52UKMM0mEnVm1-CeQYzVubUm8Xe0q-48gu5g4J6MENbtNja60', 'https://lh3.googleusercontent.com/WAfwEqNyA7yy5_wPmlgrDQ5JV-mHP3c3pbmJxnEOSWxWxUfBkDEpD_S7VWWoTX_9JQ', 'https://lh3.googleusercontent.com/mMnMo-fBw9OR4SBF4YbGlaqc8lVdOSM30fyQNeJjnvQblO6dGb0c444n5znWxMIjqIE', 'https://lh3.googleusercontent.com/Ryy3xx0gi-5g_K2Y7AQa9hzJO2tBCQrr1AQxfbxhwI7Hhe9PV2l4pSfZ8dbpEHrNZnU'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 10, 2018', 'updated': 1582467584, 'version': '1.11.0.3550-release/v1.11.0+4', 'recentChanges': '• Added support for Sword & Shield\r\n• Changes made to decks are now persisted instantly, no longer needing to hit "save"\r\n• Fixed issue with search input field erasing characters you type\r\n• Fixed issue with search filter not operating correctly\r\n• Added confirmation to +1 entire collection set\r\n• Added a way to -1 an entire collection set\r\n\r\n---\r\n• For more information visit: https://github.com/r0adkll/DeckBox/blob/master/CHANGELOG.md', 'recentChangesHTML': '• Added support for Sword &amp; Shield<br>• Changes made to decks are now persisted instantly, no longer needing to hit &quot;save&quot;<br>• Fixed issue with search input field erasing characters you type<br>• Fixed issue with search filter not operating correctly<br>• Added confirmation to +1 entire collection set<br>• Added a way to -1 an entire collection set<br><br>---<br>• For more information visit: https://github.com/r0adkll/DeckBox/blob/master/CHANGELOG.md', 'comments': ['Worked wonderfully all day yesterday, but today it won\'t work at all, across phone or tablet. When I try to search/filter cards, it won\'t give any results. Sometimes it will cinnect Evolution lines, but most of the time if doesn\'t. Lastly, a "Draw" function in testing would be helpful. The first hand isn\'t the only important information. Would definitely be 4 stars if the forst two issues were fixed, 5 if the third feature is added.', "AMAZING APP, when it works.... The're moments when you can't search for a single card, even if you type its name or if you apply filters. Also building a deck with some older cards causes the app to crash whenever you try to open that list again. But as I said, when it works it is amazing! You can easly add and remove cards from certain lists, it automatically puts the deck in the format it is made in. New cards are added super fast and the deckbuilding process is just overall fast and amazing.", "Deckbox is amazing, a fantastic tool... however it is very slow with updates, it's currently been many, many weeks since the release of the set after Sword and Shield base set, and there's no sign of an update, its last big update has made searching for cards a little janky, the search bar stutters when you type, or flat out resets. Example decks shown when you view your decks aren't updated, and haven't been so since the start of Sun and Moon.", "This app is essentially broken. It won't find any cards I search while trying to build a deck. And I browse sets it basically shows an eighth of the total cards in a set. Sometimes it will find cards I search. But if I leave and come back it won't replicate my search.", "Sometimes it doesn't work for long periods of time and you can't search for any cards that you normally can search for. It is still a brilliant app, and i love it especially after rhe rebel clash support but when it doesn't work it is such a pain. If not for this five stars.", 'I really like this app, good way to see the standart format and expanded, but i am troubled by 2 things as of me writing this review, i cant find any basic metal energy and (not as important as the prior) it would be nice to have some sort of warning icon for when building a deck in standar, to know that the expansion will get to expanded soon, but as far as anything else goes, pretty cool app, usefull for its main porpouse of building decks.', 'Perfect app to keep track of all the cards, simply Love it! So easy to use. I hope you add a little more to the testing.', "I love this app, but there is one thing that frustrates me. When building a deck I wish there was a way to filter out cards that are in my collection. It can be tedious to have to scroll through a long list of cards that I don't have just to find the ones I do. Otherwise I love it and will definitely continue to use it.", 'Great app with many great and easy to use features. I contacted the support team for some clarification on features and was pleased to find that they responded quickly and were hugely helpful. Would definitely recommend as I tried a few and this one seems the best.', 'Pretty awesome app. Useful for judging how viable a deck might might be while putting it together. Sure the typing glitch is annoying but works with some patience. The only thing I wish is that I could simulate a little further than first draw. Is there any way to simulate through turn 2? That I am missing?', "Love the app, my ONLY COMPLAINT is that currently if I try to magnify a cards image while building a deck the entire app crashes. It didn't do this before.", 'Dreadfully buggy when you try to build decks. Half the search options dont work. Recently, I cant even select cards without the ehole thing crashing.', "Love the app~~ small suggestion: wish there's a button I can only see the cards I collected", 'App is great with little bugs, however for sword and shield it uses SWSH instead of SSH which causes issues when porting to and from PTCGO, and for making printable decklists. Needs to be fixed please!', "Doesn't work on my Samsung tablet. Won't load anything and doesn't have any tutorials on how to bring add my collection", "Doesn't work. Too buggy. When you add or remove a card it doesn't do it. Typing in cards doesn't load in the words you typed. Doesn't save either. Whatever the last update was, it did the exact opposite.", 'After a glitch where a pokemon was missing it seems to work fine. Got cool stat features. Definitely going to use this and hope it improves!', "I don't usually rate apps much, however this app deserves it. Every issue I have had with this app has been fixed within days. Congrats to this app.", 'Some times when i search up a card it will start to delete the first letter of the word , and it crashes randomly , but otherwise its ok', 'Really useful. I can look up any pokemon card from any set in seconds and really good for helping to theory craft decks and build decks. Great UI, I use it all the time', "It's got some bugs but I really enjoy this app. Great images of the cards too", 'Great app. Three stars because after updating all decks and all sets were lost.', "It's a really nice app to help build decks, there are still quite a few bugs that need to be worked out.", 'By far a 4 star app but there is a few bugs that still needed fixing like searching will only let u put in 2 letters on something', "App keeps kicking me off other than that it's an awesome app I'll give it 5 stars if you fix it please", 'It keeps saying deckbox has stopped whenever I try to edit my deck', 'Awesome app perfect for researching a deck build.', 'Really good Pokemon deck building app', 'Not the greatest app in the world, still has a lot of bugs on my end', "Overall a nice way to keep track of a deck, the only problem I have is that my country's only two sets so far are amalgamated from various Sun/Moon sets, and those two sets aren't available in English, so searching the cards to add to my collection is difficult Personally, I would add the option to add cards in the deck profiles into the collection so people who already have decks and cards before installing this can get an easier jumpstart", 'I am pleased with this. This helps me keep track of everything.', "Won't search for cards to add to a deck (says couldn't find anything), doesn't show sword and shield or rebel clash.", "I've been using this app for about a month now and I gotta say, it's really great. there are annoying glitches here and there such as cards randomly disappearing, decks duplicating 2-6 times, the filters sometimes not actually applying, however overall it's awesome. something i'd reccomend is adding folders. i have alot of decks, but something that gets annoying is when i have a million WIPs that are higher up than the deck i'm looking for. i think folders might make finding decks easier. thanks", "This is perfect for me! Now I don't have to keep on making decks in my notepad app and have to keep track of deck count in my head. I would rate this 5 stars but it hasn't been updated with the new Standard 2020 format rotation, from Ultra Prism to Unified Minds, and I don't want to keep going into the set list constantly and tick off what isn't in Standard anymore. Once that happens, then this will get 5 stars!", "This app is great! it is so easy to import decks from anywhere, as long as has the format then it's good. My main problem that , the expansion has come out for this month and they didn't update the app b/c it is in japanese and you have to wait until it is in english, well that's the problem it is already in english so where is the new set at . Yes it has updates from github but it's going to be Halloween soon I want to add some new decks and some ideas put in, not wait until it finally updates.", "I absolutely love this app, Can't find another that match this let alone beat this in performance and ease of use. Have been using this for months and have to say that the layout is amazing and with the new update I can finally keep track of the cards I own which was the one thing that was missing. Overall I love the app and would highly recommend that you at least try it out.", 'All in all, this is straight up the definitive app to create a decklist for your Pokemon TCG deck and it even goes into certain aspects of the deck stats (primarily concerning the first turn). It seems the Pokémon TCG isn\'t as supported as other TCGs. Even though this app was described by me as "definitive," it still has a lot of issues. Deck lists being unable to edit, innacurate pricing, and even losing your deck make compulsive saving a must (lest you lose all your progress on your deck)!', "Used to be 5 stars but now it's too buggy, looking forward to patches so I can use again", 'enjoying the app so far. i love that it lets me test a hand a few times, tells me what set a card is from (I have a bad habit of telling a seller I need a card and having no idea the set) and overall keep things tidy. my only competent is I cant decide what card is in the front of my deck so i can easily pick it out, if there is a way to do this and I find it ill happily give this app a 5', "Great app but funny that it says u can download all sets in order to use during no internet connection, but when i did and ready to use it when im offline, all the images stay loading forever, its like i still have to redownload which i did so many time bfore i go offline or if there's no internet connection in my area, disappointed, please do something about this or my downloaded images all for nothing, could be 5/5 since the app is so simple and easy to use"], 'appId': 'com.r0adkll.deckbuilder', 'url': 'https://play.google.com/store/apps/details?id=com.r0adkll.deckbuilder&hl=en&gl=us'}
