{'title': 'a Training Tracker (ANT+ BTLE)', 'description': 'a Training Tracker is a powerful yet simple to use app with a nice user interface for the really serious athletes who want to track all the details of every training session but do not want to enter details manually.\r\n\r\nThe main Features are:\r\n  * Open Source: https://github.com/rainerblind/aTrainingTracker\r\n  * Support of many ANT+ sensors (heart rate, run speed and cadence, bike speed, bike cadence, bike speed and cadence, bike power, temperature/environment).\r\n  * Support of many Bluetooth LE sensors (heart rate, run speed and cadence, cycling speed, cycling cadence, cycling speed and cadence, cycling power).\r\n  * Pair an unlimited number of remote (ANT+ or Bluetooth LE) sensors, e.g., a speed or cadence sensor on each of your bikes.\r\n  * Simply swipe through the different individually configurable views.\r\n  * Export to TCX, GPX, CSV, and Golden Cheetah.\r\n  * Upload to Dropbox.\r\n  * Upload to various online communities: Strava, TrainingPeaks, RunKeeper.\r\n  * Use your Pebble to display values.\r\n  * When the app starts, it searches for all paired sensors and takes the data from the "best" available one.\r\n  * The activity type (run, bike) is derived from the available remote sensors.  When no remote sensors were available, the activity type is guessed from the average speed.\r\n  * The equipment is synchronized with Strava.  The equipment used in a training session is then derived from the available remote sensors.\r\n  * Shows your starred Strava Segments on the map while riding or running.\r\n  * Simple setting of the calibration factor.  You only have to input the measured and true distance. \r\n\r\nOnce configured and paired with all your remote sensors, you only have to press start when you start your training session and stop when you are done.  Except for the name of the workout, everything else should go without further interaction.  The app automagically determines the sport and the equipment (shoe or bike) you used during a training session based on the remote sensors that where used during this session. Moreover, the app can upload the files to your Dropbox.  So when you have finished your shower, the data is already uploaded to your favorite online community and on your computer, waiting to be analyzed with your favorite software like WKO+, or Golden Cheetah.', 'descriptionHTML': 'a Training Tracker is a powerful yet simple to use app with a nice user interface for the really serious athletes who want to track all the details of every training session but do not want to enter details manually.<br><br>The main Features are:<br>  * Open Source: https://github.com/rainerblind/aTrainingTracker<br>  * Support of many ANT+ sensors (heart rate, run speed and cadence, bike speed, bike cadence, bike speed and cadence, bike power, temperature/environment).<br>  * Support of many Bluetooth LE sensors (heart rate, run speed and cadence, cycling speed, cycling cadence, cycling speed and cadence, cycling power).<br>  * Pair an unlimited number of remote (ANT+ or Bluetooth LE) sensors, e.g., a speed or cadence sensor on each of your bikes.<br>  * Simply swipe through the different individually configurable views.<br>  * Export to TCX, GPX, CSV, and Golden Cheetah.<br>  * Upload to Dropbox.<br>  * Upload to various online communities: Strava, TrainingPeaks, RunKeeper.<br>  * Use your Pebble to display values.<br>  * When the app starts, it searches for all paired sensors and takes the data from the &quot;best&quot; available one.<br>  * The activity type (run, bike) is derived from the available remote sensors.  When no remote sensors were available, the activity type is guessed from the average speed.<br>  * The equipment is synchronized with Strava.  The equipment used in a training session is then derived from the available remote sensors.<br>  * Shows your starred Strava Segments on the map while riding or running.<br>  * Simple setting of the calibration factor.  You only have to input the measured and true distance. <br><br>Once configured and paired with all your remote sensors, you only have to press start when you start your training session and stop when you are done.  Except for the name of the workout, everything else should go without further interaction.  The app automagically determines the sport and the equipment (shoe or bike) you used during a training session based on the remote sensors that where used during this session. Moreover, the app can upload the files to your Dropbox.  So when you have finished your shower, the data is already uploaded to your favorite online community and on your computer, waiting to be analyzed with your favorite software like WKO+, or Golden Cheetah.', 'summary': 'Displays and tracks your training data.\r\nSupports ANT+, Bluetooth LE, and GPS.', 'summaryHTML': 'Displays and tracks your training data.<br>Supports ANT+, Bluetooth LE, and GPS.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.89, 'ratings': 130, 'reviews': 81, 'histogram': [19, 9, 10, 18, 72], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '6.9M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Rainer Blind', 'developerId': 'Rainer+Blind', 'developerEmail': 'rainer.blind@gmail.com', 'developerWebsite': 'http://www.aTrainingTracker.com', 'developerAddress': None, 'privacyPolicy': 'http://www.atrainingtracker.com/privacy.html', 'developerInternalID': '8882253497075472210', 'genre': 'Health & Fitness', 'genreId': 'HEALTH_AND_FITNESS', 'icon': 'https://lh3.googleusercontent.com/S-ZqqXh2nUBbt6EFO-U7DZaBtEXHuak3TQbK02wiSVgLyKGrGaQWv_6YlZlBWycc8g', 'headerImage': 'https://lh3.googleusercontent.com/UWoZuumgh2VEz33L5zvfVELyw_aq6CaWGhXWEmBgYdbmoPr4yvIY0U_0x5yTyOEu-Q', 'screenshots': ['https://lh3.googleusercontent.com/eACdaeI_c9j2UwJ8ZfY2j5_xWIODGOeHkqKY7vUHi1YtQWBh8rMHO_vowx-7LaKj3PHU', 'https://lh3.googleusercontent.com/IfeTzGWFQ-HYR0H02ldXMyvMgbfyuasCdt3umN-mNRrBxhsAcNShhROxc_5xvDllGA', 'https://lh3.googleusercontent.com/UZb_Z_K1tG_zXtN8LabG8lyWuoFqTU78JHmePIhtBjQJQpZsFt32D-57Mu74jrdb190', 'https://lh3.googleusercontent.com/Mfa0URgefJDS64SC-W91nAduDDx2DVqkCxRgJhspxUR7_6A0OFZWFioetAYlMidtYw', 'https://lh3.googleusercontent.com/jBKlCmPeB8iBtvW1wPSRbxPAR_jR1S_yQwawqkNHve6BW_FA6KPfHpFoSXTVWImPEmdS', 'https://lh3.googleusercontent.com/_ruP3F7XbcGcJ1KFsNERFVODTRXOyI27omlfUkewmzqxUOljc1smhnbFzl3po-X1pRyE', 'https://lh3.googleusercontent.com/HtKhlq_GyAAOYyVvJ98hNoT4ErP0AdwREfPxEr0sqnomy8pW2XTuKt5Hs5wRYtIToQ', 'https://lh3.googleusercontent.com/Hts11YcU90BSkWTY0pM_qeCjthQIG4omtPScG4ChMHpPDsU_i1IJrVFKimXD9MCmd2xU'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 21, 2014', 'updated': 1578949173, 'version': '4.2.5', 'recentChanges': 'V4.2: Fullscreen and dark mode\r\nV4.2.1: Bugfix: Crash when starting tracking and some minor UI improvements.\r\nV4.2.2: UI improvement: nicer buttons in the dialogs.\r\nV4.2.3: Bugfix: Crash of ANT+ Service on Android 10\r\nV4.2.4: Bugfix: Crash when exporting to files in Andorid 10\r\nV4.2.5: Bugfix: Tracking location when app is in background on Android 10', 'recentChangesHTML': 'V4.2: Fullscreen and dark mode<br>V4.2.1: Bugfix: Crash when starting tracking and some minor UI improvements.<br>V4.2.2: UI improvement: nicer buttons in the dialogs.<br>V4.2.3: Bugfix: Crash of ANT+ Service on Android 10<br>V4.2.4: Bugfix: Crash when exporting to files in Andorid 10<br>V4.2.5: Bugfix: Tracking location when app is in background on Android 10', 'comments': ['Still a load of rubbish, Using Kitkat on Sony E1 crashes before opening. Even after update. It would get 0 Stars if I could select Stars.', 'This is the only app that was able to connect to and receive data from my PowerTap Power Pro 2012 power hub, which automatically makes this app a win for me! Thank you so much. There are many issues with this app, but reviews are not the place to bring up faults. In my honest opinion, ignoring the bugs, this app is a must have and was the only one that worked for me and this is why I gave it a high rating.', 'The simple and the best! - it is one ONLY app that can connect my Meizu 15 phone and my (BLE) Polar H7 sensor. Many thanks for the author! I installed from another internet resource, because from here not possible to install.', 'best app ever, you can customize it, many different metrics, all that you need is available and even more, better than strava, wahoo, etc., i uninstalled strava and wahoo for this app', "Doesn't find my magnus trainer on Bluetooth. Every other app that supports Bluetooth does.", 'Just trying to work out how to set wheel circumference so i can use it on an indoor trainer...what is the default wheel circumfetence setting? Also how do i put average speed on display?', 'Great app for free if you want to pair ant+ with your smartphone to make a great cycle computer', "Doesn't work on Galaxy S10 Dec update Ant plus just crashes", 'After STRAVA switched off sensor, use this app. Like it!', 'Cant connect to strava via google account', "Bro there is no ok button to wheel circumference so i can't add my 700x32 measurement", 'Bekerja dg baik', 'Works correctly with Cycplus S1 sensor to display speed.  But, technical question: Die GPS Geschwindigkeitsanzeige funktioniert bei mir nicht in der App, obwohl der Track selbst korrekt in der app aufgezeichnet wird und alle sonstigen GPS-Apps funktionieren ( auch andere GPS Test apps zeigen eine Geschwindigkeit an).  In der "a Training Tracker" app bleibt aber das Feld Geschwindigkeit (GPS) einfach leer.  Ist das Problem bekannt?  @Rainer Blind, probably yes. Note that I want to use the Cycplus S1 speed sensor and GPS speed sensor at the same time. I created two widgets for it and set the source to each one, but only the Cycplus S1 shows speed, the GPS stays at 0.', 'GREAT app. Works with a bunch of different ANT+ sticks, and has a very customisable display. :)', 'Awesome app! Deserves to be paid app. Two suggestions from my side . 1. Add everage speed or pace measurement. 2. Remove the text from HR and speed readings, it takes display real estate and we know already anyway that HR is BPM and speed is Km/h or miles. Thanks so much for the great app.', 'Awsome app that will collect all your ant+ devices, regardless of brand, and feed it to strava or simply export to csv', "Thanks for the quick reply and update. However I have just updated to v3.21 and still get message that the app does not support split.             Only app to display bike cadence data as a bike computer. If had offline map support with open street map- or supported split screen to use with osmand app it would be great. Also can't seem to be able to change from multisport default layout", 'After trying every other running/tracking app this is the only one that works with the Speedcell btle foot pod (stride sensor) and the Pebble Time watch! Will update to 5 stars if stats remain accurate over time.', 'The only application I can find compatible with my Pebble Steel and Polar H7', 'I have tried this app and am completely frustrated with it. When i try to configure displays no matter what i change it always goes back to default and never saves.  Every time i change altitude to Time of day, it just changes back...  HOW DO YOU SAVE LAYOUT CHANGES>>>>>', 'I used HTC one X , ANT+ usb stick on OTG cable with garmin hr sensor and s&c sensor. good app and show detail sensor data . but if need more detail this app is the best example  average hr, average speed, average cadence, max speed, max hr, max cadence, and calories data not show data in my phone ,GPS data ,and can define count lap every 1 km or can define auto pause if slowly speed. In a part of data If app can save .fit for garmin connect import because .fit keep more data but compress file.'], 'appId': 'com.atrainingtracker', 'url': 'https://play.google.com/store/apps/details?id=com.atrainingtracker&hl=en&gl=us'}
