{'title': 'DroidBeard', 'description': 'DroidBeard is a lightweight and easy to use app for managing your Sick Beard installation either at home or remotely.\r\n\r\nCurrent features include:\r\n\r\n    • Add new shows from your Android device\r\n    • See upcoming episodes\r\n    • View snatch and download history\r\n    • Manage episode statuses and force searches\r\n    • Supports multiple profiles so you can manage multiple Sick Beard installations\r\n    • Support for Sick Rage specific API\r\n\r\nFor more information, visit the website at https://rastating.github.io/DroidBeard\r\n\r\nDISCLAIMER: DroidBeard is in no way affiliated with Sick Beard.', 'descriptionHTML': 'DroidBeard is a lightweight and easy to use app for managing your Sick Beard installation either at home or remotely.<br><br>Current features include:<br><br>    • Add new shows from your Android device<br>    • See upcoming episodes<br>    • View snatch and download history<br>    • Manage episode statuses and force searches<br>    • Supports multiple profiles so you can manage multiple Sick Beard installations<br>    • Support for Sick Rage specific API<br><br>For more information, visit the website at https://rastating.github.io/DroidBeard<br><br>DISCLAIMER: DroidBeard is in no way affiliated with Sick Beard.', 'summary': 'A lightweight app for managing SickBeard, the ultimate PVR application.', 'summaryHTML': 'A lightweight app for managing SickBeard, the ultimate PVR application.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.14, 'ratings': 207, 'reviews': 62, 'histogram': [14, 6, 16, 68, 101], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.0M', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'rastating', 'developerId': 'rastating', 'developerEmail': 'rastating@protonmail.com', 'developerWebsite': 'https://rastating.github.io/DroidBeard', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '6839260992518732816', 'genre': 'Video Players & Editors', 'genreId': 'VIDEO_PLAYERS', 'icon': 'https://lh3.googleusercontent.com/Dw2_FJFscXYZt99Y4Mfr5AJnhiWBWk0PDrSEEYm19gZz4VM_h9kO-OGrKxQBOy4ar-k', 'headerImage': 'https://lh3.googleusercontent.com/DsAERpl6AtKrxaa9TWvCPsTyAEaTNkt0m4-Cnaf_F-de5ulp_F34Sn6y7lc-oauPJXM', 'screenshots': ['https://lh3.googleusercontent.com/iNQgwOXpvneNl_UOiF_y5o8J_Te_qd_VNYIcPkMlJfeZDfm-aCFX9btfJ3WYA9Gq0Kg', 'https://lh3.googleusercontent.com/5oJ34ofYnrjHT4IsQ543KgJgBw7z-gKy74bvMNsABT88YkrJ4_9Cf3bVfPksR6Wq4w', 'https://lh3.googleusercontent.com/Q0NTuVAwMbORxyrEBXAyG2zQ9QBs7srBf2RSBIu8z8P_VHi2qqxuHYyytDbqQGPCb7rF', 'https://lh3.googleusercontent.com/Ls9PxL5Apo8wmNM6w1IoDorcfA6GJ1Eb2MvFPpoUpwUeFjhdlRU7ZwjevuJUB7bnnZ8', 'https://lh3.googleusercontent.com/GN1M3gLyIdQAamq945E4yX1vGq9P2zxIY1P1J5HwhhdK_gq3nxBOvII4ojHQdhf4GiWR', 'https://lh3.googleusercontent.com/sf3_W4Ew3xIK5m6_JkloLeg-OmjvPh1DGIwcu5Jr09Dle9FXF1th8BscjibfuqZagwNK'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 21, 2014', 'updated': 1537474448, 'version': '1.5.3', 'recentChanges': 'Fixes compatibility with the latest version of Sick Rage and fixes a UI issue on the shows screen for some devices.', 'recentChangesHTML': 'Fixes compatibility with the latest version of Sick Rage and fixes a UI issue on the shows screen for some devices.', 'comments': ['Does not work with fork sickgear.', 'tried shows rage for a bit. came back to this ;)', 'Any chance of support for medusa.?', 'Will not work in internal network. No error, the show list is just empty. \nNot setting up dyn dns bs for this...', 'Not a lot I can say really, the settings are all correct but nothing \nhappens.everything is blank', "It's just a pity usenet is dead, still a great management tool.", "Doesn't connect", 'App does not give any valuable feedback to the user as to why a connection has failed.for me i just needed to restart sick beard after enabling api key access however the app just silently failed and showed a blank page', "What have you done to this app? Used to be flawless. Since last update, it just doesn't connect. Why destroy something that works? Were you just bored? Are you stupid? EPIC FAIL !!!", "Takes forever for show listing to show up, and usually crashes before finished. When opened again and listing is available clicking on anything causes the app to crash again. At this point it's useless.", 'Great app. Would however be perfect if you could search in the show listing (my collection is too big to scroll). Also when adding a show it would be nice to have the same options as the web gui... i store my media in multiple places..', 'Great app when on same wifi network but unable to connect when on 3G/4G mobile network.  Any pointers?  Am I missing something?', 'Never worked . constant connection failure!', "First app that's worked with a reverse proxy setup. It also helps that it is a great app and works just as good as the web interface.", 'This app works pretty well. I just have a few issues with it. Whenever you go browse a Show in your Sickbeard library, there is no color key to figure out what the colors correspond to. Do I have to remember that Red means Wanted and Green means acquired? Also, I have found a strange issue where selecting multiple seasons and marking wanted only makes the first selected season wanted. If these issues were fixed, I would give it 5 stars. Over all, great design and functionality.', 'great interface, nice styling ... if mostly useless. Let me clarify, on trying to add a show through the app, it adds to a queue, which God alone knows where is. Might be a simple setting to find, but undocumented it seems.', 'When i want to use the show banners they show up but all blurry/lined. More people have this look?', 'Other than a few minor annoyances this suites my needs perfectly. A+', 'Otherwise good.', "Works great when I don't want to remote into my server from PC. Brilliant, thanks.", 'It would be nice to be able to look through a list of new shows or top 100 shows etc.', 'Works as advertised.', 'The first time you set up a profile you have to do so without the banners option checked or it will break your Web interface. After you gets your shows initially loaded you can enable banners. 4 stars for that minor trouble', "Works great with sickrage not a worry in the world. Setup was nice and easy, although if there was a 'next' button during the setup it would be a lot less confusing as to what to do when you've filled everything out.", 'A couple more features (more sorting and show editing options) would get  this 5 stars but this is pretty good as it is.', "Great app. Works flawlessly when I'm connected to my wifi. Would love to know how to access over my mobile 4G network....??", 'Is this crashing sickrage latest for anyone else', "One bug I see often... Sometimes shows don't display episodes.", 'Was even able to use hostname instead of IP during setup.', 'Very handy for mobile access', 'Works perfectly!', "Can't connect to my sickbeard at all.  An example would be nice, but it's not available.  But it's simple setup, and plugging in all the parameters -> no connection", 'Hi there, I have given five stars because I used to use this app with sickbeard.  I made the switch to sickrage and i cant connect ever since. Any pointers?  I d love to be able to use this wonderful app again.', 'Thank you devs for this wonderful app!  ssl connection works flawlessly even behind router with port forwarding (for those having doubts)', 'Works now with sickrage', "Seems to work really well, although it doesn't bring up any shows to add when I search. Also a UI option to match sick rage would be awesome.", 'Works great!', "Works very well, even with SickRage. I love its minimalism and responsiveness.  I'm missing the option of setting the app to go to a different address when connected to a specific WiFi network so I can use it freely at home and on the go without needing to change the server address in the settings.", "I would love it if it didn't take so long to update", 'Nice app to talk to your sick Beard server'], 'appId': 'com.rastating.droidbeard', 'url': 'https://play.google.com/store/apps/details?id=com.rastating.droidbeard&hl=en&gl=us'}
