{'title': 'PersonaDex: Persona 5 Compendium', 'description': "PersonaDex will be the most useful app to have by your side when playing Persona 5. Look up your Personas' stats, skills, element strengths/weaknesses, and even fusions! Not looking up a specific Persona? Only looking for a specific group of Personas? Sort and filter all existing Personas to find what you're looking for!\r\n\r\n- Look up all the info! Stats, element weakness/strength, skills, fusions to and from any Persona!\r\n- Filter personas by Arcana, and by level!\r\n- Simple to use searching with autocomplete (some of those Personas are hard to spell, I know)\r\n- Support for DLC Personas (Enable in settings)\r\n- Best performing Persona 5 compendium on the market!", 'descriptionHTML': 'PersonaDex will be the most useful app to have by your side when playing Persona 5. Look up your Personas&#39; stats, skills, element strengths/weaknesses, and even fusions! Not looking up a specific Persona? Only looking for a specific group of Personas? Sort and filter all existing Personas to find what you&#39;re looking for!<br><br>- Look up all the info! Stats, element weakness/strength, skills, fusions to and from any Persona!<br>- Filter personas by Arcana, and by level!<br>- Simple to use searching with autocomplete (some of those Personas are hard to spell, I know)<br>- Support for DLC Personas (Enable in settings)<br>- Best performing Persona 5 compendium on the market!', 'summary': 'The definitive compendium for Persona 5.', 'summaryHTML': 'The definitive compendium for Persona 5.', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.78, 'ratings': 366, 'reviews': 161, 'histogram': [0, 7, 10, 36, 311], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.7M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'Rechee J', 'developerId': 'Rechee+J', 'developerEmail': 'support@persona5dex.com', 'developerWebsite': None, 'developerAddress': None, 'privacyPolicy': 'https://recheej.github.io/', 'developerInternalID': '5711685320537909497', 'genre': 'Entertainment', 'genreId': 'ENTERTAINMENT', 'icon': 'https://lh3.googleusercontent.com/OHxmNzf8VTlyBCYBoNoCX3nJZfOU6bAW-0QD4bnn_XLgKt1Olyk44xtc9J-HUxlqWlY', 'headerImage': 'https://lh3.googleusercontent.com/VFjzCvICBqlCEbKrD986o7SuvsSunO-mSu5MUSkePBvv5PEJl53Kmmo7acZzH-5u9eo', 'screenshots': ['https://lh3.googleusercontent.com/tZNjO7O8XZuDfkqTSiYRttZrouB2Yu2Mz0AQao7x5OFbzdkjSHGsMoVKw-9ybmD9iuE', 'https://lh3.googleusercontent.com/0MS7sCCYBZxGH7bSLAo80l4zQIV9TxGfkUwo4NXutqXYeY3k5Z0VhMaEQcqoQ2SwmvDQ', 'https://lh3.googleusercontent.com/zYorkEMblQqlOAKh2_wCly7hsAbSqJRAfHWP_CKJQmAO8mmvlE7Dg42lrboaMlPK3EE', 'https://lh3.googleusercontent.com/dp0tlXvCw97uI8bAgaRHL2VneMdvKPvY1OJIGklUFdNS_JR5kQF_rPmqmvaZIWHGkg', 'https://lh3.googleusercontent.com/mxu7RwZ_b7luSU3-2ODbv6EIBOiLkyy9mI6tdiMzkqCpC1O3zkuuZpQ7Ig7GNbZck2Q', 'https://lh3.googleusercontent.com/Y_qFxm-YmP_mHjsit49Kurm2fEShUxtfdIk-fKHLA_lAtXT7um0ciwvzTvhNeLsxwzA'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Oct 10, 2017', 'updated': 1587177868, 'version': '3.1.0', 'recentChanges': 'You can now search for personas by their "shadow" name / the name they have before you capture them.', 'recentChangesHTML': 'You can now search for personas by their &quot;shadow&quot; name / the name they have before you capture them.', 'comments': ["I've been using this app for a majority of my playthroughs, and it's been working great. The big issue that I've been running into is that many of the fusions for Yoshitsune, all lead to Mara. You know, the one that's just a giant peen. Idk if this is a joke by the dev, but persona fusions are costly in-game, and to fuse two just to see a giant peen is not very funny.", 'Great app for the most part. Some combinations in Royal are incorrect. IE: Fusion to Arsene from Orpheus F Picaro and Obariyon did not result in Arsene. I had to use one of the other online tools to find a different downfuse path. That said, however, I love this app. I used it extensively for the original game, and I will continue using it in Royal. Just going to make sure I save before investing in a fusion path that might not work', 'I like it. Works very well. Easy to work with and helpful when trying to fuse or plan out my personas. Found a problem though. When filtering out the list the Persona 5 Royal filter option does the ssme thing that the filter for the base game. Of its changed to filter out all base game personas if i have the royal one checked and not the base one then 5 stars will be back', 'I like this app. It\'s simple, very very fast, has everything you need for a compendium app but not bloated with too much stuff. I have a suggestion tho. Please let me search persona using the alias so I can see the weakness of new personae I don\'t know the name yet. For example "possessing dog ghost" for Inugami, etc. EDIT: Feature\'s added. Thank you dev', "This was potentially pretty awesome since I just got Royal, but a lot of the fusion data is incorrect. Since it only has fusion data I expected it to be decent. I heard fusions change when you get the DLC, but this tool is too inaccurate to use at all. I suggest chinhodado's tool online. It's way better, and accurate!", "I've been using this app since p5 and I love it 👌 I have one problem tho. There are some inconsistencies regarding the fusion (fusion to) for some personas e.g. Pale Rider. It's being shown as an advanced fusion even though it is not.", 'Amazing in almost every way. Although I noticed that in the p5r edition some fusions may be wrong. For example I looked up how to fuse satan and it said one of the materials was satan itself. To fuse satan.', 'Pritty good only thing im not a fan of is some time when i try to look up a fusion and i got try it, it ends but giving me a dlc, so i wish there was away to see if fusions will change if you have dlc but its still a really good app and very useful', 'It\'s a good app overall, but sometimes the fusions for persona are wrong. For example when trying to make genbu, it says "fuse arsene and regent to get genbu" but when I try it the fusion says "impossible"', 'Great app. Would Love a persona team builder to keep track of team and moves.', "It helped me alot In dungeons and fusion and whatnot, there's literally no better app out there! (And I'm not kidding)", 'Enjoy the app and very helpful with going through the twins link, nice to see the app maker responding to problems.', 'Useful for Persona fusions and easy to use. Detailed information for every Persona for both vanilla / Royal.', 'Used this on my first few playthroughs of persona 5 which was extremely useful and now is the first app for support with Royal.', 'Loving the app altogether. But the latest updates are missing the fusions for Treasure Demons and DLC personas.', 'Pretty helpful with the original, but HUGELY outdated for Royal.', 'the app is good you do have to remember to set the settings for tje dlc but the royal calculator has the wrong fusions for satanel and lucifer and metatron', "Thanks for the app, it's really useful. Just wondering are you planning to add the persona default traits too? That would be super helpful for fusion purposes", '💯 go to for help when in fusion mode for the twins and pretty every other time you need a particular fusion!!', 'Really fast and reliable', 'Very useful in all situations', 'Very useful, thank you! 🙌', 'Helpful during my gameplay', "Just saw the update for royal. Vanilla still helped me with the first 12% of my compendium while still in Kamoshida's palace. Love the continued support.", 'Good for base game, needs updating or separate list for Royal as some of the existing fusions have changed on top of the new personas', "I used this when I was playing Persona 5. It was very useful as it helped me get the Strength Confidant's quests and fusion guides for unknown Personas. Thank you PDex, very cool", 'easily the best, no-nonsense persona 5 related app in 2020. it just. works. 5☆s imo', "The fact that it's free is the best part, because other guides are usually a dollar or two. The only downside is there are no bosses and it hasn't been updated for the DLC. Otherwise it's great! Really helped me through the entire game! The guide is also available offline which is nice.", 'The fusions "from" don\'t always link to the right Persona, only to the "Persona 2" and not the "Result" one. A minor inconvenience because the search function is still super easy to use. Other than that, the app is super helpful!', "It's a great app to help with the links, but not all the answers are accurate. some of the answers in the app say +3 but it really is +2. and yes this is with having a persona of the same arcana. if you only use this app you will waste a couple of days through out your play through. still great overall though", 'It was helpful during my gameplay and i learned how to get most of the personas', "This is the definitive guide to Personas. One little nitpick of mine is I would like it if it included the main party's Personas. Other than that,great app,glad I downloaded it 👍", 'This app was extremely useful for me throughout all of p5 but especially with the Strength social link. Are you going to update the app for Royal when it comes to the west or are you planning on a whole new app? Either way thank you for creating this app it was very helpful!', 'It is amazing help for persona 5. Now we need an updated version for when Royal comes out', 'Has so much info, it\'s pretty much all I ever needed for my fusions. I just hope that they will add the "Twins confidant fusions".', "this. app. is. amazing! highly recommend for people playing, I'm only partly or half in the game right now and I so wished I looked this up sooner! it must of taken so much time, thank you whoever made this app! 😁", 'Easy to use and quick! Definitely one of the better compendiums out there!', 'JUST DOWNLOAD IT!! It helped really really lot in the game, i hope you make an update for persona 5 royal, keep up the good work.', "not updated for DLC persona fusions just like the fusion calculator website there for i cannot recommend this to anybody, seriously these people make these guides but apperently don't care enough to update them for changes", 'the dlc personas are included you just after to enter settings and select which ones you own. to mitigate any confusion, perhaps a prompt the first time you open it?'], 'appId': 'com.persona5dex', 'url': 'https://play.google.com/store/apps/details?id=com.persona5dex&hl=en&gl=us'}
