{'title': 'Anuto TD', 'description': "Anuto is free and open source. Feel free to contribute:\r\nhttps://github.com/reloZid/android-anuto\r\n\r\nPlease report any bugs you encounter!\r\n\r\nHow to Play:\r\n• Buy new towers by dragging a tower from the inventory at the top onto the field. Make sure you have enough credits.\r\n• Open the properties window for a tower by double tapping it. To close the window tap somewhere on the field.\r\n• Strategy: Determines which enemy to target if there are multiple in range.\r\n• Lock Target: If true the tower will not switch target until it is dead or out of range.\r\n• Enhance: Increases the level of the tower making it better.\r\n• Upgrade: Replaces the tower with a higher tier tower. Note that any enhancements of the tower are lost.\r\n• Sell: Removes the tower. Refund decreases over time.\r\n• Call in the next wave using the button in the upper right corner. If you call in the next wave while there are still enemies in the game you receive bonus credits.\r\n• Make sure the enemies don't make it through the course!\r\n\r\nThis is an early release. It currently does not include:\r\n• Save game state (progress is lost if Android decides to close the app)", 'descriptionHTML': 'Anuto is free and open source. Feel free to contribute:<br>https://github.com/reloZid/android-anuto<br><br>Please report any bugs you encounter!<br><br>How to Play:<br>• Buy new towers by dragging a tower from the inventory at the top onto the field. Make sure you have enough credits.<br>• Open the properties window for a tower by double tapping it. To close the window tap somewhere on the field.<br>• Strategy: Determines which enemy to target if there are multiple in range.<br>• Lock Target: If true the tower will not switch target until it is dead or out of range.<br>• Enhance: Increases the level of the tower making it better.<br>• Upgrade: Replaces the tower with a higher tier tower. Note that any enhancements of the tower are lost.<br>• Sell: Removes the tower. Refund decreases over time.<br>• Call in the next wave using the button in the upper right corner. If you call in the next wave while there are still enemies in the game you receive bonus credits.<br>• Make sure the enemies don&#39;t make it through the course!<br><br>This is an early release. It currently does not include:<br>• Save game state (progress is lost if Android decides to close the app)', 'summary': 'Anuto is yet another tower defense for Android.', 'summaryHTML': 'Anuto is yet another tower defense for Android.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.42, 'ratings': 390, 'reviews': 201, 'histogram': [15, 23, 23, 46, 280], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '6.0M', 'androidVersion': '4.2', 'androidVersionText': '4.2 and up', 'developer': 'LogixIsland.ch', 'developerId': 'LogixIsland.ch', 'developerEmail': 'relozid@logixisland.ch', 'developerWebsite': None, 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '7677972717424672521', 'genre': 'Strategy', 'genreId': 'GAME_STRATEGY', 'icon': 'https://lh3.googleusercontent.com/8gNMMPh3uI3JJKCgBsHe1T5yRaAI-zgX0jCaah84jCiWL_7NPSEumz_NWd7POmTSvQ', 'headerImage': 'https://lh3.googleusercontent.com/IMsAtPxFdNbjNqxsTXk950AhG3RA-GCzTvsuY099BDAHi2p8qs_n7JbAf0pfcTdC53GI', 'screenshots': ['https://lh3.googleusercontent.com/XlBLMi1pgXI00zz6N8wOMwo9tzujhCqKjEgAVO3rj7P1ZVkULvH6QVfJKZCX3Cru-cA', 'https://lh3.googleusercontent.com/qNtT_t9pyel0wjnQTjQulJIIMP0z-jV6W26SuA6rbuyuxqPMYMQIdbb84R8E6vEFr-0'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': 'Mild Fantasy Violence', 'adSupported': None, 'containsAds': None, 'released': 'Dec 6, 2015', 'updated': 1550316900, 'version': '0.5-1', 'recentChanges': '* New color theme\r\n* Some translations updated\r\n* Some balancing adjustments\r\n* Fix bug which caused crashes on loading a saved game', 'recentChangesHTML': '* New color theme<br>* Some translations updated<br>* Some balancing adjustments<br>* Fix bug which caused crashes on loading a saved game', 'comments': ["Fun and simple TD game. Btw Dev, there's someone trying to copy your game on the playstore. Same name, same thumbnail. Just search anuto and you'll see it.", 'Great to pass time, got too challenging for me to pass 700,000 pts on each map. Beside occasional crashes, the graphics were clean and simple. Could use more maps, turret options, or even different game modes in the future.', "Anuto TD is a free tower defense game that doesn't blast you with advertisements and doesn't ask for access to your camera / location / personal data. A miracle in this day and age! Its 'hand-drawn doodles on graph paper' art style is charming in its simplicity while still clearly differentiating between different tower / enemy types. A few improvements I would like to see would be a tower / enemy type glossary and a button on the main screen that shows tower levels without placing a new unit.", 'The logic of this game is a lot like the classic Tower Raiders games, some of the best "defense" style games ever put out for android. The graphics are fine in this game, but it\'s easier to play with the sound off because the samples get annoying eventually. My only gripe is since maxed out lasers are useless, why even have them as an option?', "minimalist yet complete TD gaming experience. Easy to start but difficulty grows quickly. A must for TD fans. One feature I'd be curious about is the high score of other players (even only the all-time high), just to see how I do in it. Even an order of magnitude would be good - like I reached 1M on some maps and even 2M on 2, with *lots* of tries, and I'd like to know how far off I am (not the best for sure but a rough idea would be welcome)", 'Nice tower defense but lack of glossary. Tower even had no name. Make it hard for beginners to know tower function. Like slow tower, dont even know it function except after buy and see what happen to mobs. And after evove it, we dont know what tower ir become. What we can see it suck and eat mobs 1by1. Wich look cool. With lots of mob it took eternity to realize it only teleport them for a distance and only once. Even if you lazy, putting name like teleport tower should be lots of help.', 'this game is boring. not enough towers and graphics are terrible. saying it\'s the "style" is just a lazy excuse for it. smoothen out the graphics, add colour, towers, enemies, maps, skill tree and towers should have milestones for upgrades. for example, at lvl 5 i should be able to choose between upgrades like +25% fire rate, +50% range and each upgrade should change how the towers look.', 'i loved this game but had to uninstall it from my samsung s8+ because the touch screen was off by a square when placing my pieces. this was quite annoying. i miss playing it but i still give it 5 stars regardless because it is that good!!!', 'Really fun game! Finally got to max out all the turrets, and wow they deal some damage. Thank you! Can change the maps and keep playing.', 'Simple to play, low memory consumption. But should have more mapa and a good tutorials and some random tips to score even higher', "Love it, was struggling to get past lvl 110 ISH but it sounds like most people can't get much further", 'Game is simple, clean tower defense fun. Definitely worth playing.', 'Realy cool game but the upgrades are so expensive.', 'Fantastic experience in this game I downloaded it like 2hours ago and already love it', 'Very fun. I recommend this.', 'Great little defense game', 'Only one map and its boring', 'lots of fun', 'was one of the funnest games i played in a while', 'Enemies should give more cash.', 'sayori is that you?', 'best td ever', 'Noice', 'good', 'LogixIsland: the balancing tweaks are great. Small changes in strategy make a big difference. When I fail, it feels like it could have been prevented, so I keep trying new approaches. Highest level so far is 119. Thanks for continuing on this.', 'I relly want to make this a 5 star but there is no game to game progression there are no upgrades outside of each game like making the towers cheeper or more lives i relly do how simple the design is tho', 'Game is good but how about an update some new maps some different towers', 'Addictive game', 'Great game!. Fun, bult well, simple yet I still get beat. Thank you for all your great work.', "I feel this game is centered around trying to edge out a slightly better score each time as opposed to seeing how long you can last, which is evident by fact that you can only upgrade 3 tiers for each weapon, some even less. The payouts are also really low in higher rounds which makes it difficult to keep up with the enemies. Like, I can go to round 40 and still not make enough to fully upgrade 6 different weapons, which makes it incredibly difficult to keep up. And at level 56 or something like that (one with stars only), it's literally impossible.", "Really enjoy the simplicity and the lack of ads. Don't need much more in TD. Would be nice to know how many waves remain though.", 'Great game. Very simple but still fun. Also no ads', 'Best no-nonsense tower defense game. (On par with Bloons). But I would like the ability save a game. It can be a little tediuos to begin with.. With a save-function we could jump directly to level 40 and try another strategy from there', 'Desafiador. Como um TD deve ser ;) Fica um pouco entediante depois do 65 e uma wave demora horas depois do 72. Mas balanceamentos virão, o potencial é bem grande.', 'Yet another programmer trying to prove that software can be faster than a human being. No need to prove it, yes, your game is frustratingly fast and frustratingly unfair for a human, you won. Likely to be very enjoyable for a bionic woman (or a man).', 'Up to level 55 the game is fun to play, after that it becomes extremely tedious. Needs balancing or stronger upgrades. Definitely worth playing.', 'Excellent tower defense with unique graphics and sound effects. Addictive, fun and challenging.', 'Love this game! Would love to some kind of "random open grid" map, if possible.', 'Best TD game but desperately needs pause and save!', 'Great game but wave 60 is impossible to play'], 'appId': 'ch.logixisland.anuto', 'url': 'https://play.google.com/store/apps/details?id=ch.logixisland.anuto&hl=en&gl=us'}
