{'title': 'SlimSocial for Facebook', 'description': "ATTENTION: This app may not be suitable for who use it frequently. \r\n\r\nWhy do I download SlimSocial for Facebook?\r\n- It is lightweight: it weighs less than 100 Kb;\r\n- It has simple, modern design: there is only what you need;\r\n- It is Open source: the code of this app is online on GitHub, anyone can verify the authenticity of the app and contribute to its development.\r\n- It is free and without ads;\r\n- it is not intrusive;\r\n- It respect your privacy: this app doesn't require special permits. Without consensus Facebook can not access to any data of your mobile phone;\r\n\r\n\r\nThe app is in full development, so still doesn't work:\r\n- Notifications;\r\n\r\nBecome a Fan on FB: https://www.facebook.com/SlimSocialProject\r\n\r\nLink to GitHub\r\nhttps://github.com/rignaneseleo/SlimSocial-for-Facebook\r\n\r\n***Take note that this is not an official app from Facebook***\r\nThis is a project which meant to make people life easier. This app will launch Facebook official website. All credit goes to Facebook team. It is provided free for all without any Ads.", 'descriptionHTML': 'ATTENTION: This app may not be suitable for who use it frequently. <br><br>Why do I download SlimSocial for Facebook?<br>- It is lightweight: it weighs less than 100 Kb;<br>- It has simple, modern design: there is only what you need;<br>- It is Open source: the code of this app is online on GitHub, anyone can verify the authenticity of the app and contribute to its development.<br>- It is free and without ads;<br>- it is not intrusive;<br>- It respect your privacy: this app doesn&#39;t require special permits. Without consensus Facebook can not access to any data of your mobile phone;<br><br><br>The app is in full development, so still doesn&#39;t work:<br>- Notifications;<br><br>Become a Fan on FB: https://www.facebook.com/SlimSocialProject<br><br>Link to GitHub<br>https://github.com/rignaneseleo/SlimSocial-for-Facebook<br><br>***Take note that this is not an official app from Facebook***<br>This is a project which meant to make people life easier. This app will launch Facebook official website. All credit goes to Facebook team. It is provided free for all without any Ads.', 'summary': 'The Facebook Experience in less than 100kb', 'summaryHTML': 'The Facebook Experience in less than 100kb', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.2191305, 'ratings': 5785, 'reviews': 2940, 'histogram': [412, 261, 563, 955, 3591], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '320k', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'Leonardo Rignanese', 'developerId': 'Leonardo+Rignanese', 'developerEmail': 'dev.rignaneseleo@gmail.com', 'developerWebsite': 'https://github.com/rignaneseleo/SlimSocial-for-Facebook', 'developerAddress': 'Via delle Lame 31, Bologna, Italy', 'privacyPolicy': 'https://raw.githubusercontent.com/rignaneseleo/SlimSocial-for-Facebook/master/Privacy.txt', 'developerInternalID': '8627677109647085155', 'genre': 'Social', 'genreId': 'SOCIAL', 'icon': 'https://lh3.googleusercontent.com/LBavTzyVHNvJLujHd7IBcTtAyh4hWBEIZOe7GDYd2KfVdZNbLKwguVfw2o7UJ73ovw', 'headerImage': 'https://lh3.googleusercontent.com/Ejct9BA0imBYIBD70Xrn0jvZhNpaKXRu-ObiBkbPGjlupIc5ubCu_bnuvFzjaP_Keg', 'screenshots': ['https://lh3.googleusercontent.com/6-2Z56rKssHSRhaXxUUtKHT84-EVm26Eh3IdrwrbckGDXWFbAW_kSckIPBwJx6yXABk', 'https://lh3.googleusercontent.com/c9fp_U0gpRctSWDoEuOdKAm_tiPjodOcJp_cBw6t1FjaWGqEHwL4CbniDJurqFQBZ7fM', 'https://lh3.googleusercontent.com/NtctJjSxqbVXrnm_hvOJlZh-oJ13dn1smjehFN_wmUErwamfnGIvrtE_n9o56m_YiA', 'https://lh3.googleusercontent.com/11fkd62JygeChcvAyrHjeZ80Cq_dMLqxFlsYqUqXytNpfWCS0ZEQSOYYfd1qrgF7kw', 'https://lh3.googleusercontent.com/jdB9mn6ZlHhJdZBoeQ371mzA0tixde-Pccc2IyjHPibNz_gd46mh-wS5xUgC-12DEEE', 'https://lh3.googleusercontent.com/iD0eOcA49cekvcOK7JmMIxXxfVuX-uuDHuH1uE_tk5FFgw-lBxniMCadIVTod_PtpCs'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 26, 2016', 'updated': 1549660886, 'version': '3.8.3', 'recentChanges': 'In the new version:\r\n- Updated translations (31 language supported!)\r\n- Bugfix\r\n\r\nFollow SlimSocial on Facebook!', 'recentChangesHTML': 'In the new version:<br>- Updated translations (31 language supported!)<br>- Bugfix<br><br>Follow SlimSocial on Facebook!', 'comments': ["'Message' button doesn't work for first time messaging.. it works only for person that I've sent messages before. Like: 1) ability to set newsfeed by most recent, 2) no noti sound/popup on noti bar whatsoever, hope there will be a on/off toggle when you finally fixed the noti problem. Dislike: More often than not, when I clicked on a post to read it and later pressed the 'back' button, it brought me not to the last point/post I clicked, but to the top of the page. I wish that it will be fixed.", "It's awesome. The only issue so far is that I can't see the search bar (to search for other facebook users). My phone is Huawei nova 5T.", 'Marketplace is virtually unusable. Backing out from looking at an item shoots me all the way out of Marketplace. Every time.', 'This does FaceBook, and does it so much better! Lets me choose how I browse and shows just the right amount of details.', "I'm really satisfied with this app. I'll mention only 3 bugs that I'd like to be fixed. First one is occurring using Marketplace: going back after seeing an item makes you come back to the news feed instead of the marketplace home page. Thus meaning starting again with the same search for seeing other results. Second one are the lack of calls and the display of messenger app in general, which don't allow you to do many things other than typing short messages. Long messages are in fact quite difficult to write since the really short space available to read your message while you're typing. Last but not the least: tagging other people using the @tag is really painful and it's not always working. It isn't possible to tag a person only using his name and it's not possible to tag pages. That's all. Keep up the good work!", "Good alternative to FB Lite. Could be improved if it allowed user to block the 'People you may know ' feature. But otherwise a great app.", 'Exactly as advertised, no permissions, tiny size, would give 5 stars except it has a few minor bugs. Lost a star because there\'s no reason "Share post now" shouldn\'t be on all shareable posts in my timeline.', 'The app is good on my phone, so far it gave me great experience surfing facebook. And here are the comments: - At first load, the app load quite slow and there are sponsored ad showed up, but after it fully loaded, sponsored ad went away --> one up vote. - When I clicked on external link, the app opened link with external broswer, however, when I returned to continue surfing or to share the link I liked,t the app returned to the top of New Feed, which is annoying since I have to acroll down again --> one down vote', 'I\'m down grading... it worked decently (for a mobile version) before, but with the latest update when i press back in the marketplace I just get a blank page and need to restart app.. and the "open in browser" button now forces a login, so that sucks. edit: down grading didnt work, so its changes facebook made to their mobile ui. what an awful company.', "Clear, clean-cut app for FB. As of right now, only takes up 17.09MB worth of space on my LG phone! My only suggestion would be that like 'Simple for FB;' this app offers a way to 'pin'/save FB-pages|profiles|and misc. links to a menu, for revisiting later ('coz that's a *Bitchin'* option that no other FB-apps offer right now). Lastly, the 'Save/Download Photo' option in this app is refreshingly simple! 👏", "It's fast and it have a clean interface! Thanks!! Just one thing, I can't expand the images.", "Works pretty well for the most part. Editing a post has a problem. I can't scroll in a post that is more than a few lines. I swipe down but the text won't move to get to the upper lines. I have use browser foxfire for edits. Hoping the developer sees this.", "Using for years, minor glitches but overall good UNTIL no longer able to tag??pls fix and I'm happy to rate 5!", "there is a issue with this app it is bugging me otherwise it was perfect for me....when i am replying to someone it doesn't show the persons name @----- and it bugs me when i am commenting sth with several people if this issue is fixed i will use this app full-time....", "works really well with my s7! I chose slim social as I was fed up with continual and non relevant adverts, and it doesn't make me look at my phone every 5 minutes.. I'm very happy with this app.", 'Need more improvement regarding faster access in uploaded & downloaded all files.', 'Now you can Now you can go delete messages instead of going to messenger & it should stay that way .really impressed with this app 😊', 'Very Impressive. Now make it smoother for showing pages. Also Add Text Copy feature. Text Copy is a very useful feature that enables to copy any text long presseing on facebook. I hope you will consider adding this feature.', 'Light and simple for user only check newsfeed! Thanks! Best choice for replace Facebook app.', 'I love this app just as good as facebook & messenger without all the added junk.', "Works well, but if I click show more friend list, I can't scroll up or down so I can't see all of it.", "Much lighter than facebook lite. When im searching for stuff the search bar is unaccessible. It's visible for half a second and then just hides behind the top bar", "Is good.. But can't click on 'see more' button anymore.", "Maybe it's even better that it does not have notifications, more healthy that way. Besides you can have this app and messenger lite, perfect combination.", "Best Facebook app. Light on resources, fast and stable. Can't ask for more. Thank you. Did I mentioned no add?? Yes zero Facebook ads!!", 'I feel much safer using this on my phone than the official app. My only complaint is the inability to copy text from posts.', "I've used it for quite a long time. it's worked more consistently well than any other FB app for me.", "Klanky! Once a comment is added it's hard to view the full image. Can't Zoom an image. No left and right swipe features", 'Improvement in speed is needed, otherwise Excellent app', 'Need more improvement regarding attachment of numbers image really big issue ? Please look out matter to attach 30 / 40 nos images/video upload at a time from directly gallery share option with faster upload file ?', 'works as intended, however an option to choose what facebook notifications to pop up in Android would make this a 5 star app!', 'Need more improvement regarding fastest process.', 'Pretty much mobile browser version of Facebook. No background services. Cannot watch or find love streams.', 'App stopped sharing pictures. UPDATE, no access to my Facebook photos. Where did they go?', 'great features, works great, relatively lightweight the best FB alternative ive found so far!', 'For me,this app a little bit slow than open Facebook in Chrome but i can play a video in this app.', 'Light version,fully functional,no ads,better quality pictures', 'Amazing it runs smoothly in my device, no ads ,good job', 'picture or photo can not zoom in. in FB apps, you can zoom in or download', 'No photo zoom - deal breaker for me. Really saved battery life compared to Facebook app though'], 'appId': 'it.rignanese.leo.slimfacebook', 'url': 'https://play.google.com/store/apps/details?id=it.rignanese.leo.slimfacebook&hl=en&gl=us'}
