{'title': 'ECoS Controller', 'description': 'ECoS Controller allow you to control your ESU-ECoS station from your smartphone.\r\n\r\n- Multi trains selection\r\n- 24 buttons\r\n- Speed control (volume button supported)\r\n- Reverse direction\r\n- Edit train name\r\n- Switching objects support\r\n- Protocol version 0.1, 0.2 and 0.3 supported', 'descriptionHTML': 'ECoS Controller allow you to control your ESU-ECoS station from your smartphone.<br><br>- Multi trains selection<br>- 24 buttons<br>- Speed control (volume button supported)<br>- Reverse direction<br>- Edit train name<br>- Switching objects support<br>- Protocol version 0.1, 0.2 and 0.3 supported', 'summary': 'ECoS Controller allow you to control your ESU-ECoS station from your smartphone.', 'summaryHTML': 'ECoS Controller allow you to control your ESU-ECoS station from your smartphone.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.45, 'ratings': 192, 'reviews': 89, 'histogram': [13, 3, 3, 32, 138], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Erkan Valentin', 'developerId': 'Erkan+Valentin', 'developerEmail': 'erkan2005@gmail.com', 'developerWebsite': 'http://rk4an.github.com/ecos-controller/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '4837809783816066074', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/QcshvInG2nZEleM85UQwut4-E1IDJ-I9gbfWatF9qmfVStI060ZFpW-EfVkBpfz-aQ', 'headerImage': 'https://lh3.googleusercontent.com/SfuaitJcVwe2bzuoZzdFHPh5NqSZuLKYMKU2nDARD8v74yUqedOA6YD9wpQYjqQRWw', 'screenshots': ['https://lh3.googleusercontent.com/eBlg1HaUqqQ5LgH7qfA4VtE8z9HTXHy1vHFASGjYy_12mi6xQZHaNuAQPqfp1YzoSiM', 'https://lh3.googleusercontent.com/sQSlKB620b7WHxT0i1rLoCMHdx7G3FYqGFEmK744EUPPWVXSMxdKkGqfQHNm-nrKwkib', 'https://lh3.googleusercontent.com/IdARAkWjyNCeIiawe4phVrYRSoLcJo1zCBEe78CVpoo4l7foRwg3BLCJHL7t7SSUfDn6', 'https://lh3.googleusercontent.com/N4RboOj14vzhj1pMYFPIrY_KMmywv9hTfyReqEcQcVGQLUmo833f0J2jFkt3B6WO9M8', 'https://lh3.googleusercontent.com/7A1eYDr7rRsWiyHG9BdUxtBznKvQGF7bVtuf3oD1__NR6MnX7IRYcvIszffpTcj38mAi'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Apr 21, 2012', 'updated': 1495282108, 'version': 'Varies with device', 'recentChanges': '- Sign with Google Play App Signing\r\n- Enable default ProGuard optimization', 'recentChangesHTML': '- Sign with Google Play App Signing<br>- Enable default ProGuard optimization', 'comments': ["Great app! Easy to configure with the ECoS command station, works great, NO lag. However it can only do 23 of the 28 DCC functions. Other than that it's fine throttle.", "I would like to update here I was having trouble  Connecting What it was is my ip address I had to go in the settings on the app And I check my esu cab control ip  Address And I had adjust my phone app ip... So it's working great now I would highly recommend this app", "Truely fantastic app, works really well with Piko SmartControl box, Wi-fi connection has to be made using WPS button on the SmartControl box, and via phone/tablet WPS settings, my IP address required changing in this app to 192.168.65.1 all then worked really well, only downside I found was that the internet connection is temporary lost while connected wirelessly to the SmartControl box, but I guess that this can't be helped as the SmartControl box is a Wi-fi device.", 'Works well with the Piko SmartBox', 'Worked beautifully on both tablet and phone. Well thought out interface, easy and simple to use.', 'It works well for the ecos', 'If you need to add wireless control access to your ecos via a smart phone then this app is for you. Works a treat on my LG G2, I can easily access train speed & sound decoder functions. Please do help support the writer of this great program', 'Works really well on smartphone would also like to see it on my Asus tablet', "I have been using it for the last two days and haven't had any issues. Would like to see a couple of features added to it.  Some of the suggestions I have would be the following:  1) When using the slider for speed control have it instantly update the speed as you slide the slider rather than have it jump to the speed where you let off of that slider at.  2) The ability to hold the volume up key like you can with the volume down key (useful for those that like to use 1 speed step per press of volume rocker)  3) Would love to see it default to function row F8 thru F11 being opened.  4)  Tapping areas to the left and right of the throttle slider above or below it kind of like Touchcab for IOS.", 'Great first step, control works great with my original ECoS running 3.7.0.  Only gripe is that throttle response is not instant to the ECoS, you cannot keep you finger on the throttle, it only registers when you let go.  Otherwise, thanks for doing this, and keep up the good work.  Looking forward to updates.', 'I have been waiting for this app! Perfect for large model train layouts as there is no need anymore to carry around the Ecos! Would love to see an upgrade with 2 simultaneous cabs and a graphic switch board (at leat for tablets)', 'Internet Connection Requirement---So Disappointing and Switch it to offline...', 'I love it but what if you used bachmann trains?', 'True2poore'], 'appId': 'com.ecos.train', 'url': 'https://play.google.com/store/apps/details?id=com.ecos.train&hl=en&gl=us'}
