{'title': 'Simple Keyboard', 'description': 'This keyboard is created for those who only need a keyboard and nothing more.\r\n\r\nTo enable the keyboard:\r\n* Open "Simple Keyboard" from your launcher\r\n* Enable the Simple Keyboard (default system warning will be shown)\r\n* Switch to Simple Keyboard from current Input Method (differs between keyboards, usually long-press space)\r\n* To edit Simple Keyboard settings long-press "," or open system Settings, Languages & Input, Simple Keyboard.\r\n* You can enable/disable all the input methods in Settings, Languages & Input, Manage Keyboards (differs between phones)\r\n\r\nFeatures:\r\n* Small size (<1MB)\r\n* Adjustable keyboard height for more screen space\r\n* Number row\r\n* Swipe space to move pointer\r\n* Delete swipe\r\n* Custom theme colors\r\n* Minimal permissions (only Vibrate)\r\n* Ads-free\r\n\r\nFeature it doesn\'t have and probably will never have:\r\n* Emojis\r\n* GIFs\r\n* Spell checker\r\n* Swipe typing\r\n\r\nApplication is open-source (link in the bottom of store page). Licensed under Apache License Version 2.', 'descriptionHTML': 'This keyboard is created for those who only need a keyboard and nothing more.<br><br>To enable the keyboard:<br>* Open &quot;Simple Keyboard&quot; from your launcher<br>* Enable the Simple Keyboard (default system warning will be shown)<br>* Switch to Simple Keyboard from current Input Method (differs between keyboards, usually long-press space)<br>* To edit Simple Keyboard settings long-press &quot;,&quot; or open system Settings, Languages &amp; Input, Simple Keyboard.<br>* You can enable/disable all the input methods in Settings, Languages &amp; Input, Manage Keyboards (differs between phones)<br><br>Features:<br>* Small size (&lt;1MB)<br>* Adjustable keyboard height for more screen space<br>* Number row<br>* Swipe space to move pointer<br>* Delete swipe<br>* Custom theme colors<br>* Minimal permissions (only Vibrate)<br>* Ads-free<br><br>Feature it doesn&#39;t have and probably will never have:<br>* Emojis<br>* GIFs<br>* Spell checker<br>* Swipe typing<br><br>Application is open-source (link in the bottom of store page). Licensed under Apache License Version 2.', 'summary': 'Minimalistic and lightweight keyboard', 'summaryHTML': 'Minimalistic and lightweight keyboard', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.334, 'ratings': 5067, 'reviews': 2900, 'histogram': [395, 162, 233, 841, 3435], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '844k', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'Raimondas Rimkus', 'developerId': 'Raimondas+Rimkus', 'developerEmail': 'narimantukas+playstore@gmail.com', 'developerWebsite': 'https://github.com/rkkr/simple-keyboard', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '9054675471192650235', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/q876i1NWKmS5HAosyarnTKvdJkQecGMh0bNg_hZrlh99m5mMNq3SqDCo00U3M83JbJE', 'headerImage': 'https://lh3.googleusercontent.com/VsHODMoerhTuJkSkqokKwxnyhfLfxrq6xTyRAvItz5FjSPr0BZzcEe5ldXy2tbLKJg', 'screenshots': ['https://lh3.googleusercontent.com/FJj1LonQV8itRslAmDO4uAJUZv4AdAYmiTFknBCVEV0OQfXzoMtBwDtPokJZDCoPxzuL', 'https://lh3.googleusercontent.com/x91l6sTpXSwCnVsmhEXH74DCcvOrgLZ5aE9vJG6f5iw1Hjoxnkn7f-7LdBi6Lnu64Qc', 'https://lh3.googleusercontent.com/VLOkKGwk66if9BDdijANexZkBY4W5bqbuPQ_jLAnoD7C9QJzhuKMLTfZ9YpNxK_dp84', 'https://lh3.googleusercontent.com/PYuIGzZnBjpA27a6vUUruUDtSZtUdXLpdVen9tV7dSAleEaCNI1yhETQcLxHJWTzxl9N', 'https://lh3.googleusercontent.com/K74o2Uo2KfKhjNLV_LOQYTvY_KR-nTXgR-uJx3ccArahHymF5PyckatWbz6DotrOzom-', 'https://lh3.googleusercontent.com/Yy1IHtWw_DA-_YbnJXqnWMW4BzWLx8_SQARoo-0LQcbUxmc7hOSnhGxwQCxrhm8PIjM', 'https://lh3.googleusercontent.com/ruu8tblKQytU2gj1V1YWNNaqLnjyAnoTyMezqcEQcbK0uKZCStCsrcZ_sm0RMpv0oQ', 'https://lh3.googleusercontent.com/RSA3a6wtCvDlUh0AmCf7rMPztDLdeoPMTojXXzOky_n8nDYSHTx6KJ9IYJ0jocov5Us', 'https://lh3.googleusercontent.com/lfmfkVLf7DiDMlhY6-g9gI1W4n5oyZWSDTdrnFWqEwmsQBE-t0YwTy1vbaHmDDQeqTM'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Apr 23, 2017', 'updated': 1591540923, 'version': '3.21', 'recentChanges': 'RTL cursor swipe', 'recentChangesHTML': 'RTL cursor swipe', 'comments': ["No useless features (autocorrect, suggestions, emoji) that consume UI space even when toggled off. No quirky behaviors that you can't address. Just a basic keyboard that works as expected, the layouts are correct. I would've liked a customizable upper row but it's fine as it is with numbers.", 'Not that this keyboard really needs auto correction given what it is going for but it really would be cool if it had some sort of correction. It works pretty well for my tablet because of the bigger screen but it is pretty difficult to type without auto correction on the smaller keys of a phone. I do like the stock theme though with my Galaxy Tab S6. Really easy to tell where I am putting my fingers down.', 'SOLVED: select some text by swiping on spacebar during text selected. Thanks for the tips dev :) No it become the best keyboard ever!!!', 'Perfect app! It delivers what it is! I hope this can continue and expand into something more complex.', "If it's possible to add arrows option (up,down) that would be perfect, but beside that it's amazing keyboard.Thanks!", "Like the features but they keep bugging out. Newest update makes it so spacebar nav and backspace hold and drag just don't work sometimes", 'Vertical spacing between buttons is not the same with horizontal spacing.', "Does what it says on the box. Hope you'll never add keystroke tracking and data selling. Thanks", "It has red underline everytime i type, it doesnt have any auto correction features so i can't remove it, and then when i switch back to google keyboard and set the auto correction to on and off, it's gone, and then when i switch it back to this keyboard, the redunderline is back again, please reply to me how to fix this, i'm willing to set my review to 5 star again. After all the keyboard i saw here at playstore this one really stood up, i really like this app, very light, efficient and no ads.", "AMAZING! Just a keyboard, not more than that. Please keep it this way and just add more useful and meaningful features. It's fast, simple and lightweight. Highly recommend to download (I actually typed this review using this keyboard)", 'Update (4.15.20) I went back to BlackBerry keyboard. I could not get used to Simple Keyboards layout. So four stars because it is good, but not for me. Great keyboard! I left BlackBerry keyboard for this. I can still use emoticons through my texting app (Textra). Many thanks to the dev. [ I would love it if you could choose to have a BlackBerry style keyboard option. ]', "Best one I used till now. Light weight, and fast. I'm used to type with punctuation marks, but, I'm not complaining. Overall, recommended. Hope this has privacy space, and doesn't store my typing data.", "Splendid keyboard. Simple but does everything I need and can reduce keyboard height. No ads, trackers feeding the fb/google monster. For those wanting emojis, gifs, bells, whistles and stuff please note the clue is in the title. It's great because its simple, clean, lightweight, few permissions. Please keep it that way, dev.", 'It needs to improve word prediction both in English and Spanish, so it could be a top app. Also it has to improve the look and feeling of the app, improving the interface.', '(TLDR: Buggy & pretentious. Looking for just a keyboard? Look elsewhere! ) In more recent updates has become far too buggy to use, sometimes the backspace does not work whatsoever for example, this is not limited to any one app and only happens during use of this keyboard app to type. Also, this is far from a "simple" keyboard anymore, I got this because the description mentioned it did not have all the usual so called modern "features" which piss me off, oh but it DOES have those!', "Great, simple keyboard. Highly recommended if you prefer the simplicity and privacy. Swipe-style would be a nice addition, but if it would be a conflict of the internet access and/or privacy that this app supplies, I'm just as happy without it.", "Wasted space between keys. Tiny accents on keys. Number row is squashed. While I understand why there is no prediction or swiping, it sucks how there isn't basic spell-checking.", 'This just what i needed, Gboard sucks so hard. Simple is what it makes the best, no stupid emoji button anymore near the space bar. You guys do a great work, much thanks.', 'Decent keyboard but have bugs. Vibration not always vibrates, skips sometimes. Popups of keypress way too big, hides many keys so confuses writting. In landscape mode not full width. I guess its good for low budged, slow phones.', 'Essential for lightweight hardware like Go and even helps on 2gb hardware - stock GBoard is so bloated it is now bigger than many apps, and it is a resource hog as well, noticeably slowing down my hardware. Simple Keyboard takes almost no disk space, RAM, or processor cycles. I too would like a Tab key, for Google Docs formatting compatibility with desktop.', "For me this is the best keyb. and here's why: Is really lightweigth , it means that is fast and im making less mistakes on it. Its have Swipe space to move the pointer, this means that even if i make mistake i can correct it easy. It have Delete swipe , for deleting the whole text. Turn off the the Hide the special characters on the keyb. and set the Key long press delay to 190, you can use the special characters or numbers without switch. + is OPEN SOURCE 10x Alot for this app!", "Finally a keyboard app that isn't shoving emojis, stickers and gifs in my face all the time, and with no inconveniently placed non-removable emoji menu shortcuts all over the keyboard. You literally deserve 5 stars for just that. Thank you. Absolutely no unnecessary features at all. Incredibly minimalistic in appearance, functionality and actual app size. The only thing I miss is a suggestion bar , which I assume will never be implemented.", "Excellent straightforward keyboard. Wanted something for my 80-something Mum which didn't confuse with emojis, auto-correct etc. This is perfect. (Would happily have paid for something like this.)", 'Its an excellent app that does everything it claims. I like not having to worry what my keyboard is sending to google. However i do wish it included capitalization of i and and automatic punctuation on contractions. Ive intentionally left them out in this review as an example of what youll get without extra effort. Those are the only things im really missing but otherwise its exactly what i was looking for.', "Simple, open source, private. I don't get why it took so long for me to find something like this. Just wish there were emojis, gestures, Japanese, and suggestions. Also stuff like setting backgrounds for the keyboard. GBoard basically but private.", "Awesome little app, Just one small hiccup, when I set a chat app to 'send on enter' the enter button on the keyboard will be 'invisible'. The placeholder will be there and it's pressable as expected. But the icons doesn't show. Otherwise, loving it!", "simple beautiful and gets the job done thank you devs woud've been 5 stars if there were emojis and dictionnaries :/ bug: special characters do not show up when you change to languages other than the system default.", 'Nice and simplistic. Wouldnt mind an auto-correct feature but otherwise its pretty nice to use and no tracking is nice too.', "Best no nonsense keyboard! Does what it should, without forcing other non optional things on you. Bonus is it's actually fairly intuitive.", 'Awesome keyboard! Extremely comfortable features with "Space" and "Delete" buttons. Design is like: "Simplicity with style". The only thing I\'d wished for is more customizable buttons themself: fonts, fonts\' color, border coloring.', "Is it possible to add emojis to this keyboard via a mod or dev update??? This is so important to me, and your keyboard is the only one I can find that works perfectly with really dense LCD density / custom width. Custom height specifically is what makes this perfect. It's the last one that truly works, and the swipe spacebar / delete sensitivity is PERFECT (gboard is such a pain because it deletes per word rather than character, and swipe cursor is so jittery and unreliable). Thanks", 'Yeah, finally simple keyboard! Robust, easy to configure, has only the most needed options.', 'After one week of use, I REALLY like this app. Google logo showed up on my space bar one day. That was enough motivation for me. This keyboard has everything I need, meaning: just the basics. Well done.', 'Although customize screen shows dark font on light background, app only allows white font, which is unreadable on a customized light background.', 'Near perfect. It would be the best keyboard if there is emoji support added.', 'Is just the keyboard, no internet access and receive data from internet permissions needed. Please, never change it.', "Reinstalled 5 times and still have the same keyboard is had before unbelievable, I am so mad, I've been trying to find the right keyboard for me. But this has to mess it up. Annoying. And disappointing 😣😣 ☹️☹️🙁😑😑😑🙁 I did enable it and switched it, I still had the same keyboard before. I did what you asked me it still showed me the keyboard before 😒😑", 'This is just what I needed,the spacebar moved to the right.Im on tablet and when typing fast,I would always hit the period instead of space.', "A no-nonsense keyboard without emojis, autocorrect or anything flashy that might use too much ram. Simple and functional. I can't thank the developers enough!", 'Just what i was looking for. No ads no suggestions no tracking. Clean interface. Thumbs up to dev.'], 'appId': 'rkr.simplekeyboard.inputmethod', 'url': 'https://play.google.com/store/apps/details?id=rkr.simplekeyboard.inputmethod&hl=en&gl=us'}
