{'title': 'Adblock Fast', 'description': 'You can now block ads without rooting your device or switching to another browser<i>!</i>\r\n\r\n\r\n\r\nAdblock Fast runs an optimized filtering ruleset to accelerate webpages more but consume less disk space, CPU cycles, and memory than other ad blockers do. Also unlike other ad blockers, Adblock Fast doesn’t allow “acceptable ads” and never will.\r\n\r\n\r\n<b>The app requires and blocks ads in Samsung Internet 4.0 and up (not in other apps). After installing, follow the in-app instructions to turn ad blocking on.</b>\r\n\r\nAdblock Fast is free to use and the source code, free to modify: https://github.com/rocketshipapps/adblockfast\r\n\r\nWe use a public content-blocking API provided by Samsung Internet: http://developer.samsung.com/technical-doc/view.do?v=T000000278L\r\n\r\nIf you have any questions or comments, follow and message us:\r\n\r\n• https://www.facebook.com/adblockfast\r\n• https://www.instagram.com/adblockfast/\r\n• https://twitter.com/adblockfast', 'descriptionHTML': 'You can now block ads without rooting your device or switching to another browser<i>!</i><br><br><br><br>Adblock Fast runs an optimized filtering ruleset to accelerate webpages more but consume less disk space, CPU cycles, and memory than other ad blockers do. Also unlike other ad blockers, Adblock Fast doesn’t allow “acceptable ads” and never will.<br><br><br><b>The app requires and blocks ads in Samsung Internet 4.0 and up (not in other apps). After installing, follow the in-app instructions to turn ad blocking on.</b><br><br>Adblock Fast is free to use and the source code, free to modify: https://github.com/rocketshipapps/adblockfast<br><br>We use a public content-blocking API provided by Samsung Internet: http://developer.samsung.com/technical-doc/view.do?v=T000000278L<br><br>If you have any questions or comments, follow and message us:<br><br>• https://www.facebook.com/adblockfast<br>• https://www.instagram.com/adblockfast/<br>• https://twitter.com/adblockfast', 'summary': 'Adblock Fast is a free, open-source ad blocker for Samsung Internet 4.0 and up!', 'summaryHTML': 'Adblock Fast is a free, open-source ad blocker for Samsung Internet 4.0 and up!', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 3.931058, 'ratings': 14840, 'reviews': 4870, 'histogram': [2522, 607, 1175, 1600, 8934], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.9M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Rocketship Apps', 'developerId': '8343316247406921855', 'developerEmail': 'help@adblockfast.com', 'developerWebsite': 'http://adblockfast.com/', 'developerAddress': 'Rocketship\nPO Box 702\nPalo Alto, California 94301', 'privacyPolicy': 'https://www.iubenda.com/privacy-policy/216992', 'developerInternalID': '8343316247406921855', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/YdlLZPvHsZ_uhTFqPVZvqUqY6g26-MWhUTskm8joR9YcCGtekKNddTXou_50c7AF7iE', 'headerImage': 'https://lh3.googleusercontent.com/FUfOd0RdtSrdyFy2EL4rLtU3H-p7m20-9q_u5KLzlAyiML-6zMStJpg_8fSHuVq5xg', 'screenshots': ['https://lh3.googleusercontent.com/ZUxapcuIkeQ2PZXLuUzc30CgWqk5doDzdEVl9x037RVJmml1w44r5S2Kwmg8f1XMUdY', 'https://lh3.googleusercontent.com/mQV0zcBCOCGnU3ofttFZegaParUH-AkNJ557CF4GUUHUb-wz23mjyL86pjNGZRDTnAc', 'https://lh3.googleusercontent.com/5yzLO7zMnm5yL8tr2TEU0LRzWmud6GMmU7hNiB2z3K7HsQ6U_tlscEJLyHUiOFv0Zg'], 'video': 'https://www.youtube.com/embed/zvLKGxwmGxo?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/zvLKGxwmGxo/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 11, 2016', 'updated': 1536094782, 'version': '2.0.0', 'recentChanges': 'Implemented new Samsung Internet\xa05.4 features (increased device compatibility, improved app discoverability), updated onboarding, updated ad\xa0blocking. See https://log.rocketshipapps.com/adblock-fast-2-0-for-android-a7a7945ba649 for details.', 'recentChangesHTML': 'Implemented new Samsung Internet\xa05.4 features (increased device compatibility, improved app discoverability), updated onboarding, updated ad\xa0blocking. See https://log.rocketshipapps.com/adblock-fast-2-0-for-android-a7a7945ba649 for details.', 'comments': ["Ok, fast, easy app, it works so-so. Doesn't block the IN-APP ADS like online newspaper ads! Doesn't eat too much of my expensive UK DATA at just 1mb for 2-3 uses! Simple app and fun, nice layout Deleted, I try new ad-block apps every so often! UK review", 'Brilliant app to have on your phone i have seen big changes since putting this app on my phone i am not bombarded with ads all the time the Adblock works superb.', 'Stops The Ad coming through onto your screen, but for I millisecond whatever you are doing freezes. Much rather have that than have to go through what I had with constant ads popping up.', 'Definitely works for me. As soon as I installed it, it blocked all [eight] ads on my current web page.', 'The app doesnt block specific ads which appears on mostly +18 content sites. Dev(s) pls fix.', "There's still a pop-up ads showing and sometimes it opens on play store.", "Don't see a difference. Still getting lots of pop up ads in my browser.", 'Redirects you to install Samsung network to use this app! Very dodgy do not click!', 'This is the absolute best As Blocker ever it does everything it says in the description and more. It so nice to on the web browser of my choice and no ads popping up every where 🌝 Thank you a million times over too Adblock Fast Company for making this app happen', 'Good I thought, no ads until a Verizon associate uninstalled it saying that and others were causing app crashes, now all kinds of spam ads, misleading, from Samsung internet. Result, my Pandora still crashing.', 'Was going to try this app all letters came on RED ON MY CELL PHONE I THINK THEY BLOCK THEM TOO TRY SO MANY TIMES DONT WORK THANKS adblock fast 2020', "I was getting ads for a while then I just updated my phone and now i'm getting more ads. I decided to look for a ad blocker and guess what I found? I already had this ad blocker on my phone! So I go into the ad blockers app to see if it's active and yes it is. As I wrote this review I have 5 ads pop up! SMH!!!", 'I like the fact the program is "on the job" by keeping at bay annoying, cluttering ads. Also, I enjoy the "history" function that enables me to go directly to a favored site. Finally, it does not hurt when it "toots its own horn" by informing the user of how many ads were blocked on the previous page. Keep up the good work !', 'Omg this works because I haven\'t heard it, it was an inappropriate ad and it has sounds it just pops up out of nowhere saying "do not play this game when you\'re under 18" loudly and plays dramatic music, thank you. If you don\'t know, this only works in samsung internet, the ad I recieved is from samsung internet and not only that google too.', "I've used Rocketship Apps on previous Devices (Tablets & Fones) And they've Always met the High Expectations of a Silicon ½ A State soon ! Company. With Adblock, it's a 110% Defense, which is so good it only needs to use 95% to Beat the rest! But..... You Still get the Added Benefit of another 15% to Protect you, even More than usin' a Trojan, as Well as usin' a Durex ! So, having supplied my Daily Dose of Rubber in a Comment, take an Ol' Guy's Advice & Use Everything I said - No Virus is Fun!", 'Adblock Fast is a free, open-source ad blocker for Samsung Internet 4.0 and up!me can now block ads without rooting your device or switching to another browser!Adblock Fast runs an optimized filtering ruleset to accelerate webpages more but consume less disk space, CPU cycles, and memory than other ad blockers do. Also unlike other ad blockers, Adblock Fast doesn’t allow “acceptable ads” and never will.The app requires and blocks ads in SamsungInternet 4.0 and up (not in other apps)more optional', "I would love to actually rate the app fairly BUT I can't figure out how to get it to work. It shows it is installed on this Samsung Galaxy 8+ Android but I guess I  am too dumb to figure it out. I know that the ads are still coming as frequently as before. If anyone knows what I should do, please tell me.", "This thing is almost perfect. Most of the bad reviews are from people who don't know how it works. Only difficulty I'm having is that certain thumbnails, or toes of videos just don't load. Not really a big problem. As it is incredibly rare, and the video can usually be found elsewhere.", "You should visit ( BrowserGood. Com ) to install the best browser app for android. It's Adblock and FAST real. I have a constant ad popping up on my phone that I can't get rid of.Thought this would work,but it just made it worse and didn't block anything!A waste of time", 'This is fake, ads still pop up even when the circle is there so this is faaaake', "So far your app does not work I get ads on my phone every two minutes I can't even listen to one song without being interrupted by ads so no your app is not working as of yet I really hope it starts working because this is so annoying but if it does and we say when it does I will let you know thank you", "installed it, imediately got two ads in arow. uninstalled it. These ads have to be tamped down. It's as bad as saturday movies in old days you get ouple of minutes of product separated endless commercials. this program is an empty program it does nothing.", 'I had ths app for a year or two.I rarely used the app & had no issurs until recently.Then I downloadef a fb messenger app & it gave me pop up ads too.I tried this app to seek and block.It found two issues but,could not accrss to remove them and it kept scanning.Could not gain control after several restarts so had to uninstall.If this issue exist,it be great if there was a patch.Otherwisr,I will not reinstall it again.It would be great if you can get security issue reports vis email or other.', 'Very good but missing some pop up ads why ?', 'It works on browsers but not on games rip.', "thank you thank you. the ads stopped appearing on the screen and now its good and trusty worthy and thank God I found this app from a YouTuber and if this doesn't work on y'all, well it's only for samsung so yeah thanks", "Requires Samsung Internet Browser to be updated. I don't use this browser. 1 star.", 'i didnt use it long because on my moto e4 it loaded half the pagees with java as black blotchs the videos arent ads... the ads are a seperate link/url added or embedded learn to code then would have a worthwhile review was a quick deny first day using it... not even worth 1 star but bottom rating for poor filter coding does job well if you dont care about what it filters...it has no available options so its a useless imo no options or settings to toggle ublock origin better than this garbage', 'Very worst app no any ad blocked by it.I waste my time and data to install it', 'The app is useless...i got ads right after installation while it says they bloked....useless..', 'Its is the best ad blocker i used very useful', "Good but could be better. Blocks all ads on Samsung browser. But wish I could white list some sites as it's a pain having to switch it off and on again to view some news sites.", 'It\'s sad how unbelievably horrible people can be with basic reading comprehension. This app is solely for Samsung\'s internet browser, like it says IN THE GODDAMN DESCRIPTION. YOU DON\'T EVEN NEED TO HIT READ MORE; IT SAYS "FOR SAMSUNG INTERNET" RIGHT THERE. That aside, this actually is a really good app. Should have higher than a 4.1 rating, but literacy is for plebs amirite -_-', 'Good experience ads consume data if not blocked.', 'Omg this works!!!! I think if your looking for an app to get rid of ads i would recommend you use this app it works!!!!!! 5 star for sure. Edit:why am I getting ads??? this sucks 1 star', 'junk does absolutley nothing still get every single thing i got before and does not prevent annoying videos on the webpages from just starting on their own and turning my music off which was the sole purpose of installing it', 'All the comments with positive word are from IT cells purchased by this application itself.😄😜 As i guess.', 'I like it...Easy ON....Easy OFF. With just (1) Tap.', "I have a constant ad popping up on my phone that I can't get rid of.Thought this would work,but it just made it worse and didn't block anything!A waste of time!!!!", "took a while to realise I've to change settings in app to block advertising. but once done it works really well. am very grateful to you Adblock Fast."], 'appId': 'com.rocketshipapps.adblockfast', 'url': 'https://play.google.com/store/apps/details?id=com.rocketshipapps.adblockfast&hl=en&gl=us'}
