{'title': 'Always On AMOLED', 'description': 'The original and best always on display for everyone\r\nGet an always on display for your phone or tablet.\r\nKeep your screen on all the time.\r\nAn always on display for every device!\r\n\r\nThe idea is to provide users with information about, time, date, notifications and more and all without having to touch the phone. Just by looking at it.\r\n\r\nThis is made possible thanks to AMOLED displays. Most of the screen stays black except for a few pixels.\r\n\r\n★Notable features\r\n• Always On Screen\r\n• Notifications - view notifications without touching your device\r\n• New: Now featuring raise to wake!\r\n• New: Backgrounds and wallpapers!\r\n• New: Edge glow for new notifications!\r\n• New: Quick note taking! Quickly scribble or write from the always on display\r\n• Music - control your music quickly and easily!\r\n• Automatic rules - preserve battery using predefined rules\r\n• Auto movement - avoid AMOLED burn-in\r\n• Auto night mode - dim the screen automatically in dark environment\r\n• View the weather at a glimpse\r\n• Pocket mode - lock the device when you leave it in your pocket to save battery\r\n• Custom watch faces - Digital S7 style, Classic 24H, Analog S7 style, Analog Pebble style and more!\r\n• Always On Memo - write a reminder and make it show up on your screen all the time!\r\n• Double tap to wake + Swipe up to wake + Volume keys to wake + Back button to wake\r\n• Force orientation - set your preferred screen orientation\r\n• Customization - Tons of customization options, fonts, clock styles and much more! \r\n• Can be used as a night clock\r\n• Tasker integration - Start/Stop the always on display, granting you infinite possibilities!\r\n• Greenify integration - start Greenify automatically when locking the screen to save battery\r\n• Force doze - activate doze when the screen is in the always on state\r\n• So much more!\r\n\r\n\r\nPermissions\r\n<b>Camera permission</b>\r\nThe app needs camera permission to toggle the flashlight\r\n<b>Phone permission</b>\r\nThe app needs phone permission to recognize incoming calls, dismiss the always on screen and show the incoming call screen.\r\n<b>Modify system settings permission</b>\r\nThe app needs permission to modify system settings to change the brightness of the lock screen.\r\n\r\n** Note: For Xiaomi devices you will need to access the Security App -> Permissions -> Permissions -> Always On AMOLED -> Display pop-up window permission and Show on Lock screen.', 'descriptionHTML': 'The original and best always on display for everyone<br>Get an always on display for your phone or tablet.<br>Keep your screen on all the time.<br>An always on display for every device!<br><br>The idea is to provide users with information about, time, date, notifications and more and all without having to touch the phone. Just by looking at it.<br><br>This is made possible thanks to AMOLED displays. Most of the screen stays black except for a few pixels.<br><br>★Notable features<br>• Always On Screen<br>• Notifications - view notifications without touching your device<br>• New: Now featuring raise to wake!<br>• New: Backgrounds and wallpapers!<br>• New: Edge glow for new notifications!<br>• New: Quick note taking! Quickly scribble or write from the always on display<br>• Music - control your music quickly and easily!<br>• Automatic rules - preserve battery using predefined rules<br>• Auto movement - avoid AMOLED burn-in<br>• Auto night mode - dim the screen automatically in dark environment<br>• View the weather at a glimpse<br>• Pocket mode - lock the device when you leave it in your pocket to save battery<br>• Custom watch faces - Digital S7 style, Classic 24H, Analog S7 style, Analog Pebble style and more!<br>• Always On Memo - write a reminder and make it show up on your screen all the time!<br>• Double tap to wake + Swipe up to wake + Volume keys to wake + Back button to wake<br>• Force orientation - set your preferred screen orientation<br>• Customization - Tons of customization options, fonts, clock styles and much more! <br>• Can be used as a night clock<br>• Tasker integration - Start/Stop the always on display, granting you infinite possibilities!<br>• Greenify integration - start Greenify automatically when locking the screen to save battery<br>• Force doze - activate doze when the screen is in the always on state<br>• So much more!<br><br><br>Permissions<br><b>Camera permission</b><br>The app needs camera permission to toggle the flashlight<br><b>Phone permission</b><br>The app needs phone permission to recognize incoming calls, dismiss the always on screen and show the incoming call screen.<br><b>Modify system settings permission</b><br>The app needs permission to modify system settings to change the brightness of the lock screen.<br><br>** Note: For Xiaomi devices you will need to access the Security App -&gt; Permissions -&gt; Permissions -&gt; Always On AMOLED -&gt; Display pop-up window permission and Show on Lock screen.', 'summary': 'Get an always on display on your device!', 'summaryHTML': 'Get an always on display on your device!', 'installs': '10,000,000+', 'minInstalls': 10000000, 'score': 4.165457, 'ratings': 112280, 'reviews': 45970, 'histogram': [12931, 4075, 7437, 14874, 72961], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '8.1M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'Tomer Rosenfeld', 'developerId': '7598296379323058380', 'developerEmail': 'mail@tomerrosenfeld.com', 'developerWebsite': 'http://tomerrosenfeld.com/AlwaysOnAMOLED/', 'developerAddress': '15 Olei Hagardom, Tel Aviv', 'privacyPolicy': 'http://tomerrosenfeld.com/AlwaysOnAMOLED/privacypolicy.htm', 'developerInternalID': '7598296379323058380', 'genre': 'Personalization', 'genreId': 'PERSONALIZATION', 'icon': 'https://lh3.googleusercontent.com/isj-hzZSIF9Cvyroa9adJOLw_QKR6v45IqzXa7LkkNcAakUa71u3ygS_ps5feasnng', 'headerImage': 'https://lh3.googleusercontent.com/11wXGeQZClRwZXOP8OBR1-TwEoptTaf8P7e_T-LuUTab7bfFsf5y8S_chUvet9cVeI9w', 'screenshots': ['https://lh3.googleusercontent.com/kPc47H5EZsncAcURmMXlvqVlP4fFOaMxPeS3Z-bgIVALEy5ru2MGONs1snkYdNBDUec', 'https://lh3.googleusercontent.com/V4JVktNmJyk3_U5PYs-TUV_e4xbSy8_ziDDBZUmk3BkwOXgxNTVA_eGCfm8H_vt33NQ', 'https://lh3.googleusercontent.com/UYdkOOxVZZoOWxPyk08r4StU8cEHt7f6XGA-D-p1i3ZDzN-4zSKBZtAMFMQxHFKMOA', 'https://lh3.googleusercontent.com/9ahxytf2C57vj6VpSH3NXysqwB-vbPCBWcFS-c-0rmXbGhXw_S7iytrvrSSw3vHR68Lm', 'https://lh3.googleusercontent.com/eBU7t-U7-U0W9o3j1MH-00QzJ9loRaY5_m0F5ovRmRu_ODKUITIgAxU1G01cjzD8hcyW', 'https://lh3.googleusercontent.com/IYhis_--JsLZMmr8aeHMafzlRUPx8byiC_esv8b90nZyiUaHqB6GWUniOTlDfyVNnQ', 'https://lh3.googleusercontent.com/Q22uDcu00iN-iaoUDHk1ChuONBAVi08b7zPDqQCRCWCXfxlHutAMIBaY2in0YzDw0ZN-', 'https://lh3.googleusercontent.com/gG7DCNHInphtLywzhRsnqpmXtJoybJNfnfBuFgV0zulRXMwGSh7OjjgoSK90e64mSYE', 'https://lh3.googleusercontent.com/E-fv7606k0F2nrNS-8X55PVtt2uSAzHz4_4_FhpYAWVOHXs5LGvXj7BlwvpqzwbWjyo', 'https://lh3.googleusercontent.com/mjUka7TKPGwHJPrCSi2sJYZrJEQcehesycO6zuPsO0bVbp6UPCtS0xpEVU2R7dyLJJgd', 'https://lh3.googleusercontent.com/77oxDLJLGDd2NBLLkWWUNEgaHhIY34PihXrkZ33KXcLUq9bazWWbJ7Lpba66KwsJt2w', 'https://lh3.googleusercontent.com/ScXOCxu1c1RnZoeMnN-lJQ2zXoqVNKBu2IRP9GEQXv6ayf5VdgFBZ_x2xsq3y2FXqg', 'https://lh3.googleusercontent.com/WRdkWBhBpYJUdIIcj2Xg4nRqxKHxjuRPCHgBgEIkX5YvL_6yLKvAEsWqHlla9FTMT-A', 'https://lh3.googleusercontent.com/DENL6udUZl_Z2-6o8tnGG0oWzUs4bMpgNi_0kCYq0Hx_TnReE75MnWQ7hX5vJVutjV4', 'https://lh3.googleusercontent.com/OLu0avld_AL3YkQPbSIfX3r1WknyT3rA87NzhKvfXzZWF7pMD8Cz_D6RL7jaqe8CffY', 'https://lh3.googleusercontent.com/YNofPAYlkzA6kUyAe_YTcX3iBxyJ_yaigyXVNqVOwi2cXTWzjG6ehtTAec2Ef5InfOE', 'https://lh3.googleusercontent.com/ZlvlWyePT76g-n9DLAMhsa9IJdwWty4MiLTrOwMEmRIrbFvwWuA8dc3OS1NpFp5O-VM', 'https://lh3.googleusercontent.com/O2mIvYlgAYVBuyT0Ci4aKZzO4xMBxZRFGQNC0ujeHvgOEt9oHNL_uF_yiz5msErk_Q', 'https://lh3.googleusercontent.com/W-bUCra5W2lbGxyQQwz_awaIzGce93AuKdHWG2lgMDd0rhNvfyytHOKKDdSN2EQcdA', 'https://lh3.googleusercontent.com/wniTZBVlAckFD7tc_k_jgJ1BQIWIcerze5CFHfiT-uSCMPhLTqCRDZQIqlnKyqD71NU', 'https://lh3.googleusercontent.com/5xt1hDsp0fm1Fpx1tyJbXKA1dN3uG-QdFB6CGd0jw1X8aOh754WbkYNF6kQJvdKrDMs', 'https://lh3.googleusercontent.com/1nsszQ1Hz7D90mszzGdeyTJBrXHWMOw914PgkY9NCaUKmhK1DuFjj-UIWBOXuvfxYQ', 'https://lh3.googleusercontent.com/kXVHw3Nn1_OD2-0ErKPx1j10l8frNGLVEoQXFQZYiSqzy0cXdQ4bKH7PwlOgsaBXF74'], 'video': 'https://www.youtube.com/embed/qHKPkUFIeBQ?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/qHKPkUFIeBQ/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': True, 'containsAds': True, 'released': 'Jun 9, 2016', 'updated': 1585160833, 'version': 'v1.4', 'recentChanges': '☆☆☆☆☆☆\r\nNew Feature:\r\nAdded Notifications Blacklist feature, now you can disable notifications from selected apps!\r\n☆☆☆☆☆☆', 'recentChangesHTML': '☆☆☆☆☆☆<br>New Feature:<br>Added Notifications Blacklist feature, now you can disable notifications from selected apps!<br>☆☆☆☆☆☆', 'comments': ['1 STAR LESS because it doesn\'t have option for AUTO ADAPTIVE BRIGHTNESS ( no matter sensor uses more battery ). 2 STAR LESS because too many options in the app ( too many is too confusing ). Rest it\'s a better app for ALWAYS ON DISPLAY than others in PLAY STORE. MATE you add " AUTO ADAPTIVE BRIGHTNESS " option in the app and I\'ll buy ads free version. Thanks for reading my review.', "It certainly deserves more star ratings but for now I am rating it 3 because the app is a great start and quite helpful for people whose phones don't have Ambient Display, but it needs a bit more improvement. I use it as an Ambient Display and not the Always On way, so for me the Raise to Wake feature doesn't work quite well. It's always a hit or miss thing. Tried tweaking sensitivity but no help. When the device gets locked it takes a huge time to get activated. Double tap to wake doesn't work", 'Almost perfect, my phones screen has trouble turning on, so I\'ve quit turning the screen off, with this app I use the "play" button inside the app and leave it black until I need to use the phone, however, this also means I can\'t lock my phone. I have 3 suggestions, 1 A widget which goes straight to the dark/watch screen, without opening the app, 2 preventing screen rotation to turn on the screen, only allowing the taps/swipes, 3 An optional independent lock screen that prompts after "waking."', 'Application deserve 5 star rattling but after a priod of use. well well... after installation and uninstalled many poor Application. i find this Application as night clock. and its pretty good and friendly use. i will give five star afer some days of inuse.', "Tried it and have now un-installed it because for me unlike others I've tried it doesn't work automatically when you turn the phone to standby, you have to go into the app and physically do it. Also I sent myself an email from my tablet and the screen did nothing,", "Excellent. This is exactly what I was looking for long time and works perfectly on my Nokia 8. But it does drain a battery other than it's superb.Thanks a lot.", 'Upon placing my finger on the FP sensor it does not dismiss the AOD screen after it unlocks with the phone saying "Phone Unlocked With Fingerprint" in a white message above the screen. Samsung Galaxy A20', 'Best experience i used app in 5 min i will gave you 5 starts my phone is samsung a30s and there is no AOD app. So this is the best application for samsung mobile. Thank you a lot i will purshase pro. It looks like original AOD', "does what it's supposed to...with a few added features. definitely a winner & and worth the small upgrade fee.", 'This app works perfect on my HUAWEI and Sony phone. The first time I enabled this app it went something wrong but after reinstallation it works. Such a great app!', 'Fantastic app nice and bright and can choose what you want', 'The app works great on my Google pixel 4. No problems.', 'not so user-friendly UI. but it works smooothly! loved it ♥', 'Good but not best, when your device restart this app not work.', 'Thank you for this App, Please add more options for date.', 'Just installed - PERFECT! None of the other apps worked.', 'Worth the money guys, but need more watch design. Adding a calendar would be nice', 'Great alternative to the always on display.', 'Works great. Nice screen for the phone.', 'Not bad aside of paid extension which cost so much...', "it doesn't work well in xiaomi miui phones. suggestion: please add lockscreen function", 'Works so far tried it out.. wanted all the features do I bought the pro thing. Thanks', "Does what it is supposed to do but I can't figure out why for the life of me it doesn't work in landscape mode?", "Good Am I missing edge glow color feature or it ain't available?? Would be great if able to change color", 'Excellent.... this is the proper always display', "The app options seem interesting, bit I have one major problem. A purchased the PRO version and it does not seem to work on my device (OnePlus 7T Pro) and I've tried the solutions presented in the FAQ but none seem to work It this is the case I would like to know if there is a way for me to get a refund", 'Donation Rs.30 is given to Google pay by bhim upi, two time I.e Rs 60.00 but how it is not transferred to Google play as it is showing 0 balance?', 'It keeps asking me to "purchase" the app after I purchased it. This is annoying aside from the fact that I can\'t get refunded and the fact that the app is glitchy at best. Would not recommend, but if you have the free version, make the best if it.', 'This was the 1 thing my new phone was missing from my old galaxy S7, AOD, but now I can still have it :-)', "I love it. It looks great on my new Samsung A30S. Looks like real aod. No problems. Adaptive light working also. Just don't know if it will battery life by much.", "The app is really good and doesn't consume a lot of battery. The best part about he app is it's clock customisation and font edit options. I would have given 5 but the Ambient display still stays on me screen until I double tap even after unlocking", "Works well. Like the ability to change the font size on the clock display. However, I can't seem to get it to turn the clock display off. I have the display timeout set as low as it will go (20sec) but it never turns off. Suggestions?", "I loved it, I didn't waste time to go for the premium 👌", 'I love it. The best thing is to have the current weather on the screen that is always in view. I use a Samsung phone and their "always on screen" overrides this one. All I have to do is hit the off button on the side of the phone and up comes this one.', 'Works a charm even on LCD. I used this app on a mi 9t which has an amoled but I have switched temporarily to a Huawei P8 lite 2017 as I was having some issues on the 9t, they were unrelated to this app however. The contrast on the LCD panel of the p8 is pretty good so if Im in an illuminated room it fakes the effect of amoled pretty well. No complaints so far, the ads are not too jarring either.', "Features are good, but the app doesn't always seem to work in the background. It crashes and i have to go to the app to enable the service again. Im using OnePlus 5T.", 'works ok sometimes . sometimes doesn\'t activate the quick setting button not always working either to turn in or off.. also drawings can\'t be saved even though there is"option" to save on bottom left of screen... I\'ve never been able to find the files if they in fact do save which is a shame really cause drawing is cool', 'Great app with all the needed features. Just needs a little organizing when it comes to the settings.', "Largely works as described. Many features locked behind payment. Only thing I encountered is that my OP 7 pro ambient display overrules the app on double tap to wake, I hope that's fixable. Will buy if that's fixed since I wanted to be able to customize my ambient display. Also there seems to be a 'join the beta' option but I don't see information with specifics on what's in the beta.", 'To the developer of App and pro: Please advise if its safe to use this app on phone with LCD screen and will not cause any damage to phone or LCD screen. Also will battery drain be much greater on LCD screen if applicable. Thank You.'], 'appId': 'com.tomer.alwayson', 'url': 'https://play.google.com/store/apps/details?id=com.tomer.alwayson&hl=en&gl=us'}
