{'title': 'Slideshow', 'description': "# Android Slideshow\r\nSlideshow is a simple way to view your favourite photos with ease. Navigate through your files and start a slideshow with a single tap. \r\n\r\nShare with your friends and family your favourite memories and everything in between too.\r\n\r\n## Features\r\n* Select any directory on your phone\r\n* Automatically begins playing slideshow\r\n* Ability to delete images from within the slideshow\r\n* Sequential or random display order\r\n* Configurable delay\r\n* Show / hide hidden files\r\n* Check the settings for hidden features\r\n* Check the settings for hidden features\r\n* Check the settings for hidden features. Seriously, there's a ton of stuff in there\r\n\r\n## Un-Features\r\n* No sign up\r\n* No internet connection\r\n* No requests to rate the app\r\n* No trail periods\r\n* No paid upgrades\r\n\r\n## Upcoming Features and Feature Requests\r\nAll planned enhancements are here: https://github.com/ScreamingHawk/android-slideshow/labels/enhancement", 'descriptionHTML': '# Android Slideshow<br>Slideshow is a simple way to view your favourite photos with ease. Navigate through your files and start a slideshow with a single tap. <br><br>Share with your friends and family your favourite memories and everything in between too.<br><br>## Features<br>* Select any directory on your phone<br>* Automatically begins playing slideshow<br>* Ability to delete images from within the slideshow<br>* Sequential or random display order<br>* Configurable delay<br>* Show / hide hidden files<br>* Check the settings for hidden features<br>* Check the settings for hidden features<br>* Check the settings for hidden features. Seriously, there&#39;s a ton of stuff in there<br><br>## Un-Features<br>* No sign up<br>* No internet connection<br>* No requests to rate the app<br>* No trail periods<br>* No paid upgrades<br><br>## Upcoming Features and Feature Requests<br>All planned enhancements are here: https://github.com/ScreamingHawk/android-slideshow/labels/enhancement', 'summary': 'A simple slideshow application for viewing local files.', 'summaryHTML': 'A simple slideshow application for viewing local files.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.68, 'ratings': 136, 'reviews': 89, 'histogram': [32, 5, 6, 19, 72], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.7M', 'androidVersion': '8.0', 'androidVersionText': '8.0 and up', 'developer': 'Michael Standen', 'developerId': 'Michael+Standen', 'developerEmail': 'michael@standen.link', 'developerWebsite': 'https://michael.standen.link', 'developerAddress': '70 Burswood Drive\nBurswood\nAuckland\nNew Zealand', 'privacyPolicy': None, 'developerInternalID': '6738542576935730115', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/EPsVgjrw9tDQSrgnMmK9NyAzC8SJJzPz0EPSZifS6g_FDHKG_tYjPel_RFmb3mDxtyzN', 'headerImage': 'https://lh3.googleusercontent.com/CRULMLiqaB46M-EKHQ6Wx5zVdbnBkSIYKFVw23KSBu2Zx8lNFGtpjfq50yaa6yTvGg', 'screenshots': ['https://lh3.googleusercontent.com/vCYePOa0oj7BSIt2c3GxPZ_lV21p1m-rDw7EByNjNuXrXHZSXfRUbp70Cjv3fSIEpog', 'https://lh3.googleusercontent.com/FXM4PxFF3pGzKqFOg5RFJ649GNHXq-kFq2WfhCoV02JnSuDCUhGl1HEfneYf6m4dR3A1', 'https://lh3.googleusercontent.com/BZEeucL7PKI8ot7GwxM8AYjPpQNGHj_PZNta_mZLwnq8ttkimSRVUBDp0l4jOcN5pZuS'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Feb 5, 2017', 'updated': 1571000151, 'version': '2.8.1', 'recentChanges': '* Add Ukrainian translation. Thanks Yevhen Badorov!\r\n* Update Russian translation. Thanks again Yevhen Badorov!', 'recentChangesHTML': '* Add Ukrainian translation. Thanks Yevhen Badorov!<br>* Update Russian translation. Thanks again Yevhen Badorov!', 'comments': ['Brilliant! Much better than all the others I tried. Just what I was looking for. Loads of options. Would happily pay for this. Only downside is the occasional crash.', 'Perfect. Simple, easy and not intrusive in any way. Very effective App.', "4.5 stars: It's a good tool for those wanting to look at photos without transition effects, which is precisely what I wanted. Suggestion: The most frequently changed settings should be the easiest to get to. I argue those are slide duration, random, back and a few more. Move them to the top of the list and you're good. Lots of good options. Nice to have: pan/zoom while paused.", "Very simple but it has all the basic functions, it's small in used storage footprint, and does what it says. Unfortunately transition options aren't available except for the duration.", 'Excellent app, does simple slideshow with nice interface. Fully functional with no goofy frills like adding music or creating a standalone slideshow. Many good configuration options. Will pick up slideshow from exactly where one has left off.', 'Great app. If you enable root access on a non rooted phone, it lets you access files on your SD Card. This feature was very useful.', 'It works. Very minimalistic. I wish I could zoom in during slideshows, or have that as a transition option. Anyway good job on the app!', "Perfect. Only slideshow app I've found that can automatically view images in portrait or landscape mode depending on their size.", "This is exactly what I was looking for. I don't want music. I don't want to create a video. I don't want filters or emojis. I don't want fireworks or sparkles. I just want to display pictures in random order from a specified folder. Thank you!", 'Good app. But, app is not working properly in SPLIT VIEW in OnePlus 6T. If we touch another app in split view, slideshow stops working in this app.', 'Seems to want to do exactly what I want, but cannot access my memory card where all my photos are stored.', "Crashes after loading the second picture during slideshow. Otherwise it's nice and compact.", 'Useful app, does what it is supposed to do and does it perfectly Thank you.', "so far it works, but I haven't found how to access my SD card from it.", 'Awesome app. Thanks for creating this. Works awesome on my Samsung Galaxy S7.', "Useless. Couldn't access my SD card without rooting my device. Come on. Other apps do it.", 'Simple and fubctional! No hassles. Good settings.', "It's good until it crashes, which is does alot. Why does this crash so much", 'like the simplicity. But please add transition animations :) Thanks', "great viewer, small file size, sadly doesn't access external files", 'Works perfectly out of the box, exactly what I was looking for. Thanks!', "legit a worthless app doesn't even make a slideshow nothing it's just shows your pics and that's it, it's mostly the Gallery app on your phone", "Why can't I delete any pics? Maybe cause there on the micro SD? Help!", 'Could not select folder where my pictures are. Junk', 'Nice simple app to view a folder as a slideshow', 'The only slideshow application that works!', 'Simple slideshow app for pics in folders.', "Don't install it's bad not make slide just open gallery it's so bad waste my time", 'is sucking a requirement for makimg a slide show app? i put in a perfectly rendered song with my album cover and just like the other apps, it ruins the audio.', 'great program! i use it all the time', 'Great slideshow app.', 'You make pics? You collect pics? Then watch them with this app. Like I do!', "Can't see files on my sd-card", 'Does EXACTLY what I needed!', 'it is waste of time very bad app', 'works as advertised', 'DONT DOWDLOAD THIS APP!!!', 'Hahaha very funny', "Nice and simple. So tiny. The ONLY slideshow app I've been able to find that correctly sorts files into folders when running! Recommend to all.", "I like the simplicity, but it's not obvious at all how to get to the images on your SD card.  I like that it will start a slideshow from the last one shown, but then when you want to exit, you either have to hit the back button A LOT, or hit the home key.  I think a better method would be to allow one to create shortcuts on the home screen for saved slideshows. So when you press back, the slideshow quits back to the homescreen. I'd happily give 5 stars for that."], 'appId': 'link.standen.michael.slideshow', 'url': 'https://play.google.com/store/apps/details?id=link.standen.michael.slideshow&hl=en&gl=us'}
