{'title': 'Slim Launcher - Fewer distractions, more life', 'description': "Slim launcher only allows you to use fewer apps on your phone. Giving you more time to enjoy life as it was intended. Also a perfect app for a minimalist lifestyle.\r\n\r\nAll you need is less. \r\n\r\nBut this launcher comes with a twist\r\n#1 No wallpapers: Of course Slim comes with a few color themes but that's it. (This is a good thing, trust me)\r\n\r\n#2 Slim only allows you to use 5 apps on your mobile. Of course, you can switch and choose the ones you want but cheating slim by always replacing your choices becomes annoying.\r\n\r\n#3 No app icons on the home screen. You make your pick to the apps you need the most and they will be displayed by the name on the home screen.\r\n\r\nThis gives you a pretty simple theme with no sudden distractions.\r\n\r\nDon't be afraid to try it out! It's best for minimalists, students who want a strict routine or just about anyone who wants a cleaner, less cluttered home screen.\r\n\r\nFollow the app on Twitter @SlimLauncher and @sduduzog\r\n\r\nView the source on https://github.com/sduduzog/slim-launcher", 'descriptionHTML': 'Slim launcher only allows you to use fewer apps on your phone. Giving you more time to enjoy life as it was intended. Also a perfect app for a minimalist lifestyle.<br><br>All you need is less. <br><br>But this launcher comes with a twist<br>#1 No wallpapers: Of course Slim comes with a few color themes but that&#39;s it. (This is a good thing, trust me)<br><br>#2 Slim only allows you to use 5 apps on your mobile. Of course, you can switch and choose the ones you want but cheating slim by always replacing your choices becomes annoying.<br><br>#3 No app icons on the home screen. You make your pick to the apps you need the most and they will be displayed by the name on the home screen.<br><br>This gives you a pretty simple theme with no sudden distractions.<br><br>Don&#39;t be afraid to try it out! It&#39;s best for minimalists, students who want a strict routine or just about anyone who wants a cleaner, less cluttered home screen.<br><br>Follow the app on Twitter @SlimLauncher and @sduduzog<br><br>View the source on https://github.com/sduduzog/slim-launcher', 'summary': 'Slim launcher lets you use only a top-five pick of apps on your home screen', 'summaryHTML': 'Slim launcher lets you use only a top-five pick of apps on your home screen', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.112069, 'ratings': 1178, 'reviews': 648, 'histogram': [111, 40, 132, 213, 680], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.3M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Beautus S. Gumede', 'developerId': 'Beautus+S.+Gumede', 'developerEmail': 'gumedesduduzo@gmail.com', 'developerWebsite': 'https://slimlauncher.sduduzog.com/', 'developerAddress': '30 Avonwold Drive\nWoodside\nCowies Hill,\nPinetown\n3610', 'privacyPolicy': 'https://sduduzog.github.io/slim-launcher/privacy.txt', 'developerInternalID': '5889546767418038257', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/Qz8BJfh81b0_WJHGs5GpCsDOpa09XpGWomxIztfM8paDUj_xvu1-rYoT4kYT-o6UZub0', 'headerImage': 'https://lh3.googleusercontent.com/0AtJdt6Rs4_4CKhXtYboOslAFmXDE3Gnl480Kta47RvlChhdRcm-YMwxVrK5ki0hnIQ', 'screenshots': ['https://lh3.googleusercontent.com/XpTnFGVWPOr94kzwVk_LxkcFRkf3lKyoepkj6mXeaS7vdy4aUZ4juaysIZEaaKCR4Q8', 'https://lh3.googleusercontent.com/uooioupo1aLnYT8i6EYdr2AdAXU2Cy0x-pCt4RqZoUmUdbscnp0IpJTUH1eeqvSy9w', 'https://lh3.googleusercontent.com/q2QYoUc-AtUoeQjW7tJmXMYyj4Bx9OKexxsPWJ8TALO_Y742aCUIquDvwot6gu8wU-k', 'https://lh3.googleusercontent.com/gFW0JqsYgDOUDK0WBeoQEYEYemRCw4vgYqV1N-_mdHK9-lJK3GpoEK5Oro_DNW4rgog', 'https://lh3.googleusercontent.com/ZP5VHOcszn1L8K58WQPU4wIBakzglvOSlqZIbOv_HuM22OVeCQTpjJgPTLpuPsYrqS8'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 26, 2018', 'updated': 1568130846, 'version': '2.4.6', 'recentChanges': '1. Added a confirm dialog for remove all apps option\r\n\r\n2. Reset app name to original after renaming\r\n\r\n3. Bug fixes and download size minimized', 'recentChangesHTML': '1. Added a confirm dialog for remove all apps option<br><br>2. Reset app name to original after renaming<br><br>3. Bug fixes and download size minimized', 'comments': ["Great App for Reducing the screen time on your Android device. The minimalist approach is really awesome, Oy one thing that if We need to use any other app necessarily then we won't able to do that, rather than that this is something what I was looking for a long time. Thanks for making the App and keeping it subscription free and also Ad free.", "Everything is awesome except that there is no way to access any other apps. I want to limit my access to them, but not cut them out entirely. If that was the case I would just uninstall them. So if there was an app drawer, or a search bar or something when you swipe down or something that's still going to be very helpful. Otherwise it's the best one currently available", 'Seems to be very good launcher. There are some others with restrictions down to 4 or 5 prg choices but 7 seems to be a much better number. The fact that also the time, phone and camera have their own button is very helpful. For those who are struggling with the missing drawer they should install "Organize Drawer" in addition. This little prg will solve this issue.', 'Love this apps. Super clean and simple. I don\'t have any problem with only six apps list. I can get access to all of my apps, with just a simple trick. Install an apps drawer (I use "Organized drawer" very small size ). Simply put it on the list and wallahh, you can get access to all of your apps within this launcher. Thanks developer for this awsome apps.', 'This is a good launcher to take a break from all the stress coming from notifications, is customizable so you choose what degree of liberty you can have, for example I keep email and messaging app because for me they are not a distraction but necessary for work. Good job, I will like more theme, only thing I can suggest!', 'I love this launcher. Beautifully designed, intuitive, and works exactly as advertised. At first I was a little bothered there was no app drawer, but once I realized that was the point I came to appreciate it, which makes this launcher perfect for someone looking to break a bad phone habit. Thank you and keep up the good work!', "Great App! I wanted to use this but using apps other than the favourites is just so difficult that it make it inconvenient. Things that would've taken 10 seconds now take a lot more. The day you make an all apps button I'm back. Uninstalling for now.", 'I love the minimalist and sleek feel. If I were to give a suggestion, it would be to provide an app drawer (for the users who need to easily access an app not included on their top list). Other than that, I give the app five stars!', 'Excellent app, it does not support gestures on Android 10. Navigation automatically changes to 3 button old system. I will install it once gesture support is provided. But the idea is really attractive. Simple but still useful app. Great job !', 'Beautiful and has the prettiest settings for this type of app. However, I want to reduce distractions not be locked out of my phone entirely. Some options to access all apps via a list would be great.', "I like it, but when I want to search apps to add I have to write the name of the app differencing Uppercase and Lower case. it's so annoying, maybe you can solve it just with a .toLowerCase :)", 'I love this launcher!! I put the main apps on that I know I will need and use. And kept The rest off! You only get a select few to chose from anyway. And the fact that you cant access your apps is great! Because Its not tempting you to go to other apps all the time. And you can still access your system settings which I love! Pluse the Midnight theme Is awesome to and great for battery.', "I have had this launcher for 5 minutes and it's flipping fantastic. Best minimal launcher on Google Play Store by far! Simplicity and helps limit addiction! Also no ads!! :)", 'I cannot launch the dialer app with the bottom left ico no matter how many times I touch it. Its just broken. Camera Icon is working fine. Please fix it ASAP.', "Please add an option to hide apps list from the home screen. Currently it's very easy to access all the apps. For distraction free experience, the all apps list should be hidden/locked away. When a user tries to access an app other than the few available on the home screen a message could be displayed to make the user rethink their choice of launching a time consuming app...", 'I really like this app! However the navigation bar is still white when using a dark theme. And swiping up to reveal all apps is a bit flimsy/inconsistent (mainly when swiping quickly). Fix that and it would be 5/5', "Why can't it keep the system Font. It's the reason I'm giving this a Four stars. This is way better than Less phone But I don't prefer this over that one onlyy because of the font.", 'Would love to get a feature like "set time limit" for a particular app. Every app can be accessed through system settings, thus the time limit feature', 'App is Good as its name.But when I add seventh app&after use when i try to remove it becomes difficult bcoz remove all button overlaps the three dot button. Fix this.', "Minimal design. UX beautifully done. The only thing, I want launcher to use system font instead of Ubuntu. But can't.", 'Great launcher if you want a clean look. The only problem is that you cannot have more than four shortcuts at homescreen', 'Google search widget is not available. That is a must. A search widget shall be added. All other features are good.', 'Everything is super clean and nice but wish you could give support for custom wallpaper. Thanks!', 'Really nice.. I loved the UI.. But please add some option to access all apps. It is irritating when i am in emergency to open an app not in homescreen..', 'Gestures don\'t work when on "options" page of the launcher...it wo to go back when i\'m swiping to go back.', "Good work. I love the fact that because I now have this app my phone no longer eats much battery. It's a real no brainer thou I must say if you looking for a much simpler look for your phone, download the app. It reduces the amount of things that are displayed on the screen but the things that are displayed all depend on the applications you chose.", "I like it. Not sure how practical it is. I need to use banking and financial apps and definitely don't want those on my homescreen. Also when I hit the switch app/multitasking button on the phone, it shows the GUI of the system installed launcher (not sure if that is caused by my tablet or the app). It is great for someone wanting to go back to an old feature phone but still has a need for a few apps. I give it 5 stars for that reason. All in all, It doesn't meet my needs, but I like it.", 'I wish this have a double tap to wake and double tap sleep on screen. Other than this is a must have for those whonwantnsimplicity.', 'I love it. It\'s such a good app for a person who wants to limit their phone usage. My only suggestion that I think would be really cool is if you had a "lock it in" option that would lock in your app choices and the only way to change them would to be doing a task that would be super annoying and take a couple minutes. Maybe like, 5 picture captchas in a row. That would be brutal. awesome app guy! I would love to support you if you have a way.', "I liked the design of this launcher and how it provided built-in access to the camera and phone. However, I'd like to be able to choose a calendar app to open (gCal vs. Samsung). Also, after I added a few favorites, I couldn't see a way to swap them out. I think you should be able to change the list from Preferences instead of just getting an annoying notice that you aren't on the home screen. And maybe there should be a list of apps - to make them harder to get to, but not impossible.", "Can't access other apps anyway. I understand that's the point but other family members use mobile. I have more than 7 apps for studying. Overall great work better than any other. Had more suggestions but won't be relevant now. There should be a way to access other apps too. Or change between this and normal launcher easily", 'I love this app. Have been trying to delete built in browsers and minimize distractions on my phone and android makes it where loads of apps can not be uninstalled. This app is a life changer and a life saver. Minimalist design, clean, easy to use and helps me spend less time on my phone and more time with people I want to be with!! Thanks and thanks for making it FREE!!!', 'Love this app. Saved me spending $300 on an actual "dumb phone."', "Almost exactly what I want! I'm just very annoyed that the 7 app limit isn't optional and that there is no full app drawer :(", "While great in concept and pretty accurate in execution, I have a few complaints. The number of apps on the home screen should be increasable, so people who need more can choose to have more. Sliding up for the menu doesn't always work or feel natural. Once you're on the menu pressing the home button does nothing, it should take you back to the 5 apps. I know you'd hate this, but a way to open all apps by means of a difficult to access drawer? And lastly, custom themes", "Nice, bug free and smooth! It would be cool if the options that appear when you swipe up would be sorted from bottom to top instead of top to bottom. On a large phone they are very hard to reach. I'd love the *option* to gave icons, perhaps monochrome icons to go with the minimal theme! Would make apps easier and faster to recognize.", "I love it! As an app maniac, I need to take a break (although I wouldn't have found this if I wasn't an app maniac browsing through launchers). Anyway, does what it says, forces you to just leave your phone alone! May not be ideal as an everyday launcher since many people use their phones to run their business etc, but maybe for the weekends or when you go out to have fun!", 'This is one of the best apps I\'ve encountered with... I use it when I have any approaching exams, just to avoid social media. But the recent updates has got some issues that I think I should inform... 1) A "notes" text in showing on the full app list. 2) The font sometimes fails to work... 3) The app, overall got a bit buggy... Update: Yes I\'ll. Although that notes things does not always show up, and when it does I\'ll just click on it.', "I would appreciate an option to remove the phone and camera buttons, and a way to access other apps maybe? also would be nice if the way to get to settings was a little more hidden for an even more minimalist experience. I do like the Solid background color. A color picker would be nice, but not necessary. I'm testing this launcher with my work profile. Reply if anything changes and I'll give it another test =]", 'great minimal launcher. i like the way that you are limited to 5 apps and the font is not tiny. another good point is that Change Launcher is very easy to get to. sometimes you need your phone back and its only 2 clicks away. my only gripe is that its not immediately obvious how to change one of the allowed apps (remove the unwanted one first then add the new one). overall a really nice launcher'], 'appId': 'com.sduduzog.slimlauncher', 'url': 'https://play.google.com/store/apps/details?id=com.sduduzog.slimlauncher&hl=en&gl=us'}
