{'title': 'Todo List  (Privacy Friendly)', 'description': 'The Privacy Friendly To-Do List can be used to keep outstanding tasks in mind and organize a personal schedule. This application allows to create lists of tasks which can be individually managed. Each list contains a set of tasks. Each task can have a deadline, a reminder time and a list of subtasks. By setting a reminder time the user will be informed by a notification. It is possible to display all tasks in a calendar, to protect the app with a secret pin and to sort and prioritize tasks within a list. Colors indicate the urgency of a task (taking the deadline into account).\r\n\r\nFeatures of Privacy Friendly To-Do List\r\n\r\n1. PIN protection\r\nOpen the Settings menu to setup a PIN protection for your application. The PIN needs to be a number with 4 digits. You are asked for it every time you start the application / start the main view.\r\n\r\n2. Reminder\r\nYou can set a reminder to your tasks that will notify you if a deadline is approaching. Settings provide you the possibility to enable a notification sound.\r\n\r\n3. Widget\r\nIn addition, this app provides a widget that you can add to your device’s home screen. The widget presents you tasks that belong to a chosen list. Clicking on a task or its checkbox leads to the main view of Privacy Friendly To-Do List. The synchronize button can update the displayed tasks inside the widget.\r\n\r\n4. Progress by subtasks\r\nBy default, progress can be chosen freely by the user when creating or editing a task. To-Do List gives the opportunity to automatically compute and show the progress of a task dependent on its done subtasks. Therefore go to Settings and enable Progress by subtasks.\r\n\r\nOur Privacy Friendly App differs from other applications with respect to two aspects:\r\n\r\n1) No permissions\r\nPrivacy Friendly To-Do List does not use any permissions.\r\n\r\n2) No advertisement\r\nPrivacy Friendly To-Do List completely relinquishes advertisement.\r\nMany other free apps in the Google Play Store dazzle annoying advertising which also shortens battery life.\r\n\r\nPrivacy Friendly Checkers is part of the Privacy Friendly Apps group developed by the research group SECUSO at Technische Universität Darmstadt. More information at: https://secuso.org/pfa', 'descriptionHTML': 'The Privacy Friendly To-Do List can be used to keep outstanding tasks in mind and organize a personal schedule. This application allows to create lists of tasks which can be individually managed. Each list contains a set of tasks. Each task can have a deadline, a reminder time and a list of subtasks. By setting a reminder time the user will be informed by a notification. It is possible to display all tasks in a calendar, to protect the app with a secret pin and to sort and prioritize tasks within a list. Colors indicate the urgency of a task (taking the deadline into account).<br><br>Features of Privacy Friendly To-Do List<br><br>1. PIN protection<br>Open the Settings menu to setup a PIN protection for your application. The PIN needs to be a number with 4 digits. You are asked for it every time you start the application / start the main view.<br><br>2. Reminder<br>You can set a reminder to your tasks that will notify you if a deadline is approaching. Settings provide you the possibility to enable a notification sound.<br><br>3. Widget<br>In addition, this app provides a widget that you can add to your device’s home screen. The widget presents you tasks that belong to a chosen list. Clicking on a task or its checkbox leads to the main view of Privacy Friendly To-Do List. The synchronize button can update the displayed tasks inside the widget.<br><br>4. Progress by subtasks<br>By default, progress can be chosen freely by the user when creating or editing a task. To-Do List gives the opportunity to automatically compute and show the progress of a task dependent on its done subtasks. Therefore go to Settings and enable Progress by subtasks.<br><br>Our Privacy Friendly App differs from other applications with respect to two aspects:<br><br>1) No permissions<br>Privacy Friendly To-Do List does not use any permissions.<br><br>2) No advertisement<br>Privacy Friendly To-Do List completely relinquishes advertisement.<br>Many other free apps in the Google Play Store dazzle annoying advertising which also shortens battery life.<br><br>Privacy Friendly Checkers is part of the Privacy Friendly Apps group developed by the research group SECUSO at Technische Universität Darmstadt. More information at: https://secuso.org/pfa', 'summary': 'Manages Todo lists', 'summaryHTML': 'Manages Todo lists', 'installs': '1,000+', 'minInstalls': 1000, 'score': 3.7714286, 'ratings': 35, 'reviews': 20, 'histogram': [5, 3, 4, 6, 17], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.4M', 'androidVersion': '4.2', 'androidVersionText': '4.2 and up', 'developer': 'SECUSO Research Group', 'developerId': 'SECUSO+Research+Group', 'developerEmail': 'secusoresearch@gmail.com', 'developerWebsite': 'https://www.secuso.org', 'developerAddress': None, 'privacyPolicy': 'https://secuso.aifb.kit.edu/english/datenschutz.php', 'developerInternalID': '4797307650791917378', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/ja7lF0AnjvlGIwG6TU0FtNp1rw95KxV91_5H9SEjhzqNGgqXqT3dtHkCRCnv9-7u8g', 'headerImage': 'https://lh3.googleusercontent.com/GTId1kXGwt3RJtIp-_UBZ7Nw587LoMz40ocKLai6cccZbnfhWuMyIcGwDFXhT7zaVQ', 'screenshots': ['https://lh3.googleusercontent.com/YYx8MI5vbCPtMF8JdUBcafx_cR86STiN5UkJOrfOE2R4yar56WS7jEtQxhuoO88cTQ', 'https://lh3.googleusercontent.com/eq1pwAJe4zPQ04n3YD7dMGqrT9E2L1UW87haOj_YL_EwyUMo_unf2NSYArik1em93U8n', 'https://lh3.googleusercontent.com/a29AWamJza4IhyeeJluYFJWwLu2ujMBvhnM8JF5lvv0ZIAsG5e8S8r_3gl25pV1qUELt'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 29, 2018', 'updated': 1580400192, 'version': '2.3', 'recentChanges': '- Fixed a bug with deleted Subtasks\r\n- Tasks can now be switched to a default list', 'recentChangesHTML': '- Fixed a bug with deleted Subtasks<br>- Tasks can now be switched to a default list', 'comments': ["This is an excellent app, please add google sync option so that we don't loose data if we reset our phone or change device.", 'cannot delete subtask, as it restores itself after restarting the app', '1. Can you create an encrypted back upfile function to save a copy of to do list into a folder? That way users can auto sync a copy of the encrypted backup file using to cloud storage using other sync app.   2. I think you should combine notes and to do list as one. Otherwise, people have to download each individual app. So that they notes and to do list kept private in one place and with an encrypted backup file locally. Users can either sync that folder on their oqn to cloud storage by themselves or using other auto sync app.   In case, the mobile hp is lost, or upgraded to another device, information can be retrieve again.   Thank you.', 'Thank you! Very useful app, with simple interface, without unnecessary \n"fountains". There is a bug, however: you cannot edit subtasks. Actually \nyou can, but the app will not save changes.', 'Great app with progress and priority features. Missing google drive backup (priority) and colour the task (optional)'], 'appId': 'org.secuso.privacyfriendlytodolist', 'url': 'https://play.google.com/store/apps/details?id=org.secuso.privacyfriendlytodolist&hl=en&gl=us'}
