{'title': 'Weather (Privacy Friendly)', 'description': "Privacy Friendly Weather lets you watch the weather for cities and locations you are interested in. The app has been developed by the research group SECUSO at Technische Universität Darmstadt. More info can be found on https://secuso.org/pfa\r\n\r\nThe weather includes current weather as well as a 5 day / 3 hour forecast. The weather data includes details such as temperature, a short description of the current weather condition and humidity. Locations can either be added permanently until they are removed or non-permanently which means that the location and its weather is forgotten when exiting the location's weather data.\r\nFurthermore, Privacy Friendly Weather provides a radius search. This makes it possible to find the locations around a given location which have the best weather conditions at the moment. The search space can be set by the user.\r\nThe unit of temperatures can be set to Celsius or Fahrenheit and the unit of distances to kilometres or miles.\r\n\r\nAll weather data are retrieved from the OpenWeatherMap by using their API (http://openweathermap.com/api) which provides a free service.\r\n\r\n1. Minimum permissions\r\nPrivacy Friendly Weather requires only the minimum amount of permission, namely only the INTERNET permission. This permission is necessary to make HTTP requests to remote servers for retrieving weather data.\r\nFor comparison: The Top Ten of similar memory app the Google Play Store (September 2016) in average uses 3,9 permissions. Many apps required a network or internet connection which is totally unnecessary for a memory application.\r\n\r\n2. Radius Search\r\nFind the locations around a given location which have the best weather conditions at the moment.\r\n\r\n3. No advertisement\r\nOther free apps display advertisement which might result in privacy violations, shorten the device's battery life or use mobile data.", 'descriptionHTML': 'Privacy Friendly Weather lets you watch the weather for cities and locations you are interested in. The app has been developed by the research group SECUSO at Technische Universität Darmstadt. More info can be found on https://secuso.org/pfa<br><br>The weather includes current weather as well as a 5 day / 3 hour forecast. The weather data includes details such as temperature, a short description of the current weather condition and humidity. Locations can either be added permanently until they are removed or non-permanently which means that the location and its weather is forgotten when exiting the location&#39;s weather data.<br>Furthermore, Privacy Friendly Weather provides a radius search. This makes it possible to find the locations around a given location which have the best weather conditions at the moment. The search space can be set by the user.<br>The unit of temperatures can be set to Celsius or Fahrenheit and the unit of distances to kilometres or miles.<br><br>All weather data are retrieved from the OpenWeatherMap by using their API (http://openweathermap.com/api) which provides a free service.<br><br>1. Minimum permissions<br>Privacy Friendly Weather requires only the minimum amount of permission, namely only the INTERNET permission. This permission is necessary to make HTTP requests to remote servers for retrieving weather data.<br>For comparison: The Top Ten of similar memory app the Google Play Store (September 2016) in average uses 3,9 permissions. Many apps required a network or internet connection which is totally unnecessary for a memory application.<br><br>2. Radius Search<br>Find the locations around a given location which have the best weather conditions at the moment.<br><br>3. No advertisement<br>Other free apps display advertisement which might result in privacy violations, shorten the device&#39;s battery life or use mobile data.', 'summary': 'Checkout the weather for cities and locations you are interested in.', 'summaryHTML': 'Checkout the weather for cities and locations you are interested in.', 'installs': '5,000+', 'minInstalls': 5000, 'score': 3.7333333, 'ratings': 60, 'reviews': 40, 'histogram': [6, 3, 13, 17, 21], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '5.3M', 'androidVersion': '4.2', 'androidVersionText': '4.2 and up', 'developer': 'SECUSO Research Group', 'developerId': 'SECUSO+Research+Group', 'developerEmail': 'secusoresearch@gmail.com', 'developerWebsite': 'https://www.secuso.org/pfa', 'developerAddress': None, 'privacyPolicy': 'https://secuso.aifb.kit.edu/english/datenschutz.php', 'developerInternalID': '4797307650791917378', 'genre': 'Weather', 'genreId': 'WEATHER', 'icon': 'https://lh3.googleusercontent.com/BAMcWO84H1lrsCRDn48Y_uektPs7OXtmPnlHhR-QUe83ezfrxqIAjVqRAj1d8dEAUOc', 'headerImage': 'https://lh3.googleusercontent.com/ZpZIkk2_kalsYY8pmRUZEW_mq1MoIakaybVxxKoyISYpJyqB8Du6Fz0ssu9pG-fSCw', 'screenshots': ['https://lh3.googleusercontent.com/Wpq0OTJK7Eae_wnFngo1QfCVR4sB6wuyi1TRlDg7Qt2omFsycxVU2Xc8tZJC2Q7LO6U', 'https://lh3.googleusercontent.com/2d6Xw_NMoBAwEcbGd00K9NWJPFZuIvglOLSNaNP0R3sI-5PFSVTO2FPk2IiH6pUXHws', 'https://lh3.googleusercontent.com/-ZaWTSJ-w9eNGXhK72SkUE2gQWZtov2So4umkCak-_N3iV62BsbmdDgLX3Tsem9o5Vc', 'https://lh3.googleusercontent.com/tcHFaR1oXa_QVYEd9RjuvZDHmRQYyoIWFLeSW9GcFVddldwyOuljD_4IiFIiNOFoI3U', 'https://lh3.googleusercontent.com/EP29_yjWU3kgV42XMUpIzEGlsbN9gqr_E19Jzrp4QCxa7urG2d0SfHqcCkXvPRdOPtjc'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 6, 2016', 'updated': 1591100048, 'version': '2.2', 'recentChanges': '- Added timezone support\r\n- Added adaptive launcher icon\r\n- Added improved widget support and design\r\n- Fixed decimal numbers displaying incorrectly in some languages\r\n- Fixed the activity being unnecessarily recreated after the dialog closed\r\n- Fixed some database errors on migration\r\n- Fixed some layout issues', 'recentChangesHTML': '- Added timezone support<br>- Added adaptive launcher icon<br>- Added improved widget support and design<br>- Fixed decimal numbers displaying incorrectly in some languages<br>- Fixed the activity being unnecessarily recreated after the dialog closed<br>- Fixed some database errors on migration<br>- Fixed some layout issues', 'comments': ["It pulls weather data from official sources, just like every other weather app on the planet. It gets the job done. Plus, it isn't spying on you, and selling your information to data brokers, crooks, or spooks. It's Free and Open-source. We can audit the code to make sure no shenanigans are going on – and fork it if ever they do... With Apple having acquired Dark Sky, and the unconscionable privacy invasions of other weather apps: Secuso's 'Weather' is at least an acceptable alternative.", "I appreciate the privacy but this weather app needs more, um, weather. No text forecast, no radar maps, no dewpoint, an odd prominence of the relative humidity where one would expect probability of precipitation numbers. I hope this gets better because I'd love to use it.", "Good so far. Just wish it showed the precipitation percentage instead of humidity percentage. I don't want to have to guess the likelyhood of rain when it shows it's going to rain but then doesn't. So, then I have to Google the weather to see how likely it's going to rain.", "I like the privacy/security issue about the app. No adds etc. That's why I downloaded the app. It's very basic. But unfortunately it only shows European time zone (Germany), so it is always 6 hours ahead of USA east coast time zone. U can't change it and that's kind of annoying.", "4-stars since there's no dark mode/AMOLED black mode yet, but the simplicity and privacy-focused design of this app are phenomenal. Dark mode would be a major bonus, 5 stars without question.", "Could not use the app, it wouldn't search for my location. Will try again later and see if patches fix this.", 'I love the idea of a weather app that doesn\'t sell your location data. I didn\'t give 5 stars because the widgets are all pretty big and don\'t support dark mode. But the developers seem keen on finding ways to improve (the feature of an API key shows the reality of web services and that we\'re all paying for "free" services with our data). Some apps truly do "value your privacy." 🤘', "A nice idea, but it only shows low temperatures in the forecast, which is not useful in the summer. Couldn't find a way to delete a city from the list once I entered it. Maybe okay if you live in a cold region and have a need for a low-storage weather app.", "I love the idea, but the app doesn't account for local time. It's currently 12 hours off from my current location and there's no way to adjust this.", 'Very cool idea but somehow the widget does not refresh.. it still shows the temp and everything from yesterday when I placed the widget. Even when i refresh inside the app. Autorefresh is set to 2 hours. Huawei p30 @ 9.1.0.124', "not bad app but not good in my experience. the widget often forgot it's location", 'Needs time zone setting. As others have mentioned, having the time in Germany, and 24 hour time, is not very useful in other countries.', "Will update this review once the app is fixed but:- 1. Location options are missing (some nearby locations are unavailable, can't be added) 2. The 4x1 widget with 4 days weather is broken.", "No ads. Straightforward. Support Open Source Software! (How about a 'course of the day' widget?)", 'it is nice that it is basic. limited locations & did not see a radar..', 'Very limited and is not configurable', "You can't even choose Postal code to be sure you have selected the correct city, but the idea of respecting privacy is exelent, Google could learn a lot in that regard", "It's ok. Simply opening a homepage shortcut to Environment Canada offers much more information. Wind speed in m/s is not a common thing - should have kph as an option. Wind chill factor for the winter months is needed in cold climates.", "finally a weather app without ads or crazy permissions.. but widget doesn't update and app can't show newest data in real time.. best idea without good implementation!", 'Good stuff', 'I like that there are no permissions needed and no ads, unfortunately,  there isn\'t any weather information either... won\'t load more than one city\'s weather without having some sort of app mental breakdown. Can\'t delete cities from your list, which seems odd. It\'s like the devs said "f*** it! This is dumb" and gave up before finishing. Anyway, not much to rate.', 'Didn\'t work at all for me.  Added a city and it didn\'t show up in the list.  But if I try to add it again it says "already in the list".  Go figure.', 'Not sure what the problem is. It shows the correct temperature in celsius ,but the temperature in Fahrenheit is way off'], 'appId': 'org.secuso.privacyfriendlyweather', 'url': 'https://play.google.com/store/apps/details?id=org.secuso.privacyfriendlyweather&hl=en&gl=us'}
