{'title': 'Password Generator (Privacy Friendly)', 'description': "With Privacy Friendly Password Generator you can generate different\r\npasswords for all your accounts while remembering only one master\r\npassword. Detailed information about generating passwords can be found at the app's help page or at https://secuso.org/pfa. The app belongs to the Privacy Friendly Apps group developed by the research group SECUSO at Technische Universität Darmstadt. More information can be found an https://secuso.org/pfa\r\n\r\nIn case you wish to generate a password for a user account, you can add this account to Privacy Friendly Password Generator. Therefore, you only have to enter which characters (lower-case letters, upper-case letters, numbers, special characters) you would like the password to consist of and how long it should be. \r\nThe account are arranged in a list. To generate a password, click on the account and enter your master password. The master password is a password made up by you and it guides all other passwords. Like the other passwords it is not stored in the application. So if you wish you can write it down and keep it in a safe place. \r\nFinally, Privacy Friendly Password Generator displays the password which has been generated for you account. This password can be re-generated any time.\r\n\r\nIn case you wish to find out how Privacy Friendly Password Generator generates the passwords, have a look at https://secuso.org/pfa\r\n\r\nHow does Privacy Friendly Password Generator differ from other similar apps?\r\n\r\n1. No permissions\r\nPrivacy Friendly Password Generator does not require any permissions.\r\nFor comparison: The Top Ten of similar apps from the Google Play Store requires an average of 3,4 permissions (in November 2016). These are for instance the location permission or the permissions to access, modify or delete storage.\r\n\r\n2. Protection of passwords\r\nPrivacy Friendly Password Generator does not store any generated password, nor does it store the master password. For the generation of password a stateless algorithm is used. This means that the passwords only exist during the generation and are not stored in the program after the application has been closed. Additionally, the app prevents devices from taking screenshots.\r\n\r\n3. No advertisement\r\nMoreover, Privacy Friendly Password Generator distinguishes from many other applications in the way that it completely relinquishes advertisements. Advertisement might track a user's actions. It could also shorten battery life or use mobile data.", 'descriptionHTML': 'With Privacy Friendly Password Generator you can generate different<br>passwords for all your accounts while remembering only one master<br>password. Detailed information about generating passwords can be found at the app&#39;s help page or at https://secuso.org/pfa. The app belongs to the Privacy Friendly Apps group developed by the research group SECUSO at Technische Universität Darmstadt. More information can be found an https://secuso.org/pfa<br><br>In case you wish to generate a password for a user account, you can add this account to Privacy Friendly Password Generator. Therefore, you only have to enter which characters (lower-case letters, upper-case letters, numbers, special characters) you would like the password to consist of and how long it should be. <br>The account are arranged in a list. To generate a password, click on the account and enter your master password. The master password is a password made up by you and it guides all other passwords. Like the other passwords it is not stored in the application. So if you wish you can write it down and keep it in a safe place. <br>Finally, Privacy Friendly Password Generator displays the password which has been generated for you account. This password can be re-generated any time.<br><br>In case you wish to find out how Privacy Friendly Password Generator generates the passwords, have a look at https://secuso.org/pfa<br><br>How does Privacy Friendly Password Generator differ from other similar apps?<br><br>1. No permissions<br>Privacy Friendly Password Generator does not require any permissions.<br>For comparison: The Top Ten of similar apps from the Google Play Store requires an average of 3,4 permissions (in November 2016). These are for instance the location permission or the permissions to access, modify or delete storage.<br><br>2. Protection of passwords<br>Privacy Friendly Password Generator does not store any generated password, nor does it store the master password. For the generation of password a stateless algorithm is used. This means that the passwords only exist during the generation and are not stored in the program after the application has been closed. Additionally, the app prevents devices from taking screenshots.<br><br>3. No advertisement<br>Moreover, Privacy Friendly Password Generator distinguishes from many other applications in the way that it completely relinquishes advertisements. Advertisement might track a user&#39;s actions. It could also shorten battery life or use mobile data.', 'summary': 'Generate passwords for all your accounts.', 'summaryHTML': 'Generate passwords for all your accounts.', 'installs': '1,000+', 'minInstalls': 1000, 'score': 4.5833335, 'ratings': 24, 'reviews': 7, 'histogram': [2, 0, 0, 2, 20], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.9M', 'androidVersion': '4.2', 'androidVersionText': '4.2 and up', 'developer': 'SECUSO Research Group', 'developerId': 'SECUSO+Research+Group', 'developerEmail': 'secusoresearch@gmail.com', 'developerWebsite': 'https://www.secuso.org', 'developerAddress': None, 'privacyPolicy': 'https://secuso.aifb.kit.edu/english/datenschutz.php', 'developerInternalID': '4797307650791917378', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/J6yaOefJN59Rstj9HhYUDV6zL2-DKxvLlbXGi3ejHZrhU_9WGnsb0vnXerkOpzp9wmHQ', 'headerImage': 'https://lh3.googleusercontent.com/fX76914AqzncbBeWQ78Z0kmJcW_4hQG224OeOGFpyIksRW6-dOYghP-2uYqnrXLxmw', 'screenshots': ['https://lh3.googleusercontent.com/WF7gpc56dX-iDYjZfKZtuFfqY5Y4qZo6oYlU8fA8halcbtvplkMwWiqxJwLOZrDJGocJ', 'https://lh3.googleusercontent.com/_GyOHbf60uwHmDPwBaJhGiMn0qmfhcMhho3lVzY0aVZolcTeR6P6QLSYTL5s6TFcFA', 'https://lh3.googleusercontent.com/-kTvBbOeBy-eJarqKi9LKRAdYo17T58SRdkzU7fEM3Rg5AgJSoro6d_A_GFkGL1yrg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'May 3, 2017', 'updated': 1553775607, 'version': '1.0.3', 'recentChanges': 'Minor Improvements', 'recentChangesHTML': 'Minor Improvements', 'comments': ['Awesome app! Doesnt store passwords, instead generates passwords on the fly using a master password that you know as part of a key to generate a password. Same password is generated  each time you give the same input so the passwords "store". Also via settings can use unique phone details as part of key so the password generated cannot be generated anywhere else but on your phone. No permissions required.'], 'appId': 'org.secuso.privacyfriendlypasswordgenerator', 'url': 'https://play.google.com/store/apps/details?id=org.secuso.privacyfriendlypasswordgenerator&hl=en&gl=us'}
