{'title': 'Hayai Search Launcher', 'description': 'Hayai is an extremely lightweight, fast, battery friendly app launcher.\r\nUse it in conjunction with your current launcher as an alternative app drawer to quickly launch your apps.\r\nYou can also launch the app enabling its permanent notification or by long pressing/swiping up the home button.\r\n\r\nNo permissions, no ads.\r\n\r\nSource code available at:\r\nhttps://github.com/seizonsenryaku/HayaiLauncher', 'descriptionHTML': 'Hayai is an extremely lightweight, fast, battery friendly app launcher.<br>Use it in conjunction with your current launcher as an alternative app drawer to quickly launch your apps.<br>You can also launch the app enabling its permanent notification or by long pressing/swiping up the home button.<br><br>No permissions, no ads.<br><br>Source code available at:<br>https://github.com/seizonsenryaku/HayaiLauncher', 'summary': 'A fast way to search and open your apps.', 'summaryHTML': 'A fast way to search and open your apps.', 'installs': '1,000+', 'minInstalls': 1000, 'score': 4.411111, 'ratings': 90, 'reviews': 53, 'histogram': [4, 3, 5, 18, 60], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '104k', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'Hayai Software', 'developerId': 'Hayai+Software', 'developerEmail': 'hayailauncher@gmail.com', 'developerWebsite': 'https://github.com/seizonsenryaku/HayaiLauncher', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '7918744608612510188', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/DpSllKSAnq5nG_4bjEdqSAZjOInOYcE33rzKjfy2Ho63QxIVt-ISQdRaSojwMGLAWEM', 'headerImage': 'https://lh3.googleusercontent.com/f1FmQoXURD5tRQa33bGMufYqzsY8dAqpFIn4cMwjWxQ78OqeU1e5JlPxeNKymIj-EQw', 'screenshots': ['https://lh3.googleusercontent.com/amFxL-8PKMgL5Pchgh83JqTg_73cUS_BdeX9dZr4wXWoXrkvpjxMkIRPksByiO3eF6M', 'https://lh3.googleusercontent.com/p52ZHS3a3ySJEBD-yG30jofb7EgnZJDseOXisH3J1hWTU-xmDY0z5p83ETb0pFvTEA8', 'https://lh3.googleusercontent.com/sYdFe4E4y14ORDRygYlz0nJrj1DGmMhlrB7PfMOL0qQx-r_XYhrhrlXEHEW6-tPDipQ', 'https://lh3.googleusercontent.com/qgTtdwvaGC2fyCUqX-nu3IPp75kTaSSfb-RbVKTkenwZz55atGZNIZXJ6Nc8VvEaYhc', 'https://lh3.googleusercontent.com/EfTffCl5u75V1Uoz2CoMGwjtWVaD_QpXXrEWosnFjptPRoJIs5YYnLjH3gahT-pZ6yVc'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 7, 2015', 'updated': 1486767967, 'version': '1.4.5', 'recentChanges': 'Updated Polish translation\r\n    Avoid opening multiple instances of the same activity', 'recentChangesHTML': 'Updated Polish translation<br>    Avoid opening multiple instances of the same activity', 'comments': ["Sorts by last used just how I wanted, but please please update the app, currently leaves a black bar on the bottom of the screen, doesn't utilize full phone screen. Would love to go back to using this.", 'A true foss launcher but 1 small problem is the app list does not instantly update when I install or uninstall apps.', 'I love how minimalist this app can be. disabling icons makes this really really fast to search, albeit you need to read the text to know what your launching. its just is what it says "a fast launcher / searcher"', "It didn't update the app list after installing a new app and the search sucks, e.g. my app's name is Email - when I search 'mail' it doesn't find it.", "I just wanted a home screen that doesn't access my data. Thanks!", "Just what I wanted. I prefer the simple and fast design that this launcher \ndelivers. I don't use any widgets, so this is great for me. I would like an \noption to remove the search bar at the top, and possible notification \nnumbers support for the icons.", 'Ability to change app icon size and/or custom icon pack support is needed.  App hiding feature is must needed. Because, many phones come with bunch of junk apps. And users prefer to hide those.', 'Most used apps in the top half of screen, any app found with just entering a few letters - this is all I need from launcher.', 'cannot even find itself in the search has nothing but a long list of apps by recent usage. looks simple, but too simplistic for todays needs to groups apps and to easily find resources in phone.', 'Much better than the native interface. But is it spying on me?', 'Minimalist design, swift execution, and free. Great work, dev! Keep up the good work!', '1. Мне не хватает возможности скрывать приложения. 2. При поиске приложения расположены в верхнем углу (далеко тянуться=)', "Couldn't find anything better.", 'Simple, free, adfree, microtransactions free.', 'Nice! App hide and lock with fingerprint and optional touch pattern would make this perfect', 'This is the best launcher.', 'Brilliantly simple and elegant. Supports for fuzzy text search might be quite helpful.', 'Simple app drawer is awesome  But need of a "dock" in bottom as kind request', 'plz just add widgets support , its excellent', 'Its Awesome! Easy to use!', 'Genius', "After trying out a lot of different launchers I found this one. It's simple, open source and does only one thing: launch apps. Love it", 'This is a super fast, battery saving launcher. If you are using a $50 prepaid phone. Defiantly get this launcher.', 'works well, but if you can make it user customizable to scroll horizontal or vertical that would be awesome', 'nop', 'Nice concept', 'Thanks ..I even uninstalled my Fdroid install in order to be able to leave this comment because you deserve it.', 'Needs app hiding though', "I probably need some time to get used to it though coming from sense. It would be nice if you would auto clear the search bar when I press home or back. Although I'm kinda missing the widget for my greenify.", "Overall, it's an extremely great piece of software. However, the lack of control over priority ordering is quite irritating. I would advise at least some customization to be permitted.", 'Does what it says in the description.  Extremely light app that searches apps in your phone very quickly.  This is one of those apps where the programmer has actually taken the care not to make a bloated app, that still handles the job perfectly.', "With search based launcher, it adds an icon based app tray and an optional shortcut in the notification tray. Doesn't show up as a choice for the home gesture on Marshmallow (for me)", 'Quick and easy', 'great'], 'appId': 'com.hayaisoftware.launcher', 'url': 'https://play.google.com/store/apps/details?id=com.hayaisoftware.launcher&hl=en&gl=us'}
