{'title': 'DMach - Drum Machine', 'description': 'DMach is a drum machine with 6 channels, a 16 step seqeuncer and real-time sound synthesis.\r\n\r\nSource code: https://github.com/simonnorberg/dmach', 'descriptionHTML': 'DMach is a drum machine with 6 channels, a 16 step seqeuncer and real-time sound synthesis.<br><br>Source code: https://github.com/simonnorberg/dmach', 'summary': 'Drum Machine with real-time sound synthesis.', 'summaryHTML': 'Drum Machine with real-time sound synthesis.', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.25, 'ratings': 752, 'reviews': 323, 'histogram': [60, 30, 75, 82, 503], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '4.2M', 'androidVersion': '4.2', 'androidVersionText': '4.2 and up', 'developer': 'Simon Norberg', 'developerId': 'Simon+Norberg', 'developerEmail': 'info.simno.net@gmail.com', 'developerWebsite': 'https://github.com/simonnorberg/dmach', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '6717930396317665224', 'genre': 'Music & Audio', 'genreId': 'MUSIC_AND_AUDIO', 'icon': 'https://lh3.googleusercontent.com/vPfsPgdYD2HxtZ_8EUKv2jAy14J84he4Kx99U1AMCRhw-ysYa0xpvCd6i7acoddd_Mw', 'headerImage': 'https://lh3.googleusercontent.com/GxHOb6krSLC50SBbbmIlvcJ_rlCE5LRqFMjqSTAf2jV7epDwULAE6XASCSXohFmIi1Ji', 'screenshots': ['https://lh3.googleusercontent.com/O0VUxqE3sjJlBH5uD75xkzUOHIrQYi9y9-sIr1jfdonCjbfzHSGke4WNWd-LlUyBOg', 'https://lh3.googleusercontent.com/HbFm9v_2r-m1Sthf3r3ZdoBQv9Atm9BFC2al6NlGDTWAxxHr73EZTtCDF_yi4lqG', 'https://lh3.googleusercontent.com/usMvWLIjCoq_6aIVICoj4EW7KusNjHh6CWKU8b7uvbFCoAGr_wc870H8e4t1kmfcVe4', 'https://lh3.googleusercontent.com/5zcENSzoIK1QUTFhUPHDN541P0b7TtSOp77vP6nzLeS7E4ZKBJ6A14Dc6FfoQFc3cA', 'https://lh3.googleusercontent.com/ygV3VJCCI0sgLZs9b1aQ5BvFUmm_03DR7uYR7sbWx4DoO7DYo9xK0_JmMIghUYrAKQ', 'https://lh3.googleusercontent.com/G3kZCWiDKylMtm-_S6Oj09nkYqPLGnvhqSsilApJTAMPxdxTdQg3MSzYEQLqm_iS4cY', 'https://lh3.googleusercontent.com/-z_MAtVoAL_lMAcKCbuqSLxapKD2SFSvj0dstAml86f84ZJ5qTudpuCSPim3YQHy4w', 'https://lh3.googleusercontent.com/m8u7Nv2KtycRMdwI3suw6PAfnS_AQvMuGFpehw9Yy_aQSwtqh92lYvpsKwTLaJ9y6w'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 9, 2013', 'updated': 1573374248, 'version': '1.6', 'recentChanges': 'Updated for Android 10', 'recentChangesHTML': 'Updated for Android 10', 'comments': ["This drum machine app is really fun to use and it's a great tool for working on songs with an acoustic guitar. The swing feature had made it possible to work on blues tunes with a shuffle. I would really like a button to reset a drum sound to the default. You can edit the synthesis of each instrument which I love, but I think the default kick drum sound is pretty great and it's hard for me to get back to it.", 'Looks great, sounds great. Just needs two things: different time signatures and multitrack audio export.', 'Reminds me a lot of those old DR-55 and DR-110 drum machines. Great fun. Shoutout to the developer!', "Awesome minimalist UI design. I'd love to see future versions with a time signature setting so I can use meters other than 4/4.", 'Powerful, simplistic, and amazing. Genius. I WANT to pay for it. Im a musician. Acoustic, Jazz, Electronic, Gospel and this my drummer.', "Inspiring! Clean and simple UI, very playable, flexible and powerful drum synth. Kicks hard on a decent set of monitors. Run thru overdrive and delay for legit techno. I'd love to see an expanded (even paid) version with the following features: - more tweakable tom synth - mute track gesture from sequencer view - mode to change sequence length per track for polymeter - maybe a 2nd set of tracks accessed via swipe, so you can do closed/open hats, use kick for kick+bass etc. Or proper p-locks :D", '4 beats, 16 notes, 6 voices I was up and running in minutes. I love how simple it is. Best metronome ever, for 4/4. Then I thought about other time signatures. That would be a great enhancement!', "Fun to use with lots of cool features and options but so far I've just been stuck with a 16 step sequencer and no ability to change time signature, so it's limited where that's concerned", "It's a decent app, but it definitely needs an export to wav option.", 'Super app , easy to use, so many adjustments 👍👍👍', 'Exactly what I was looking for. Quickly throw together a beat as easy as possible.', 'Love the app, but would use it 10x more if I could change the length of patterns. I.e make it 12steps or 15 instead of the standard 16.', 'Easy to use, fun, cool efx and nice swing', 'I love this app. Simple and sounds good. Wish i could live record from within the app, and easily export. Any chance this feature will be available in future?', 'Lightweight, no ads, and super fun to use. Loops can play in the background, while you run other apps.', 'amazing sounds and playability. hopefully it gets a pattern bank and longer pattern lengths on any future updates.', "It's a very good app for to have.. would be great if it had more functions though.", "Can't get back to the sequencer screen", 'Adjusting tempo in 10s is problematic and not usable for me.', 'The tempo is not adjustable enough. It jumps 10db', 'Nice work! Really clean UI and rather addictive.', 'Great emulation of analogue Drum Machine.', 'Bass drum not great.', "I just wanted something I can play my guitar along to 😃 I'm happy so far!", 'Top stuff! Beats!!', 'This is the one and only. simple but powerful.', 'Hung up in vol/ pitch screen', 'Great for developing new beats!', 'lots of fun', 'I have tested many, but I always come back to this one', 'Lots of fun 😁', 'Cant do any thing with out it.And thats that.Next?.', 'This is badass.', 'I love it.', "I love this app. It sounds amazing, and offers extensive drum sound design capability. While it is definitely limited (no song mode or chaining of sequences, only one 4/4 16-step sequence available, no recording/exporting of sequences possible), it sounds so good and it's free, how can anyone complain? The drum sounds it creates are so unique and punchy, I sample them frequently. I just connect a line from the phone audio ouput to my sampler or computer's audio input and sample away.", "I've had this installed for ages now. Only use it occasionally but always end up happy with the sounds I end up with. Nice little app.", 'Hortible', 'Perfect!', '💕💞💘😍💝', "I've only used it a few days, and found it to be pretty user friendly once \nI figured out that I could shape the sounds by tapping the column of \ninstruments. Other than that, I'm very disappointed by the apparent lack of \na way to export them to a wave, or ogg, type format to be used in audio \nprojects. If you're looking for a funky drum machine to play along with, \nthen this may be for you. It's very lightweight, and configurable. But if \nyou're looking for a way to port it, keep looking until they add the \nfunction."], 'appId': 'net.simno.dmach', 'url': 'https://play.google.com/store/apps/details?id=net.simno.dmach&hl=en&gl=us'}
