{'title': 'Simple Draw Pro - App for quick & easy sketches', 'description': "Want to draw something creative but you have no paper? This app will suit you perfectly. Just pick a color and draw, it is as easy as that. You can either save the drawing in a file, print it or share it directly through email or social networks so that your friends can have some fun with it too.\r\n\r\nThis hugely popular app for quick sketches provides many useful functions like Undo/Redo, changing the background color, or using an image as the background. You can optionally make the app prevent the device from falling asleep too. You can also change the brush size, or use an eraser, if you messed something up. It supports inserting colors either by selecting it on a huge palette, or by entering the colors hex code. It has a modern look based on material design.\r\n\r\nThe app supports many different formats like PNG, JPG or SVG vectors.\r\n\r\nYou can either draw something new from scratch, or open some file and just play around with it. It is perfectly usable either by you, or by a family with children to play some games. Afterall, everyone has a piece of artist in himself.\r\n\r\nYou will not find any fancy or advanced tools, brushes, fonts, filters here, it is supposed to be used to have some fun with.\r\n\r\nContains no ads or unnecessary permissions. It is fully opensource, provides customizable colors.\r\n\r\n<b>Check out the full suite of Simple Tools here:</b>\r\nhttps://www.simplemobiletools.com\r\n\r\n<b>Facebook:</b>\r\nhttps://www.facebook.com/simplemobiletools\r\n\r\n<b>Reddit:</b>\r\nhttps://www.reddit.com/r/SimpleMobileTools\r\n\r\nDon't forget that if you uninstall any paid app within 2 hours, you will automatically be refunded. If you want a refund anytime later, just contact us at hello@simplemobiletools.com and you will get it. That makes it easy to try it out :)", 'descriptionHTML': 'Want to draw something creative but you have no paper? This app will suit you perfectly. Just pick a color and draw, it is as easy as that. You can either save the drawing in a file, print it or share it directly through email or social networks so that your friends can have some fun with it too.<br><br>This hugely popular app for quick sketches provides many useful functions like Undo/Redo, changing the background color, or using an image as the background. You can optionally make the app prevent the device from falling asleep too. You can also change the brush size, or use an eraser, if you messed something up. It supports inserting colors either by selecting it on a huge palette, or by entering the colors hex code. It has a modern look based on material design.<br><br>The app supports many different formats like PNG, JPG or SVG vectors.<br><br>You can either draw something new from scratch, or open some file and just play around with it. It is perfectly usable either by you, or by a family with children to play some games. Afterall, everyone has a piece of artist in himself.<br><br>You will not find any fancy or advanced tools, brushes, fonts, filters here, it is supposed to be used to have some fun with.<br><br>Contains no ads or unnecessary permissions. It is fully opensource, provides customizable colors.<br><br><b>Check out the full suite of Simple Tools here:</b><br>https://www.simplemobiletools.com<br><br><b>Facebook:</b><br>https://www.facebook.com/simplemobiletools<br><br><b>Reddit:</b><br>https://www.reddit.com/r/SimpleMobileTools<br><br>Don&#39;t forget that if you uninstall any paid app within 2 hours, you will automatically be refunded. If you want a refund anytime later, just contact us at hello@simplemobiletools.com and you will get it. That makes it easy to try it out :)', 'summary': 'Pen & paper for your creative quick easy drawings with no ads or internet access', 'summaryHTML': 'Pen &amp; paper for your creative quick easy drawings with no ads or internet access', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.54, 'ratings': 542, 'reviews': 188, 'histogram': [16, 0, 32, 119, 373], 'price': 1.19, 'free': False, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.9M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Simple Mobile Tools', 'developerId': '9070296388022589266', 'developerEmail': 'hello@simplemobiletools.com', 'developerWebsite': 'https://simplemobiletools.com', 'developerAddress': 'Hviezdoslavova 7, Košice 04001, Slovakia', 'privacyPolicy': 'https://simplemobiletools.com/privacy/draw.txt', 'developerInternalID': '9070296388022589266', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/4Uk2cyr4tBeiNm8bCjvYWb2ZDtKlw-wTg7icKG--n2NKNoCY0oKX4HCbCXI10SbRlI8', 'headerImage': 'https://lh3.googleusercontent.com/LvQ8tsHNzNP_yhPF4rkD3P824CO5LoF52XAL02GcyEFLDlCiIKaaSDnbqtl7jNs1MJA', 'screenshots': ['https://lh3.googleusercontent.com/MlPVnC5t0FHexJSgOKtHcRMy_k6bZH67JOpxdURJSQ49WDG6fA9os3bCyIEgvy-I6PA', 'https://lh3.googleusercontent.com/Z2GswKxvUkDIIdOkKtDYVkH-gdVjmB9rDQnWKMkXriZyCkJ8j6cADwvy1JzXV0q9093Q', 'https://lh3.googleusercontent.com/WjqP2g-u5LRF8PduKIZbTSG9uJyFlbsH_cB3iYMUYiH0UraU6yVhi54MW9UpVlnNt_I', 'https://lh3.googleusercontent.com/3cE4LbEueHdWJKbI1HACb_bN1ymlZNDAuCr7pFhXdFiSp_YdPz_GO1TVfTh1mowHeJk', 'https://lh3.googleusercontent.com/_OD2nAHuDejOQZP4MR3-zEg-4MsjlDVNclv2bt0iQwDDSmi3-L96ipzZFfsKnTHbItLu', 'https://lh3.googleusercontent.com/hRmyjEPeSf9LBFcbsaDUtcNm5wGeTQrM5JTo4t1WXz73SHV17NXDeM80sWl_wcxlCQ', 'https://lh3.googleusercontent.com/UOZeW_hWv_U0iDq9gmRdNxCS-cdJc1-DOFgrRQ5RGg7mQSI6sIExsCYVceXJ6WUwpw'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 4, 2018', 'updated': 1590435457, 'version': '6.2.1', 'recentChanges': 'Use a nicer app icon on lower Android versions\r\nDo not require the Storage permission in some cases\r\nAdded some translation improvements', 'recentChangesHTML': 'Use a nicer app icon on lower Android versions<br>Do not require the Storage permission in some cases<br>Added some translation improvements', 'comments': ['I always appreciated this app as it looked like a fun little basic drawing app for kids to use. Today I needed to share an image and cover some private text before doing so. I spent ages trying to find a simple image editor that allows erasing or drawing over the text before sharing. After trying a few highly rated image editing apps only to find they all just offer an Instagram level of adding sprites or applying color filters, but no ability to actually edit. I remembered this. Worked 5/5', "Needs fullscreen mode, so that gestures on Android 10 won't be as easily triggered", 'This seriously needs a two finger pan to accompany the zoom function. How is not in there yet?', "Won't draw. FAQ doesn't help, either.", 'easy, handy little app...', 'It seems I cannot share a picture to this app. It can only edit a picture on the disk/storage. For example if I edited a picture in another app, and share the picture (without saving) to this app, it does not work.', "Useless for simple editing images (I just wanted to cover something in the photo). It adds frame around the image with canvas background color. Also you can't even zoom in specific part of image, you can only zoom in the center, so you can't see the sides. Why would you even upload this to the play store? Dude, why??", 'I like the simplicity of this app as i just wanted it for scribbling when i was bored. However there is a really annoying flaw which is: if you accidentally hit the back button on your phone, which is easy to do , you lose any unsaved progress.', "It says I installed the pro version, but its not. It'd exactly the same. Not even the name is different. I really like some of your other releases. Gallery Pro is my favourite. But it seems you put all of your effort Into two or three and dozed off on the rest.", "A remarkably well designed, simple sketch pad. It does everything I want it to do and it's entirely intuitive to use.", "Very light and simple. I'm not sure yet if their are any tools. But an idea could be line and circle tool. Or cursive effects, transparency, layers, stamp making. If you can build it, they will come.", 'I use this to draw on screenshots, but the application either crops the top part of them, or adds white bars to the sides. It would be nice to keep the original picture size when opening picture files. Otherwise, a great application.', "It might not be simpler backend, but a stylus-only mode would sure make my experience simpler. It's a solid, straight up app. Wish more of my world would pursue that paradigm (as I backspace 20 emojis I just typed accidentally....)", "It's excellent app for quick marks/highlights on an image/photo/screenshot to share. To get the fifth star, it needs crop/cut feature to be able to remove unwanted info.", 'WARNING: this is just aweful! And like all this dev\'s apps it ALWAYS RUNS IN BACKGROUND NO MATTER HOW MANY TIMES I KILL IT! HUGE BATTERY WASTER! WORST: when I "uninstalled" it it only "disabled" but STAYED ON MY DEVICES AND SOMEHOW STILL KEPT OPENNING EVERY SO OFTEN! THAT IS TOO SUSPICIOUS SO I USED ADVANCED FEATURES TO WIPE ALL TRACES FROM MY DEVICES!', 'awesome application with stellar features. It is really simple app as you descibed. customisation is superb. keep it up....', "I think it's an easy app that I use to make quick notes.. just three buttons.. quick and simple .. I like it and works great for me !!", 'No-nonsense sketch tool. Simple and fun to use. Part of an excellent series of apps that are worth the money.', 'Hard to find something that will let you import a pic amd draw on it...for some reason. this app fits the bill and as the name implies, keeps everything nice and simple.', 'Nice and simple but I\'ll never buy your apps. Your original apps I did purchase through "thank you" and then you stop development and start another set. You gonna do that again? I\'m not taking a chance. Thanks for the free app one day offer.', 'What an absolutely fantastic, elegantly simple drawing app, which importantly, does not request any unneeded permissions either. Well done developer!', 'Very usable tool on a tablet. Reasonable simple to use. Does have some ads but not intrusive. Sometimes just use it for saving notes etc. Certainly suits my purposes.', "Great for simple drawings or photo edits. Easiest way to highlight specific buildings on map screenshots that I've found! Happy with my purchase.", "Fabulous drawing tool. Wonderfully versatile and you don't have to be a tech wiz to use it. Totally recommend!", 'Simple and good ... has features to undo, erase, clear and change colors ... the best!', 'For a few pennies I think this app is good fun. It used to be free but I think it is worth supporting this developer!', "It's like the best drawing app ever so when I make videos I'll make drawing videos I can do lots of thing great app so keep up the good work 😃", 'Simple, easy and nice, as it should be', 'Easy to sketch and draw quickly and saved very good', "It's good. Sad to see all the haters probably paid by competition to rate your apps poorly, don't let it discourage you :)", 'Good and handy tool, happy with it', 'Make it so that you can zoom everywhere and not just in the middle, good app tho', 'Great for quick doodles.', "I use it a lot and I like it, now that it's working again.", 'Simple and works great.', 'Good app for doodles.', 'Best for doodling fast', 'Great work boss.. Working as mentioned. All the best.', 'Great app for drawing', 'Thank you so much for your Xmas gift.'], 'appId': 'com.simplemobiletools.draw.pro', 'url': 'https://play.google.com/store/apps/details?id=com.simplemobiletools.draw.pro&hl=en&gl=us'}
