{'title': 'Simple Scrobbler', 'description': "A lightweight music meta-data sharing tool that submits information about what music you play on your android phone.\r\n\r\nSupports Last.fm, Libre.fm & ListenBrainz\r\n\r\nSupports most Music Apps for Android 8.0 Lollipop and higher, since version 1.5.9\r\n\r\nPlease note that some of the following applications require changing their default settings to enable scrobbling, for Android devices before Lollipop.\r\nSupported Apps: \r\nSpotify, Google Music, Deezer, Rhapsody/Napster, Rdio, My Cloud Player, SoundCloud, 8tracks, InfiniTracks, Squeezer, Amazon Music, Huawei, n7player, BuMP, PowerAMP, Black Player, AIMP,  Timber (Beta), Vanilla Music, SmartVanilla Music, Shuttle Music Player, Rocket Player, JRTStudio Android Music Player, PlayerPro, Jetaudio, jukefox, foobar2000, DeaDBeeF, GoneMAD Music Player, Folder Player, Neutron Music Player, Music Pump XBMC Remote (Beta), Music Folder Player, Meridian Player, MixZing, Archos Music Player, Radio Noise FM, Now Playing, SoundSeeder, MortPlayer, bTunes, WIMP, Just Playlists, RockOn, Apollo, Android Music Player, HTC Hero/Sense Music Player, MIUI Music Player, ServeStream, Default Sony Ericsson/Xperia Music Player, myTouch 4G, LG Music Player, DAAP Media Player, xenoAmp, Marine, MediaMonkey, Pulsar, more...\r\n\r\nSupported Languages:\r\nEnglish, French, Spanish, German, Russian, Portuguese, Polish, Czech . If you'd like to help translations, please open an issue on GitHub to get help or fork and add your translations.\r\n\r\nFor problems and feedback, please open an issue. SLS is on GitHub, and any and all contributions are welcome!", 'descriptionHTML': 'A lightweight music meta-data sharing tool that submits information about what music you play on your android phone.<br><br>Supports Last.fm, Libre.fm &amp; ListenBrainz<br><br>Supports most Music Apps for Android 8.0 Lollipop and higher, since version 1.5.9<br><br>Please note that some of the following applications require changing their default settings to enable scrobbling, for Android devices before Lollipop.<br>Supported Apps: <br>Spotify, Google Music, Deezer, Rhapsody/Napster, Rdio, My Cloud Player, SoundCloud, 8tracks, InfiniTracks, Squeezer, Amazon Music, Huawei, n7player, BuMP, PowerAMP, Black Player, AIMP,  Timber (Beta), Vanilla Music, SmartVanilla Music, Shuttle Music Player, Rocket Player, JRTStudio Android Music Player, PlayerPro, Jetaudio, jukefox, foobar2000, DeaDBeeF, GoneMAD Music Player, Folder Player, Neutron Music Player, Music Pump XBMC Remote (Beta), Music Folder Player, Meridian Player, MixZing, Archos Music Player, Radio Noise FM, Now Playing, SoundSeeder, MortPlayer, bTunes, WIMP, Just Playlists, RockOn, Apollo, Android Music Player, HTC Hero/Sense Music Player, MIUI Music Player, ServeStream, Default Sony Ericsson/Xperia Music Player, myTouch 4G, LG Music Player, DAAP Media Player, xenoAmp, Marine, MediaMonkey, Pulsar, more...<br><br>Supported Languages:<br>English, French, Spanish, German, Russian, Portuguese, Polish, Czech . If you&#39;d like to help translations, please open an issue on GitHub to get help or fork and add your translations.<br><br>For problems and feedback, please open an issue. SLS is on GitHub, and any and all contributions are welcome!', 'summary': 'A scrobbler that submits information on what music you play.', 'summaryHTML': 'A scrobbler that submits information on what music you play.', 'installs': '500,000+', 'minInstalls': 500000, 'score': 3.2940693, 'ratings': 16775, 'reviews': 5745, 'histogram': [4587, 1533, 1948, 1768, 6936], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.6M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'The SLS Team (Adam Renberg and others)', 'developerId': 'The+SLS+Team+(Adam+Renberg+and+others)', 'developerEmail': 'simple.last.fm.scrobbler@gmail.com', 'developerWebsite': 'https://simple-last-fm-scrobbler.github.io/sls', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8799068346962245676', 'genre': 'Music & Audio', 'genreId': 'MUSIC_AND_AUDIO', 'icon': 'https://lh3.googleusercontent.com/v_YFIS0eRQRDJfzx0_odhoBBMYsv_v3sR2NRQcLBR1vYw78uKy9M3j2X_vQdb5BP7uAm', 'headerImage': 'https://lh3.googleusercontent.com/w2HV0jhORVC__-OE9gaoSnECSoF7JVzP-QUWB3N4uzlPvPVlOq9HZrKoRZcWs4y9fg', 'screenshots': ['https://lh3.googleusercontent.com/PwitUP9iZLj67brgJHNKHLjXQt8khqKIslS7Ilttag85PJtHaxf-0TUwSjquyYcOMZ0', 'https://lh3.googleusercontent.com/S5wp5eEH1woKrXmq6V__ZJI3dU3uaXtAT1SxFFUWQNJTNa7Rs7qR7MVSCC0Rdl0S0g', 'https://lh3.googleusercontent.com/J6Gsz1T6wzJrX6SKvo7ZtBGpVRc54UTfurDop6LhbXPG3pNzEdniIOSkaqgZXcN_bRhU', 'https://lh3.googleusercontent.com/dVBUhja2R1g8wAsiYwAQNtzp3ZoxmNI_39GEQiddIdgPb2yoQGvJ1bnBD8cz11YhMQ', 'https://lh3.googleusercontent.com/83gXzOEmm3hsJjBp3pxNUnVfxCmFLYfinxz5yRYT9RvrNdlEH2ye3XXovkTvTKqO4Wo', 'https://lh3.googleusercontent.com/juN9TXqt-uzPp2O1wJy64HTpPoDNIyGEeS1GIk5KAZNwQWD-vKoeKHZ6hsZpSoXvK71y', 'https://lh3.googleusercontent.com/20Hu-J3k89ksXyrmTJoNQaASpq-VblZykKIQdGFwTgmZ5h-m0yQdoKHvDD6PzO1h8Kg', 'https://lh3.googleusercontent.com/BZLfcgSKbcbfqHQD5GQa95-bobi22pWr6TMUL0a5aXU_RTu2d5SVPgGHipjzTjNOX6o'], 'video': 'https://www.youtube.com/embed/nQDqhqkrjpo?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/nQDqhqkrjpo/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': None, 'updated': 1569157808, 'version': '1.7.0', 'recentChanges': '- 1.7.0 (2019-9-22) codename: mingus\r\n  * Login notification bug\r\n  * Music App Activity bug\r\n  * Rate Limit Exceeded status for Last.fm', 'recentChangesHTML': '- 1.7.0 (2019-9-22) codename: mingus<br>  * Login notification bug<br>  * Music App Activity bug<br>  * Rate Limit Exceeded status for Last.fm', 'comments': ["Have been collecting a massive cache of scrobbles since the start of the year that I cannot submit manually through the Submit option. Already sent an email a while ago to the support team with no reply as of yet. Nothing I can do works, I re-logged into my last.fm account to no avail (not clearing credentials as this would delete all my scrobbles). Guess I'll be stuck collecting scrobbles until the developer fixes this, though I may well move on begrudgingly to a different app which works.", "This app used to be great, but as of Oct 2019, it is very annoying. It has an un-dismissable notification constantly in my notifications which I finally got over. But if I'm not playing something, it goes and finds the default music app (which I don't use) and scrobbles a song that is on my phones storage approximately 6 times a day. Sometimes more sometimes less. But every few days, I log in to last.fm and have to delete 20 or 30 scrobbles of the same song I haven't listened to in a year. It also scrobbles every single youtube video I watch - music or not - basically making last.fm a public display of my private youtube history until I manually delete those scrobbles. That being said, it still mostly scrobbles everything I actually listen to, and I have faith that they'll fix the bugs.", "Used to be a great app. Does not work anymore. I have hundreds of scrobbles waiting to be uploaded but it's not happening.", "this is the best app for scrobbles! the only thing I want is the option to edit Album Artist, there are a few songs/albums that the album's artist is not the same as the Artist singing 🙂 when you guys put this option I'll give 5 stars 😂", "it used to work perfect and now randomly there is a huge list of unscrobbled songs stuck in ''cache''. I cleared the cache thinking it will then send the tracks to scrobble but no. WHY 2 options for clear cache? What the hell is is suppose to mean? I tried pressing scrobble now. NOTHING. All my scrobbles are vanished. jeez just great. This app makes me want to pull the hair from my head. Ive tried everything to fix it, every setting, permission, and several times i lost hundreds of scrobbles. Simple scrobbler my ass. You RUINED my last.fm it was perfectly accurate and now its ruined. I WANT TO SCROBBLE TRACKS THAT HAVE PLAYED. IS IT THAT HARD????????????????", 'Works with MediaMonkey and does a good job. Please consider to add the option to be able to filter unwanted scrobbles. I would love to get rid of all my scrobbles that have Artistname=Podcast.', "Ever since the last update, the scrobbling doesn't work at all (using Black player ex, tried notification metadata reading, too) and every activity of the app (when in foreground) keeps crashing. Edit: of course I am logged into my last.fm account. Edit2: after the now newest update, the app stopped crashing but it still doesn't scrobble. Edit3: App now scrobblers, but only if I keep the the foreground activity running. In the past, the service itself stayed alive and scrobbled even if I closed the activity (swiped it out of recent apps). I also turned battery optimization off & allowed this app to run in background.", "It just doesn't work anymore. Always used it with Foobar2000 but by now nothing works at all. Sad because this used to scobble perfectly in the background...", "Doesn't scrobble the correct album when using Youtube Music. Instead, it takes the album of the last song played prior then applies it to the recently scrobbled song even if they're different artists/albums. I can fix these using the Rule system but it's annoying when I have to edit every single song.", "This app used to work great but now it's completely stopped scribbling. I am on a Pixel 4. I confirmed my credentials are correct by logging into last.fm directly but the app still throws errors and won't connect anymore. I am very sad because I loved this app.", "Doesn't let me authenticate. It's not like it doesn't let me, it doesn't even try, I write my credentials and nothing happens. I rebooted, tried another day, while connected to another network, but nothing", "Has quit scrobbling for Rocket Player altogether. What little has been scrobbled is wrong. Ozzy Osborne when I haven't played any of him in months! I was playing Men Without Hats!", "On Android, when I set my music player to repeat one (repeat the same song), simple scrobbler just submits the song once no matter how many times I play that one song. I'm open to improve my rating once this problem is adressed.", "Works well with most of my music apps except Neil Young Archives which is a shame as I use it a lot. Seems to scrobble You Tube which I don't want but have found I can switch it off now. Otherwise great", "seems to be the only scrobbler that works with amazon music, great. except i never know when its working and always have to keep checking it to see if its doing anything. sometimes its great it does Amazon music but it doesnt seem to act on its own. you have to open it up all the time and keeo checking. maybe it's a bug or maybe its my phone but id love it to work without checking it all the time. UPDATED/EDIT Aug. 19. for my new phone, the Note 9. fails to work now, can't sign in", "App used to work. Now it doesn't work at all. I used to be able to listen to music without manually turning on the app, now I have to turn it on first, and there's an annoying notification that HAS to be there for it to scrobble, and it doesn't even scrobble 70% of the time. Idk what you did with your new updates, but your app doesn't work anymore.", "TLDR: This is a great app, but it would be good if there was an option to only scrobble/cache songs while offline.   This would be useful as it is possible to connect your last.fm account to spotify and scrobble without the need for apps like Simple Last.fm Scrobbler. However, it doesn't cache scrobbles when listening offline which is what I need Simple Last.fm Scrobbler for. So why not only use Simple Last.fm Scrobbler you ask? Because I havn't found a decent desktop program for scrobbling from spotify windows, therefore, I must connect spotify and last.fm, however, this feature can't be disabled in android.", 'It used to work nice and dandy, now I get stuck with a permanent notification, will update to say how much battery it drains as it\'s now always running, also "needs" to read all notifications we get. At the end, why tho? It used to work nicely, now it\'s mildly functional, but just after uninstalling and reinstalling. It was a solid 5 stars. Why u do dis to us?', "The app works as intended. BUT! Every time the Devs update the app (which is quite regularly over the last few months), it loses my Last.fm credentials. Even worse, it doesn't notify me that it's stopped scrobbling, and so stops working until I notice and login again. Most other apps can retain login details when they update, so I'm not sure what the problem.is here.", "This app used to work great, and true to its name it was simple. From what I can gather the unfortunate downfall of this app is due to changes with Android, and likely will be the case with other scrobblers too. Edit after tinkering and reading: Indeed Android changes are to blame, and all scrobblers are affected. I'll keep an eye out for the multiple scrobble bug, but so far I can continue to recommend this app. Unfortunately it seems to be a bad time for Android scrobblers.", "I've had this for years thinking it was scrobbling my music, but it turns out I forgot to re-enter my credentials at some point. My fault obviously, though I suppose a notification that I'm not logged in to anything when I start listening would be nice. Since noticing this I've tried to log in to last.fm and always get a network error. 4G, different WiFi networks, all the same.", "I've been using this app reliably for YEARS, but after updating to the latest version, with all its weird changes, nothing works anymore. I don't know how many of these changes were forced by the recent Google Play app policy changes, but something needs to be done, because it is dreadfully bad, useless, buggy, and misleading now. All lifetime scrobble stats are gone, the account was signed out, nothing gets scrobbled, and no scrobbles remain in the cache to even get properly scrobbled at one point after they failed to be saved to my account. The most I get is a song put out to Last.fm as 'Now Playing' but that's it. After the song finishes playing, it doesn't stay scrobbled, but just changes the song listed as Now Playing. This is a major problem. The app doesn't work at all anymore and I've missed a ton of scrobbles because of this. I feel bad for all those who auto update their apps and don't even realize their plays aren't being scrobbled anymore, can't imagine how many scrobbled were lost from this. The logo change is a welcome update and a notable improvement, and the themes are good even though they are tedious to enable and compare. Plus there's all the weird behavior with the new sticky notification dropdown entry which is totally useless, and the weird permissions it requires now. I'm sideloading an older version I had backed up for the foreseeable future, and so far it works flawlessly. Responding for the dev: I had already tried experimenting with various scenarios and they all resulted in the same broken state. I tried with app notification disabled/enabled in settings, changing the notification priority, etc., but nothing helped.", 'Great app, just works with every music app and that is one of the best things ever, It works with my Music app from my Xperia and I can listen on Hi-Res and scrobble to Last.Fm, Libre.Fm and MusicBrainz. How cool is that? I Fully recommend this app', 'After the update, the app has turned very unreliable. I have lost scrobbles due to the app crashing or randomly logging me out of Last.fm. It used to be able to scrobble pretty much everything with minimal effort on the user. It also now wants a lot more features in Android and the user interface for that seems to be rather buggy. On the plus side, it does display a notification informing the user that they have been randomly logged out.', "Scrobbling now works after I got a new phone. Keeps notifying about new apps discovered when it's already discovered them several times, which is slightly annoying.", 'Last update added an empty notification with "love" and "copy" buttons. Clicking it asks for random permissions, and skipping gives a nonsense message "Warning! Are you sure? - Warning will not Scrobble - Notification Listener". There is no explanation at all on the screen. This is in violation of the Android guide which requires permissions to be accompanied by an obvious reason for requesting them. Edit: updated to 1.6.7 as requested, no change. Still empty notification and nonsense messages.', "This app used to work great, but now appears to be almost completely broken. Persistent, undismissable notification, scrobbling tracks that haven't even been played, unscrobbled cache that is out of sync with what has actually been scrobbled to last.fm, etc... It's understandable that the devs needed to change how the app works to comply with modern Android API's, but they managed to completely ruin the app in the process. I don't like posting negative reviews, but until they fix it, stay away.", "After upgrade - random logouts, intrusive permissions (don't feed me with the github URLs, everything worked before upgrade), and what finally ended my patience - it scrobbled the whole album while I only listened to a few songs and then turned the player off. I'll go use some other app. UPD: Oh, and the empty notification that's always there also drives me crazy.", "Doesn't work anymore. Connection error but other apps work.", "EDIT: All of it sudden it works, don't know why and whatnot, but it works. Original Review: It won't scrobble via Poweramp in the current version. I tried everything. The previous version was flawless and didn't have this problem. I doubt anything will be done to fix this. No reason to fix what wasn't broken in the first place.", "don't use this scrobbler. it's broken and unusable. thanks for wasting my time, I have so many missing scrobbles now thanks to your incompetence.", "Last update (1.6.7) comes with a bunch of problems, apart for what was already referenced here, the app creates an empty notification and doesn't go away when I try to kill the app as it drains a lot of battery, it's not scrobbling like it should, and scrobbles a bunch of songs I already listened on my PC on spotify just because it went to the spotify mobile cache", "Used to work great before the most recent update. I'm on the newest version (not beta) and am being repeatedly logged out of last.fm. Also, if I put a single song on loop, that song is only scrobbled once for the first time it is played. Disappointed with this latest updated, because the app used to work so well.", 'I\'ve disabled the active notification in the app options, just as the devs have repeatedly instructed people to do, and it still leaves a permanent notification that I can\'t swipe away Scrobbled a random song by a random artist I\'ve never heard of over 100 times, from "android music player apps", I don\'t know what this is but I only use two music players and this is neither of them, this happened over several weeks before I noticed. Might be the phone ringtone being scrobbled? I have no idea', "No idea what they have done with this app since I last used it but I just installed it and now it asks for lots of permissions for unclear reasons and it also shows a permanent empty notification. The permanent notification is absolutely unacceptable for any app and doesn't even fill any function here what so ever since it's completely empty except for the app name. There are also nonsensical error messages displayed if you try to proceed without giving the app all permissions.", "Worked Perfectly for years. Last week's update deleted all scrobbles in Cache and now nothing will scrobble. I now have to uninstall and try to find a different scrobbler. Too bad. This was a very easy and good app to use. If the developer would just give me back my old version than I would Scrobble in peace. Let me know when you get the bugs fixed.", 'Tried relogin and apps still not detected. v 1.6.7 does not scrobble. I reinstalled and logged in and it will not even detect any supported music apps anymore even as music is playing from PowerAMP. What is going on? This app was working fine until about two weeks ago and was seemingly fixed until about 9/16, when this new update saw all the previous issues return. Please fix!', 'I was able to find Last.FM again in Play and reinstall it. I would like to know how SimpleScrobbler got on my phone since I don\'t recall ever browsing the Play store, selecting SimpleScrobbler and thinking, "I want this," while tapping Install. It feels like it was attached to another app update install with a EULA the size of the Holy Writings since 10,000 A.D.. Like the "Human Centipede" episode of South Park. I will remove my review, shortly.', "This is a good app, I've used it for almost two years. But the only thing, the new updates erase any cached scrobbles. And after one updates, scrobbles don't automatically resume until one opens the app post update. Just make sure you scrobble before you update and open the app after you update so you don't lose any data.", "Garbage app with unnecessary options. Only thing good is that it's the only app that accurately scrobbles Pandora's album titles."], 'appId': 'com.adam.aslfms', 'url': 'https://play.google.com/store/apps/details?id=com.adam.aslfms&hl=en&gl=us'}
