{'title': 'Simple Flashlight - Bright display & stroboscope', 'description': "A clean flashlight with an extra bright display, customizable stroboscope and a predefined SOS mode.\r\n\r\nAll these functions can be hugely helpful under certain circumstances.\r\n\r\nThe Bright display can have its color changed, opening a new world of possible uses. It can come handy in case you want to see your wider proximity without blinding yourself.\r\n\r\nThe stroboscope can have its frequency changed, ranging from really fast blinking to occasional ones.\r\n\r\nIf this free flashlight is turned on via the app (not widget), it will prevent the device from falling asleep. The strong torch can optionally turn on at launching the app, but it isn't mandatory.\r\n\r\nComes with a 1x1 widget with customizable color and transparency.\r\n\r\nIt comes with material design and dark theme by default, provides great user experience for easy usage. The lack of internet access gives you more privacy, security and stability than other apps.\r\n\r\nContains no ads or unnecessary permissions. It is fully opensource, provides customizable colors.\r\n\r\n<b>Check out the full suite of Simple Tools here:</b>\r\nhttps://www.simplemobiletools.com\r\n\r\n<b>Facebook:</b>\r\nhttps://www.facebook.com/simplemobiletools\r\n\r\n<b>Reddit:</b>\r\nhttps://www.reddit.com/r/SimpleMobileTools", 'descriptionHTML': 'A clean flashlight with an extra bright display, customizable stroboscope and a predefined SOS mode.<br><br>All these functions can be hugely helpful under certain circumstances.<br><br>The Bright display can have its color changed, opening a new world of possible uses. It can come handy in case you want to see your wider proximity without blinding yourself.<br><br>The stroboscope can have its frequency changed, ranging from really fast blinking to occasional ones.<br><br>If this free flashlight is turned on via the app (not widget), it will prevent the device from falling asleep. The strong torch can optionally turn on at launching the app, but it isn&#39;t mandatory.<br><br>Comes with a 1x1 widget with customizable color and transparency.<br><br>It comes with material design and dark theme by default, provides great user experience for easy usage. The lack of internet access gives you more privacy, security and stability than other apps.<br><br>Contains no ads or unnecessary permissions. It is fully opensource, provides customizable colors.<br><br><b>Check out the full suite of Simple Tools here:</b><br>https://www.simplemobiletools.com<br><br><b>Facebook:</b><br>https://www.facebook.com/simplemobiletools<br><br><b>Reddit:</b><br>https://www.reddit.com/r/SimpleMobileTools', 'summary': 'Free beautiful flashlight, no ads. Has torch, SOS, stroboscope, bright display.', 'summaryHTML': 'Free beautiful flashlight, no ads. Has torch, SOS, stroboscope, bright display.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.58, 'ratings': 860, 'reviews': 348, 'histogram': [51, 0, 43, 68, 696], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.0M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Simple Mobile Tools', 'developerId': '9070296388022589266', 'developerEmail': 'hello@simplemobiletools.com', 'developerWebsite': 'https://simplemobiletools.com', 'developerAddress': 'Hviezdoslavova 7, Košice 04001, Slovakia', 'privacyPolicy': 'https://simplemobiletools.com/privacy/flashlight.txt', 'developerInternalID': '9070296388022589266', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/rl6gXok3qzIuIlFnBGqYkDwllBUWk9hG2yzw5CBjub0mwCllwdOzO7ZEuNZXmUcj0jk', 'headerImage': 'https://lh3.googleusercontent.com/yqoXghiFmw7vITb3jeVus37-3kVNO0sdwEN1HwfbNGl0mAalv6ZW_nJ9BOfCF1vZn1wn', 'screenshots': ['https://lh3.googleusercontent.com/pcCIF_0FG8yfaRR572wLoSHvAk8Fx3jk2taEdit-2iQD5pCzJ0HTeEYQ8eqeWA-bMLs', 'https://lh3.googleusercontent.com/Pg4nVWYW09DScxsBj-TYALzeMv-vMkpAjHdepJIlaEpn0vfPNph4mr3ffPeWo2-_Ig', 'https://lh3.googleusercontent.com/J0Sea2T2gcHy42wyM7jqhZl6h82XXMN5u2vVBizkhJlhHYtRmIbaUZlxoYE4vCtqCLz5', 'https://lh3.googleusercontent.com/CXht1wr3B5dROd1XqyT1swTG8wp9vF7WQCodnWP8klWKEp60we_5Tz3K7uVDjPOhfaY', 'https://lh3.googleusercontent.com/khOdRcXTQQkPSvzYqz6iybXhMNg92YYfEhAMLAe22eWL2B90FpbR8Rv_m8AJVZichw'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 5, 2016', 'updated': 1590400018, 'version': '5.1.1', 'recentChanges': 'Updated the app icon on lower Android versions\r\nAdded a Bright Display shortcut\r\nRemoved the Camera permission on Android 7+', 'recentChangesHTML': 'Updated the app icon on lower Android versions<br>Added a Bright Display shortcut<br>Removed the Camera permission on Android 7+', 'comments': ['Everything is fine.. except one. The flash light turns off automatically after the screen is switched off. Please fix that. Besides that i loved the stroboscope feature.', 'Widget doesn\'t work if I restart Nova Launcher, until I go to "Customize widget colors" in the app.', "Almost perfect. One thing I'd like to see is a second widget for one tap for bright screen in addition to the existing widget for flash. Thanks!", "My favourite torch app. So simple, so good, as it's name says. Bought it.:-)", 'Please consider this. One more simple button & this app will be the best. A button to turn off automatically after 10sec, 30 sec,.... 3 min etc.', 'I wish more smartphone owners (thus app users) knew the concerns involved with unwarranted app permissions. This app is GREAT. But (sigh) most people probably do not understand why. Thanks, devs, for your work!', 'Use it to see in small dark places to examine and make repairs. Also good for locating small objects that are in dimly lit or dark spaces.', "Great use it alot to find things by putting more light in the area. Don't have to find a flashlight this v one is always with me.", 'The best all in one flashlight with no adds', "This app Doesn't let us Increase and decrease brightness of flash.", 'Simple and useful.', 'It is definitely what it says. SIMPLE. Love the customization features.', 'Excellent! All three options (flashlight, bright display and stroboscope) at my fingertips, finally. Makes it easy to alter and combine. Love the option to change the colour of the bright display. That proved to be a very useful addition that came in handy for all kinds of scenarios, like manipulation of light in photography (warm/cold), or choosing complementary paint colours. Brilliant!', 'Quick and easy to use', 'Ohmygod. I seriously LOVE your app. I hate having the app staying on my screen notification bar even after I quit the app. Your apps works well. There is backlight and frontlight and the blinking light. All package in one. It also use lighter space than my previous flashlight app. NO ads at all too. Thank you hey developer! :)', 'After trying many other apps, I found this to be the best. The light is crisp and bright, there are no irritating - do people really believe ads that disrupt apps work? - ads and the app has a clean, well thought-out ux.', 'Simple to use, clean interface, has all features & most importantly no adds. 5 🌟 from me', "I LOVE how the flashlight Really turn off when I turn it off and no app lingering on the notification bar while it's on or even when it's already turn off. This is what keeps this app installed even now. No app BEGGING me to turn it on or turn it off on my notif bar.", 'A godsend considering how many flashlight apps pollute Google Play with a zillion permissions and ads. Some even contain malicious code. This does not.', 'Nice features for such a small app.', 'best flashlight app. no ads. just simple and loads quick.', 'Works well but because of your recent abandonment of your apps you get 1 star. Installed this app, saved the APK encase you remove the Simple Apps from the Play store.', 'Finally a simple flashlight app with the necessary features and necessary options excellent work!', "Free and versatile! Best of all I've tried.", 'Simply the best. On/Off/Strobe, screen color. Thank you so much', 'The best and safest flashlight. Privacy friendly and light.', 'I love the bright display and customizable stroboscop.', 'Very useful app when walking my dogs and have left main flashlight at home', "It's simple and it works", 'No ads. Ever.', "I really like that there's no ads.", 'Simple and excellent', 'Simple but useful app.', 'Not bright enough', 'Simple and perfect', 'please add front Flash Light & and App Widgets options', 'SOS could be better. Should be a pause, like SOS ... SOS ... SOS', 'Boy Howdy, it lights stuff right up! 😉🔦', "My 'Go To' cell phone flashlight!", 'Good bright. Light'], 'appId': 'com.simplemobiletools.flashlight', 'url': 'https://play.google.com/store/apps/details?id=com.simplemobiletools.flashlight&hl=en&gl=us'}
