{'title': 'Simple Calculator - Do your calculations quickly', 'description': 'This stylish modern calculator offers great user experience that you will love seeing. You can copy the result or formula to clipboard by long pressing it.\r\n\r\nThe app is a simple helper for fast calculations with many basic functions including multiplying, dividing, root and powers.\r\n\r\nYou can make it vibrate on button presses to make you confident during inserting your values.\r\n\r\nThere is an option to prevent the phone from sleeping while using the app for comfortable usage.\r\n\r\nThe text color of the resizable widget can be customized, as well as the color and the alpha of the background. Press the result or formula in the widget to open the app.\r\n\r\nIt comes with material design and dark theme by default, provides great user experience for easy usage. The lack of internet access gives you more privacy, security and stability than other apps.\r\n\r\nContains no ads or unnecessary permissions. It is fully opensource, provides customizable colors.\r\n\r\n<b>Check out the full suite of Simple Tools here:</b>\r\nhttps://www.simplemobiletools.com\r\n\r\n<b>Facebook:</b>\r\nhttps://www.facebook.com/simplemobiletools\r\n\r\n<b>Reddit:</b>\r\nhttps://www.reddit.com/r/SimpleMobileTools', 'descriptionHTML': 'This stylish modern calculator offers great user experience that you will love seeing. You can copy the result or formula to clipboard by long pressing it.<br><br>The app is a simple helper for fast calculations with many basic functions including multiplying, dividing, root and powers.<br><br>You can make it vibrate on button presses to make you confident during inserting your values.<br><br>There is an option to prevent the phone from sleeping while using the app for comfortable usage.<br><br>The text color of the resizable widget can be customized, as well as the color and the alpha of the background. Press the result or formula in the widget to open the app.<br><br>It comes with material design and dark theme by default, provides great user experience for easy usage. The lack of internet access gives you more privacy, security and stability than other apps.<br><br>Contains no ads or unnecessary permissions. It is fully opensource, provides customizable colors.<br><br><b>Check out the full suite of Simple Tools here:</b><br>https://www.simplemobiletools.com<br><br><b>Facebook:</b><br>https://www.facebook.com/simplemobiletools<br><br><b>Reddit:</b><br>https://www.reddit.com/r/SimpleMobileTools', 'summary': 'A calculator for quick simple calculations with a nice user interface and no ads', 'summaryHTML': 'A calculator for quick simple calculations with a nice user interface and no ads', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.55, 'ratings': 474, 'reviews': 190, 'histogram': [23, 9, 28, 33, 379], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.5M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Simple Mobile Tools', 'developerId': '9070296388022589266', 'developerEmail': 'hello@simplemobiletools.com', 'developerWebsite': 'https://simplemobiletools.github.io', 'developerAddress': 'Hviezdoslavova 7, Košice 04001, Slovakia', 'privacyPolicy': 'https://simplemobiletools.com/privacy/calculator.txt', 'developerInternalID': '9070296388022589266', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/ts00gtopPh_RZaU7PMedqsov0tN6lcOxognM2eOpQAdQ82Fp4hpDfpPaKqlBZV2S-_I', 'headerImage': 'https://lh3.googleusercontent.com/0Qf8iWqaGKiGwvhPmWyEM0D0tWlR2DVJeEXJdku8wEwFtwSsVgKmAiTztlQrhoaCB1mm', 'screenshots': ['https://lh3.googleusercontent.com/yLi6igC8YFKlVq_JWmQOylQxhFFzzyLU3-z5gBs3qQcjGa-CwwxaH7G57tcZsQJA680', 'https://lh3.googleusercontent.com/u5xXkYj3BO3DPAPoeWBCoLxG8LmTCA0SwNloB9PiINfIc8h_LNp4MIOKn0dPtarw9PQ', 'https://lh3.googleusercontent.com/xaVoNQbhUTApfq--iTafkAEO3XkbTrBFw2OFnBZ5gSkL8KLS4IXCTQrbMvOzPpvOFA', 'https://lh3.googleusercontent.com/i0TnJ36FN4SYYFyo6ZiMpl8PF-b_GMPJ_V17o6L1666HnwcN9_xY3HjOwC6cUcqMo9wK', 'https://lh3.googleusercontent.com/0uxbiBnUOQbIg44fS8jl-FuKKvfftC6PWLhNfWqDIvWR7nuU1DItHMmtzyX0oeC81LU'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 5, 2016', 'updated': 1590354765, 'version': '5.2.0', 'recentChanges': 'Use a nicer app icon on lower Android devices\r\nAllow making the widget smaller as before\r\nUse rounded corners at the widget\r\nShow a warning at dividing by zero (by ochagovdanil)\r\nCouple other translation and UI improvements', 'recentChangesHTML': 'Use a nicer app icon on lower Android devices<br>Allow making the widget smaller as before<br>Use rounded corners at the widget<br>Show a warning at dividing by zero (by ochagovdanil)<br>Couple other translation and UI improvements', 'comments': ["Simple is Best. All their apps do what they say on the tin without grabbing unnecessary permissions or popping up with bothersome notifications you don't need to see. Wholesome and trustworthy. Get Simple, be happy.", "Perfect calculator. Numbers are supposed to be boring, I think. Right numbers, right equations, same darn answer *every* time! I've replaced any native app I can with yours. Thanks.", "Not good... you can't put a small shortcut on your desktop, and the widget takes up a full desktop page with numbers that are hard to see against any kind of photo background. Needs more work!", 'A replacement for the Google calculator that comes pre-installed in Android. This is a good alternative if you hate Google, otherwise there is no reason to use it as it ads nothing.', 'i am using your 4 apps permonent level.... i will suggest you to create your custom Rom with your apps... you have bright future.... and just go in same way.... your apps are light in size,no uses more RAM, keeeeeeep it up😀', 'It does exactly what it says on the tin. No ads, no BS.', "I was helping my mom setup her phone and found that even the pre-installed basic calculater made connections to the internet. I don't 100% like how Simple Mobile Tools builds their apps, but they're way better than what comes with computers these days.", 'Does what it says on the tin, clean and simple. Also this app has zero trackers and zero permissions, so props to the developers for that 🙌', 'Excellent. Very difficult to get simplicity these days. Only working widget calculator on the market. Thank you.', 'I like the privacy orientation of your development, however this calculator currently falls short for me. Really need a scientific calculator, not just these basic functions.', 'Even calculator is possible to do better than others.', "It's not simple, you have to hold down clear button to restart. You cant do correct math problems without restarting.", "Perfectly simple, but more than that, it has a themeable flat widget that allows custom colors. Which is exactly what I needed. I've been using it for way too long before realizing I hadn't reviewed it. It's one of those apps that is so simple, but useful you just don't think about it, even using it daily. That's a good thing.", "It's nice to have the dark theme for my calculator back after Google ruined the Stock Calculator application with a bright, white theme. But please, please allow an entire formula to be typed in before calculating rather than one number at a time!", 'Famn I thought I found the perfect calculator app! This looked very nice and clean, and had some awesome customizations. But I discovered there is no delete button to erase a digit if you hit a wrong one by mistake!!! That pretty much makes it useless. Uninstalled.', 'Great and very simple application! Huge amount of customisation for your pleasure. But only one little problem with percentage counts, they are really strange', 'Good But Widget Has Weird Glitch. Everytime I use widget at every third or fourth press it brings up my toggle screens. Is it supposed to do that? Kind of annoying. I have the donated version installed.', 'Does not show the selected operation in the widget window, meaning there is no way to know if you hit multiply or fat fingered the key and are actually subtracting untill after the fact.', "Hope more functions can be added to bring it to par with Google calculator. Really want to use this instead of Google's. Missing functions include trig, pi, a, log, ln, parentheses, etc.", "App doesn't support screen rotation, remains fixed in portrait mode.", "Fantastically simple calculator app with everything you need, and none of what you don't.", 'Simple, effective, and customisable. Love it!', 'Great basic calculator, would be nice tho if it showed more than two past operations', 'It is a good looking app but installed storage usage is alot for a simple calculator', 'Percent operator is very strange and not a simple function: 1%99 = 0.0099 99%1 = 0.9801 2%99 = 0.0396 99%2 = 1.9602 3%100 = 0.09 100%3 = 3', 'Just installed, works well, easy to use.', "Natural feel is epically designed into this application,;')", 'No landscape view I would like to see more features in the app', 'This app is awesome I love your apps so useful thanks for your hard work to make awesome apps', "Percentage button doesn't seem to do anything", 'Great lightweight calc app with custom theming', 'There are no advanced functions.', 'Simple and clean. Thank you.', 'Works great. Simple.', 'Great simple calculator app', "Can't go wrong with this calculator for my needs. Always recommend this to my friends", 'Easy to use..', 'Transparent Calculator widget Woow 😍', '"131118..kfr..thank\'s..."', 'Best calc ever in the galactic. No permissions needed'], 'appId': 'com.simplemobiletools.calculator', 'url': 'https://play.google.com/store/apps/details?id=com.simplemobiletools.calculator&hl=en&gl=us'}
