{'title': 'Simple Clock - Alarm, Stopwatch, Timer, No Ads', 'description': "The app has multiple functions related to timing.\r\n\r\nAt the clock you can enable displaying times from other timezones, or use the simple, but customizable and resizable clock widget. The text color of the widget can be customized, as well as the color and the alpha of the background.\r\n\r\nThe alarm contains all the expected features as day selecting, vibration toggling, ringtone selecting, snooze or adding a custom label. Waking up will be a pleasure. It supports as many alarms as you want, so there won't be any more excuses for not waking up :) Gradual volume increasing is supported too, enabled by default. A customizable Snooze button is available too, just in case you really had a good reason for using it.\r\n\r\nWith the stopwatch you can easily measure a longer period of time, or individual laps. You can sort the laps in a few different ways. It contains optional vibrations on button presses too, just to let you know that the button was pressed in case you cannot look at the device for some reason, or you are in a hurry.\r\n\r\nYou can easily setup a timer to be notified of some events. You can both change its ringtone, or toggle vibrations. You will never burn that pizza again. The timer countdown can be paused too, not just stopped.\r\n\r\nAdditional features include for example preventing the device from falling asleep while the app is in foreground or toggling between 12 or 24 hour time format. Last but not least you can decide if the week should start on Sunday, or Monday.\r\n\r\nIt comes with material design and dark theme by default, provides great user experience for easy usage. The lack of internet access gives you more privacy, security and stability than other apps.\r\n\r\nContains no ads or unnecessary permissions. It is fully opensource, provides customizable colors.\r\n\r\n<b>Check out the full suite of Simple Tools here:</b>\r\nhttps://www.simplemobiletools.com\r\n\r\n<b>Facebook:</b>\r\nhttps://www.facebook.com/simplemobiletools\r\n\r\n<b>Reddit:</b>\r\nhttps://www.reddit.com/r/SimpleMobileTools", 'descriptionHTML': 'The app has multiple functions related to timing.<br><br>At the clock you can enable displaying times from other timezones, or use the simple, but customizable and resizable clock widget. The text color of the widget can be customized, as well as the color and the alpha of the background.<br><br>The alarm contains all the expected features as day selecting, vibration toggling, ringtone selecting, snooze or adding a custom label. Waking up will be a pleasure. It supports as many alarms as you want, so there won&#39;t be any more excuses for not waking up :) Gradual volume increasing is supported too, enabled by default. A customizable Snooze button is available too, just in case you really had a good reason for using it.<br><br>With the stopwatch you can easily measure a longer period of time, or individual laps. You can sort the laps in a few different ways. It contains optional vibrations on button presses too, just to let you know that the button was pressed in case you cannot look at the device for some reason, or you are in a hurry.<br><br>You can easily setup a timer to be notified of some events. You can both change its ringtone, or toggle vibrations. You will never burn that pizza again. The timer countdown can be paused too, not just stopped.<br><br>Additional features include for example preventing the device from falling asleep while the app is in foreground or toggling between 12 or 24 hour time format. Last but not least you can decide if the week should start on Sunday, or Monday.<br><br>It comes with material design and dark theme by default, provides great user experience for easy usage. The lack of internet access gives you more privacy, security and stability than other apps.<br><br>Contains no ads or unnecessary permissions. It is fully opensource, provides customizable colors.<br><br><b>Check out the full suite of Simple Tools here:</b><br>https://www.simplemobiletools.com<br><br><b>Facebook:</b><br>https://www.facebook.com/simplemobiletools<br><br><b>Reddit:</b><br>https://www.reddit.com/r/SimpleMobileTools', 'summary': 'Combination of a beautiful clock with widget, alarm, stopwatch & timer, no ads', 'summaryHTML': 'Combination of a beautiful clock with widget, alarm, stopwatch &amp; timer, no ads', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.26, 'ratings': 469, 'reviews': 242, 'histogram': [14, 32, 46, 98, 276], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.4M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Simple Mobile Tools', 'developerId': '9070296388022589266', 'developerEmail': 'hello@simplemobiletools.com', 'developerWebsite': 'https://simplemobiletools.com', 'developerAddress': 'Hviezdoslavova 7, Košice 04001, Slovakia', 'privacyPolicy': 'https://simplemobiletools.com/privacy/clock.txt', 'developerInternalID': '9070296388022589266', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/oXkdE6zzvfvHhq3-WXRixTjuf0sY1OKVYlCOtjrRTGt5YEJe7hchyfPChwsrewdAxMmw', 'headerImage': 'https://lh3.googleusercontent.com/i5VcMSDrkR0RdChfZle2_1sF9zxiAUaXQjx3h8-nwcNzDFc6gKwj-LBYEcSpbC_WegY', 'screenshots': ['https://lh3.googleusercontent.com/5eDF94kVTuYiBc6r9dTOyVeRoCEzQqxABCLkIp-2yKYhrb5XdH5OZRvm7lljb-3ZuFE', 'https://lh3.googleusercontent.com/Vs1UhQd9wO90X0pMPyo7TMEnP6Q0fpT9nz2qkFi-BbJ-sKLlg5pJTt3QzPR7CwVdHEY', 'https://lh3.googleusercontent.com/RhOraTAdc_Fu_GVVyKvLxIWYdkWShC0lZmAH_MQ1FYlPYKwXFGHx0SFkcvQRXaYiWX8', 'https://lh3.googleusercontent.com/9CcXvKzcJrYpLxYRR60p5Arqhec64TLvlaIY-B198TPLfZpZFH_6N6GpqyJEjjrWv5QU', 'https://lh3.googleusercontent.com/XQ2CV_GKkXzGTui6uusUOEq42iPZm9L7L3wqhdZSj4glijhRggcy1x6_DKxPIZoExw', 'https://lh3.googleusercontent.com/ErdsETSq2vy9HCzBkO7MHFBtaqYO2WbNFqrtK_rNE_p1SUkFz-y-Mn28GCAsKSzIRiI', 'https://lh3.googleusercontent.com/4rHInJepiWQfbHEfQAp8GpdlVm5lwUe6oqjkNUGUBhf4ViynvV-LByfRI1jrgIUbrFpq', 'https://lh3.googleusercontent.com/AptrXr3sdK4xLo0l3sOKK7ICGqb6Bp6oal6Ev8rhgKCmjseOy4JBGQ86xptlzG9RxPM'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 13, 2018', 'updated': 1590687359, 'version': '5.2.2', 'recentChanges': 'Use rounded corners at the widget\r\nProperly reschedule new alarm when dismissed\r\nAdded some other UI and translation improvements', 'recentChangesHTML': 'Use rounded corners at the widget<br>Properly reschedule new alarm when dismissed<br>Added some other UI and translation improvements', 'comments': ["Love the other apps by this developer, but this one is too basic. For example, the AM/PM shown in the widget is lowercase ( 9:00 a.m. ) which is... not attractive. And the font used seems to be the developer's choice, rather than the system font or something that is selectable. Other apps are great. I've bought paid versions of several of them.", "Great app. unfortunately one major issue for me. I have a Samsung Galaxy running Android 10 that, using Samsung inbuilt app., auto-optimises & auto-restarts to a schedule. No issues on auto-optimise but on auto-restart it 'holds' at screen lock (as it should) but the alarm doesn't sound. Samsung's own & Google alarms don't have this problem - any chance of a fix so I can give this app. the 5* it deserves?", 'Good multi-function app, but would be better with a few small additions: TTS voice output at customizable intervals stating time elapsed/remaining, timer options for ascending volume and mini-alert at customizable time (e.g. 1 minute remaining), speech input for timer, and ability to create, name, & choose timer presets. Also, timer should update to new duration when changed, not when started. It also seems odd that tapping on timer time resets it instead of showing time selection dialog.', 'Excellent replacement app for Timely. NO intrusive permissions and AWAKES when sleeping. Yayy ! One thing though, I can\'t seem to get the timer sound to play anything other than "Spring". ? EDIT: After reading comment of John Smith, sound selection does change after toggling vibrate switch on/off in Timer. Needs a fix, though.', 'I\'ve got "exception" message in place of the timer, after the alarm was turned off. I usually set an alarm, and after turning it off, the next time I open the app, it continues the sound like if the alarm was set when I touch the Clock app. Is true I had battery save mode on, maybe has something to do with the issue.', 'Please add an option to disable opening the app if tapped on the widget. Let it just show the time, if I want to go to alarm I simply go to the app.', 'Excellent app, as all other Simple apps! Well done! Can you add a duration of the increasing sound? I think it peaks up very quick. Also on alrm, can we have a quick add with no requirement of day?', 'This is a beautiful app in a jumble of overly complicated or ugly or difficult-to-use apps. This just needs multiple timers facility. Can you implement this while maintaining simplicity?', "Superb app, but sometimes alarms do not start, nevertheless battery optimisation is disabled. The are shown in the notification bar, but just don't start at the select time. Except this small bug, the bug is great. I love the clock widget.", "EDIT: Toggling 'vibrate' on and off after changing the alarm sound forced it into effect. Devs: fix this bug. Old review: Unable to set a different sound for timer from the alarm. Setting a different sound does nothing.", 'the snooze and dismiss patterns are very similar, you could easily mistake! you should put a tap on the screen for snooze, and a bottom swipe for dismiss.', 'Its good. Add more fonts to make it better.', "I tried the alarm today and it wouldn't turn off I couldn't find how to turn it off so I restarted my phone that worked. Please fix this", 'Good simple app. Takes too long to use pad for selecting time: new alarm > click on time > click on pad > click on hours > click on minutes > Ok > Ok', "Widget lags a bit mostly by 4 mins . Otherwise it's a great app", "The latest version works great if I turn off the phone 's power saving mode.", "Alarms don't sound, even after I disabled battery optimization. Android 8.1", 'Unable to change the timer tone...is there any ways I can do ?', "It doesn't work on my device. I lock the screen, timer stops. I even added the app to battery optimization exceptions. It didn't help. Android 8.0. I don't have the time to troubleshoot. uninstall.", 'Easy to use. Very reliable!', "The alarm didn't go off on some days, did on others.", 'I like this so far, but I have set multiple timers, and they will not trigger until I turn my screen on. Not that great when I am using it for cooking. || Alright, thank you. || Also, now the entire time my timer is counting down my phone is notifying my with a alert sound, but not the timer alarm sound. Looking forward to the updates, the other Simple apps I have used are great.', 'Good for appointment 👍', "The app runs fast, is customizable and doesn't turn your phone on when an alarm time comes... That's where the good things end here. If your phone is off and the alarm time passes, the next day if the phone is on but you haven't opened the app and turned the alarm off and on again, it won't go off... If you have a timer on, and turn off the screen then the timer will pause and not run. The stopwatch will do the same. I'm a bit disappointed because this app was supposed to be so good, and my experience has been quite poor at best.", 'This app is a nice, simple clock. Problem: in my Moto Z3 the alarm clock is tied to the system ringer volume, not the system alarm volume! This is particularly problematic for those times when I like to sleep undisturbed and turn my ringer off, and hope to wake up on time and turn the alarm ringer all the way up. Please fix, and 5 stars are coming!', "The only things this needs to be a full replacement for Google's clock app is the ability to create multiple timers and use custom fade-in durations. Note: The app does not see sounds placed in storage/Alarms/ without the storage permission, so be sure to grant it if you need this. (The app itself doesn't seem to make this clear.) As well, custom sounds will become silent if you delete the added sound from its original location, so be careful! (The app should add a warning/fallback for this.)", "Only thing I miss is that the alarms don't work when the phone is switched off. I refuse to waste energy leaving my phone on while I sleep. Build it in please or build it in another clock alarm app (one that keeps counting the seconds until the alarm alarms when switched off) Android 9 still alarms do not work when phone is switched off. How hard can it be to allow alarms to wake up the phone?", 'The app is simple and small enough for what I needed, no location or install referrer permissions. So I was happy. But then I realized it does not always sound when I set the alarm or countdown. Which made me miss a few appointments, before I uninstalled.', "Does exactly as it was designed to do. The widget responds to every size appropriately, by adding a new line or enlarging the text to ensure nothing is cut off but filling as much as possible. No need to re-add widgets to change colors either, because the options open right up to whatever HTML color code desires. Another stupidly simple app that's just plain old no nonsense simplicity. Some people rant about FOSS, but really KISS is the philosophy that takes precedence. Well done. ;)", 'Nice but one small glick. The round " + " (add) alarm button hides the last lower item on/off swich. Ps: after several missfired alarms i decided to uninstall', "Works great on my Note 9 ! No issues. Changed my review. Sorry. Worked great for first 3 wks. Then started randomly misbehaving. Today, didn't wake me up for work. Will have to uninstall if it can't be fixed.", "Nice and simple. It doesn't do much more than the stock clock on my phone, and both don't have adds, so for me there's no point in allocating storage for two very similar clock apps", "A nice simple clock, but the alarm function needs some work. It doesn't seem to be using the alarm channel for volume, and even with the app excluded from battery optimisations it's not waking the device to sound the alarm.", 'Experiencing issues. If screen goes off, timer does not ring. Alarm in morning does not always trigger.', 'Widget shows nonexistent alarm at 7:30am tomorrow morning. I use another app for my alarms. Why is this showing up?', "No option for a one time non repeating alarm. I usually change alarm every day & like to keep it off some days. V difficult to do it with this app as it will accept only repeating alarms. If I deselect all 7 days then app doesn't allow.", "Really like the apps you develop but this app gets killed by the system, I don't want to turn off doze and I already have battery optimalization off. please add the option for a persistent notification when an alarm is on so the app doesn't get killed", 'Would be great if the alarm function worked. The app gets stuck on the screen that comes up when the alarm rings. Uninstalled until this is fixed.', 'Love your suit range, but stopwatch and timer not work for me, out of sync. Had to go to clock + another open source software. Please fix so i can come back as i have uninstalled :(', "there are no one-time alerts? you have to be kidding... also: volume and snooze time should be configurable per alarm. otherwise it looks nice. i really don't understand why you force me to have alarms repeated by weekdays this has to be a joke"], 'appId': 'com.simplemobiletools.clock', 'url': 'https://play.google.com/store/apps/details?id=com.simplemobiletools.clock&hl=en&gl=us'}
