{'title': 'Sky Map', 'description': 'Sky Map is a hand-held planetarium for your Android device.  Use it to identify stars, planets, nebulae and more. \r\n\r\nOriginally developed as Google Sky Map, it has now been donated and open sourced.\r\n\r\n<b>Troubleshooting/FAQ</b>\r\n<i>The Map doesn\'t move/points in the wrong place</i>\r\nMake sure you haven\'t switched into manual mode.  Does your phone have a compass? If not, Sky Map cannot tell your orientation.  Look it up here: http://www.gsmarena.com/ \r\n\r\nTry calibrating your compass by moving it in a figure of 8 motion or as described here \r\nhttps://www.youtube.com/watch?v=k1EPbAapaeI.\r\nAre there any magnets or metal nearby that might interfere with the compass?  Try switching off "magnetic correction" (in settings) and see if that is more accurate.\r\n\r\n<i>Why is autolocation not supported for my phone?</i>\r\nIn Android 6 the way permissions work has changed.  You need to enable the location permission setting for Sky Map as described here:\r\nhttps://support.google.com/googleplay/answer/6270602?p=app_permissons_m\r\n\r\n<i>The Map is jittery</i>\r\nTry adjusting the sensor speed and damping (in settings).  We have a better solution coming soon!\r\n\r\n<i>Do I need an internet connection?<i>\r\nNo, but some functions (like entering your location manually) won\'t work without one.  You\'ll have to use the GPS or enter a latitude and longitude instead.\r\n\r\n<i>Can I help test the latest features?</i>\r\nSure!  Join our beta testing program and get the latest version.\r\n\r\nhttps://play.google.com/apps/testing/com.google.android.stardroid\r\n\r\n<b>Find us elsewhere:</b>\r\n*  https://github.com/sky-map-team/stardroid (github - source code)\r\n*  http://goo.gl/XWjRg (Google Plus)\r\n*  http://groups.google.com/group/google-sky-map\r\n*  http://twitter.com/skymapdevs</i></i>', 'descriptionHTML': 'Sky Map is a hand-held planetarium for your Android device.  Use it to identify stars, planets, nebulae and more. <br><br>Originally developed as Google Sky Map, it has now been donated and open sourced.<br><br><b>Troubleshooting/FAQ</b><br><i>The Map doesn&#39;t move/points in the wrong place</i><br>Make sure you haven&#39;t switched into manual mode.  Does your phone have a compass? If not, Sky Map cannot tell your orientation.  Look it up here: http://www.gsmarena.com/ <br><br>Try calibrating your compass by moving it in a figure of 8 motion or as described here <br>https://www.youtube.com/watch?v=k1EPbAapaeI.<br>Are there any magnets or metal nearby that might interfere with the compass?  Try switching off &quot;magnetic correction&quot; (in settings) and see if that is more accurate.<br><br><i>Why is autolocation not supported for my phone?</i><br>In Android 6 the way permissions work has changed.  You need to enable the location permission setting for Sky Map as described here:<br>https://support.google.com/googleplay/answer/6270602?p=app_permissons_m<br><br><i>The Map is jittery</i><br>Try adjusting the sensor speed and damping (in settings).  We have a better solution coming soon!<br><br><i>Do I need an internet connection?<i><br>No, but some functions (like entering your location manually) won&#39;t work without one.  You&#39;ll have to use the GPS or enter a latitude and longitude instead.<br><br><i>Can I help test the latest features?</i><br>Sure!  Join our beta testing program and get the latest version.<br><br>https://play.google.com/apps/testing/com.google.android.stardroid<br><br><b>Find us elsewhere:</b><br>*  https://github.com/sky-map-team/stardroid (github - source code)<br>*  http://goo.gl/XWjRg (Google Plus)<br>*  http://groups.google.com/group/google-sky-map<br>*  http://twitter.com/skymapdevs</i></i>', 'summary': 'Sky Map turns your Android device into a window on the night sky.', 'summaryHTML': 'Sky Map turns your Android device into a window on the night sky.', 'installs': '50,000,000+', 'minInstalls': 50000000, 'score': 4.1649117, 'ratings': 474530, 'reviews': 89865, 'histogram': [60179, 16989, 23398, 57790, 316172], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Sky Map Devs', 'developerId': 'Sky+Map+Devs', 'developerEmail': 'skymapdevs+feedback@gmail.com', 'developerWebsite': 'http://sky-map-team.github.io/stardroid/', 'developerAddress': None, 'privacyPolicy': 'http://github.com/sky-map-team/stardroid/blob/master/PRIVACY_POLICY.md', 'developerInternalID': '6152823538910518088', 'genre': 'Books & Reference', 'genreId': 'BOOKS_AND_REFERENCE', 'icon': 'https://lh3.googleusercontent.com/4VGiZutofCjs_wEC3BOuFPXysyF-ClYDTa40F3qK-GhKcISkWFFpRiBFmD8HPDTrElQ', 'headerImage': 'https://lh3.googleusercontent.com/_xHJWFBX923mWuafHttWCP7M4kc63TVUj5RU_KM_OfJ3kic5xmcQtg0Y9UI-Xo94xg', 'screenshots': ['https://lh3.googleusercontent.com/Ag5QSMMtWqxi3UTFW7y239mT0khsMvBNPVqkdwuadr6Ar2vMV9vZFyzoHvGNOTNYWA0', 'https://lh3.googleusercontent.com/veDf0tA3YTKBbavlTbITigF04iZ3lEKcNrZKwZJktCL8fn-cGLCW9Ifk-g8ICduZgw', 'https://lh3.googleusercontent.com/_9FKlrlbRz4phkAIDqtsLAnl5Yi3WmLhh6Tv8KCuy2x5FWiMBlm-qfTqXvgET2F5x7E', 'https://lh3.googleusercontent.com/PagtRs82S_uWgzGApzfQBg5iJmspg6H1ByPPq2qtctMufz2Nar4hxaj4aCh7-N4ahKk', 'https://lh3.googleusercontent.com/ChobWjgx7U1l3tFoQr09IXlIXr-i7DtFy7Pmek1evqXOFOaZPhJ3SnW8EEvT_WlK-HA', 'https://lh3.googleusercontent.com/yfX-_XD-YzNz1sKbA7vUgN_yEBXHpCzf8rHSxKDlUNbF-EID8hDfHvtmlYpczlF4UoM', 'https://lh3.googleusercontent.com/E01joGlVkodgK91jqwi6oXlH9ChsE8Z93nihL8g5N1kXOYyE-CFRhZ8gyTJRxGM6rFEI', 'https://lh3.googleusercontent.com/S0mWOIoo9OnxNlP7_sgQuhp4m-tq-sA-4zxgJ7uQPmPpiI3rmZIqqkMU0ml-DWGidUA'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': None, 'updated': 1536197804, 'version': 'Varies with device', 'recentChanges': 'Fixed M31 image\r\nUkranian support - thanks Lukyanov\r\nOther language fixes\r\nWorkaround for broken menu styling in Android P', 'recentChangesHTML': 'Fixed M31 image<br>Ukranian support - thanks Lukyanov<br>Other language fixes<br>Workaround for broken menu styling in Android P', 'comments': ["Although the app is brilliant, the positions/locations aren't accurate. I can visibly, in naked eye see where the sun is positioned, but on your app it is during the sun in a different location/direction. If this is the scenario with Sun , then I imagine all other planets and stars location are also incorrect! This has to be corrected! Otherwise, I must say this is a brilliant initiative as an app!", "I originally had a 5 star rating when I first installed the app. Within the last month though, it has gone way off track. There is no horizon line. Nothing it correct. It won't even show the moon. Stars are not accurate. I've calibrated it over 10 times and that doesn't work. It doesn't matter what I do, NOTHING is displayed accurately anymore. The app sucks now.", 'Opened this app up for the first time in about 6 months this morning at about 5am.   Everything was way off , almost 180 out of position.   I did several calibrations,  and still the same result.   After about 30-40 minutes of messing with the settings and calibrating,  I realized that the time travel was stuck on the "next sunset" setting as the default.   How does that get defaulted to "Now".  After uninstalling and reinstalling it remains on the "Next sunset ".  Please fix.', 'turn the app on after installing . aim to find a planet had to move the arrow to find it. first the planet was in the wrong direction. secondly I had to aim the phone at the arrow to find it. how could you do this when the arrow is already inside the phone program. Graphics might be good for a space game but no ill uninstall one and there will be a better one because there will not be a worse one than this starmap', 'Lovley visuals, the ability to find an object track its course to find out where and at what time it will rise above the horizon is brilliant. It is a shame that this is hampered by (as with other apps) the pointing being so off, (almost 90 degrees sometimes, admitted it could be my phone) add to that there is absolutely no option to recalibrate or adjust the pointing in the menu. Maybe that could be added to the next update. It could be very usable otherwise.', 'Very useful for learning the stars, planets and other things seen in the night sky. Works really good once your cellphone is optimized by calibrating according to instructions given by the Sky Map app. You can customize what you want to see on the screen.', "It has been good for yrs but now it is messing up everything time I try to use the app. I can't look at stars or planets, I can't look at there location cause the screen would move away from where I want to be. I try and try but I have to keep on deleting the app. I can't use it.", "The app works fine except for one MAJOR flaw. The map, in automatic mode is exactly 180 degrees off. And it's not a compass issue because the compass app my phone comes with is spot on (checked with a map and sighting off landmarks). It's still handy to use, if I'm at home because I know which way the backyard faces and can put it on manual. But if I'm out in the wild it's not much help.", 'It seems some change has been made to the app which makes it always orient towards north. I like the app, but as it is now it is practically unusable if you want to get it to track your movements and orient it to a point off north.', 'I was absolutely thrilled to discover that Sky Map is still available in the Play Store even if it has seemingly been orphaned by Google. Literally, a review of this over ten years ago (as far as I can remember) was one of the primary reasons I got an Android device! I miss that device as much as I missed this app until I reinstalled it. 🌌', "The best tool of any stargazer.... I've had this app for years and absolutely love it. Pick a star in the sky, any star, point your phone towards it and the app tells you it's name, you can identify stars, planets, constellations, etc with great ease. You can also enter the name of the celestial body you want to see and the app will guide you towards it. It has several cool features including time travel which has made me fall in love with it. Highly recommended for stargazers!", 'I have tried this app in three separate devices and its been a dead loss in the most recent two. Its best & most effective performance was in an older Samsung android Galaxy Ace (would be, having an astronomy link) My newest mobile, the display just "dances" around, won\'t stay still to read anything. If you want a decent application for stargazing, then I guess you have to take on one with in-app purchases instead. 2/5 was me being generous, bearing more on its usefulness on a much older phone.', "I only recently downloaded and started using this app, thinking it would be fun to have a look at the night sky while walking my dog. It was more than I hoped for. It's really easy to use, accurately matches what I can see in the sky, I love that I can search for an object, and it's encouraged me to learn more about astronomy. It's also brought back some good childhood memories of learning about constellations in the planetarium. I definitely recommend this app, and I can't believe it's free.", "So far it's a really decent app. I had this app years ago and loved it. So far it's just as fun as it was yes ago. My oldest son and I are having a blast bonding and talking about the stars and planets. I can't wait to surprise him and show him the space station as it passes us! If it's as good as it was years ago I'll give it 5 big ol stars.", "Its interesting to look at occasionally . However it works , it does not appear to be a real time view of the sky .Ohio is constantly cloudy & hazey . Perhaps this app is better used in other area's.", "Great to see the sky. I can even point it up when it's cloudy to still 'see' the sky. The screen can be pointed past the horizon which is great for following the planets and the path if the main constellations. The main problem is my own ignorance, but the app might improve my knowledge as well as other users.", "It's become hopelessly inaccurate. Unable to calibrate it despite prolonged efforts. It's used to be quick and accurate but is no longer worth keeping. One of my longest serving apps up until now. A great shame.", "This app would be something special, if it was close to accurate. Even after calibrating it, it can get NEWS correct, but the placement of constellations is always off. I thought the app just needed to be updated, but there isn't any updates. Maybe that's why.\U0001f928", "I downloaded this app a long time ago and never got around to using it. I was wondering if it was worth keeping, so I tried it just now and it's really cool. Works great on my Pixel 3 XL. I've seen comments that say it doesn't work well on some recent phones, but I would contact the developers if that's the case rather than lowering your rating. This is true of so many reviews. You can contact developers rather than venting in your review. I know, I know. Sometimes you just have to vent.", 'Nice App! I have found one issue, makes no problem, just a bit worst view. The Moon phase looks good, but not oriented to the Sun in the Sky view. Thank you!', "It's wonderful, but I have to point out that some of the constellation lines are incorrect (Boötes, Ursa Major, Sagitarius, etc.). Please change the incorrect ones!", "It was nice, when it lasted... This app no longer works properly. It freezes on launch and has other problems. It's been obviously abandoned by the developers. Luckily, there are better alternatives, such as SkyView.", 'It is a great app. It tells the exact location of every planet,star and many more. First I thought it was fake. But then I realised that it showed everything correct', "I really like how this shows you what you are looking at. They are drawings but they show the stars, their names. Planets with names. Every direction you turn it shows the galaxy in that direction. It changes as the earth and planets move. It's really cool.", "I used to love this app, but recently I have been unable to use it as it keeps on saying that my phone needs to be calibrated, and no matter what I do, I can't calibrate it, or get the app to register any movement at all. No matter what direction I point, nothing changes.", "It's a fun app and great way of learning about stars and constellations. Simple interface, just need to point at the sky and all information is on the screen.", 'Downloaded it to identify a planet and it worked immediately. Simple, easy, and intuitive interface. Just point your phone to the sky and all is revealed. Had me stargazing for a solid hour! Really wonderful app!', "I love it. When you are wondering about that nights sky and just open the app and hold your phone towards the sky and see everything you want to know . There are other cool features too. And it's all free with no adds that pop up on my phone ever.", "Stops working too much, but when it does work I like that you can choose what you want to see as far as planets stars constellations etc. Maybe make it a little more user friendly and maybe make an option to turn off seeing what's on the other side of the planet", 'Great app for sky gazing. Just hold the phone towards sky like shooting any landscape. You will locate planets, stars , constellation . ,Holds very less memory , accurate and easy to use. Even Ready to pay for such app.', "Superb ! What else can I say about it 😀👍 . It helps me find different planets, stars, constellation etc. Very useful for us and also children because some children like me love to see different constellation etc. Ops! I forgot to tell you that I am using my Papa's phone.", 'App is fine, I find it a bit challenging to calibrate the compass so I dont fully trust where the map is. Not a big deal though. It would be cool if it had a feature when you tapped on a star/planet/constellation, that it would provide some info on it', 'Excellent features,easy to use and understand...I like this much moreso than I did for other PREMIUM app....this one is much better, non laggy, visuals are good.', 'No explanation for the symbols used and the menu disappears frustratingly fast. EDIT: i just found a text description in "Help" i assume the icons listed are in the same order... not sure its just text and doesnt show the icons.', 'The GPS is off. I put the map right at the constellation Orion and it said there was something else there. I found Orion on the map about twenty feet away from where it is in the sky. Please fix this and I will reinstall.', "Posted a negative review this morning that the map was suddenly frozen. Then later I found the solution in an old review. Go into the app's settings and disable the gyroscope. Voila! Working again. Thank you Ms. Jacobs whoever you are!", "Love this app, but images seem to judder constantly, when I'm looking at the sky, shame as this means focussing on the text is tricky...any tips to fix this?", "Used to be really good but now the accuracy is really off and I have to constantly recalibrate, and even then it's not accurate.", "Used to be great, however since I've moved to Australia, when I launch the app, the app continuously shakes. It's really frustrating as you can't see anything and furthermore, it's not calibrated properly and is showing the sun where there is no sun. Very annoying. I used to use this app a lot for star gazing and finding planets. It's a real shame as I'm in a part of the world where star gazing is so good.", 'I point at objects in the sky. Skymap tells me the objects are up to 30 degrees off from where they are. Useless.'], 'appId': 'com.google.android.stardroid', 'url': 'https://play.google.com/store/apps/details?id=com.google.android.stardroid&hl=en&gl=us'}
