{'title': 'Secure Photo Viewer', 'description': "This app is here to protect you from you friends and enemies. Have you ever handed over your phone to show someone the latest meme? Or a cool pic you took? How often did they scroll too far and have seen something embarrassing in your gallery or image browser?\r\n\r\nNow we have a solution: Select the pictures you want them to see in your gallery, press share and select the Secure Photo Viewer! Now they will only see what you want them to see. It works with any amount of photos or videos you share from you gallery! It's that easy to protect your privacy from nosy friends.\r\n\r\n\r\n\r\n\r\nDisclaimer: Screenshots and gallery/image browser pictures are under the Creative Commons Attribution-Share Alike 4.0 International license. Includes private work of Augustus Binu. Hide photo and hide image were taken with permission of the creator. Secure photo lock developer S. Hill helped me create this app. Thanks! This app is private and secure, absolutely no data will be shared with anyone. This is no vault app.\r\n\r\nIncase you need any help, feel free to message me: Greetechprog@gmail.com", 'descriptionHTML': 'This app is here to protect you from you friends and enemies. Have you ever handed over your phone to show someone the latest meme? Or a cool pic you took? How often did they scroll too far and have seen something embarrassing in your gallery or image browser?<br><br>Now we have a solution: Select the pictures you want them to see in your gallery, press share and select the Secure Photo Viewer! Now they will only see what you want them to see. It works with any amount of photos or videos you share from you gallery! It&#39;s that easy to protect your privacy from nosy friends.<br><br><br><br><br>Disclaimer: Screenshots and gallery/image browser pictures are under the Creative Commons Attribution-Share Alike 4.0 International license. Includes private work of Augustus Binu. Hide photo and hide image were taken with permission of the creator. Secure photo lock developer S. Hill helped me create this app. Thanks! This app is private and secure, absolutely no data will be shared with anyone. This is no vault app.<br><br>Incase you need any help, feel free to message me: Greetechprog@gmail.com', 'summary': 'Protect your gallery from nosy eyes', 'summaryHTML': 'Protect your gallery from nosy eyes', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.44, 'ratings': 168, 'reviews': 84, 'histogram': [16, 1, 5, 11, 132], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.3M', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'Gree Tech Prog', 'developerId': 'Gree+Tech+Prog', 'developerEmail': 'greeTechProg@gmail.com', 'developerWebsite': None, 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '6451618738023493918', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/dxdpAa-Jz1BjtQnXH9Tz2jBGGdPrG3XzJIlHS5aj1uGstIRLQQrGWAhfZt3PxKTszOXG', 'headerImage': 'https://lh3.googleusercontent.com/0qmedys8Y3Mpnn6mipze0LrQdyIu-_-JG4VSVcl_UipQLz3GUgv3rI2fBnSm2fYcZig', 'screenshots': ['https://lh3.googleusercontent.com/8Le7UxDLd5InUH25CHYPPqfi4jdUwezkk_9Z9icu9lXEL2wtvEtFpKAFd3jtA6zpag', 'https://lh3.googleusercontent.com/4WMXDrbaJgW_37GAltHsXLDZksAxZ0jpoKqVknsz3pePEnuPYrtzKg-XcI-NCZ7cS6Fw'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 1, 2017', 'updated': 1540673816, 'version': '1.3', 'recentChanges': "**PLEASE READ HOW TO USE**\r\n\r\n1) Make sure that you have some kind of lock screen. Pin, Password, Fingerprint, whatever\r\n2) Go to your gallery, select some photos or videos and tap share.\r\n3) Select the Secure Photo Viewer\r\n\r\nAnd you are done! As soon as you press your lock button, the photos will pop up. Your friends won't be able to get into your phone until you unlock it again.", 'recentChangesHTML': '**PLEASE READ HOW TO USE**<br><br>1) Make sure that you have some kind of lock screen. Pin, Password, Fingerprint, whatever<br>2) Go to your gallery, select some photos or videos and tap share.<br>3) Select the Secure Photo Viewer<br><br>And you are done! As soon as you press your lock button, the photos will pop up. Your friends won&#39;t be able to get into your phone until you unlock it again.', 'comments': ["I downloaded the app but I couldn't even get into it as there was no option to open it and it wasnt showing up with the rest of my apps either, however that doesnt mean it's not a good app, it just failed to work for me", "Exactly what I needed, the app is less than a megabyte in size and works brilliantly. Would've been nice if it supported pdfs and more video file types.", 'Amazing application. I have been looking for an app like this since forever. Works flawlessly. Thanks to the developer for making this app. You did a really good job. Some people are stupid giving this app just 1 or 2 star.', 'A little slow to come up after locking but other than that EPIC!', 'Had scenarios where I did not want it playing media on lock screen. And from day 1, wished it would just go straight to loading the media…', 'I love the functionality and simplicity of this app. Wish I could give it 6 stars.', 'i love the functionality and simplicity of this app. wish i could give it 4stars✨', 'Thank You, Works Like a Charm !!!', 'Perfect app to keep nosy people away from my pictures. 10/5 stars!', 'Very Useful app', 'Great app serves its porpouse. 10 stars', "Exactly what I've been looking for long time!", 'Works as advertised.', 'Exactly what I needed', 'Very important to me', 'it does what it says', 'this is nkt even an app i can open', 'Brilliant.', "Galaxy note 3. Simple and effective. Been searching a long time for an app to do exactly what this app does. Works smoothly and flawlessly. It's worth noting, there are no icons on the home screen or anywhere else. To use this app follow the 2 pictures on the app page,  1. Have pass word lock on phone. 2. install app. 3. Open any photo gallery 4. Select photos to view 5. Click share to 6. Select secure photo viewer 7. screen blacks out for a moment 8. Photos appear. 9. Finished viewing, unlock phone ,😀", "Great app, love the concept... Has one small flaw... If the user is using smart Lock like I am and one of the conditions is met  (e.g. at home) then the lockscreen isn't really stopping anyone... So please have the app lockdown the lockscreen before showing the photos", "Good idea and well implemented for the limitations in place with OS. As other reviews said, it won't override any features that keeps your device unlocked, such as Trusted Devices, etc. But it does create a limited experience of just the media I meant to share, and at least requires exiting that experience and swiping up to open my phone for real, which is an acceptable and welcome barrier vs none at all, albeit easy to overcome.", 'I have been waiting for this app! I want to show people pics of my son without them accidentally seeing pics of his birth. My thanks to the developer! :)', "Thanks Dev, this masterpiece works like a charm!, it's convenient and easy to use. If you can't figure out how it works, please read the instructions (RTFM!)", 'Very good job. A way to automatically do it would be perfect but is good enough. You can show pictures while not having to worry with the rest of the content.', "Just heard from XDA and installed it from play store. It's an awesome app. The dev whose idea behind it, is a genius. Thanks for this app. ✌️✌️✌️✌️😀", "I followed the directions just as stated and it does not work for me. I'm using the Moto G4 Plus and my gallery is Google photos", 'Just installed it and does what it said it would do. Excellent app, allows you peace of mind when handing over your phone to show photos.', 'Does not work waste of space', 'I hate to give 2 stars but I do have a lock on my but seems the app is not working.   Yes i have a lock screen and yes  I have uninstall and reinstall the app. I tap the picture, then share, then tap the app after I tap the app the nxt menu states to lock the device or pin  this app then TAP HERE.( With a wide gap)  Tap where? The only thing in the bottom is view. Pls help.', 'Very nice! No more stress about someone scrolling here and there.', 'Works well! Pictures appear shortly after locking screen, back button and home button go to lock screen.', 'It\'s not a gallery, so make sure you read the "how to use" in the \ndescription. It works well!', "No idea how to use even doesn't locate this app where is it on my device after installed.", "App doesn't downloaded", 'Excellent app! Just surprised no one thought of this before. This should have been a given.', 'This is, without question, a must have app.', 'Great useful app. Would you make the app visible in the list of apps?', 'A must have app.', "It doesn't do anything. I can still see what I selected in my pics…", 'From reddit <3'], 'appId': 'com.gtp.showapicturetoyourfriend', 'url': 'https://play.google.com/store/apps/details?id=com.gtp.showapicturetoyourfriend&hl=en&gl=us'}
