{'title': 'Simple Weather', 'description': '<font color="red">Simple Weather v5 now Available</font>\r\n\r\nSimple Weather is a fast, simple and intuitive app for your Android mobile, with a clean User Interface without those clutters and ads. Get all the information you want at a glance. Getting weather information has never been so easy and amazing. Stay connected to the latest weather conditions with Simple Weather.\r\n\r\nCompatible with Android Jellybean(4.2.x) and above. App best experienced with Android Lollipop and above (5.0+).\r\n\r\nNow available in 11 languages: English, Basque, Chinese, Danish, Hindi, French, Norwegian, Dutch, Spanish, Japanese, Russian\r\n\r\nFeatures:\r\n• View Current Temperature, Minimum and Maximum Temperature\r\n• View Wind Speed and Direction\r\n• View Humidity and Pressure\r\n• View your Weather in 11 different languages\r\n• View weather data of multiple cities simultaneously\r\n• View Sunrise and Sunset Time\r\n• View Weather Graphs and Maps\r\n• Add cities on the basis of ZIP Code\r\n• Add weather widgets of the default city on launcher\r\n\r\nComing Soon:\r\n• UV Index Data\r\n• Multiple cities in the widget\r\n\r\nThe app will be regularly updated, and new versions will also be released.\r\n\r\nApp source code available <a href="https://www.google.com/url?q=https%3A%2F%2Fgithub.com%2FSparker0i%2FWeather&sa=D&sntz=1&usg=AFQjCNERhd5Y-VArXpmSzc9BrNcPUE41xw">here</a>', 'descriptionHTML': '<font color="red">Simple Weather v5 now Available</font><br><br>Simple Weather is a fast, simple and intuitive app for your Android mobile, with a clean User Interface without those clutters and ads. Get all the information you want at a glance. Getting weather information has never been so easy and amazing. Stay connected to the latest weather conditions with Simple Weather.<br><br>Compatible with Android Jellybean(4.2.x) and above. App best experienced with Android Lollipop and above (5.0+).<br><br>Now available in 11 languages: English, Basque, Chinese, Danish, Hindi, French, Norwegian, Dutch, Spanish, Japanese, Russian<br><br>Features:<br>• View Current Temperature, Minimum and Maximum Temperature<br>• View Wind Speed and Direction<br>• View Humidity and Pressure<br>• View your Weather in 11 different languages<br>• View weather data of multiple cities simultaneously<br>• View Sunrise and Sunset Time<br>• View Weather Graphs and Maps<br>• Add cities on the basis of ZIP Code<br>• Add weather widgets of the default city on launcher<br><br>Coming Soon:<br>• UV Index Data<br>• Multiple cities in the widget<br><br>The app will be regularly updated, and new versions will also be released.<br><br>App source code available <a href="https://www.google.com/url?q=https%3A%2F%2Fgithub.com%2FSparker0i%2FWeather&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNERhd5Y-VArXpmSzc9BrNcPUE41xw">here</a>', 'summary': 'Free Weather forecast, temperature, maps and widget without ads - Simple Weather', 'summaryHTML': 'Free Weather forecast, temperature, maps and widget without ads - Simple Weather', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.58, 'ratings': 145, 'reviews': 94, 'histogram': [29, 13, 14, 21, 66], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.6M', 'androidVersion': '4.2', 'androidVersionText': '4.2 and up', 'developer': 'Aaditya Menon', 'developerId': '6116967233401290402', 'developerEmail': 'support@sparker0i.me', 'developerWebsite': 'http://weather.sparker0i.me', 'developerAddress': '"SREEDEVI",\n(P.O.) Kavilpad,\nPalakkad - 678012', 'privacyPolicy': None, 'developerInternalID': '6116967233401290402', 'genre': 'Weather', 'genreId': 'WEATHER', 'icon': 'https://lh3.googleusercontent.com/IuRL3JxTV4p1oY2viwFLD82b3Z9r2DyVk8dt7np1PWWDUttUfeY0QeO989p7miQS1lxe', 'headerImage': 'https://lh3.googleusercontent.com/ZsNzF7-ThjuXRko2RnkZgSL_QbHbVhZZ_aJpyi8h60gKFjj57nykbeTn3Txm_tCFENac', 'screenshots': ['https://lh3.googleusercontent.com/jXSx58ThsBWBF4oLpH3X0z7TaYZA7oNuZU6u1Nt2J6qZ7tKrnEz0LZEd7i90D2Q2HC6b', 'https://lh3.googleusercontent.com/SVI6o3mzA3mG1RpD59ecj4rehqIQ2yIfyNzD5Yk2n01I8gwaP7i8aMUlwiztqSn5p5s', 'https://lh3.googleusercontent.com/KKgOHkiAo7LzLQfwup3NxxwmfaDBW2SiVkgpfIdlD6pLh3vgucYFyciRHnt7vG0UuaU', 'https://lh3.googleusercontent.com/t0VDvkMYRvVv-QBHXDVv3LDvUS-qeahA1HTIbqTXDZEqK0cALQ_zB6fPs0VUiGqutv0', 'https://lh3.googleusercontent.com/FsNYhxB2beFRRr4baJ_vHcIjhkMOfdLAeEaDY4gTTiC06ZRAjzaOgdMrcWXvJQwdiA', 'https://lh3.googleusercontent.com/irC0qWuikyqtf1XzwJHV7p7YLrjqvXajRA4JyeVh8cXJq2GzybD9q4o0b-LEbljOWA', 'https://lh3.googleusercontent.com/BUii1NSAwx-mP1M62hXmGcBxUQf-5uVZ4MvVLyellmk71UfWVA6lxD96ehisbQ4yHw', 'https://lh3.googleusercontent.com/d43Ni1O_VC5SyyEOPmju6MFB_j5a0h1iThb9dQsqeHTpbrwA25yAt3UynIJqpj1lkgCU'], 'video': 'https://www.youtube.com/embed/IDlP0YbXuKw?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/IDlP0YbXuKw/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Oct 10, 2016', 'updated': 1517775694, 'version': '5.3.2', 'recentChanges': "WARNING: Old Widgets might no longer work when you upgrade, create a new one instead\r\n\r\nHere's what's new in Version 5.3.2:\r\n- New Layout for Home Screen Widget\r\n- Slightly darker colors in the app\r\n- Simple Weather now in 10 more Languages\r\n- Add multiple cities to the app\r\n- Return of the Red Search Button\r\n- More responsive notification and widget\r\n\r\nBUGS FIXED:\r\n- Fixed crashing of app on Android 7.1 and below\r\n- Fixed Weather Maps not loading\r\n- Fixed Unable to Create Widget", 'recentChangesHTML': 'WARNING: Old Widgets might no longer work when you upgrade, create a new one instead<br><br>Here&#39;s what&#39;s new in Version 5.3.2:<br>- New Layout for Home Screen Widget<br>- Slightly darker colors in the app<br>- Simple Weather now in 10 more Languages<br>- Add multiple cities to the app<br>- Return of the Red Search Button<br>- More responsive notification and widget<br><br>BUGS FIXED:<br>- Fixed crashing of app on Android 7.1 and below<br>- Fixed Weather Maps not loading<br>- Fixed Unable to Create Widget', 'comments': ['Fast, light, doesnt need GPS to update! Very good app. Downloaded for Google Pixel 2XL. Only reason for 4 star is widget wont display anything.', 'Was not able to get my API key to work, also my location would not stick. Every time I opened the app another location with same name would be default, had to pick my city.', 'Wow ! Very useful … small size … no unnecessary permissions … and no advertisements. Hats off to the developer !!! Just a few suggestions… if the icon colour and background are changed to light blue (from deep blue), it will be more appealing. The widget background colour should also change to make it usable. Moreover, if the current time can be displayed on the widget, it will be a bonus. Nevertheless, it is a great app. Thanks !', "I'm picky about my weather app, but this one checks all the boxes! I do think it should use mm for snow, though, not m/s--that would be an unbelievably enormous pileup of snow! The graphs are fantastic!", "Same as Partha Bose comment. Light, small, quick, no bells and whistles, no ads, no permissions. I don't want a heavy duty weather app, I just want to know how cold it is right now and how much it's supposed to warm up today. Just what I was looking for!", 'Graphics are a bit on the primitive side. Would be nice if they were customizable. Otherwise a very simple, elegant and useful app. No ads or nonsense.', 'really like the app/widget and would give 5 stars if widget displayed present location and was customisable. transparency a must. uninstalling for now. will check back later.', 'FRUSTRATING. Does not understand USA zip code for city find, I get some city in Nigeria. Temperature units are adjustable from metric, but air pressure, wind speed, rain/snow amount is not. Weather map overlay is too dark to see the map.', 'good app. No ads Very much lightweight. Perticularly, weather maps and graphs are good.', 'Perfect lightweight weather app, without ads or in-app purchases!', 'I\'d love to give this a try but when I type in my city (Singapore) it says "Singapore, MY". Singapore is a sovereign nation and is typically denoted as SG.', 'Shame, does not auto refresh tried everything for 2 weeks.......', "App says my city isn't in the database I don't give much stock in the other review that say it's great because it's not can't even get passed enter your city.", 'crashes when opening graphs got a pixel 3a xl', 'Simple. Widget not good', "Couldn't find St Louis in its database?", 'Horrid functions', 'Finally!  It is accurate, simple layout, no obvious advertisement, it doesnt take up much space on my phone, its got 2 widget choices which also lends to space-saving and everything I need to know about weather before I get ready for work is all on 1 screen. Convenient, helpful, low impact. Omg... Make a transparent widget option & I will buy stock.   UPDATE  I gotta start shopping again. The widget wont update and I miss being able to save cities, then flip back and forth. Hunting season is approaching so being able to glance at the conditions for multiple towns in a short time is useful. Loved this app. Perhaps its too simple.', "Great little app but strangely it says my location is Canterbury GB (Great Britain) where my actual location is Canterbury in Sydney, Australia.  Huh!? Wrong side of the globe. 🙄 Sydney has many suburb names that are derived from the UK from the early settlers. I cannot use this app when I am moving around Sydney! It jumps  from local Sydney to UK weather.  Crazy! Maybe the Dev's could fix this. 🤔 EDIT: Dev,  yes I have been using the GPS to update my location but it points to Canterbury UK. I won't use this feature do therefore will have it set to Sydney permanently. Thanks for your instant response. 😉", 'Perfect! Many thanks to the developer. This app gives all the information needed, with no intrusive advertising.Simply does the job. Neat, clean and lean. Awesome. !!', "thumbs up for developers  , over all great UI ,but can you guys add transparency on widgets  because blue doesn't look good on all wallpapers", 'Better than Any other great app Like AccuWeather. As light as a feather :)', 'It could be one of the best if:  1- it adds the feature to show weather temprature in status bar 2- it become customizable in terms of language.', 'Works great! Love the open source. Would be nice if the notification icon used the current weather icon, with the temperature next to it.', "It's simple, clean, and therefore fast! Everything I need, nothing I don't. Thank you!", 'I like it. How do I change the city? Can I save multiple cities?', 'Why it is asking me to write my location. It is supposed to locate automatically.', 'Nice and light weight. Thanks for the response. Will definitely wait for the transparent background. :)', 'UI is bad', 'Amazing and without the ads!', 'Exactly what I was looking for', 'Superb', 'This is one of those must have apps which we use daily. Thumbs up for the awesome developer and his hard work. Hope you develop more useful apps like this.                                               [edit]: Super fast response from developer. Fixed reported issues within hours and updated the app. [edit2]: good to know that this app still has support and gets update frequently. Keep up the good work ! 👍', "I would really like to see a widget that displays current time and temp for the area. If there is one, I haven't found it yet. The small size and fast performance is great!", "Good that this app is back to basics, too many too cluttered apps nowadays. Suggestions for the developer: 1) Add imperial units (Fahrenheit, MPH, InHg, etc), ideally the units change should be done just tapping on the temperature unit (C or F) on the display, instead of going to a settings menu. 2) In some devices it doesn't switch to landscape mode. In those that it works the display real estate is not used efficiently in my opinion.", "I can't see a change to Fahrenheit ...", 'This is my favorite app! All I ask is maybe in the future support Fahrenheit too. :)', 'Does not have Fahrenheit option', 'How do you change to Fahrenheit?', 'Simple and good. But it has  no widgets'], 'appId': 'com.a5corp.weather', 'url': 'https://play.google.com/store/apps/details?id=com.a5corp.weather&hl=en&gl=us'}
