{'title': 'LRC Editor', 'description': "LRC Editor helps you to create and edit lyric files ( .lrc files ) easily.\r\n\r\nFeatures:\r\n - Comes with a small built-in media player to help you synchronise your lyrics with your song\r\n - Supports both fine and coarse tuning of timestamps for synchronising your lyrics perfectly\r\n - Supports powerful batch editing features to adjust timestamps quickly\r\n - .lrc lyric files can be directly opened from your file manager with this app\r\n - Lightweight and Ad free\r\n\r\nBonus: Complete any In-App purchase to unlock the two dark themes.\r\n\r\nYou can use .lrc lyric files to add lyrics into music players that support them for example the stock music players of Xiaomi, Huawei, OPPO, Samsung etc\r\n\r\nTry it out now!\r\n\r\nIf you face desync issues, make sure you're using a high quality constant bitrate MP3 file or a music container suited for precise seeking.\r\n\r\nLRC Editor is Open Source. If you would like to contribute, head over to https://github.com/Spikatrix/LRC-Editor ♥\r\n\r\nA big thank you to all the translators:\r\n - Chinese (zh-rTW) by Martin C\r\n - German (de) by Leon Thelen\r\n - Indonesian (in) by Fajar Maulana\r\n - Polish (pl) by Zbigniew Zienko\r\n - Portuguese (pt-rBR) by Ayrtown Karlos", 'descriptionHTML': 'LRC Editor helps you to create and edit lyric files ( .lrc files ) easily.<br><br>Features:<br> - Comes with a small built-in media player to help you synchronise your lyrics with your song<br> - Supports both fine and coarse tuning of timestamps for synchronising your lyrics perfectly<br> - Supports powerful batch editing features to adjust timestamps quickly<br> - .lrc lyric files can be directly opened from your file manager with this app<br> - Lightweight and Ad free<br><br>Bonus: Complete any In-App purchase to unlock the two dark themes.<br><br>You can use .lrc lyric files to add lyrics into music players that support them for example the stock music players of Xiaomi, Huawei, OPPO, Samsung etc<br><br>Try it out now!<br><br>If you face desync issues, make sure you&#39;re using a high quality constant bitrate MP3 file or a music container suited for precise seeking.<br><br>LRC Editor is Open Source. If you would like to contribute, head over to https://github.com/Spikatrix/LRC-Editor ♥<br><br>A big thank you to all the translators:<br> - Chinese (zh-rTW) by Martin C<br> - German (de) by Leon Thelen<br> - Indonesian (in) by Fajar Maulana<br> - Polish (pl) by Zbigniew Zienko<br> - Portuguese (pt-rBR) by Ayrtown Karlos', 'summary': 'Create and edit lyric files with ease', 'summaryHTML': 'Create and edit lyric files with ease', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.35, 'ratings': 929, 'reviews': 474, 'histogram': [83, 27, 37, 111, 668], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '1.0M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'CG Devworks', 'developerId': 'CG+Devworks', 'developerEmail': 'cg.devworks@gmail.com', 'developerWebsite': None, 'developerAddress': 'Kerala, India', 'privacyPolicy': 'https://sites.google.com/view/lrceditor-privacypolicy', 'developerInternalID': '5340039213363793759', 'genre': 'Music & Audio', 'genreId': 'MUSIC_AND_AUDIO', 'icon': 'https://lh3.googleusercontent.com/EH-tuKvKz302a-idsyIPvRLw1oOkyhYQBKg5Eb_aAzzMnYmvjSSotzj3QyePD7gfI_yQ', 'headerImage': 'https://lh3.googleusercontent.com/AMZGnqWFdgavFDSvjjflj7RVX-682D5PrW2I8ANH-nrhSetFCEeV_epV-DOQWSPw96Q', 'screenshots': ['https://lh3.googleusercontent.com/R-6CVuGEe2q8FD60-aVjd87ZNIiHL0Kzl9AWqNN8k-uHoJFlAmHZHgW0EDiga3cwzZ3-', 'https://lh3.googleusercontent.com/noiEAtSUkdJ50mZWnxkkovoxbep-qbTTcSJmDbTpIzFpfeMl_pTq5ShgY2FGxbTSYhQ', 'https://lh3.googleusercontent.com/_gCKRLjlcvNC-DzbcE43aAYMSnWxFbIfQctuhm14RUcVnHlgfeko71QjaSp-UsY2sQ', 'https://lh3.googleusercontent.com/RoeKDhaopll3Dev2557--ESobgYWRJ-jSabKeW45GQNWs0y8daEhHMZaItk1pAeMssE', 'https://lh3.googleusercontent.com/7Me8femURersLbCRkcdEpfWZY20kel2MzSmG5Jux1Qfd_K7BvV1jd_KjPnyXMHZGSHo', 'https://lh3.googleusercontent.com/H7L_-hukrIcSxNn7vhJlqmuqa_ophCrAGCwosPMpx8cGi07braXtaR-Q24Ep8wUrlA', 'https://lh3.googleusercontent.com/Gt6XWsK1bx79CnnYC6Jr7bMIube02IUu5D7sVQTwCkWZq2Nq6i2LXG2FLswpY1peZ3_z'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 27, 2018', 'updated': 1589447629, 'version': '3.2.3', 'recentChanges': " - Several UI changes and improvements\r\n - Fix for not being able to read/write to storage on certain Android 10 OEMs\r\n - Bug fix for the offset parameter causing issues in reading LRC files\r\n - You'll no longer lose your syncing progress if the app was killed by the system in the background to make space for more free RAM while you were busy searching for cat GIFs to keep your friend occupied", 'recentChangesHTML': ' - Several UI changes and improvements<br> - Fix for not being able to read/write to storage on certain Android 10 OEMs<br> - Bug fix for the offset parameter causing issues in reading LRC files<br> - You&#39;ll no longer lose your syncing progress if the app was killed by the system in the background to make space for more free RAM while you were busy searching for cat GIFs to keep your friend occupied', 'comments': ["Hey! The app was amazing and free from adds! I red some reviews that gives (4,3,2,1) star/s I red your replies that I also need to do. I tried to move the lyrics into the same folder and saved it same name as the music file but The lyrics won't appear. I scanned my Musics and Refresh again and again. The lyrics won't really appear.", 'Amazing app, very easy to use, user friendly, no annoying ads, a very recommended app if you want to have timings for your lyrics.', "I followed all the steps but still, the lyrics won't appear. And also all the file ive saved will suddenly disappears in the lrc app. And i can't open the lrc file when im offline. Thanks", 'This app is just so damn amazing. I never knew how to make lrcs. I was just searching for an app to view one but when I downloaded it everything was complete. I can make my own lrcs. Amazing.', 'The UI is very good and is user friendly therefore making it simple and easy to use. Very good app.', "Yes, a good app. I always wanted those auto scrolling lyrics on my music player. Its simple to create and apply the lyrics onto one's preferred song. For most people, atleast.", 'I have a question why does it says to me that "you dont have apps that can open this file..." and i saved using the title of the song and same location..', "Well I save the lyrics in the music file as asked but it doesn't appear in the actual music app , is it normal ? (Still doesn't want to work :/)", 'A VERY USEFUL APPLICATION. EASY TO USE AND YOU CAN SELECT WHERE TO PUT YOUR MUSIC LRC, WHETHER IN SD CARD OR PHONE MEMORY. 100% LEGIT, COMPARE TO THOSE BULLSH*T APPS AND WEBSITES IN BROWSER. ❤️', 'Good work. But i need a translate feature to translate lyrics in any language. I hope you add.', 'Good application for make lyrics for songs..', 'So far the application is good, hoping there is a feature to open lyrics file from the folder', 'Cant get this to do anything. Pasted in lyrics. Savrd, appsrently succrssfully. Selected audio. Saved... Repeated for over 2 hoirs... File always empty. Nothing but headers Aboit to retry in msin directory.', "🔸Very useful when i want to record lyrics for songs, easy to create song lyrics. 🔸Helpful when i don't get downloadable .lrc files from internet as i myself can create lyrics whenever i want. 👌🏻👌🏻👌🏻", "This app is great and easy to use. I don't have any problems with it so, it's all good. 5/5 from me.", 'Exactly what it promises to do. Straight and simple, and in a compact size. What more can you ask for?!', "useful for when i'm translating lyrics and want to record it on phone", 'Easy to use. Does the job well.', "I have a little problem with the app. Though the lyrics on the music player appear and everything is working just perfectly, the LRC Editor doesn't save the work. I tried saving the whole process multiple times, I even closed the application and opened it again, but no lyrics are saved there. The whole page is blank, but the lyrics work just fine.", 'The simplest and best. I will also use it as a timestamp - bookmark creator and player for mp3 recordings. The only problem for this use is that it will not be possible to create bookmarks for recordings with longer duration than 99 minutes, 59 seconds and 99 milliseconds, which is at most 1 hour and 40 minutes. Thank you :)', "Doesn't add lyrics...", "It's a great and very useful app. But sometimes there can be a lack of accuracy after setting the time stamp. You can notice it when you play the songs on the device music player. Would be of great help if you could correct this issue. BTW, I m using Samsung music on galaxy s9", 'Simple and useful LRC generator.', "Wouldn't load the song.", 'Could not use it as i have an LG k40 and it would not read any files. Ill give it 5 stars as to not rate it unfairly. I hope this somehow can be fixed so that its usable for me and others of similar phones. (Unless i missed something)', "It's too good app for lrc editing. I am happy 😊 Thanks for this app 👍", "It's actually super simple to use and I really like it. I suggest you add the ability to add a song cover photo as well, that would be really cool. Other than that, perfect app, thank you for making it 👌😇❤️", 'This is the best one for me to making lyrics file. But when I working on, my phone keeps lagging and some lyrics not in sync as the accurate song lyrics .. I hope you fix this bug asap Edit: OMG Thank you so much hearing my feedback! After updating, the app going smoother and the lyrics so in sync as the song^^ I love youu.. I also love the new features ^^ Now I give you 5 STARS!♡', 'Excellent! This app has a really easy user-interface. It does what we expect of it really well: put lyrics, edit it, put timestamp, save it. And some other things. The app team is also suprisingly quick & concise with their reply. Glad I downloaded it.', 'the app is great for adding lyrics on your music player without any interuptions like ads and stuff. the only issue i have with this is there are often delays on the synchronization of the song and the lyrics even though i made it as accurate as possible. please fix this.', 'Yes all the issues started when I updated my OS I think.', 'No nonsense lyrics editor, along with the ability to syn them. Its the only reasonable lrc editor out. There are no ads. The interface is easy to understand and unlike other app synchronizing lyrics is a breeze.', "Doesn't work for me. I made a synced Lyrics. But it didn't show as a synced lyrics in the song. Edit: I'm changing my my review as the problem is fixed now. Best wishes... ☺️", 'Guys!!!! This app is so amazing!!! Download it now!!! It can really help you get your synced lyrics!!! I love it!! Now, I have a moving lyrics in NY default music player!!!!', 'Thank you for this app the settings and the features are really cool. By the way it can be improved by adding lyrics start and end time if you know what I mean. 😁👍 Thanks.', 'This is the best lyric file editor out there, hands down. And yeah, good support from the developer. They responded to my mail about an issue so fast and fixed it within the next couple of days.', 'I mean that adjustable playback time button ("+" at the right corner) it\'s difficult to tap when dealing with the fast flow of song lyrics make it large or convenient... 😅 Thank you so much ❤️❤️❤️❤️', "It's perfectly functional! I impressed with this app, gonna pay you with a small support, it's the only one I have now. Thanks for making this app 💙", "UI friendly, but somewhat terrible synchronization when i placed an lrc file on a music player. Doesn't exactly match the ones i have heard on this app. Maybe improve?", "Love this app ! It would be great if u add the feature that the lrc can save as the same file of which it's song exist and can change the same file name as it's song in final stage of editing !"], 'appId': 'com.cg.lrceditor', 'url': 'https://play.google.com/store/apps/details?id=com.cg.lrceditor&hl=en&gl=us'}
