{'title': 'Default Dark Theme for Substratum', 'description': 'IMPORTANT: You need the Substratum app working on your device! Read the inbuilt information before reporting any issues!\r\n\r\nTheme for Substratum, originally based on the default AOSP dark material colors; then extended to provide more variants to allow configuration according to the users taste.\r\n\r\nAvailable accent colors (separately selectable for settings and system):\r\nDefault teal; amber, blue, blue light, cyan, green (3 variants), lime, orange, pink, purple, red, white, yellow.\r\n(If you want another one, contact me with the color code)\r\n\r\nAvailable background colors:\r\nDark, darker, black.\r\n\r\nAvailable notification colors:\r\nLight, dark, black.\r\nSemi-transparent variants also available for dark and black.\r\n\r\nAvailable quicksettings + volume slider colors:\r\nDark, darker, black; each either solid or transparent.\r\n\r\nThemed parts:\r\n- Framework\r\n- SystemUI\r\n- Settings\r\n- PackageInstaller\r\n- DocumentsUI\r\n- CM Settings\r\n- AICP Extras\r\n- AOSP Calculator\r\n- AOSP Contacts\r\n- AOSP Dialer\r\n- AOSP Email\r\n- AOSP Messenger\r\n- Substratum\r\n- Rview\r\n\r\nSource code: https://github.com/SpiritCroc/DefaultDarkTheme-oms', 'descriptionHTML': 'IMPORTANT: You need the Substratum app working on your device! Read the inbuilt information before reporting any issues!<br><br>Theme for Substratum, originally based on the default AOSP dark material colors; then extended to provide more variants to allow configuration according to the users taste.<br><br>Available accent colors (separately selectable for settings and system):<br>Default teal; amber, blue, blue light, cyan, green (3 variants), lime, orange, pink, purple, red, white, yellow.<br>(If you want another one, contact me with the color code)<br><br>Available background colors:<br>Dark, darker, black.<br><br>Available notification colors:<br>Light, dark, black.<br>Semi-transparent variants also available for dark and black.<br><br>Available quicksettings + volume slider colors:<br>Dark, darker, black; each either solid or transparent.<br><br>Themed parts:<br>- Framework<br>- SystemUI<br>- Settings<br>- PackageInstaller<br>- DocumentsUI<br>- CM Settings<br>- AICP Extras<br>- AOSP Calculator<br>- AOSP Contacts<br>- AOSP Dialer<br>- AOSP Email<br>- AOSP Messenger<br>- Substratum<br>- Rview<br><br>Source code: https://github.com/SpiritCroc/DefaultDarkTheme-oms', 'summary': 'Dark material theme for the Substratum Theme Engine', 'summaryHTML': 'Dark material theme for the Substratum Theme Engine', 'installs': '100,000+', 'minInstalls': 100000, 'score': 2.6545455, 'ratings': 1114, 'reviews': 458, 'histogram': [557, 81, 40, 60, 374], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '9.3M', 'androidVersion': '7.0', 'androidVersionText': '7.0 and up', 'developer': 'SpiritCroc', 'developerId': 'SpiritCroc', 'developerEmail': 'info@spiritcroc.de', 'developerWebsite': 'https://github.com/SpiritCroc/DefaultDarkTheme-oms', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5695643630698110213', 'genre': 'Personalization', 'genreId': 'PERSONALIZATION', 'icon': 'https://lh3.googleusercontent.com/eIx4k1enwJC7U3Ktc1qFETjDos6XSUd4vU2uW_xe3oyXfuD5vk8vLcXM-SqhVaxkuvU', 'headerImage': 'https://lh3.googleusercontent.com/6ONpbAPjUY-n6JX9XEEAo_RaZ5KEi25NZ6aegXmUgs4eTdcnD-sO76_Q4Zm6vpxwT-8', 'screenshots': ['https://lh3.googleusercontent.com/bwroZIT5kc89Y3yTgqC6B4AunMUqzlitvBMK-lyw5NG5HRbK9FT8_TR62Z1x88yfsvE', 'https://lh3.googleusercontent.com/Yxa3InananW-dEkUc9C5C0W9UvwMED2I0ORu4YQVQk9pFnOTKkWXfIw4OG_mLXsLtPE', 'https://lh3.googleusercontent.com/lABVH7z9bIcaQNRT4BAfDefDPRmMEmAVQf_8tLAamrKwhNGdBV4-izz57oc-g8GN8zU', 'https://lh3.googleusercontent.com/n1lKxTjufzmHTnxkM7h97ZY2F4X6837a8GziGaC-ijmb6Vc29sO-pMkawxOc1-0fsdc', 'https://lh3.googleusercontent.com/jCi9SeXwbM9ED5JSZvusDU51Jwh-Odtqgs-q70_3AvXvAxbvC5uUXvwGkOQxmJ89aEQ', 'https://lh3.googleusercontent.com/QnC7gQa8bfxJMLntgP3z4gvJgUsj1Z4qSu5_sGMgC1yKhhMePUcrdhjurzuhMxEzzg99', 'https://lh3.googleusercontent.com/2g4n8Q8DAbphFTLEIQP4HhE-fGyIM8FN5ZMr0b-q-OIknr2cQ5Eq2AIs_EKzr03P_YS7'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 18, 2016', 'updated': 1571153812, 'version': '7.7.3', 'recentChanges': 'Update dependencies', 'recentChangesHTML': 'Update dependencies', 'comments': ['Very good offering for a free dark mode substratum theme, doesn\'t work on a few apps but for the price that shouldn\'t even be a complaint. The app was tested on a galaxy j3 with lineageos 14.1 as the os and magisk as the superuser manager. Those who leave bad reviews saying that it "doesn\'t work" without adding anything else to their argument are not the target audience for this app and their opinion should be weighed as such when evaluating the app.', "The app won't show me the dark move setting, when i open the app, it didn't show since I have a budget 2019 version LG Phone. Don't download this with any LG Tribute phones out there in the market.", 'Dunno why there are so many negative reviews. This works perfectly fine for me and it’s the best dark theme out here! Most of the themes are paid, but he built it for us for free. There is another free dark theme but that’s actually themed pure black, so it didn’t look well to my eyes. This app deserves my 5 stars and I will give another 5 stars from my 2nd account.', "The developers know there is a problem with this app but refuse to fix it. They say that if you dont know what a substratum is, then you should just uninstall immediatly even though they include a link to a substrarum next to it. The subtrarum doesnt work by the way. They also rudely tell you to not leave a bad review even though it is their fault that the app wont work and it's their fault they won't fix it. They put the blame on you for not knowing advanced developing terms.", "Even though it works as expected, the developers should tell the person what it is, not everyone knows everything, and you don't have to punish people by not knowing how to use it. But great app, it makes it easier to use my phone in the dark. Btw it also helps you if you click on the link in the app. Lol", 'People are like "Haha this app sucks I don\'t know how to use Google to search what Substratum is and why it is not working on my device so 1 star" ***k you. Substratum is a theme app that needs ROOT ACCESS to run on Android 7 and 9 (I might be wrong with 7 but 9 requires root for sure) Also theme isn\'t bad', "I use this theme on most of my Google-free setups (no Play Store). About the only free and regularly updated theme AND available via F-Droid. Works fine on all ROMs where I use it including some without OMS like LineageOS 14.1. Don't know why it's rated so low.", "Don't know why so many users are leaving bad reviews. At least read the description before installing! It's perfect working with my stock oreo. No issues I've found so far. Thanks for keeping up the development, waiting for more apps support.", 'Really nice simple customizable "substratum" theme capable of pure black backgrounds for the system interface. Love the purple on black. Thanks Dev. Great Work!', 'Share menu is still white with white text, so it is pretty much impossible to read the text. Could you fix this? Thanks', 'It\'s not working. When I open it, it shows black screen. And in the upper right corner. When I tap it, it says " I know what I\'m doing".', 'Dark mode everything. Add theme overlays for GApps (especially Play Store, GMail and Calendar) and this is a 5 star rated app for me. Great work done, devs. Cheers!', "Really nice theme 👍 I would advise users to read all instructions and seek assistance if they don't understand something.", 'Giving a 1-star review because you downloaded an app called "Default Dark Theme for Substratum" and then don\'t know what substratum is or how to use it- only out\'s you as a moron! Although I use SwiftDark as my primary theme, I use this one because it\'s the ONLY theme I\'ve ever found that gives you transparent notification shade and transparent notifications on your lock screen. And the effect is stunning... and if we use the Oreo settings that works perfectly in Pie as well; ignore the idiots.', 'System UI worked well in 7.5 version.. Now not working.. In 7.6.. Do fix it..', "Fails to apply and makes substratum crash. FuchsiaOS theme app did it single handedly what I couldn't do with your app.", "I don't understand the bad reviews, works very good for me on an old samsung galaxy tab S 8.4 with lineage os 14.1", 'Perfect ; DARKENS doesn\'t "Blackify" , Nice & Easy on the eyes', "One of the best Substratum themes out there. If you're into having a dark theme, Default Dark is my top recommendation.", "does not work properly on my phone. It doesn't open required root files etc. problematic app. please solve this issue !!!", 'Just black screen, nothing works.', 'Certain bugs in some parts (white on white on notification settings) Or in the storage section in settings', 'You told not to report bug but I want to say that I am on android oreo this app is not working.', 'Rubbish.. After opening app it dont show any thing.. Waited for last 15 minutes Andriod pie updated...', 'my avg app says it detected a malware when i opened it, so i uninstalled it, i rescanned my apps and it says im safe now.', 'NEVER install this app, its just in Play Store to cheat and to lie and to trick you and its just wasting for your time!!! Do NOT install it because you will install after trying it because its the worst!!!', "Worst app ever.It will not work if you have not a substratum. I alao don't know what it is.......😂😂 But please don't install it😕😕", "Don't Install It, Its a LIE, so don't waste your time downloading this useless app, It wont even work, its just a useless app in Play Store to trick you and waste your time!!", "It's bad requires different app with loads of ads", 'If i can give no star than i would...they asked to download three other apps before its running but end up with nothing..!!', "Giving this 1 star just because of the snarky message left by the developer. You may be bitter about people giving you 1 star reviews because their device doesn't support Substratum themes, but essentially calling potential customers dumb and demanding they don't give 1 star is always a policy that gets my back up.", 'Substratum not found Message come, not work', 'not installed this fake app it required to download substratum and nothing will happen.', "Awful app, it doesn't work at all", 'This is litle bit awessom but have some error that made this app rating low', "wht didn't it change? i am on android 7 subtratum installed with root, subtsratum wont change anyhing even with other themes", 'You should have explained what Substratum is in your first Home page for app instead of asking people to not to review it bad... It is fair...', "I don't know why people are giving horrible reviews!! Learn how to use it before you post your stupid comments 🙄🙄🙄 It IS one of the few freely available decent themes for substratum, I like it. To dev: please add support for GApps, especially Google play store.", 'app is useless even with the right device. it is better not to download it.', 'they use 100% brain to earn more .... very bad app .. totally wastage of time nd data'], 'appId': 'de.spiritcroc.defaultdarktheme_oms', 'url': 'https://play.google.com/store/apps/details?id=de.spiritcroc.defaultdarktheme_oms&hl=en&gl=us'}
