{'title': 'Battery Charge Limit [ROOT]', 'description': "NOTE: This app requires ROOT access to work - if you don't know what it is, it is highly probable that your device doesn't have it. There is no other way this app can work on non-rooted phones. Not all devices may be supported as well! If your device is not supported, please follow the help & support text below. Also, checkout xda-developers.com for more information on rooting devices.\r\n\r\nThe app works when the device is plugged in and starts charging below the max threshold and will stop once the device is either unplugged or hits the max threshold, completely stopping charging!\r\n\r\nThe app is OPEN SOURCE, with the source code found on Github:  https://github.com/sriharshaarangi/BatteryChargeLimit\r\n \r\nCheck out the XDA thread for more help & support:\r\nXDA forum link: https://forum.xda-developers.com/android/apps-games/root-battery-charge-limit-t3557002\r\n\r\nHelp & Support\r\nTo request support for a device/issue, please open an Issue on GitHub and a developer will assist you soon!\r\n\r\nThis app is not responsible for unintended behavior - though any changes done by it are usually temporary and typically do not survive a reboot.", 'descriptionHTML': 'NOTE: This app requires ROOT access to work - if you don&#39;t know what it is, it is highly probable that your device doesn&#39;t have it. There is no other way this app can work on non-rooted phones. Not all devices may be supported as well! If your device is not supported, please follow the help &amp; support text below. Also, checkout xda-developers.com for more information on rooting devices.<br><br>The app works when the device is plugged in and starts charging below the max threshold and will stop once the device is either unplugged or hits the max threshold, completely stopping charging!<br><br>The app is OPEN SOURCE, with the source code found on Github:  https://github.com/sriharshaarangi/BatteryChargeLimit<br> <br>Check out the XDA thread for more help &amp; support:<br>XDA forum link: https://forum.xda-developers.com/android/apps-games/root-battery-charge-limit-t3557002<br><br>Help &amp; Support<br>To request support for a device/issue, please open an Issue on GitHub and a developer will assist you soon!<br><br>This app is not responsible for unintended behavior - though any changes done by it are usually temporary and typically do not survive a reboot.', 'summary': 'Stop charging at desired level to preserve battery health for most devices!', 'summaryHTML': 'Stop charging at desired level to preserve battery health for most devices!', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.283951, 'ratings': 1637, 'reviews': 890, 'histogram': [151, 70, 101, 151, 1162], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.3M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'SL/\\SH', 'developerId': 'SL/%5CSH', 'developerEmail': 'sriharshaarangi@gmail.com', 'developerWebsite': 'https://github.com/sriharshaarangi/BatteryChargeLimit', 'developerAddress': '407, A block, Srikanth Residency, Venkojipalem, Visakhapatnam, 530017', 'privacyPolicy': None, 'developerInternalID': '7337387978847751908', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/qbehSHmVyYZZYVXle2sYWOCPB2jqOg12169tMoa0WZOOWFOg2TCq5ixzCvgdc-XTdgA', 'headerImage': 'https://lh3.googleusercontent.com/yvwJrKUsUidtWvsLckLmC4tb0azUj1TbGSDyNUIw1jSIWYR1CQbP95bWw15OpXNMays', 'screenshots': ['https://lh3.googleusercontent.com/pdTmdNKvbCG62c-5Q0u6H9drFvwhwropfjr6AgbNjdkMVjLPfb8dnVaNwU_8Jg-Hrbtt', 'https://lh3.googleusercontent.com/mH9h2dAIPmbm0tPh7EsBKMdXBOA8Osqy7g7Gd_z9PpvwENZTcvqvAEkhMRKwHGsSQI4', 'https://lh3.googleusercontent.com/9mqyhhiKcUGIckJq86nrXOzLRpZf29y8EBPeVoIxkv3__OeUERZOGXI7y9P428mdIA'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 6, 2018', 'updated': 1526285773, 'version': '1.1.1', 'recentChanges': 'UI and stability improvements\r\nAdded support for Amazon Tate\r\nAdded Russian translation and updated other translations \r\nMinor bug fixes', 'recentChangesHTML': 'UI and stability improvements<br>Added support for Amazon Tate<br>Added Russian translation and updated other translations <br>Minor bug fixes', 'comments': ['Installing it on a rooted Nexus 10 will make it boot loop & you have to wipe everything to stop it! This issue has been around for quite some time as well. Also placing the apk in a folder on the N10 from a PC will make the N10 file manager force close on the N10 when opening the same folder! Works fairly well on my Nexus 6 thanks. Will alter my feedback once issue is resolved thanks.', 'OnePlus 7 Pro user here and this app works flawlessly. It will be interesting to see how much longer the battery will last in the long run with this. Thank you for making such a useful app!', "Sadly doesn't quite work for me. Limits the charge, but not at the right value, then it keeps toggling charge on and off for a while, and then it never kicks back on and by morning I'm left with 10-15% lower than what I set it for.", "This app is super good not works in all phones tho not the developers fault works flawlessly! what you're doing is basically transfering your power source to your charger when your battery is stopped charging at a specific level.", "The app did what it was supposed to but in my case it was heating up my phone excessively while charging (the soc not the battery), I was not sure what was causing it but uninstalling the app fixed it for me P.S. :- I have a Xiaomi Mi Mix in case you're a developer and wondering, I would live to hear back from you and potentially seeing it fixed", 'The application was running relatively stable when I used android 9 and I assigned values not above 90 , not below 60 , however after upgrading to Android 10 it keeps running in the background when charging but it exceeds the limit and the batteey reaches 100% .Is there anyway to check and apply a fix in the next update.', "I would really contribute my bucks and give a lot of kisses and hugs to all of these devs for saving my phone's life. Whether or not you have the same problem as mine, this app worth WAY MORE A LOT than you might've thought, so give it a shot. The app's been doing really great so far. Congrats devs!", 'It does exactly what I wanted it to do! I can easily set the max percentage to charge to and what percentage to start charging again! I recommend.', 'Solved both of my problems that restraining mobile from charging to more than 90percent and restarting charging if battery level goes down 1 percent.... With proper settings of that app i can leave the phone with overnight charging without any fear ..thanks dev', 'This Is Nice application .but on Wall Charger its stop charging and ampere meter show No current at 80 % but few hours later mobile reach to 100%. . Then i check on power Bank Its 100 percent working on Power Bank its Totally stop charging.', 'Good, but no, when it recharges, it restores it to the 460 mAh capacity, not the full charge', "Amazing. Does exactly what it's supposed to do. You should add an optional in app purchase for something silly (color theme, etc) so you can get donations.", 'Works perfectly on my Galaxy S5 running Lineage OS 16. Thank you! Also working in my S10!', "I wish this app worked without root. I can't be bothered to root my phone. I guess my four star review is more about Google than it is about this app. Come on Google, let people have the option of increasing the lifespan of their batteries by setting charge limits.", 'Works absolutely well so far. It already has all the features I could ask for. Thanks for making this app!', 'Works perfectly as promised. Extended battery in the long run and never have to worry about unplugging overnight!', 'Love it. Thank you very much for taking the time and putting this up! Needed to manually set settings "Pixel 2" for Pixel 3 (didn\'t auto detect). After that it worked correctly (default setting worked, but it never started charging again after first disable). Also currently the charging icon always stays on (charging stops and starts correctly though)', 'This app works great on my rooted Moto G4. I will no longer need to unplug my phone at night!', 'The app works great! But there is an annoying side effect that the screen turns on and off anytime charging is started and stopped, which can be very annoying and I have not found a workaround.', 'Works perfectly on Pixel 2XL and the ancient Nexus 6 with the last official Android 7.1.1 (on Nexus 6, it needs the option "automatically reset battery stats" that I could not find documentation for)', "Mostly works as advertised on my rooted Note4.  Small issue, when I leave the phone charging overnight, it does creep past my set 80% limit - very slowly (about 2% per hour).  Only happens when the phone is very idle.  I suspect the phone's power saving may be constantly attempting to disable the app, allowing tiny bursts of charging past the limit.", "I am unsure if this is correct behaviour or not but when setting the cap to 80% - 65% it stops charging at 80% BUT it stays at 80 forever.. I fear that it is still charging a little sometimes so that it always stays there. Let me get that right.. When it reaches 80 it should stop charging until it discharges to 65? And if I plug in my charger at say 70%, is it still supposed to discharge until it reaches 65 or would it charge to 80.. This is really confusing.. I'm awaiting a response..", "I like how it allows my phone to stop charging when it reach max capacity. However, if I set a limit to 75%, it would stop charging, but then it would tickle it's way back to 100%. Itusually happens overnight. I even noticed that my battery percentage increased after I unplugged it. I hoped that this app would prevent it.", 'Its a pretty good app. does exactly what it says. But there is a small problem for me, the app doesnt quit automatically when I disconnect the charger, and the notification stays active. Please do something about this. Anyway its been an year after the last update. (Xiaomi Poco F1, Pixel Experience Rom)', 'Nice but some bugs noticed. In MIUI 10.3.4 for poco-f1, the battery reset stats is not working properly. Even checked n hv toast message of reset successfully, it still not clear previous power usage history. Hv to open the app and press the reset button manually then it reset the stat. Otherwise working as advertise. Thanks developer!', 'It corrupted my battery information. Now my phone charges to 50% from 0 in 2 minutes 😂', 'bad notification status: text to long, no custom alarm tone, and the instruction is confusing (it just asking for open the app and always alarming) it would be better if it replaced with eg. sugested user to unplug charge or add action button to snooze alarm or disable/pause apps service when target reached. Anyway, beside that, all good.', 'it work perfect with normal charger, but it gets bug in wireless charging. The app is always open and close rapidly, and the phone not charges. Pls try to make this app work with wireless charger. I use wireless all the time. If it can run at wireless charger, 5 star of couse. Thank for the great app.  P/s I know what go wrong with my case. It because when the phone rich the limit setup. It stop charging and the wireless charger think I remove the device. But after some seconds It automatic check that is there any device ready to charge and find out the phone still there and start charging. At that time, this app think I plus in the charger and let phone charge but it still hit the limit so this app decide stop charge again. Everything go around and around and...... At the end I have to stop using this app in so sorry :((((((.', 'it worked very well, but stopped for no apparent reason. Im using my phone as a home router and this app is the only thing stopping the battery from blowing up because apparently you shouldnt keep a battery at 100℅ charge all day every day.. i wish it was working again.. UPDATE: started working again -\\_°°_/-', 'Life saving app with user friendly GUI for battery of rooted phone for standby purposes with upper limit but lower limit is not working ( I mean it should not charge between these limits). It is also observed that it trickle charges at 0.17 to 0.2amp if the screen is made on. With installation of write_secure_settings etc through ADB shall make it more useful to make it to work even after unrooting. However another app called Magic Charger Switch works as expected with manual editing of configuration file with root explorer in case of Redmi note 4 miui 10. Mcs shows the path as /sys/devices/soc/qpnp-smbcharger-18/power_supply/battery/charging_enabled onKey=1 offKey=0', 'The app should inform if charged to desired level even if the phone is not rooted for those who dont want to root.', 'great app! i use this app for my extended battery case, usually i have to press a button for my extended battery case to start charging and turn it off using the button, this app saves me from doing that because it does it automatically for me. im surprised no one knows about this app who use extended batteries. thank you!', 'Does what it says and stops charging at a % of your choice. Would be even better if it had more details/info like battery health and other stuff.', "Very useful app for those who don't want their phone degraded by overnight charging", "It doesn't work when I turn off my rooted phone/tablet. I like(really, really love) it to work even if my devices are turned off while charging. Even in deep sleep state, battery wasn't really good in charging well since other apps tend to force notifications still. At first, I thought this app can work even if my rooted devices are turned off... sadly, it needs the devices to be turned on, awake & active, so that it can limit the battery charge to a certain level. It's like, as if, I really don't need to turn off my phone/tablet every now & then as long as Battery Charge Limit App is taking charge of the battery while my devices never rest nor sleep! Can you please make it work while my rooted androids are turned off even if it requires users to pay an acceptable amount of money?", "I think it's a really nice and and it works really well, but I just wish there was an option for it to turn on and of by itself at certain time schedules", 'Hello Team, No wrong intention to give you poor rating. But I m facing problem installing it on my Note-8. Please solve the problem. Your app seems very good and a unique kind. You are getting good reviews. But please solve the problem. Try yourself installing it on note-8 and if I m wrong then please correct me by giving proper guidance. Thanks. All the best.', "great work but needs some improves my battery ctrl file was in /sys/devices/platform/battery/enable_charge but app couldn't find it automaticaly and I found and input it manualy I used acc project on github before this app and I intrested in with acc terminal features like limit charging by time and temprature that this app doesn't have these, I suggest you to add these to your app too, anyway I like the app and thanks for your work♥", 'i guess my device is not supported, because when i use it,the percentage is stopped for real,but it stil show that lightning icon which mean it still charging,and when i step up the limit,it just immediately go up and reach the limit again,im using xiaomi mi a1 pie January patch,sorry my bad English', "I love the app, but I'm having one issue. The service/notification doesn't disappear when I unplug my phone, so I have to manually open the app once again or press disable on the notification."], 'appId': 'com.slash.batterychargelimit', 'url': 'https://play.google.com/store/apps/details?id=com.slash.batterychargelimit&hl=en&gl=us'}
