{'title': 'Proximity Service', 'description': "<p><b>Proximity Service</b> uses your device's proximity sensor to control the screen on/off state. Simply covering the sensor will turn the screen off whilst keeping the device awake - perfect for games that need to be running in the foreground but don't need your continuous attention. Flip your phone on a table, place it in your pocket, or use any other means to cover the proximity sensor. As soon as the sensor is uncovered, the screen will come back on.</p>\r\n<p>This app is open source - follow the website link at the bottom of this Play Store listing for the GitHub repo.</p>", 'descriptionHTML': '<p><b>Proximity Service</b> uses your device&#39;s proximity sensor to control the screen on/off state. Simply covering the sensor will turn the screen off whilst keeping the device awake - perfect for games that need to be running in the foreground but don&#39;t need your continuous attention. Flip your phone on a table, place it in your pocket, or use any other means to cover the proximity sensor. As soon as the sensor is uncovered, the screen will come back on.</p><br><p>This app is open source - follow the website link at the bottom of this Play Store listing for the GitHub repo.</p>', 'summary': 'Minimal service for turning off the screen using the proximity sensor', 'summaryHTML': 'Minimal service for turning off the screen using the proximity sensor', 'installs': '500,000+', 'minInstalls': 500000, 'score': 4.14, 'ratings': 2521, 'reviews': 1139, 'histogram': [322, 100, 131, 312, 1653], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.6M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'ssaqua', 'developerId': 'ssaqua', 'developerEmail': 'dev@sungsoo.me', 'developerWebsite': 'https://github.com/ssaqua/ProximityService', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '6810769509769974732', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/tzJCr7BZeF0Q1eTqV0Fv_qXf1sXvrYG49BS9CRaNJAXv7F5AA6zZ6w9-JfXHiteyQQ', 'headerImage': 'https://lh3.googleusercontent.com/hw9Xz0ZfdWvB0N-D1Fv7TgxcyxTK54gGwGx6ES72Pf0E5KeAoixHsLMxMI4KucYiiek', 'screenshots': ['https://lh3.googleusercontent.com/_DmNc1TC-3poOzbyu6nBX_5d-G-bKT_j9uEJy5jVkYQ22AZypb6ZBt-yiXfkT30JcWg', 'https://lh3.googleusercontent.com/L6p5JMulRFy3djjC2BNZ4UJp6UFCMPUUvrV0JdSDSGDn13_7ntV2lp7WLt9IcCFEtKk', 'https://lh3.googleusercontent.com/NWwwNUjT7zt7Y88W-p_6zJNSgK8H2U6_GsQjDl1fT75SFBrJ2PICbueyQJu7yTo8dnc', 'https://lh3.googleusercontent.com/sXSr5lfmDBkeFxouJBUWuQJZO-hkfe3anuudO7DUrPoR1WStb8LVb_ufL8_5r7oZKHY', 'https://lh3.googleusercontent.com/2z4_asijjccmbRLWRRMEr3YU5qpdB0DmDL0gxnN04TzeVCfzofFMjiAzEXVyscUEUnQ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 14, 2016', 'updated': 1578092236, 'version': '2.2.6', 'recentChanges': '- Fix bug related to screen off delay', 'recentChangesHTML': '- Fix bug related to screen off delay', 'comments': ['Great app, very useful if you are grinding a game. For people experiencing difficulties, please turn off your power saver and allow the app to manage manually. This will keep the app from running. Just cover your sensor and your good to go.', "It's a good application, it saves your battery. It works very nicely. But it doesn't work in all phone, what I mean if you have old model phone do you may face problem , otherwise it's perfect", "There's a consistent issue where the service stops entirely. It's usually only a matter of minutes, then I have to turn it back on. Please fix this! Edit: It's since been fixed and works like a charm now!", 'Thank you so much. I had a problem with my brand new Mate35 phone where puttng it to my ear during a call caused the settngs menu to appear, and different settings would start randomly. Occaisionally it would activate airplane mode, ending the call. Extemely frustrating!! With this smple proximity sensor service that problem is solved. Thank you again. :)', "Extremely grateful for this app. I'm a contractor and on the job I like to listen to YouTube podcasts. I turn on this app and throw my phone in my pocket. I don't have to worry about my phone pressing buttons or anything because I know p service is doing its thing. Love it. Love you guys. 🙌", 'Worked in my phone.one problem is that when my device is restart this app automatically not blocking the sensor.', "Amazing app, it fits my expectation. But it would be much better if being added toggle to kill the app not only stop the service, so it won't eat any power at all when not needed.", 'Not properly work in samsung phones. Please fix the problem.', 'Works great, but after the last update turning the service on/off is very delayed, especially if using the shortcut button in the notification panel. Samsung S9+', "It would be great if I could find a way to have it auto start after a reboot. Otherwise, it does what it's supposed to. Thanks.", 'Used to work great on my s9+, but since I got my s20 ultra the app no longer works.', 'There is a noticeable flickering of the screen when turning back on.', 'You are life saver, I was not satisfied with One Plus 7T proximity operation. Now really want to say thanks to developer.', "Doesn' t works on my note 8 pro from quick menu. Fix this please.", 'Missing of option to start automatically after reboot.', 'Good app, but not working while TOI app read news....', 'This app iam using last 3 to 4 year but i have not issue aney Time happy', 'After open this apps..my screen go blank until battery die', 'WOW, great App, it solved my problem.', 'its very good app . amazing awesome app . mind-blowing', 'Still crashing on the Pixel 2 after the December 2019 update, if used from the Quick Setting. If I choose the app from the app crash pop-up, choose the app, then turn it on, it works. Annoying.', 'Excellent solution to a problem no manufacturer solves: what happens when a call comes and your phone is in the pocket.', 'I love what this service accomplishes, allowing me to put my phone down, with the screen off, but lets an app keep running. I dislike the fact that it randomly turns itself off (or crashes, I can\'t tell which) a few minutes after I turn it on, until I finally get it to "stick" and stay on. Not sure if this issue is the app or my phone, but it\'s all that\'s keeping this from having 5*.', "Excellent app for shutting the screen off. It's the simplest one I've seen. I wish it would have an auto-restart option. Please put that in your next version. Keep up the great work! UPDATE : I have found an app called AutoStart that I recently installed. I put the Proximity Service app in it to start it up on reboots. It works perfectly. No more worries about it not starting. UPDATE : The app does not stay working with Android 9. It would be nice if it would? Please fix it!", 'Have been looking for a fix for the Google Voice and Hangouts dialers. There is a major bug for these dialers (apparently on Samsung devices) where the proximity sensor does not work during calls. Once I installed this app I was able to FINALLY use Google Voice without clicking hundreds of things on the phone during calls or forced to hold away from my ear. Thanks!', 'Awesome app. I wish I had found this before.', "My lock key is broken. If I press lock button, it gets stuck and phone keeps restarting in a loop and it's difficult to stop. Then I installed this app and it works like a charm. I don't see any battery issue like it happens in other app. Only improvement which I would like to see is, after phone restarts this app should start automatically which isn't the case right now.", 'Loved this app for its simplicity. When on call my touchscreen used to automatically wake up. I have faced this issue on Android for years now. It used to be frustrating when while on call my phone user to get muted because of my ear or check touching the mute or some other button. Life is good with this proximity service. I wish the app also provided an option to autostart during boot up. On my resurrection remix I was not able to find an option to autostart this service.', "Fantastic and it's free too! Works on BlackBerry KEY2 Android without interfering with the built-in double-tap screen off setting. No conflicts. Wish I could disable Notification without inactivation. Plus, as many have commented here, need to reactivate after a reboot - not a big deal. In any case, thanks to the developer for such a lovely and functional app. Thank you.", "Great concept but doesn't seem to work beyond 30 seconds. I've reviewed the settings and I don't see anything where it reactivates the screen after a certain point, only settings that cause a delay before turning screen off. I was excited to try this to allow apps to run overnight without killing my screen and preventing screen burn but unfortunately after 30 seconds the screen comes back on defeating the purpose of this app for me.", "Perfect. I've been in search an application which does this job since a couple of days...and here it is. Thank you Dev. You made my day. Would you please provide an option to add the service to startup. Also an option to 'delay to switch on screen' similar to the given option to 'delay to switch off screen' requested..", 'Best app, it\'s better than the Proximity lock unlock app I have. It\'s because of that "direct home screen redirection" and, "off when sensing close, on when sensing far". Only downside is that it may be insecure. Proximity lock unlock app is better at security, this app is better at algorithms.', 'It is really a wonderful app but it stops working after 5 to 10 minites when phone is not in use. Single tap is necessary on its icon to use it again. So, please fix this issue so that the icon does not have to be clicked again and again.', "Was working perfectly on my Galaxy s9, but now that I've upgraded to the Galaxy s10 it doesn't work at all. Will patiently wait for an update to fix the issue, then adjust my rating to 5 stars. It is a super useful app and would love to be able to use it again.", 'Useful and reliable. The optional 0.5 - 3 second delay is helpful. I set mine to 1 second to prevent accidently turning my screen off. However I find it hard to access the options, because the options screen tends to disappear when I try to access it.', "Perfect for keeping the phone from overheating by staying on all the time when you got an app running!  Only downside, the app doesn't seem to memorize the settings (I want it to stay and retain the notification but it keep switching back to dismiss for some reason)", "App works very well, but turns itself off a few minutes after closing the cover. It's a shame because it's ability to detect cover open or close is much better than anything else. Please fix this issue. (Nokia 6.1 android 9)", "It turns the screen off as intended when the proximity sensor detects something, but, contrary to the app description, the phone doesn't keep running while the screen is off. I used it for a game and as soon as I I picked up the phone, it turned back on, but the game froze and reloaded as if I had just put my phone into sleep mode", 'Not working on redmi note 5 pro', 'The service works as intended, where the screen physically turns off, but is still functional e.g. if you have an auto clicker running. The service does however often seem to shut down or crash, even after having disabled battery optimization for the aervice on my OnePlus 6.'], 'appId': 'ss.proximityservice', 'url': 'https://play.google.com/store/apps/details?id=ss.proximityservice&hl=en&gl=us'}
