{'title': 'phyphox', 'description': "Did you know that you are carrying a 3D magnetometer? That you can use your phone as a pendulum to measure earth's local gravitational acceleration? That you can turn your phone into a sonar?\r\n\r\nphyphox gives you access to the sensors of your phone either directly or through ready-to-play experiments which analyze your data and let you export raw data along with the results for further analysis. You can even define your own experiments on phyphox.org and share them with colleagues, students and friends.\r\n\r\nSelected Features:\r\n- A selection of pre-defined experiments. Just press play to start.\r\n- Export your data to a range of widely used formats\r\n- Remote-control your experiment through a web interface from any PC on the same network as your phone. No need to install anything on those PCs - all you need is a modern web browser.\r\n- Define your own experiments by selecting sensor inputs, defining analysis steps and creating views as an interface using our web-editor (http://phyphox.org/editor). The analysis can consists of just adding two values or using advanced methods like Fourier transforms and crosscorrelation. We offer a whole toolbox of analysis functions.\r\n\r\nSensors supported:\r\n- Accelerometer\r\n- Magnetometer\r\n- Gyroscope\r\n- Light intensity\r\n- Pressure\r\n- Microphone\r\n- Proximity\r\n- GPS\r\n*some sensors are not present on every phone.\r\n\r\nExport formats\r\n- CSV (Comma separated values)\r\n- CSV (Tab-separated values)\r\n- Excel\r\n(if you need other formats, please let us know)\r\n\r\n\r\nThis app has been developed at the 2nd Institute of Physics A at the RWTH Aachen University.\r\n\r\n--\r\n\r\nExplanation for the permissions requested\r\n\r\nIf you have Android 6.0 or newer, some permissions will only be asked for when needed.\r\n\r\nInternet: This grants phyphox network access, which is required to load experiments from online resources or when using the remote access. Both are only done when requested by the user and no other data is transmitted.\r\nBluetooth: Used to access external sensors.\r\nRead external storage: This is may be necessary when opening an experiment stored on the device.\r\nRecord audio: Required to use the microphone in experiments.\r\nLocation: Used to access GPS for location-based experiments.\r\nCamera: Used to scan QR codes for external experiment configurations.", 'descriptionHTML': 'Did you know that you are carrying a 3D magnetometer? That you can use your phone as a pendulum to measure earth&#39;s local gravitational acceleration? That you can turn your phone into a sonar?<br><br>phyphox gives you access to the sensors of your phone either directly or through ready-to-play experiments which analyze your data and let you export raw data along with the results for further analysis. You can even define your own experiments on phyphox.org and share them with colleagues, students and friends.<br><br>Selected Features:<br>- A selection of pre-defined experiments. Just press play to start.<br>- Export your data to a range of widely used formats<br>- Remote-control your experiment through a web interface from any PC on the same network as your phone. No need to install anything on those PCs - all you need is a modern web browser.<br>- Define your own experiments by selecting sensor inputs, defining analysis steps and creating views as an interface using our web-editor (http://phyphox.org/editor). The analysis can consists of just adding two values or using advanced methods like Fourier transforms and crosscorrelation. We offer a whole toolbox of analysis functions.<br><br>Sensors supported:<br>- Accelerometer<br>- Magnetometer<br>- Gyroscope<br>- Light intensity<br>- Pressure<br>- Microphone<br>- Proximity<br>- GPS<br>*some sensors are not present on every phone.<br><br>Export formats<br>- CSV (Comma separated values)<br>- CSV (Tab-separated values)<br>- Excel<br>(if you need other formats, please let us know)<br><br><br>This app has been developed at the 2nd Institute of Physics A at the RWTH Aachen University.<br><br>--<br><br>Explanation for the permissions requested<br><br>If you have Android 6.0 or newer, some permissions will only be asked for when needed.<br><br>Internet: This grants phyphox network access, which is required to load experiments from online resources or when using the remote access. Both are only done when requested by the user and no other data is transmitted.<br>Bluetooth: Used to access external sensors.<br>Read external storage: This is may be necessary when opening an experiment stored on the device.<br>Record audio: Required to use the microphone in experiments.<br>Location: Used to access GPS for location-based experiments.<br>Camera: Used to scan QR codes for external experiment configurations.', 'summary': 'Perform physics experiments with your phone. (by the RWTH Aachen University)', 'summaryHTML': 'Perform physics experiments with your phone. (by the RWTH Aachen University)', 'installs': '500,000+', 'minInstalls': 500000, 'score': 4.5348835, 'ratings': 3485, 'reviews': 1184, 'histogram': [131, 81, 212, 425, 2634], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '7.1M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'RWTH Aachen University', 'developerId': 'RWTH+Aachen+University', 'developerEmail': 'contact@phyphox.org', 'developerWebsite': 'https://phyphox.org', 'developerAddress': 'IT Center RWTH Aachen University\nSeffenter Weg 23\n52074 Aachen', 'privacyPolicy': 'http://phyphox.org/disclaimer', 'developerInternalID': '5002709353148645145', 'genre': 'Education', 'genreId': 'EDUCATION', 'icon': 'https://lh3.googleusercontent.com/jHcAAnRBdCBqWmgW3Mya2BSO6enybt7PNDxgPN8BLpTOfkPUOXDaKPWnPMUI1QT-mCc', 'headerImage': 'https://lh3.googleusercontent.com/C2lzGIC0_2_MRSJbLqAf4yoLHwyErMFIJuOGT4ulygFf6LE7t6EjjxZAOsEbWi54R4s', 'screenshots': ['https://lh3.googleusercontent.com/Ec2pj24gwo8vaY-rDceSqwisVnA9YJ-6WyAe97Z1ijkYtWaqVI90gFLbH7nSf8ggwg', 'https://lh3.googleusercontent.com/LBkwIPcoxHNI_2Q8RJgOam7hgQFvzA-vgvVsl8sVGR3jdT4g_iMhxJSNwABbl-PQIQ', 'https://lh3.googleusercontent.com/PKhq8GWa0-1W1B8OpTJYVYKCFdsrFe5ORmY-QGJuK_N6Z2f8nI03Iu2CdvDO2pcwr0I', 'https://lh3.googleusercontent.com/brHKaWyS8wyH7S-109k6zXhYbToQ3n03uzetIttKPa3jlvPyR3Ftd3arKXMUCiha0E0'], 'video': 'https://www.youtube.com/embed/xbafUQto5uk?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/xbafUQto5uk/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 9, 2016', 'updated': 1584657711, 'version': '1.1.5', 'recentChanges': '- Spanish translation\r\n- Turkish translation\r\n- Spectrum experiments now have a peak frequency history plot\r\n- The apply-zoom dialog when leaving a graph now defaults to "reset", but remembers if you want to keep the zoom for the next time.\r\n- Many bugfixes (see phyphox.org)', 'recentChangesHTML': '- Spanish translation<br>- Turkish translation<br>- Spectrum experiments now have a peak frequency history plot<br>- The apply-zoom dialog when leaving a graph now defaults to &quot;reset&quot;, but remembers if you want to keep the zoom for the next time.<br>- Many bugfixes (see phyphox.org)', 'comments': ["It great I've long awaited somthing like this it really is great to see. I only ask if there's away to increase the magnetic field or power of the sensor or expand the capabilitys of the magnometer please make it happen the metal detector apps are good for the field but I jus would think there be a way to increase the strength of it or use all magnet systems in the same way to achieve the desired level of strength I'm sure there's a way to do this without damaging the rest of phone too much", "A great physics thing. The problem is that, I haven't figured out how to utilise all of them. Thank you for the frequency generator especially", 'This is Such a Cool App. Huge Thanks to the Creative Crew. Measuring Shockwave from 2 blocks away of overloaded high impact Oil Tanker Trains rolling by,, simply laying phone on bed, and saves to file is so slick. Cheers', 'This app is truly amazing! And I just discovered probably less than 1% of all the features...', 'Easy, simple, powerful app to use cellphone sensors.', "Very nice app to use all your phone's sensors", 'You get lots of physics lab devices just with your smartphone. Make sure to use their youtube videos to get ideas.', 'Had/Have App on several mobiles & tablets [several yrs] & WOW. These Dudes/Devs are Proper Based! Incredible features, visuals, guides, options, combinations... & So Much Data! (Sry. I = An Über-Nerd) Plus, it\'s a unique tool to learn ab your device/sensors & the wonderful world of Physics! Cool YT Channel, Super-Friendly Support & Really Fun/Cool Experiments encouraging kids/mates/family/you to discover the "How\'s, Why\'s..." & myriad queries applicaple to both Daily Life &/or Uni Coursework!', "OMG I'm like a kid in a candy shop! Was only expecting some nifty eye candy representation of data.. Not a full blown toolset of epic little goodies. Echo location is bloody brilliant, reliable on my XZP upto about 30 meters. Do love the audio filters and tools you've added, Doppler and Correlation have come in useful. Thanks Dev, keep it up!", 'It is hard to believe that such a valuable, versatile, and well-organized app exists, never mind for free and without ads or other bloat. If I could suggest one improvement: I was very surprised that you can\'t view the spectra you\'ve taken over time as "carpet"-style spectrograms. I\'d really like to see that functionality.', "I found out about this app from the presentation at the 2019 CCC conference. It's a great app to do understand the phones sensors and other many other thing! Thanks you for the nice work and releasing this as an open source app.", 'Funtastic scientific tool.', 'Amazing app, open up lots of opportunities to learn more.', 'Add wakelock support. I want to record for an hour and not drain the battery with screen on. Right now it stopa recording when putting to sleep. Also real clock time is missing from csv exports.', "App hijacks extension settings without warning or ability to disable. I had other apps set, or never set a default, but this app decided i wanted to see its fail log for everything. Why does an app like this need to take over opening zip and py files? Yeah, I don't know either.", 'Ha! Every phone in my opinion, should come with this type of readouts... instead of bloatware that collects excess useless data that fills up your phone over time. Main sensors reads are nicely categorized into easily understood menus, and overall theme is clean and straightforward. Good job guys.', "Exceptional for classroom use - as a teacher (age groups 11-18) it's fantastic that I can set my phone up in place in an experiment & then control and display all the information in real time on a screen through a browser. Makes data-logging equipment for demonstrations look poor in comparison & the number of sensors it accesses is awesome.", 'A very well made app. Really insightfull and extremely data driven. Big thumbs up to the data export feature.', 'Lots of fun physics!', "Oh this is better than any game, using your phone for fun/interesting/eduational experiments Mind to keep the lid on the silly/stupid. eg. acceleration testing yr phone into concrete will probably destroy yr phone (as well as not giving a test result). There's good explanations for the uninitiated. The looks you'll get during your commute to work, priceless. Uninstall your Minecruft, Phyphox is here to activate your brain. Unleash your curiosity. Totally amesome! n.b. Phyphox is no toy.", 'Hi, It is good, I would say. In the location(GPS) section, instead of " height" you should write " Altitude"', 'Great app! Creates a website for other devices to connect to and browse an ongoing datacapture from an experiment. The data can be exported to a csv file, so it would be possible to further prosses it in Excel for example. Wonder if it would be possible to use it together with a ti nspire cas calculator somehow?', 'The best application I can imagine. It can be used to diagnose your phone too, to find if any sensor is busted... also you can find any live wires in the walls before put any nails through. Or play cool experiments with your kids. The limit is your imagination.', 'Super awesome! This is one of the best raw data device access and recording app ever. Good work developers!', 'Great app for exploring device sensors. Wish I had this when I was a kid.', 'Amazing. Simple to use and a ton of possibilities for experiments.', 'Almost everything I need in one package. Raw data filters would be great - threshold setting for accelerometer, for instance, could be extremely useful, since they are noisy as hell.', 'Great collection of tools. Thank you for keeping it tracker free.', 'Great Execution and Design, love the GUI. A small recommendation to the developers, offer a bit more in depth guidance to assist noobs with initial use.', 'This is the best app to access raw data from each individual sensor on your phone. Absolutely no limitation to the possibility of application to experimentation in everyday situation!', 'Friggin AWESOME app! It had a wide variety of measuring tools that are both fun to play with and useful! I am so very happy to have stumbled across this inedible app!', '..available sensors & data. allows different ways to organize & use data. inspires different uses, views of phone sensors (or lack of) hardware', 'this app is very good for exploring your sensor functioning on your phone as well as for doing experiments using that information I highly recommend it and there are no ads or any kind of spyware on this', "This is a very cool app. I didn't know the phone I have could sense when I squeeze it. A lot of great and useful tools that work good.", "Great app. All Physics teacher should use it particularly if they don't have a lab. Thank you very much  for this work.", "Hats off,,,, the APP, ... getting raw data so easily from all the device's sensors.. 😍😍", 'This is the best app I have ever found, feel like im in the 29th Century. Just gotta watch out for Suliban now! This app should definately come with all mobile devices.', 'Cool! So many different experiments. Also like the applause meter.', 'an amazing effort here....clearly much time and toil has been spent creating this amazing app. ...i never knew my phone had all these sensors on it', 'no nonsense, feature loaded depending on the host device and q piece of cake to use.'], 'appId': 'de.rwth_aachen.phyphox', 'url': 'https://play.google.com/store/apps/details?id=de.rwth_aachen.phyphox&hl=en&gl=us'}
