{'title': 'Standard Notes', 'description': "Standard Notes is a simple and private notes app. It syncs your notes securely across all your devices, including your Android devices, Windows, iOS, Linux, and Web.\r\n\r\nPrivate means your notes are end-to-end encrypted, so only you can read your notes. Even we can't read the contents of your notes.\r\n\r\nSimple means it does one job and does it well. Standard Notes is a safe and lasting place for your life's work. Our focus is making it easy to write notes wherever you are and syncing them with encryption to all your devices.\r\n\r\nOur users love us for:\r\n• Personal Notes\r\n• Tasks & Todos\r\n• Passwords & Keys\r\n• Code & Technical Procedures\r\n• Private Journal\r\n• Meeting Notes\r\n• Cross-platform Scratchpad\r\n• Books, Recipes, & Movies\r\n• Health & Fitness Log\r\n\r\nStandard Notes comes free with:\r\n• Seamless sync across all your devices, with easy to use applications on Android, Windows, Linux, iPhone, iPad, Mac, and web browsers.\r\n• Offline access, so you can access your downloaded notes even without a connection.\r\n• No limit on number of devices.\r\n• No limit on number of notes.\r\n• Passcode lock protection, along with fingerprint protection.\r\n• A tagging system to organize your notes (like #work, #ideas, #passwords, #crypto).\r\n• The ability to pin, lock, protect, and move notes to trash, which allows you to recover deleted notes until the trash is emptied.\r\n\r\nStandard Notes is completely open-source, which means when we say your notes are encrypted with AES-256 encryption, and that only you can read your notes, you don't have to take our word for it. Our code is open to the world to audit.\r\n\r\nWe made Standard Notes simple because longevity is important to us. We want to make sure we're here, protecting your notes, for the next hundred years. You shouldn't have to find a new notes app every year.\r\n\r\nTo sustain our development, we offer an optional paid program called Standard Notes Extended. Extended gives you access to powerful tools including:\r\n• Productivity editors (like Markdown, Code, Spreadsheets)\r\n• Beautiful themes (like Midnight, Focus, Solarized Dark)\r\n• Powerful cloud tools including daily backups of your encrypted data delivered to your email inbox every day, or backed up to your cloud provider (like Dropbox and Google Drive).\r\n\r\nYou can learn more about Extended at standardnotes.org/extended.\r\n\r\nWe're always happy to talk, whether it be a question, thought, or issue. Please feel free to email us any time at help@standardnotes.org. When you take the time to send us a message, we'll be sure to do the same.", 'descriptionHTML': 'Standard Notes is a simple and private notes app. It syncs your notes securely across all your devices, including your Android devices, Windows, iOS, Linux, and Web.<br><br>Private means your notes are end-to-end encrypted, so only you can read your notes. Even we can&#39;t read the contents of your notes.<br><br>Simple means it does one job and does it well. Standard Notes is a safe and lasting place for your life&#39;s work. Our focus is making it easy to write notes wherever you are and syncing them with encryption to all your devices.<br><br>Our users love us for:<br>• Personal Notes<br>• Tasks &amp; Todos<br>• Passwords &amp; Keys<br>• Code &amp; Technical Procedures<br>• Private Journal<br>• Meeting Notes<br>• Cross-platform Scratchpad<br>• Books, Recipes, &amp; Movies<br>• Health &amp; Fitness Log<br><br>Standard Notes comes free with:<br>• Seamless sync across all your devices, with easy to use applications on Android, Windows, Linux, iPhone, iPad, Mac, and web browsers.<br>• Offline access, so you can access your downloaded notes even without a connection.<br>• No limit on number of devices.<br>• No limit on number of notes.<br>• Passcode lock protection, along with fingerprint protection.<br>• A tagging system to organize your notes (like #work, #ideas, #passwords, #crypto).<br>• The ability to pin, lock, protect, and move notes to trash, which allows you to recover deleted notes until the trash is emptied.<br><br>Standard Notes is completely open-source, which means when we say your notes are encrypted with AES-256 encryption, and that only you can read your notes, you don&#39;t have to take our word for it. Our code is open to the world to audit.<br><br>We made Standard Notes simple because longevity is important to us. We want to make sure we&#39;re here, protecting your notes, for the next hundred years. You shouldn&#39;t have to find a new notes app every year.<br><br>To sustain our development, we offer an optional paid program called Standard Notes Extended. Extended gives you access to powerful tools including:<br>• Productivity editors (like Markdown, Code, Spreadsheets)<br>• Beautiful themes (like Midnight, Focus, Solarized Dark)<br>• Powerful cloud tools including daily backups of your encrypted data delivered to your email inbox every day, or backed up to your cloud provider (like Dropbox and Google Drive).<br><br>You can learn more about Extended at standardnotes.org/extended.<br><br>We&#39;re always happy to talk, whether it be a question, thought, or issue. Please feel free to email us any time at help@standardnotes.org. When you take the time to send us a message, we&#39;ll be sure to do the same.', 'summary': 'A simple and private notes app.', 'summaryHTML': 'A simple and private notes app.', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.07971, 'ratings': 1410, 'reviews': 677, 'histogram': [112, 91, 214, 143, 848], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '6.4M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Standard Notes', 'developerId': 'Standard+Notes', 'developerEmail': 'hello@standardnotes.org', 'developerWebsite': 'https://standardnotes.org', 'developerAddress': None, 'privacyPolicy': 'https://standardnotes.org/privacy', 'developerInternalID': '6035666363033743741', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/yE8spVlVS8DxeK0eDkgoMw2TgTckRojptYQLW8UUuXrg1X4wpld_G0SmNgJSDzBdlxvv', 'headerImage': 'https://lh3.googleusercontent.com/GsAFrU_dJAFkdUH4ocfhPgYYz2hhius00_EFYNjt99ABdbWQ65MV8WjLMb6cQ3vNNOUQ', 'screenshots': ['https://lh3.googleusercontent.com/S-_JaSa2co_l0ZpP0bzPLO7hESr6e0z635UjhUXjSrCUBxAFBib5WX3ZzfjEPc-8Cmpa', 'https://lh3.googleusercontent.com/jM68NWGwzPsB0kkMteL06t3a1xWRo-Fwst_9LLs-68TNdk9dbt9pQY0jY8O_4YeeDA', 'https://lh3.googleusercontent.com/CLswXraYlad1tlWPLiF_XLa3K2zyiLb0jxPvEq4Vvstis2E3YuoAt9Nb8lm7VAsIesg', 'https://lh3.googleusercontent.com/lkZ9L6GlXM5xb--J-8kimJi6WqRPxDFLTM98C-4nxBppvrWLHydNJ3GQdNeGNOetgNN8', 'https://lh3.googleusercontent.com/nAgrthKW959EF5P9_NSyeiWzdpGYaVhyBu6BRJ_DDTQM6DTsAoayv_T9-cT7DFj6ESnb'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Oct 13, 2017', 'updated': 1580752553, 'version': '3.0.21', 'recentChanges': '- Adds ability to specify existing themes as either the Dark Mode default or Light Mode default. You can access these options by long-pressing on a theme.\r\n- Removes splash screen for new users that required them to sign in or register, and instead shows a non-obtrusive banner in the list of notes reminding users to register to keep their notes backed up.', 'recentChangesHTML': '- Adds ability to specify existing themes as either the Dark Mode default or Light Mode default. You can access these options by long-pressing on a theme.<br>- Removes splash screen for new users that required them to sign in or register, and instead shows a non-obtrusive banner in the list of notes reminding users to register to keep their notes backed up.', 'comments': ["This app provides an excellent haven from all the intrusion we have to put up with these days. It has a polished feel as well as being user-friendly with a simple, light structure. I'm more than happy to support the devs with a paid subscription as they are not just providing everyone with a reliable and secure place for note taking and file storage, they are hosting syncing services as well which you can't do for free. The extensions which are made available in return are well worth it.", '"Potentially out of sync" error occurs very frequently. The solution it offers is to backup the notes, and re-login and sync. Then you\'ve to manually check each note to see if anything is missing, and if so, use the backup to retrieve it. That\'s the worst way an app can solve the inconsistencies in sync. Better to look for other alternatives. If sync error occurs you\'ll never get your notes data back as data is encrypted. And that\'s a big loss for me, not to forget a big inconvenience too.', "What I like about this - it's a perfect middle ground between rudimentary note apps and word processor - it's open source & encrypted so no worry about security - there is desktop version available which is highly customisable What i don't like - there is no text customisation what so ever, even bold,italic selector( in free version) - dark mode for mobile version would have been nice - grid view is absent. - you can't insert image in notes .", "I am moving away from using One Note in favor of this and I'm really blown away by the capabilities offered through the extensions, notes in markdown is just what I needed and it's super cool to have the flexibility exactly the way you want it as a user. The only thing that jumps out to me as missing right now is the ability to draw using touch screens. 10/10 otherwise!!", 'Mixed experience. Good security levels, but some problems with sync errors. For me, some apps that have more engaging interface become more frequently used and more enjoyable. I especially like the new Bundled notes app (still in beta but superb already)', "Love it. But can't use it as much as I would like because of a long-standing bug causing the cursor jumps to the beginning on a new note after local data loads. I can't use it as my quick thought notepad for this reason alone.", 'Very basic. Needs the ability to add check boxes to make to do lists. Otherwise the encryption works well. No syncing issues between Android and Windows. The aesthetic is also nice. Making some minor tweaks will make this a 4 star app.', 'I really want to like this as I value open source and privacy. Unfortunately, it is a terrible hot mess of badly made choices due to code focus rather than a USER focus. Examples: - Plain text notes without basic functionality like lists, links, etc. Paid upgrade to make usable - Files attached via a system of uploading to a third party cloud. - Backups are also external - Extension system complexity - UX It would be better to have it user friendly and instead charge for cloud storage.', 'Testing options for a better alternative than Evernote. So far it handles adequately, not *quite* the same polish as Evernote but the core functionality is there including syncing between multiple devices so this could be the one that finally allows me to separate from Evernote and their exhorbitant subscription scheme. Looks very promising.', "Standard Notes is a good application. I have bought it. But there is a problem with Markdown plugin, the part of text is under keyboard and I can't see the text when I am writing.", 'It seems like a great app but I think having a list option (as in checklist) would be a very nice improvement to see added sometime. Other than that, at first glance I think it has everything I want, so thanks.', 'Great app. Secure app. Changes to notes on one device appear almost instantly on another device. Changes are transmitted in encypted format. Notes are extremely easy to create and maintain. I use this across android, ios, and win10 devices.', "Search doesn't highlight searched term. No formatting ability. I like the easy ability to export notes. Without formatting, ability to have hierarchical notes nor highlighted search results it does not work as a note taking app.", "Love it! After I switched away from Googles services, I tried out about 15 different notes apps to replace Keep, and Standard Notes is hands-down the winner. Awesome job guys, keep it up! If you upgrade to the pro version, there's tons of plugins and features: tags, editors, themes, secure lock, pin notes ets. And it's truly cross-platform too! This makes it a viable alternative to EverNote, OneNote, Dropbox Paper etc. The difference with S Notes is that it's secure, private and trustworthy", "I love the concept, business plan, and privacy, but the apps need work. On a Google Pixel 2 running Android 9 the app refuses to unlock after the phone is put in standby. You have to close the app and reopen it which is a huge pain. I've also had sync issues across multiple devices where sometimes Standard Notes creates another copy when it detects a conflict and sometimes just gives up and forces you to log out and start over potentially losing data on that device. OneNote wins on sync.", "okay I'm upping to 3 stars from one as the app is finally working. mysteriously wouldn't allow login but after many attempts was finally able to login. Warning there is no password reset and I was unable to delete the account. the free version is very basic but the security features seem good. I am intrigued about the features available in the 5 year plan and will consider it if the app proves to be reliable. I will try it out for now and see.", 'Standard Notes is an average notes app when using the free tier, but is capable of scaling up to be as complex as you need it with extensions as a paid service. My only complaint is the pricing, but when compared to Evernotes $7.99/mo, it really is a fair price for the added encryption and privacy.', 'Requires registration. Uninstalled. Update: Unlike comment of developers, the most recent version does NOT contain button "Other options". There is a button "Advanced options" that existed also in the previous version. It gives the possibility to specify server URL. But there is no way to skip registration. Again UNINSTALLED.', 'Dark theme (long press on existing theme) does not work. No font size adjustment. Like the open source, cross platform, encryption and search functions.', 'This is the cross platform notes app that works on every device I use. The notes are end-to-end encrypted which is the best form of security that anyone could rely on. It syncs immediately while making/editing a note, thus making sure that any part of the note is not lost in case of a power failure.', 'This is wonderful service. But when I am trying to install on my android phone, it is taking forever to install. Please find a solution as soon as possible.', "This is the best free cross-platform application I've found for taking notes in an encrypted format. Works on linux, android, and windows flawlessly that I've tested", 'Simple notes encrypted and securely synced. Beautiful and easy interface.The business model and focus on sustainability also adds a measure of reliability.', 'Always says "potentially out of sync". Network issues are non-existent for me.', 'Forced login to use EDIT: yes, forced account registration is no longer required. The app has a good design and is working smoothly. The fingerprint implementation also is really good. How do I add images to notes though? Is that even possible?', "Thèmes don't work ... No dark mode = refund time. Come on, you have the feature, just make themes work. OnePlus 5T", "Works flawlessly. Doesn't use screen space to display as much note text as possible. Switch to multiple columns", 'Pretty simple. Does not have any special features in the free version. But it is ok. But I like that it is encrypted.', 'locked notes annoying text added then erased. make it uneditable in 1st place. both Bold and Plus editors have very annoying issues. change side menu animation to something less comolex and drawn out.', 'Awesome. Truly multiplatform and smooth to use. Great UX.', 'Accidentally deleted a load of text while trying to select all and copy only to find out the humble undo feature is a luxury that costs $9.99 a month. Loved this app until a simple mistake cost me hours of work. Sorry but no more recommendations from me!', 'App itself is good. But with paywall for extra editors makes it less attractive compared to simple note app.', 'Clean, private, syncs easily across devices. No complaints so far.', "Lacks the most basic editing features. Doesn't even have a todo list.", 'Does one thing and does it well. Extendable, privacy focused, open source, and here for the long run. Been using it for years, and will be using it for years to come.', "Finally, an encypted note app with cloud Sync. A few more features (Note linking pleaaaaase!) would be nice, but it has tags so I can't really complain. Premium is also priced well.", 'Best notes app, hands down and meets all the security and privacy concerns', 'Grate app. But I would like to have better search option through text of notes. I want to find not only a note that contains a needed word, but the word itself within the note.', 'locked out of my app when i upgraded from pixel 3 to pixel 4--- previously (pixel 3) used fingerprint lock--- pixel 4 has face unlock--- but i cannot get into app that prompts me for non-existent fingerprint--- cannot get back even to old password', 'The note app I ever wanted! Synch, encripted with zero-knowledge, good interface!'], 'appId': 'com.standardnotes', 'url': 'https://play.google.com/store/apps/details?id=com.standardnotes&hl=en&gl=us'}
