{'title': 'FlutterHole for Pi-Hole®', 'description': 'Warning: this app has been tested exclusively on the Pi-hole V5 API. It is recommended to update your Pi-hole to V5+ before installing this app.\r\n\r\nFlutterHole is a free third party Android application for interacting with your Pi-Hole® server.\r\n\r\nFeatures:\r\n*Quick enable/disable: Toggle your Pi-hole from your home screen with a single tap.\r\n*Multiple configurations: Easily switch between every Pi-hole that you have access to.\r\n*Summary overview: View top clients and the top used domains.\r\n*Query log: Inspect & search your Pi-hole queries.\r\n\r\nFlutterHole is open source, which means anyone can view the code that runs your app. You can find and star the repository on Github.\r\n\r\nThe best place to report bugs and feature requests is the Github issue tracker. This is a convenient place for developers to track running issues, and for users to look for issues similar to theirs.', 'descriptionHTML': 'Warning: this app has been tested exclusively on the Pi-hole V5 API. It is recommended to update your Pi-hole to V5+ before installing this app.<br><br>FlutterHole is a free third party Android application for interacting with your Pi-Hole® server.<br><br>Features:<br>*Quick enable/disable: Toggle your Pi-hole from your home screen with a single tap.<br>*Multiple configurations: Easily switch between every Pi-hole that you have access to.<br>*Summary overview: View top clients and the top used domains.<br>*Query log: Inspect &amp; search your Pi-hole queries.<br><br>FlutterHole is open source, which means anyone can view the code that runs your app. You can find and star the repository on Github.<br><br>The best place to report bugs and feature requests is the Github issue tracker. This is a convenient place for developers to track running issues, and for users to look for issues similar to theirs.', 'summary': 'A third party Android application for the Pi-Hole® dashboard.', 'summaryHTML': 'A third party Android application for the Pi-Hole® dashboard.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.26, 'ratings': 332, 'reviews': 169, 'histogram': [13, 29, 33, 36, 219], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.9M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Sterrenburg', 'developerId': 'Sterrenburg', 'developerEmail': 'flutterholepihole@gmail.com', 'developerWebsite': 'https://github.com/sterrenburg/flutterhole', 'developerAddress': None, 'privacyPolicy': 'https://github.com/sterrenburg/flutterhole/blob/master/PRIVACY.md', 'developerInternalID': '7005975077885523558', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/AqpFEhw1Hfq957SKAUQMbTSYtiR7I_80wi1WRLdyTJKfsBLiZHNhvc2_giwaWnhnuck', 'headerImage': 'https://lh3.googleusercontent.com/K6NiI7vZEvlYezUuBwJHE8JLGEAnil0sWt0voJpaB1yR1zAAGELRcijD6WCWm_HCRw', 'screenshots': ['https://lh3.googleusercontent.com/XFmL-cAMtOzVj2OkJr4u-fmYVHTEZ07FohXI13ZsUlONbH5ZIeuLsa__I-3OGDwQ4zr-', 'https://lh3.googleusercontent.com/NQZNVeQTa75Sw2cQOn2tNe_vlsc_fPd5x8G2dtuH5CFD0x7V7Y6qlz6HGn0oyBvt0i8T', 'https://lh3.googleusercontent.com/u7z3sbVORghOIdgeW2ocrAjt1gaBXl5AmJQpkDz88AYS0Db8H4RsvPkhUZZZY9c91A', 'https://lh3.googleusercontent.com/EPIBlKCec_qnQinp3EVx3Jm8vaGW6Qv0LCh2Q2hxDLucT22tkv60FGXA4ut1a6m5Dw', 'https://lh3.googleusercontent.com/l_H7ove5h4Adnoz19KhzjUP1vb4K_zRg4ZGX_outhCSahKxJUjeecKh-zRDw9I12AvKq'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Feb 23, 2019', 'updated': 1590398427, 'version': 'v5.1.2', 'recentChanges': '* Adding new logo with an easter egg 🥚\r\n\r\n* Adding apiTokenRequired field, fixes #79\r\n\r\n* Remove index shift from QueryStatus toJson/fromJson, fixes #82\r\n\r\n* Adding query log page\r\n\r\n* Adding queries over time chart\r\n\r\n* Adding clients over time chart\r\n\r\n* Searchable & refreshable query log/client/domain pages\r\n\r\n* Status indicators in Pi-hole forms can be tapped to show error details\r\n\r\n* More verbose error logging\r\n\r\n* Adding drawer footer and better about dialog\r\n\r\n* Adding DoubleBackToClose', 'recentChangesHTML': '* Adding new logo with an easter egg 🥚<br><br>* Adding apiTokenRequired field, fixes #79<br><br>* Remove index shift from QueryStatus toJson/fromJson, fixes #82<br><br>* Adding query log page<br><br>* Adding queries over time chart<br><br>* Adding clients over time chart<br><br>* Searchable &amp; refreshable query log/client/domain pages<br><br>* Status indicators in Pi-hole forms can be tapped to show error details<br><br>* More verbose error logging<br><br>* Adding drawer footer and better about dialog<br><br>* Adding DoubleBackToClose', 'comments': ["After the upgrade to v5, the dashboard displays properly. In the previous version, the dashboard didn't display, but I could still disable/enable. I like the addition of the ability to disable for a set period of time right from the dashboard screen instead of having to open the left menu. The only downside is that my settings didn't carry over. Not a huge deal, just a bit annoying. After I updated the settings it picked my pihole pretty quickly. Seems to be a bit faster than the previous version, at least in my limited experience. Overall I'm very happy with the new version.", 'Since the latest pi-hole update to v.5, while the connection is green solid. there are no graphs and stats on the summary tab. In addition the Query Log, Blacklist or Whitelist tabs return an errorFormatException. On the contrary, the Clients and Domain tabs are OK. Update: With the last update problem solved.', 'Excellent work! I really like the new look. This is a great value add! Feature request(nice to have): Please add a scroll bar to scroll through very long lists. Currently it is really time consuming when scrolling through long list.', 'Update broke the functionality. General dashboard is showing but clients and anything else shows the following error. {message: fetchClientsOverTime failed, error: PiException.notAuthenticated(error: API token is empty)} API key is entered in the settings and validation says it is working and connected.', "This is a good start for viewing pihole statistics. However the API for viewing the query log isn't working nor is any of the other logging features. This is a great start for monitoring a pihole through an app. If the logging was enabled this would be a go to app for management.", "Cool app with a nice UI, just can't get it working. I cannot get my PiHole to properly work in this app at all, I keep getting PiException.notAuthenticated() I've added my API key and saved it, even reinstalled PiHole just in case and its still not working.", 'Very handy, however it appears to NOT work with Pihole v5. Anxiously awaiting an update. UPDATE: May 26,2020. Glad to see the author working on this. As of last week most of the functions now work on PiHole V5. Good work!', "Last update broke it entirely. I am using nginx as reverse proxy with a self signed certificate, which is however imported onto my device. Futterhole fails to connect to the API: Error: DioError [DioErrorType.DEFAULT]: HandshakeException: Handshake error in client (OS Error: CERTIFICATE_VERIFY_FAILED: unable to get local issuer certificate(handshake.cc:354)). I set allow self signed certificates in the app (although shouldn't be necessary as imported the ca cert - via chrome no issues)", 'The new update is amazing! Scales perfectly on my Blackberry Key2 Display. This app has come a long way! Devs are great! Very fluid UI I wish all apps worked like this! Thank you! As a developer myself, I am very impressed!', 'Great, thanks for the update! Is it possible to have an all query list back, black list and white list? I can see only dashboard with clients, domains and summary... Queries over last 24hrs graph is also missing...Ty', 'I truly loved this app with v4. I realize pi-hole was updated to v5 and some features are simply unavailable, but without direct access to manage the query log this app is now useless.', 'Pretty nice. Would love the added ability to pause/unpause all piholes with one tap. I have 2 running piholes and have to manually pause and unpause both whenever i need to do so.', 'Great app! Easy to access and manage useful features of Pihole without the use of a desktop. Thank you for the Pihole v5 update!!', 'Was working perfect, latest update seems to have removed the entire config and I am left with a black screen.', 'Great app to interact with pihole on mobile. Will be a perfect app once the API is updated to modify the black and white lists as well.', 'App it not working with pihole version 4.3.2. Older version of the app was working. No data loads bit the log says connected.', 'This new version broke all functionality. Not possible to login to pihole anymore. App totally useless now.', '+EDIT+ Previous error was solved by updating pihole to v5 as suggested by dev. App works flawlessly. Many thanks for your work.', 'App has little problems from time to time, but usually things get fixed quick.', 'Great update Looks and works fantastic with V5, I upgraded early to 5 so was waiting until support returned. Cheers', 'Was working for me until the update... Just loading. Any ideas?', 'Probably the most beautiful interface ive used in a very long time, thanks for the hard work 👌🏾', 'Thanks for making this. Newest update looks sick and works great!', 'Great app and thanks for the update was gonna contact you about the pihole v5 update', 'Clean and straight forward. Thanks for a great app!', 'Works well and is nicely organized', 'The best interface for pi-hole that I am aware of!', "Not seeing the 'search' function on my S7. Why?", 'Fantastic!! New update is phenomenal!', 'Great app. Thanks for update!', 'A great app, does everything I\'d want it to do and looks good. It\'s just one thing I hate.... It\'s called Flutterhole. Such a bizarre name I need to remember what it\'s called when I go looking for it in my app tray and I can never remember that. Even if it was named "PiHole FlutterHole", it would be so much better. I\'d actually consider paying for a premium version where that\'s the only difference.', "Please add a tile in the Android tiles list (notification drop down, like WiFi, airplane mode) to disable/enable adblocking of all Pi-Hole servers or even just for this specific device. That's the only feature I am really looking for on my mobile device.", "Very nice app.. stumbled upon it today and love its simplicity and the dashboard. Only thing I'd love is in devices the be able to scroll.. only shows some of the devices on my network. Great however and recommeded!!", "good until most recent update. It was working flawlessly until it updated and now I get a white screen and won't load the app. If it does, it just sits there not able to connect to host. I did nothing to the app. it was working perfectly until update.", 'I just upgraded my phone from a Galaxy S8+ to a OnePlus 8 pro. Unfortunately it seems is not working properly. Everytime I open the app, I get a black screen and nothing happens. Please fix it. Thank you', 'Fanatic app and was working fine until yesterday when pi-hole v5 was released and now all I get is a black screen.', "SocketException: Failed host lookup: 'pi.hole' (OS Error: No address associated with hostname, errno = 7)DioError [DioErrorType.DEFAULT]: SocketException: Failed host lookup: 'pi.hole' (OS Error: No address associated with hostname, errno = 7) Error", 'Phenomenal update! Excellent interface changes, especially the refresh "droplet".', 'Works good, if you could add a feature to have query log update automatically that would be great', 'Great app to quickly check up on your Pi Hole, works perfectly! Would be cool to see historic stats in the future, like total items blocked.'], 'appId': 'sterrenburg.github.flutterhole', 'url': 'https://play.google.com/store/apps/details?id=sterrenburg.github.flutterhole&hl=en&gl=us'}
