{'title': 'PDF CONVERTER: Files to PDF', 'description': 'PDF CONVERTER is easy to use the application to convert your files or Images to PDF and edit PDFs on your Android devices. \r\n\r\n⭐No in-app purchases. EVERYTHING FREE!! \r\n⭐ No limits on file size or the number of documents converted\r\n⭐Various file formats are supported (Word, Excel, Image, Text, Doc, Docx, QR code, Bar code and more).\r\n⭐ File converter of excellent conversion quality.\r\n⭐ PDF scans and complex documents are converted as well.\r\n⭐ Different PDF size: cropped part, letter,  A4 and even custom sizes are supported\r\n✔️ Smooth and easy to use interface\r\n✔️Takes up only a few seconds\r\n✔️ Select images from camera or Gallery\r\n✔️ Image enhancement features\r\n✔️ Crop images before creating a PDF\r\n✔️ View PDF files\r\n✔️ Delete PDF files\r\n✔️ Add or remove password from PDF\r\n✔️ Rotate PDF pages\r\n✔️ Add watermark to PDF\r\n✔️ Add images to existing PDF\r\n✔️ Extract images from PDF\r\n✔️ Convert PDF pages to images\r\n✔️ Split PDF\r\n✔️ Merge PDF\r\n✔️ Convert text files to PDF\r\n✔️ Manage your PDF files\r\n✔️ Remove pages from PDF\r\n✔️ Reorder PDF pages\r\n✔️ Compress PDF\r\n✔️ Convert QR code and Barcodes to PDF\r\n✔️ Convert Excel to PDF\r\n✔️ Add text and Images to existing PDF\r\n✔️ Invert PDF colours\r\n✔️ Convert Zip to PDF\r\n✔️ Share the created PDFs with your friends\r\n✔️ Easily manage the PDFs created by our app\r\n\r\nSupported image input types:\r\n✔️JPG\r\n✔️PNG\r\n✔️GIF\r\n...and other image formats!\r\n\r\nThis application can be called as a PDF Converter, Images to PDF Converter, JPG to PDF Converter, BMP to PDF Converter, PNG to PDF Converter, GIF to PDF Converter, Image to pdf converter, Convert JPG to PDF, Convert to Pdf, PDF Converter, Convert JPG to PDF,  Convert Doc to PDF, Convert Excel to PDF, Images to PDF, files to PDF converter, PDF editor, JPG to PDF Document Converter. Extract Text from PDF.\r\n\r\nThe simplicity of this app makes it an ultimate PDF Converter for your device.\r\n\r\nWe are constantly working on improving the PDF Conversion performance. If you have any suggestions or complaints, feel free to mail to us at swati4star@gmail.com !!', 'descriptionHTML': 'PDF CONVERTER is easy to use the application to convert your files or Images to PDF and edit PDFs on your Android devices. <br><br>⭐No in-app purchases. EVERYTHING FREE!! <br>⭐ No limits on file size or the number of documents converted<br>⭐Various file formats are supported (Word, Excel, Image, Text, Doc, Docx, QR code, Bar code and more).<br>⭐ File converter of excellent conversion quality.<br>⭐ PDF scans and complex documents are converted as well.<br>⭐ Different PDF size: cropped part, letter,  A4 and even custom sizes are supported<br>✔️ Smooth and easy to use interface<br>✔️Takes up only a few seconds<br>✔️ Select images from camera or Gallery<br>✔️ Image enhancement features<br>✔️ Crop images before creating a PDF<br>✔️ View PDF files<br>✔️ Delete PDF files<br>✔️ Add or remove password from PDF<br>✔️ Rotate PDF pages<br>✔️ Add watermark to PDF<br>✔️ Add images to existing PDF<br>✔️ Extract images from PDF<br>✔️ Convert PDF pages to images<br>✔️ Split PDF<br>✔️ Merge PDF<br>✔️ Convert text files to PDF<br>✔️ Manage your PDF files<br>✔️ Remove pages from PDF<br>✔️ Reorder PDF pages<br>✔️ Compress PDF<br>✔️ Convert QR code and Barcodes to PDF<br>✔️ Convert Excel to PDF<br>✔️ Add text and Images to existing PDF<br>✔️ Invert PDF colours<br>✔️ Convert Zip to PDF<br>✔️ Share the created PDFs with your friends<br>✔️ Easily manage the PDFs created by our app<br><br>Supported image input types:<br>✔️JPG<br>✔️PNG<br>✔️GIF<br>...and other image formats!<br><br>This application can be called as a PDF Converter, Images to PDF Converter, JPG to PDF Converter, BMP to PDF Converter, PNG to PDF Converter, GIF to PDF Converter, Image to pdf converter, Convert JPG to PDF, Convert to Pdf, PDF Converter, Convert JPG to PDF,  Convert Doc to PDF, Convert Excel to PDF, Images to PDF, files to PDF converter, PDF editor, JPG to PDF Document Converter. Extract Text from PDF.<br><br>The simplicity of this app makes it an ultimate PDF Converter for your device.<br><br>We are constantly working on improving the PDF Conversion performance. If you have any suggestions or complaints, feel free to mail to us at swati4star@gmail.com !!', 'summary': 'Easily convert your files to PDF & enhance them using PDF Converter application.', 'summaryHTML': 'Easily convert your files to PDF &amp; enhance them using PDF Converter application.', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.33, 'ratings': 566, 'reviews': 344, 'histogram': [62, 5, 28, 56, 413], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '20M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Swati Garg', 'developerId': 'Swati+Garg', 'developerEmail': 'swati4star@gmail.com', 'developerWebsite': 'http://swati4star.github.io/Images-to-PDF/', 'developerAddress': 'Delhi', 'privacyPolicy': 'https://sites.google.com/view/privacy-policy-image-to-pdf/home', 'developerInternalID': '6354300606982696607', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/ur-59L8Yx07mRMttxe6mwG7h76GpYsjDUTGOHRkDofTsvPrygsLO6HTQ1aQZLvz7JJI', 'headerImage': 'https://lh3.googleusercontent.com/TquF3bNqtsMjuYGqwR6OXRhBvxSJ0T9hmZ4tQsMp3YoqhAdvJP0pA8W8Keb5FMgN7g', 'screenshots': ['https://lh3.googleusercontent.com/CpZ6UhsLhB9Z-lB4TRb4jZyYjhnkZzrilceXN2IrrBbdL4J0ElTuAS4cnUhfAj8xbOA', 'https://lh3.googleusercontent.com/G-y0v_R_TANMHOA3J8mIzPV37unxQ5ERuMt7cD9Y5_U9CALVVXUi08fbNG8q184vnSc', 'https://lh3.googleusercontent.com/XA7r8uY9LINnu2146meDZ5iJpf80VJQBhDnYJd7tQ8XsDcuhHogSuyPgaNsvG5S6bGYg', 'https://lh3.googleusercontent.com/CvTUhzjhcl8fdIJtAsawt6wHyzaqwLuM9v05WcEIAJVzbvE2mYe9ddFdzBjfFtieYAo', 'https://lh3.googleusercontent.com/k0d2fpVGHS7xS5Q3cneOPlCNXzv-oCb6zMAWD7HQj6sFdsa2AX2fmo4eJLrimTnv2nXz', 'https://lh3.googleusercontent.com/F_MD5Krhqo9kILdMuGnvX9Gx5Rsx-zD30iVN9qYc2iRoGGQb2Ce9wffqbgXY8cZBXQ', 'https://lh3.googleusercontent.com/w8O43cTTaIYIQGOiRV0DoXXRojJBSAW75KTl_GpqMn869abU3POpq-jYFMrYp5K6V88', 'https://lh3.googleusercontent.com/csPtyzqOMBxR8d9k0lPp1FdNxYur2SsSNLYBSb_c9wbuegJDTpLdlChzS2e6pyzQkQVP'], 'video': 'https://www.youtube.com/embed/P9gpQOeGsCo?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/P9gpQOeGsCo/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Oct 29, 2017', 'updated': 1587836361, 'version': '8.8.4', 'recentChanges': 'Crashes fixed', 'recentChangesHTML': 'Crashes fixed', 'comments': ['Absolutely terrible experience. Tried converting a pdf to an image. Spent at least 30mins trying to get the app to work properly. First few attempts created blank/unrecognised images. Tried changing file location to find the imaginary files. Eventually the app crashed & created a bug report. When I tried it again, it worked, but.. Dont have any options to change quality. Poor quality png image result. May as well just screenshot my phone (produces much better quality images & much quicker).', 'I just download this app and have not try to convert anything yet to pdf. I am giving it 5 🌟 because the layout gui alone, is impressive. If this app is good as I think it will, then this is a keeper for a very long time, for me. Edit after usage. Yes, it is better than I expected. More versatile, easy and simple to use. Verdict.. I am keeping this app for good.', "Unable to access the folders in file manager or any other folder in the device. Restricted to select only images from ALL MEDIA folder. Actually I should be able to select any file situated any where in my mobile device. Your app doesn't permit this. It allows images from AllMedia only. Hence there is big drawback of this app. Please improve upon it.", 'Tried to convert a basic PDF to an image so I can upload to Facebook. But.... it only pulls the pictures in the pdf and not the ENTIRE pdf..... This was the only reason I downloaded this app.... Any help is appreciated. On an aside: the app is well constructed, easy to navigate etc...', "Best pdf App Easy to use or I would say it's a jumbo pack 💥 My only suggestion to the creator is that there should be an option to reduce the size of pdf file", 'Great pdf cpnverter app. It have beautiful interface and very easy to use. Work very good and fast. I like it and I recommend 😁', "Wow, pdf converter very essential app for making a pdf file. It's working very good. I am highly recommended all of android user. I love this app.", 'No ads, full of features. Pretty good all around.', 'I want to give this app 100 stars but it is not possible this app is really awesome app with a few seconds it convert files to pdf. Easy to use', 'Great PDF utility tool and easy to use. Highly recommend it to all Android users', "It's best one...easy to use...my other mates r also using this one...and i will recommend others also...", 'The best app for converter, never will choose another app. You guys want to merge pdf? This app is the one👍🏼', 'Easy to use and work on this app.and so much feature.', 'This app contains ads, but categorised as no ads', 'Brilliant app, it turnrd a docx file to pdf very fast, has many other ad/extract/merge/split features & works offline too, the best app of its kind, it has small non intrusive ads, (unlike other apps with full screen pop-ups) & its free, top marks for a top notch app.', 'PDF Converter has a very user friendly UI and it has a lot of options. You can convert images to PDF and PDF to images, as well as image extraction and many more.', "Best pdf convert app I've ever used. There are a lot of different options but still fast and simple to use. Can you add code reader and qr code ?. That's will be amazing", 'I had scanned my documents and needed to convert in pdf format. I tried 2 or three apps but it was horrible. I tried this one and to my amazement it worked. Superb app', 'Most of the apps in the market convert to PDF by uploading the file to their servers which is a security hassel for user. This app converts offline. I would have given 5 stars to the app but the pdf compress function gives error that the file is password protected. Please check on the same. Apart from it, great app. I have bought the license to support the developer.', 'This app has really helped me create lecture notes for my students on short notice with colleges closing. I have been able to create PDF documents from my hand written notes quickly and post for my students.', 'Wonderful app to convert any files to pdf. Has lot of options to choose from. I would defenitely recommend pdf converter app to anyone who needs to convert files to pdf.', 'Nice and friendly to use this pdf converter app. Very handy in a tiny pack of MBs . Nice work by developer . Keep it up . Good luck.', 'Best pdf converter app ever...I tried at least 20 apps and websites and found this is the best...so many options and features....Keep going...👍👍👍👍👍', 'This pdf converter is the best app so far. We can convert the files into pdf in very easy way by using this amazing app . I reccomend the app to all', 'All pdf related things clubbed in one application. You can create pdf from text, merge different pdf. No need to have multiple app s', 'PDF converter is a box of joys here i can convert all of needed items and it has very friendly UI engine can use it easily.', 'Very nice is so amazing I love to play this game when I was kid and this game still attracted me. Good work', 'Best offline PDF utility app, helped me by converting my some private and secure image in PDF without uploading anywhere.. Best secure PDF converter app', 'This PDF CONVERTER APP WOW is incredible! It has great graphics.the PDF App Nice is awesome and it is a fan favorite with so may different characters to shoose from creators of this app are still making updates and PDF App Wow will recomend to anybody and everybody', 'This PDF Converter is very easy to use and super convenient. I recommend it to anyone', 'Good app to covert from/to pdf. Best app inits category. Easy to use.', "Honestly in the beginning i thought this app couldn'tbe better than Adobe PDF but i changed my mind this is my favorite now i love it thank you developer", 'Best pdf converter app for with multiple features to convert pdf using camera and qr code features I love it this app .', 'Really easy to use with PDF converter, everything work perfectly, absolutely recommend to download.', "This pdf converter does exactly what it says on the tin, I'm an exceptional easily lay out and well designed app this converts files for ease of use very good", "Best pdf app I've used yet.. Loads of tools fordiffrent function yet stillvery clear and simpleto use... I love thiz app.. Having a scane function an added a bonus... Keep up tge god work.. Hardly recommanded .. Nice app...", 'Useless. When I wanted to convert a pdf to a jpg, an error occurred without any hint why and how to fix it. Uninstalled.', 'PDF CONVERTER: Files to PDF is the best application to convert any file to pdf , thank you for the app.', 'best file to pdf convertor all file iss very eqsy to convert and i love this awesome app realy like it i am use this app last 1 year and after give a best review highly recommend download now.', 'Very simple ui too understand easy to convert files to pdf in low app size best converter'], 'appId': 'swati4star.createpdf', 'url': 'https://play.google.com/store/apps/details?id=swati4star.createpdf&hl=en&gl=us'}
