{'title': 'Kore, Official Remote for Kodi', 'description': 'Kore™ aims to be a simple, easy to use and beautiful remote that lets you control your Kodi® / XBMC™  media center from your Android™ device.\r\n\r\n\r\n<b>With Kore you can</b>\r\n– Control your media center with an easy to use remote;\r\n– Including several colour themes;\r\n– See what’s currently playing, including relevant information (movies, TV shows, music, pictures and addons);\r\n– Change, sync or download subtitles;\r\n– Switch to the desired audio streams;\r\n– All the usual playback and volume controls at your disposal;\r\n– Toggle back and forth between windows or full screen playback in Kodi\r\n– Add, check and manage the current playlist;\r\n– View what is in your media library with details about your movies, TV shows, music and add-ons;\r\n– Direct link to relevant IMDb website for extensive information;\r\n– Library maintenance like clean and update;\r\n– Wake-on-LAN and other power control actions that the selected device supports;\r\n– Send YouTube videos to your currently selected media center;\r\n– Send text to the instead of using the keyboard in Kodi;\r\n– Switch to live TV channels and trigger recording on your PVR/DVR setup;\r\n\r\n<b>Currently not added yet</b>\r\n– Browsing smartplaylists\r\nThese features will be added in future versions\r\n\r\n<b>Works with</b>\r\n– Kodi 14.x "Helix" and higher;\r\n– XBMC 12.x "Frodo" and 13.x Gotham;\r\n\r\n<b>Current supported interface languages</b>\r\n– Basque\r\n– Bulgarian\r\n– Chinese\r\n– Czech\r\n– Dutch\r\n– French\r\n– German\r\n– Italian\r\n– Portuguese\r\n– Portuguese (Brazil)\r\n– Spanish\r\n– Russian\r\n\r\n<b>License and development</b>\r\nKodi® and Kore™ are trademarks of the XBMC Foundation. For further details you can visit http://kodi.wiki/view/Official:Trademark_Policy\r\n\r\n\r\nKore™ is fully Open-Source and released under the Apache License 2.0\r\nShould you wish to help on future development you can do so by visiting https://github.com/xbmc/Kore for code contributions.\r\n\r\n<b>Permissions</b>\r\nStorage: is needed for possible downloading of content from Kodi\r\nTelephone: is needed to be able to pause Kodi when an incoming call is detected.\r\n\r\nKore does not collect or share information to the outside.\r\n\r\n<b>Need help or have any problems?</b>\r\nPlease visit our forum at http://forum.kodi.tv/forumdisplay.php?fid=129\r\n\r\n<i>Images shown on screenshots are Copyright Blender Foundation (http://www.blender.org/), used under a Creative Commons 3.0 License</i>\r\n<i>Kodi™ / XBMC™ are trademarks of the XBMC Foundation</i>', 'descriptionHTML': 'Kore™ aims to be a simple, easy to use and beautiful remote that lets you control your Kodi® / XBMC™  media center from your Android™ device.<br><br><br><b>With Kore you can</b><br>– Control your media center with an easy to use remote;<br>– Including several colour themes;<br>– See what’s currently playing, including relevant information (movies, TV shows, music, pictures and addons);<br>– Change, sync or download subtitles;<br>– Switch to the desired audio streams;<br>– All the usual playback and volume controls at your disposal;<br>– Toggle back and forth between windows or full screen playback in Kodi<br>– Add, check and manage the current playlist;<br>– View what is in your media library with details about your movies, TV shows, music and add-ons;<br>– Direct link to relevant IMDb website for extensive information;<br>– Library maintenance like clean and update;<br>– Wake-on-LAN and other power control actions that the selected device supports;<br>– Send YouTube videos to your currently selected media center;<br>– Send text to the instead of using the keyboard in Kodi;<br>– Switch to live TV channels and trigger recording on your PVR/DVR setup;<br><br><b>Currently not added yet</b><br>– Browsing smartplaylists<br>These features will be added in future versions<br><br><b>Works with</b><br>– Kodi 14.x &quot;Helix&quot; and higher;<br>– XBMC 12.x &quot;Frodo&quot; and 13.x Gotham;<br><br><b>Current supported interface languages</b><br>– Basque<br>– Bulgarian<br>– Chinese<br>– Czech<br>– Dutch<br>– French<br>– German<br>– Italian<br>– Portuguese<br>– Portuguese (Brazil)<br>– Spanish<br>– Russian<br><br><b>License and development</b><br>Kodi® and Kore™ are trademarks of the XBMC Foundation. For further details you can visit http://kodi.wiki/view/Official:Trademark_Policy<br><br><br>Kore™ is fully Open-Source and released under the Apache License 2.0<br>Should you wish to help on future development you can do so by visiting https://github.com/xbmc/Kore for code contributions.<br><br><b>Permissions</b><br>Storage: is needed for possible downloading of content from Kodi<br>Telephone: is needed to be able to pause Kodi when an incoming call is detected.<br><br>Kore does not collect or share information to the outside.<br><br><b>Need help or have any problems?</b><br>Please visit our forum at http://forum.kodi.tv/forumdisplay.php?fid=129<br><br><i>Images shown on screenshots are Copyright Blender Foundation (http://www.blender.org/), used under a Creative Commons 3.0 License</i><br><i>Kodi™ / XBMC™ are trademarks of the XBMC Foundation</i>', 'summary': 'Kore is the official remote for Kodi, with a simple and easy to use interface.', 'summaryHTML': 'Kore is the official remote for Kodi, with a simple and easy to use interface.', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 4.3130436, 'ratings': 16348, 'reviews': 4745, 'histogram': [1360, 406, 1167, 2233, 11179], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.6M', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'XBMC Foundation', 'developerId': '5766904818522015813', 'developerEmail': 'koresupport@kodi.tv', 'developerWebsite': 'http://kodi.tv', 'developerAddress': None, 'privacyPolicy': 'https://kodi.tv/kodi-privacy-policy/', 'developerInternalID': '5766904818522015813', 'genre': 'Video Players & Editors', 'genreId': 'VIDEO_PLAYERS', 'icon': 'https://lh3.googleusercontent.com/CsGrM0VSYdwFPPnSo9sV1OocBGwdXZzRUr9sSf25XLuuWnvh9ILRyUJyzjjiV6n9CI4', 'headerImage': 'https://lh3.googleusercontent.com/FBx4U6x_9a5ftDjsHuZmZPLnylLkFg2dLosX9yLP3LINyeDo_QZy8N8kVoF5SJTU-U0', 'screenshots': ['https://lh3.googleusercontent.com/UB_cUbC6zsjrbwr0OiHzbezLEHZf3TTvE3kbJYfwVHG-x7msH3hm6yL74cEPzevvLt0', 'https://lh3.googleusercontent.com/0-j6zRn-M6rJCHcm5SICZR3L5yu0dLGsekKVolAQiETvCUNxPLpoTURcTJqKPmtmYC0', 'https://lh3.googleusercontent.com/rNxYlODJOy9sienzy0mSpPd2GKtnS2l8p5WsWW1cSsFMnO9pHnLZqN35UqZlnFm5mw', 'https://lh3.googleusercontent.com/EmGhqunY7OU2Bv0xopDdb2tuNbis-m0s7sH-0gsDIPLsiTAwrLECm83SSU_3eVotwZxA', 'https://lh3.googleusercontent.com/ZTwJf8vnX2zLCiTjwyV8QbSdrd-rt5LKv-QM1Jf0JVpGtlB4-FN2pAuZmIQjSiL513P_', 'https://lh3.googleusercontent.com/upkuo5XX6-kC4zxM71sBx8526I6ndArZ2_nJoVUhdYq1VWRr-LgrFf2tu9-uW0as9yA', 'https://lh3.googleusercontent.com/P0zUQwFqGi1E6yNmRsagvS-Gg6HoXvhse9_z3ysRp19p9jpSbHNpdGUjM9P8xyk9jJw', 'https://lh3.googleusercontent.com/Zs_Qt9ixjS0vYTKU422kRmFAnwXLpfNEmGyR2k8lZb2dliEUCeHTrsLTL3h5b7mLUg', 'https://lh3.googleusercontent.com/dvi49G65oJC-kqRadT7o4X1v_AFdx7pJD8u9rGEka2IE6DpznzU2Xv6g8TDz0W9Yp1A', 'https://lh3.googleusercontent.com/g0FIWJL2TVEu-zhzwtzCQxrB2kdrKXBku-IoqER60KHdWGJ8pog3FqNS0TH76QGbImM', 'https://lh3.googleusercontent.com/uvlTTRHQ4kUZBEPO0SpoECsLuYugwaRyMSUbFNdfO5qklBlkiMsFhokKc3r5svdNfmOA', 'https://lh3.googleusercontent.com/Yxxct_HZay9pJwqEEaGuw1Jha8EH1aKjNYte1z1vr9NiiehtLKT_Wj6aEN1_R2-QDNY'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 15, 2015', 'updated': 1578394285, 'version': 'v2.5.0', 'recentChanges': '- Improved PVR section: new search option, sort recordings and hide watched items;\r\n- Add support for sharing local files to Kodi, by using the side menu "Local Files", or by choosing Kore as the share target for a file;\r\n- Allow changing Kore\'s language in Settings;\r\n- Add new sort option for albums, movies and tv shows (by year);\r\n- New color themes (Sunrise and Sunset) and tweaks to the others;\r\n- Show all the available playlists (in the playlist screen), even when nothing\'s playing;', 'recentChangesHTML': '- Improved PVR section: new search option, sort recordings and hide watched items;<br>- Add support for sharing local files to Kodi, by using the side menu &quot;Local Files&quot;, or by choosing Kore as the share target for a file;<br>- Allow changing Kore&#39;s language in Settings;<br>- Add new sort option for albums, movies and tv shows (by year);<br>- New color themes (Sunrise and Sunset) and tweaks to the others;<br>- Show all the available playlists (in the playlist screen), even when nothing&#39;s playing;', 'comments': ["Great app for controlling multiple kodi boxes. One slight problem though, once you cue multiple tv shows, movies, or albums/songs, you cannot rearrange them. So you need to be sure you put them into the cue in the order you want or you'll have to start over from the beginning. Just a small bug, but one that needs to be fixed. Will rewrite review once bug is fixed.", 'I like this, very handy and I love a graphical remote. I would suggest 2 improvements though.... 1) when not playing, to be able to browse the media files on the app, so I can pick and play without needing the TV on, or even be in the same room. 2) the option of hearing the audio files through the remote. Odd one I know, but I use the phone for audio more than visual, with files stored on a PC, and this app is basicallu 90% of the way there. Keep up the excellant work! :) :)', "Can't seem to handle album cover thumbnails embedded in ID3 tags in my music files. About 70% seem to display, the rest won't, but they do on my Kodi main install on HTPC just fine. I hate flipping through my collection looking at giant letters where the album cover should be. I'll delete this app instead and look for a Kodi remote that gets thumbnails right.", "This app is so awesome and useful it almost defies description. With it I finally have a phone app that I can control a music player with at home into which I've integrated MusicIP mix technology and and it's beautiful and sweet. Still there are a few things that separate this app at present from perfection: 1) If I search my library for music to play, and then play a song and build a mix, and go to the remote control, then come back to search, the library search is reset. Aaargh. This lack of memory is the greatest frustration that has me trying other Kodi remote apps out. I spend ages homing in on an album I want to sample I try a song, and come back and I have to start again .. 2) It lacks any clear means of rating music that's playing. I want to be able to rate a song I hear say 1-5 stars and then be able to find songs by rating. TO be honest I haven't even worked out how to coax that out of Kodi yet let alone Kore. But man if Kore had this it would be another step toward perfection. 3) Lack of a Lyrics display. Kodi has a Lyric add on that display a best effort at lyrics of a playing song. It is pretty cool. Shazam can do same for me and technically I can shazam the danged song that's playing but wow, is that a round about way of doing things. Basically if there were an option to display lyrics in Kore, yet again one step closer to perfection! These three things would move me to a 5+* rating for the app, unable to sing its praises far and wide enough. As it is its' rocking awesome but has these little frustrations at the cusp of what it might offer.", 'best thing out there....with one exception......unable to scroll down and stay at bottom of multiple page display.....in library page......keeps poping to top of page......nothing in settings to fix this......uninstalled re install.....fixed problem.......thank you', 'Great remote but one thing is missing to give 5* review. Can we get a widget to play stop directly from home screen or lock screen ? That would be great! Anyhow thanks for good job.', 'Awesome Application. Very impressed with how well it works. It creates a Roon Like experience for next to no cost at all.', "It's ok. Happy that the sync and library updates can be done from the remote. But cannot seem to resume a show / movie from where I'd left, only option is to start from the beginning. And more often than not, the operation of the remote brings up menu items on the computer.", "Congratulation! You broke kore with this v2.5. now i have 2 icons to choose in share page (1.play on kodi 2.queue on kodi.) The prev version was simpler with only 1 icon. Now the 'play on kodi' icon displaced running video and the 'queue on kodi' sometimes doesnt queue the video at all to play.. bring back the old feature.", 'It needs an option to reset the setup wizard. I have to uninstall and install after the app loses connection when the ip address changes.', "Haven't ever been able to get it to recognize the media center sitting right next to it, no matter what I tried. Garbage.", 'This remote control works on all platforms of kodi including Linux. You can even access content on your home theatre PC and streamed directly to your phone or tablet.', "Won't cast anything from the local device; the app crashes if you try to. Most of the time, it sits on connecting and will never actually connect.", 'Works really well, been using it for quite a long time now and experienced very few problems. Good stuff!', 'Good app. Disconnection issues sometimes,please fix it', 'Crash Report: Refreshing Music from Local Files crashes the app', 'It works flawlessly! You can do everything you need to in Kodi with it. Simply awesome!', 'I have been using a lot of Kore rip off des.. I have tried so many apps and you just end up with Kore 😂 as well as installing it to as possible. I I have some ideas on possible xondifurationd Heil asking akotr', "Even with Kodi settings set to allow remote control devices on the network, it won't find my Kodi media centre :(", 'Love the remote! Works perfect with latest pi and kodi! Thank you! Could use more admin/advanced controls...', "Doesn't work. Even with correct manual settings it whil not connect.", 'sorry, can\'t toggle shows to "watched" - thats a dealbreaker and reason for downvote. otherwise works and looks nice..', 'Love it, just keyboard feature is missing', "For a TV it's useless because doesn't send a url text when adding a new addon, which is primary reason I've installed it. The keybord was showing, but it didn't send pressed letters. To enter text with arrows the native TV remote control is more convenient.", 'Downloading subtitle button does not work..', "It's great. Has most of the features I need but the UI/UX is missing something... I find Yatse way better from the UI size/disposition point of view. If it weren't for that I'd be using More.", 'Quality as expected from the XBMC/Kodi team', "There's a bug in the latest version. Playlist keep refreshing every 3s and scroll up. For now I have reverted to the older version.", 'Works well when it connects.', 'This sounds a lot better than it is, and if you want to save yourself a lot of time and frustration, get a cheap keyboard and plug in to the Kodi device.', "When it works it works well. Basic but usable. When it forgets how to connect with my Kodi box, about every other time I use it, there's no obvious way to connect it and I have to clear the apps data in system settings to trigger the connect process. The usual level of incomplete thinking I'm used to in Kodi applied to Kore. At least they're consistently bad at usability ☹️", 'Simply the best remote, period.', 'Only working on the first network I set it up on', 'Basic simple application that does what it says. Absolutely Love it. All the other similar apps. Make it all complicated (unnecessarily), this one, does it all for you, and works wonderfully. Thank you for developing this app. Awesome!', 'wakup on lan is not working, after quit kodi not able to open by application', "So I've been using Kore for quite some time. It's been fantastic for everything I've needed it for. The only complaint I have is recently on Android Pie. The audio/subtitle quick button is gone. Where did it go? I used to be able to select and download subtitles as well as adjust subtitle offsets very quickly within Kore. Thanks so much! Edit: Absolutely correct in your answer. After using it more i realized that it does show up eventually and it does seem to be tied to the connection quality.", 'Helps me get to the shows I want to watch easily 😁', "Not satisfied. Remote keeps on disconnecting when something is playing on Kodi. Network is highly optimized. On same machine, VLC Player with its remote works extremely well. Don't know why connection keeps dropping on this one. Shame, looks well though. Full of features. Really. I would like to edit, and point out one thing as a response to XBMC. I have three android phones on the network. Of those three, two of them works fine, one that is running android 9 has issues mentioned above.", "It's one thing that makes this a no no for me. The power button and no options for it. In all logical sense there should have been no destructive options on that button by default. Meaning quit Kodi and minimize Kodi is non destructive. If you needed the other options you should be able to enable these individually from within a menu.", "Really awesome frontend to one for multiple KODI servers. Gives access to almost all features of the backend. Nice gimmicks such as volume control via the phone's buttons. BTW, I really don't understand why some people write angry reviews and give only one star, when they only miss a single feature in the app (which is free and OSS!). Respect to the Kore team for responding to such moronic reviews in a polite manner."], 'appId': 'org.xbmc.kore', 'url': 'https://play.google.com/store/apps/details?id=org.xbmc.kore&hl=en&gl=us'}
