{'title': 'BootUnlocker for pre-2014 Nexus Devices', 'description': 'This application REQUIRES a Galaxy Nexus (GSM, Verizon, or Sprint), Nexus 4, Nexus 5, Nexus 7 (2013), Nexus 10, or OnePlus One with root. \r\n\r\n\r\nNexus 6 and newer devices contain security measures in their bootloaders, connected with factory-reset protection. These measures make it very difficult to use root to lock/unlock the bootloader, and as a result it is unlikely that Nexus 6, Nexus 9, Nexus 5X and Nexus 6P will ever be supported.\r\n\r\n-------------\r\n\r\nYou\'ve rooted your device, and you are trying to decide between the security of relocking your bootloader (with stock recovery and USB Debugging off), and the flexibility of leaving it unlocked.\r\n\r\nYou know that in order to prevent an unauthorized user from accessing your data by flashing a custom recovery, "fastboot oem unlock" wipes your data. This also means that if you relock your bootloader, you will need to do a full backup-and-restore whenever you decide to unlock it again.\r\n\r\nBootUnlocker for Nexus Devices lets you have the best of both worlds by using root privileges to unlock your bootloader from within Android, without wiping your data. This allows you to keep your bootloader locked for security, with this application safely protected behind your lockscreen password.  Whenever you want to unlock or relock your bootloader, just unlock your screen and run BootUnlocker.\r\n\r\n\r\n\r\nLicense:\r\n--------\r\n\r\nBootUnlocker for Nexus Devices_ is Open Source Software, licensed under the Apache License, Version 2.0: http://www.apache.org/licenses/LICENSE-2.0.html\r\nSource code is available on Google Code: https://code.google.com/p/boot-unlocker-gnex/\r\n\r\nUnless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License.\r\n\r\n\r\n\r\n\r\nSupport:\r\n--------\r\n\r\nFor support, you can:\r\n\t* Open an issue on Google Code\r\n\t* Join this app\'s discussion on XDA: http://bit.ly/BootUnlocker\r\n\t* Email the developer', 'descriptionHTML': 'This application REQUIRES a Galaxy Nexus (GSM, Verizon, or Sprint), Nexus 4, Nexus 5, Nexus 7 (2013), Nexus 10, or OnePlus One with root. <br><br><br>Nexus 6 and newer devices contain security measures in their bootloaders, connected with factory-reset protection. These measures make it very difficult to use root to lock/unlock the bootloader, and as a result it is unlikely that Nexus 6, Nexus 9, Nexus 5X and Nexus 6P will ever be supported.<br><br>-------------<br><br>You&#39;ve rooted your device, and you are trying to decide between the security of relocking your bootloader (with stock recovery and USB Debugging off), and the flexibility of leaving it unlocked.<br><br>You know that in order to prevent an unauthorized user from accessing your data by flashing a custom recovery, &quot;fastboot oem unlock&quot; wipes your data. This also means that if you relock your bootloader, you will need to do a full backup-and-restore whenever you decide to unlock it again.<br><br>BootUnlocker for Nexus Devices lets you have the best of both worlds by using root privileges to unlock your bootloader from within Android, without wiping your data. This allows you to keep your bootloader locked for security, with this application safely protected behind your lockscreen password.  Whenever you want to unlock or relock your bootloader, just unlock your screen and run BootUnlocker.<br><br><br><br>License:<br>--------<br><br>BootUnlocker for Nexus Devices_ is Open Source Software, licensed under the Apache License, Version 2.0: http://www.apache.org/licenses/LICENSE-2.0.html<br>Source code is available on Google Code: https://code.google.com/p/boot-unlocker-gnex/<br><br>Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an &quot;AS IS&quot; BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License.<br><br><br><br><br>Support:<br>--------<br><br>For support, you can:<br>\t* Open an issue on Google Code<br>\t* Join this app&#39;s discussion on XDA: http://bit.ly/BootUnlocker<br>\t* Email the developer', 'summary': 'On most pre-2014 Nexus devices, unlock your bootloader without fastboot!', 'summaryHTML': 'On most pre-2014 Nexus devices, unlock your bootloader without fastboot!', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.3937826, 'ratings': 2048, 'reviews': 484, 'histogram': [212, 63, 21, 159, 1591], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '893k', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': "Segv's Tools", 'developerId': "Segv's+Tools", 'developerEmail': 'support@segv11.net', 'developerWebsite': 'https://github.com/segv11/boot-unlocker/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '5429743747983543296', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/OU5jcVTj-q_9nYtaB9l4rChuQZgZJO_EGax7tj5o4WJmVEvS9a6GbGv3PG4rR0cYnQ', 'headerImage': 'https://lh3.googleusercontent.com/L7CSo4UrCB2P21u4MHvUH_AISjthyyIh-4MF9o1TQPmhj6ok9qVEn_Ku0ekvXg3M6A', 'screenshots': ['https://lh3.googleusercontent.com/V56KTNjgN1bKP-Mq1q4r9jAX6Qdc19cNrTRk2c8R9dY-YnT_cowIO6kJUMuBQvh0I-w', 'https://lh3.googleusercontent.com/lfJ6iKPXWVh6_CijtvrzXCE_WYCVIlHP3BQbfBdbXplFnhVu9Ga468jbLTjSVcahxtg', 'https://lh3.googleusercontent.com/jta3tBA1el4jlNQyLu1szhmXiZ0kpgosJSfiZWn-M5mtmwzfaWJgo0HnoQSHVick0ro', 'https://lh3.googleusercontent.com/c_xxn47jpsH_k1WU0X2u6AhLdFpDPj7u5TzT15D34llYm1kA_HX7hhqdDhrqj0G2SBxx', 'https://lh3.googleusercontent.com/kINDuZShM2GLW88KYp61TNjQOf-Lo1dGqtsm3MGJhPx61LUWLZqb0q-4J3DIEaMqDhCF'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 25, 2012', 'updated': 1420864368, 'version': '1.6.1', 'recentChanges': None, 'recentChangesHTML': None, 'comments': ["Really wish this was possible on other devices. My Nexus 7 in particular is saved by this, as the usb port has been dead for years (twrp doesn't lock, and no fastboot access)", "Very cool. Working perfectly on my Hammerhead. Wish I'd found this year's ago", 'Sorry that one star review was supposed to be for another app. I am taking back the one star and giving you 5 star, thank you for your response.', 'Is it works in razer phone?', 'Its a great app works like it should and does something very unique of locking/unlocking the bootloader without deleting data and of enabling/disabling the tamper flag, i wish it would support more phones. But for the phones it supports it works great. Tested on 1+1=2', "Works just fine on my Nexus 5, thank you for creating such an awesome app! Really, really wish I could've found out about this before reverting to adb and fastboot", "Thank you for a great app! To the people trying it on Nexus 6 and giving bad reviews. READ devs warning & explanation before installing/complaining! It's not the devs fault it won't (probably ever) work. Be fair.", 'This app made switching back to a stock recovery a breeze. Without it I would have had to wipe the phone just to unlock the bootloader to flash recovery. Well worth having on your device so you can quickly unlock/lock the bootloader.', "Doesn't work for me at the present time. Rooted, unlocked, using Nougat (bokrom). Update, switched to a different nougat aosp ROM and all is working now", 'Saves a ton of time, and trouble. Quick and easy to (re)flash if needed. No wipe required.  Thanks, Dev!', 'Use this tool to make your unlocked, rooted phone appear locked and untampered. This will allow your phone to receive OTA system updates, since the phone must appear locked to receive them. When prompted with a system update, use this tool to unlock your phone then immediately run the update. This will allow you to immediately re-root your phone without having to first unlock and wiping all your data.', 'Works great for my hammerhead and flo. Though I may just keep them unlocked. Can\'t wait until it supports bullhead (Nexus 5X). Where\'s the "pro key"? ;-)', "Of course that in order to be rooted on certain Nexus devices you must first unlock your bootloader and wipe your device but once you've done that you can use this program to come back and forth as you need. Brilliant!", 'Extremely useful for performing OS updates through the SDK, when running stock OS with root and customized system partition, in which case OTA fails due to "unexpected contents" with the error code 7. Being able to unlock the bootloader without wiping data partition is a huge time saver, not having to go through accounts set ups, app reinstalls and all the settings reconfigurations involved. One of the most essential apps for Nexus users.', "It was an excellent app for my late, great Nexus 5... Too bad it'll never work on newer phones.", "It's great being able to lock/unlock the bootloader at will, giving that extra layer of security should my phone get lost/stolen. Would live to see Nexus 7 (wifi, ie nakasi) support.", "The best, most straightforward app I've used yet!  I opened the app - my phone was automatically identified showing the bootloader's locked status.  With one click...unlocked!  I didn't have to wipe or reboot!  I was then able to install my TWRP recovery.  It took longer to write this review. 10 Stars!!", 'Will there be any updates to resolve this?', 'As a N6 owner it is important to have compatibility. Please improve this app to support great devices such as this.', 'This app is the best BL locker/unlocker for earlier generation Nexus devices ever developed. Most important app to simplify flashing/fastest since Flashify. I would pay for this app,  or donate towards its development if I knew where to...', "I unlocked my phone using team win and installed a previous version. When I tried to relock it, it dint happen. So I downloaded this app. But its all greyed out and I'm not able to press any button. It says root is required. I'm not sure what to do. Can you please help locking my phone?", 'This is just amazing tool and it works perfectly. I have no issues using it. Very simple to use. I would recommend this for those using nexus devices except the nexus 6 and 9 but it now works with the one plus one if you are rooted.', 'Has two useful functions for Nexus 5 – lock, unlock and tampered, untampered.', 'Great tool, one push and presto!', "This app allows me to easily flash software updates and regain root access without having to wipe my phone. Simple, but it's great for what it does.", 'Pls I have no samsung or nexus', "I have a stock nexus 5 and it wont root. Don't use it.", 'No Nexus 6 support? That makes me a sad panda.', 'Guys if you ever need to lock and unlock on the go for some reason this is defo the app you need. so awesome!!', 'No Nexus 6/shamu support. 5 stars once this is corrected.', 'Used on my Nexus 5, now waiting for Nexus 6 support.', "can't  understand properly. I have rooted nexus-4.  now  system update is available.  how will I do it without loosing root?", 'Very useful for Nexus users. Keeps your phone more secure, and still be able to flash roms.  Open source too.', "This doesn't work with nexus 6", 'Very good it work but something cross my mind.did lock/unlock can be done unlimited or there is limit??.....thanks', "Doesn't work. Says not supported. :(", 'It works great on my Oneplus one, but it would be nice if it supported the nexus 7 2012.', 'Said device not supported in red', 'As vrea sa pot sa iti dau o bere prin net.', 'When will this be available for the nexus 6?'], 'appId': 'net.segv11.bootunlocker', 'url': 'https://play.google.com/store/apps/details?id=net.segv11.bootunlocker&hl=en&gl=us'}
