{'title': 'CPU Stats', 'description': 'CPU Stats that displays usage details within your phones status bar.\r\n\r\nFeatures:\r\n* 6 & 8 Core CPU Support!! (2 notification icons)\r\n* Single Core, Dual Core (NVIDIA Tegra 2), & Quad Core (NVIDIA Tegra 3) support!!\r\n* Statusbar notification for CPU Usage\r\n* Statusbar notification for CPU Frequency\r\n\r\n----\r\n\r\nsource: https://github.com/takke/cpustats', 'descriptionHTML': 'CPU Stats that displays usage details within your phones status bar.<br><br>Features:<br>* 6 &amp; 8 Core CPU Support!! (2 notification icons)<br>* Single Core, Dual Core (NVIDIA Tegra 2), &amp; Quad Core (NVIDIA Tegra 3) support!!<br>* Statusbar notification for CPU Usage<br>* Statusbar notification for CPU Frequency<br><br>----<br><br>source: https://github.com/takke/cpustats', 'summary': 'Compact CPU Usage Monitor', 'summaryHTML': 'Compact CPU Usage Monitor', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.115819, 'ratings': 3668, 'reviews': 1052, 'histogram': [383, 196, 290, 538, 2258], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.1M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Panecraft, Inc.', 'developerId': 'Panecraft,+Inc.', 'developerEmail': 'takke30@gmail.com', 'developerWebsite': 'https://github.com/takke/cpustats', 'developerAddress': 'Midorigaoka 6-31, Ebetsu-shi, Hokkaido, JAPAN', 'privacyPolicy': 'http://www.panecraft.net/privacy_policy.html', 'developerInternalID': '5380500334948627539', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/FOUj19h6L8NBgifLiddpc1z1qrSZ2UQ757QHqlvkfDZkmgNJnA1BrJhR1m3d0R6-KQ', 'headerImage': 'https://lh3.googleusercontent.com/2U-HXcRAaBRlXH5MxvqKkmJ1DvKY2dqhgpBJ782fLJZJLK4DRHm7JWvkYqxRusadIV4', 'screenshots': ['https://lh3.googleusercontent.com/g6jv6AnmUOszfLKUTV7pn-n2jbuSQLksBSxOP3UtRwlIcwqarGdT6T2kqbj5nrbbGSM', 'https://lh3.googleusercontent.com/3JD_9C3OBXJ46MP3_avXTmoSaZTr28iIy-0JnTFVxoQI64Bohb16-aL1qeDoFmWLC5EX', 'https://lh3.googleusercontent.com/11koXRy8zLEoIR-9wxUXD2LVaPHVW5L6DdQJW8tEeb8RKeQDe4J-gFhn0V-1UX-QwPw', 'https://lh3.googleusercontent.com/_zZLfuUqUXj1C5srtL-PJEFPSejvjiSasdJV-QJhgN4AwTtY6R75z-uahKMj_7dBgOk'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Oct 15, 2012', 'updated': 1572656265, 'version': '2.1.2', 'recentChanges': 'v2.1.2\r\n- Fix to stop notification by system after closing the main activity\r\n- Fix some bugs\r\n\r\nv2.1.0\r\n- Change notification icon color to Monochrome (Android 5.0+)\r\n- Set "Start on boot" by default\r\n- Support Android 4.0 or later (Stop supporting Android 2.3 to 3.2)\r\n- Set icon mode as "1 Icon (sorted)" by default\r\n- Others', 'recentChangesHTML': 'v2.1.2<br>- Fix to stop notification by system after closing the main activity<br>- Fix some bugs<br><br>v2.1.0<br>- Change notification icon color to Monochrome (Android 5.0+)<br>- Set &quot;Start on boot&quot; by default<br>- Support Android 4.0 or later (Stop supporting Android 2.3 to 3.2)<br>- Set icon mode as &quot;1 Icon (sorted)&quot; by default<br>- Others', 'comments': ['Did not work. Appeared to detect hardware specifications fine, but always displays (falsely) at 100% usage.', "Also had this tool for ages. I remember F-Droid version using monochrome icons, too, so I went back to this one. Now no color so I downgraded. You say it's Google's fault. Fine. I suggest a really separate F-Droid version allowing the user to choose between color and monochrome. Otherwise, I'll stick with 2.0.2 and be done with it.", 'Ive used this app for years and really appreciate being able to visualize the cpu load in the status bar. However the recent update that turned the icons white instead of the colored icons of old is very annoying. The color gradient icons were so much better. The app still functions the same, but lacking the useful color gradient is a big loss.', 'Doesn\'t seem to support Android 9? Updated: Using version 2.1.2, All of the top 4 cores stuck at 13% as the bottom ZEROED OUT POSITION before moving. All bottom 4 cores stuck at 23% as the bottom ZEROED OUT POSITION before moving. LG V30 running Android 9 Pie. Also Restarted after applying settings for 1 second intervals. Still a "no go".', 'Worked for 5 stars on Android KitKat, however after upgrading to Huawei Y5 on Oreo, the notification icon dissappears after a while. This is affecting all Apps, and not just yours. I noticed others in your comments are experiencing the problem. Some software update is required.', "Thanks for the latest update :-). Even though I miss the previously coloured, load indicating bars in the app's status/info bar icon, having CPU Stats there, for the first time on my Android 8.1 phone, display the current CPU usage, just like I was used to on my previous A4.4 one, is marvelous. But I do miss the lack of colour ;-)", "Its quite good app but I was forced to uninstall it because it hadn't been updated earlier. My android says that power consumpion is too high. I cannot stand it anymore. Power consumption is crutual nowadays. Samsung galaxy s8 plus. Android 9", "Pre-update: My last app with notification icons in color. I'm going to miss you pretty colors \U0001f97a👋🏽 Post-update: it's not as bad as I thought but I don't care for the monochrome icons vs the colored ones. I understand, it's Google's fault.", "Using it on the s8; The best thing is no ads ,and your phone doesn't have to be rooted to use it, big thanks to the developer.", 'Very useful and simple. I need RAM version of this app.', 'Works, but will not exit when asked. Have to uninstall.', 'For differentiating app slowness from system slowness.', 'This app does what I would like, but the app or the system continues to shut it down. Running more stable under Android Q v10.', 'Great little app. It was perfect until now. But I want my colored icon back! I hate Google, always these annoying changes!', 'I loved it. Used it for years.. But now I have a Huawei p10 with 8 cores and does not work. Keeps locking up', 'If you wish to know what your cpu is clocking at and duty cycle this is very nice', 'Only way to close the app is to force quit it (exit option in the menu only exits the user interface, the app still runs and the notifications still show their stats).', "It works great but I don't like that you took away the colors in the icon bar at all!", "No monochrome. Uninstall after years. Edit: found a previous version, that's still fine. Thanks.", 'prefect, great work Dev! i been using this since it came out many years ago. love it!', 'Works with Android Pi. It would be helpful to monitor memory and GPU usage also.', "CPU LOAD in the STATUS BAR. That's what i wanted. Thanks!", 'Cool app, but sometimes is freezing cpu cores workload icon', 'Works perfectly on all devices - even on octacores.', 'icon, notification, keeps disappearing. 6gb ram device..', "It don't have CPU usage on the notification bar, only app icon.", 'bring back color notification icon. excellent open source app .', 'Please add support for big.little cpu architecture for cortex a73 and cortex a53 and android 9', 'Neat, really been wanting a simple cpu monitor for android.', 'Can we have the colours back please?', 'Please consider making an update. Cheers!', 'do not update', 'Good! Update for Android 9?', 'EXACTLY what i was looking for!', "doesn't show usage by app", 'It would be great if you mentioned in the description that cpu usage monitoring only works on Android 7 or earlier and on rooted devices. CPU frequency does *not* correctly represents CPU usage especially for long CPU intensive operations where the SOC needs to downclock to adhere to thermal limits - in this case the user might be misled that e.g. CPU frequency is just 50% of its maximum while in reality the user device is under big stress.', "Doesn't seem to be as accurate as before November 2019 update. As in all 4 cores in one box out of two, go up a notch or two or however many, at the same time, rather than independently. Still essential app for me though.", 'My go-to CPU monitor app for my phone since it takes up very little screen space and has a good UI. I just wish it had a good task manager built in. Bring back the color status bar icon!', 'Works great on Pixel 2 XL but only shows 1 icon on Pixel 3.', 'no consume datos'], 'appId': 'jp.takke.cpustats', 'url': 'https://play.google.com/store/apps/details?id=jp.takke.cpustats&hl=en&gl=us'}
