{'title': 'Logcat [NO ROOT]', 'description': 'PLEASE READ DESCRIPTION.\r\n\r\nRead Android logs without root access. The app uses remote debugging to connect to phone local ADB daemon. Configuring remote debugging on a phone can be challenging and requires some technical expertise. It has to be done once and after each device reboot.\r\n\r\nEnable USB debugging first on your device. Navigate to Settings > About Phone and tap Build number seven times. Go back, access the Developer options menu and check USB debugging option.\r\n\r\nNext step is to enable remote debugging. You need to have Android SDK installed on your computer. Connect your phone via USB cable and run following adb command:\r\n\r\n<b>adb tcpip 5555</b>\r\n\r\nDisconnect USB cable before trying to use the app. Some phones have problems handling network ADB connection when they are connected via USB as well.\r\n\r\nSometimes establishing connection to ADB hangs and requires killing and restarting the app. It seems to be a problem with ADB daemon itself and not the app issue.', 'descriptionHTML': 'PLEASE READ DESCRIPTION.<br><br>Read Android logs without root access. The app uses remote debugging to connect to phone local ADB daemon. Configuring remote debugging on a phone can be challenging and requires some technical expertise. It has to be done once and after each device reboot.<br><br>Enable USB debugging first on your device. Navigate to Settings &gt; About Phone and tap Build number seven times. Go back, access the Developer options menu and check USB debugging option.<br><br>Next step is to enable remote debugging. You need to have Android SDK installed on your computer. Connect your phone via USB cable and run following adb command:<br><br><b>adb tcpip 5555</b><br><br>Disconnect USB cable before trying to use the app. Some phones have problems handling network ADB connection when they are connected via USB as well.<br><br>Sometimes establishing connection to ADB hangs and requires killing and restarting the app. It seems to be a problem with ADB daemon itself and not the app issue.', 'summary': 'Logcat app that does not require root access', 'summaryHTML': 'Logcat app that does not require root access', 'installs': '100,000+', 'minInstalls': 100000, 'score': 2.63, 'ratings': 405, 'reviews': 197, 'histogram': [210, 24, 20, 4, 145], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.8M', 'androidVersion': '4.3', 'androidVersionText': '4.3 and up', 'developer': 'Anton Tananaev', 'developerId': 'Anton+Tananaev', 'developerEmail': 'anton.tananaev@gmail.com', 'developerWebsite': 'https://github.com/tananaev/rootless-logcat', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '7510277361579248162', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/XIppczCkjKa_1n4PIyX-Mdjvwx8ffxNhz8kiRsmyen-GLXo99GKziQZKBfdlG5VQLGdl', 'headerImage': 'https://lh3.googleusercontent.com/4uYM6ThZyGe0gljsEFLReMrlRYbh6SZiJ-aAn3BSRvtHR5iAOg0PcGOO1MCKsLExaYg', 'screenshots': ['https://lh3.googleusercontent.com/jN-Oj-6w6y41fUgg5vIR0K646PVvkPhOWBj5Il90_MBkUsdHZFEv04vktfhUnuR0B2I', 'https://lh3.googleusercontent.com/2vSmjg6abZig07_Y17SLFZR1-L02M-bczvF1yyckJwhKLLPSMvD9RxQutX7zwwiCWUE', 'https://lh3.googleusercontent.com/FjXF_9ywbD7tvsdFYYNk04EBu0_TB5aAksptqr3y2j1nS6RasZLraAcd1_REiwHKOVUk'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 4, 2016', 'updated': 1569180923, 'version': '1.11', 'recentChanges': 'Support Android 10', 'recentChangesHTML': 'Support Android 10', 'comments': ['What a useful app this is! The bad reviews are from people who have not read and followed instructions given by the developer within the app or the Play Store listing. Kudos Anton for your ingenuity!', 'This app does exactly what it says it does, allows you to view the all logcat files on your phone without root. Those giving this app a bad review, do not understand how this works or what it is used for and should not use this app. A bit of history, when Google released Android 4.1, they changed the system so that an app can only read its logcat file and not others. For an app to read all logcat files, you either need root access or you need to issue a command using ADB on a computer. You cannot just install this app and expect it to work out of the box. To get this app to work, first you need to enable USB debugging in Developer options on your phone. ADB and this app need that to issue the command and access the logcat files. Then, you need to plug your phone into a computer that has ADB on it. Once it is plugged in, you need to open the command prompt on your phone, navigate to the folder with ADB, and then run the command "adb tcpip 5555." This app then uses remote debugging (acts like a PC to access USB debugging), so each time you open this app, you will need to allow the "computer" to access the phone.', "This app works as described. I rarely write reviews but some ignorant people who can't follow instructions a 5 year old can are blaming this app for viruses, robocalls and what not made me do it. The app works perfectly, is open source, virus free and is the best of its kind. kudos.", "Doesn't work if the phone doesn't have a working USB port (because you need to run adb logcat tcpip 5555), and the dead USB port was why I couldn't root my phone in the first place.", 'This app works perfectly on non-rooted phone because its reading the logs via TCP connection to the ADB server. I just wish I had a searching by date and time.', "The app description in the Play Store needs info on what _is_ needed for it to work. In order to avoid User's confusion. As I got, it doesn't work as is...", 'Dear Sir, the app works great! how do i filter using tags? can you give me an example please? Thank you for your hard work!', 'Great app. It would be wonderful if you add RegEx to search & Filter box.', "This doesn't work at all. Then when i reinstalled it the same message popped up. So i recommend u don't use this app", 'I was hesitant to install after reading comments, but this app works absolutely great! I love it!!!', "App works great, exactly as advertised: root isn't needed", "App works as described. Don't worry about the negative comments. It is just a bunch of ignorant people that can't follow simple instructions. Anton is a legitimate developer and I have used several of his open source programs.", "The app works exactly as it said it would. Those giving a bad review probably didn't read the description.", 'Requires remote login. Uninstall.', 'this is such a BAD APP I OPEN IT AND IT SAYS CONNECTING I WAITED FOR 2 HOURS STILL NOTHING i really think this its just trash its not really usefull 😒', 'It keeps loading on mine :,(', 'app works as said in description. you just need follow the steps given carefully', "People don't know how to use it. Its super easy and to the point", 'Its wont connect or even open', 'Dont have a wokring usb port :/', 'It is actully good cause its my first time downloading it.', 'Works great without root', 'Working as expected. Literally everyone needs to read', 'this app is auwsome!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!', 'it works! 😃 i love this tool app', "lily the fox is right it keeps loading and i'm not waiting for 2 hours delete it its noob its stupid its dumb 😡😡😠😠😠 >:( it sucks just delete it just do it!!!!!!!!!!!!!!", "Anton is an idiot. this app will make your device have so many viruses. He is a liar. He doesn't even have the guts to send real replies to any of us", 'I install this app But this app does not worked', 'I know it works I just want to understand better!', 'Very very worked!!!!', 'it sucks, thats all i gotta say, bc its the truth :-[', 'This app is fake it doesnot work useless app', 'Got the logs I needed 5/5 would recommend', "doesn't work.", 'This is so gay', 'Is this a hacking app?', "It doesn't work", 'Идея интересная. Не самый удобный способ, но зато без рута, а это важно...', 'GA GUNA', 'Not work'], 'appId': 'com.tananaev.logcat', 'url': 'https://play.google.com/store/apps/details?id=com.tananaev.logcat&hl=en&gl=us'}
