{'title': 'Telegram', 'description': "Pure instant messaging — simple, fast, secure, and synced across all your devices. Over 400 million active users.\r\n\r\nFAST: Telegram is the fastest messaging app on the market, connecting people via a unique, distributed network of data centers around the globe.\r\n\r\nSYNCED: You can access your messages from all your devices at once. Start typing on your phone and finish the message from your tablet or laptop. Never lose your data again.\r\n\r\nUNLIMITED: You can send media and files, without any limits on their type and size. Your entire chat history will require no disk space on your device, and will be securely stored in the Telegram cloud for as long as you need it.\r\n\r\nSECURE: We made it our mission to provide the best security combined with ease of use. Everything on Telegram, including chats, groups, media, etc. is encrypted using a combination of 256-bit symmetric AES encryption, 2048-bit RSA encryption, and Diffie–Hellman secure key exchange.\r\n\r\nPOWERFUL: You can create group chats for up to 200,000 members, share large videos, documents of any type (.DOCX, .MP3, .ZIP, etc.), and even set up bots for specific tasks. It's the perfect tool for hosting online communities and coordinating teamwork.\r\n\r\nRELIABLE: Built to deliver your messages in the minimum bytes possible, Telegram is the most reliable messaging system ever made. It works even on the weakest mobile connections. \r\n\r\nFUN: Telegram has powerful photo and video editing tools and an open sticker/GIF platform to cater to all your expressive needs.\r\n\r\nSIMPLE: While providing an unprecedented array of features, we are taking great care to keep the interface clean. With its minimalist design, Telegram is lean and easy to use.\r\n\r\n100% FREE & NO ADS: Telegram is free and will always be free. We are not going to sell ads or introduce subscription fees. \r\n\r\nPRIVATE: We take your privacy seriously and will never give third parties access to your data.\r\n\r\nFor those interested in maximum privacy, Telegram offers Secret Chats. Secret Chat messages can be programmed to self-destruct automatically from both participating devices. This way you can send all types of disappearing content — messages, photos, videos, and even files. Secret Chats use end-to-end encryption to ensure that a message can only be read by its intended recipient.\r\n\r\nWe keep expanding the boundaries of what you can do with a messaging app. Don’t wait years for older messengers to catch up with Telegram — join the revolution today.", 'descriptionHTML': 'Pure instant messaging — simple, fast, secure, and synced across all your devices. Over 400 million active users.<br><br>FAST: Telegram is the fastest messaging app on the market, connecting people via a unique, distributed network of data centers around the globe.<br><br>SYNCED: You can access your messages from all your devices at once. Start typing on your phone and finish the message from your tablet or laptop. Never lose your data again.<br><br>UNLIMITED: You can send media and files, without any limits on their type and size. Your entire chat history will require no disk space on your device, and will be securely stored in the Telegram cloud for as long as you need it.<br><br>SECURE: We made it our mission to provide the best security combined with ease of use. Everything on Telegram, including chats, groups, media, etc. is encrypted using a combination of 256-bit symmetric AES encryption, 2048-bit RSA encryption, and Diffie–Hellman secure key exchange.<br><br>POWERFUL: You can create group chats for up to 200,000 members, share large videos, documents of any type (.DOCX, .MP3, .ZIP, etc.), and even set up bots for specific tasks. It&#39;s the perfect tool for hosting online communities and coordinating teamwork.<br><br>RELIABLE: Built to deliver your messages in the minimum bytes possible, Telegram is the most reliable messaging system ever made. It works even on the weakest mobile connections. <br><br>FUN: Telegram has powerful photo and video editing tools and an open sticker/GIF platform to cater to all your expressive needs.<br><br>SIMPLE: While providing an unprecedented array of features, we are taking great care to keep the interface clean. With its minimalist design, Telegram is lean and easy to use.<br><br>100% FREE &amp; NO ADS: Telegram is free and will always be free. We are not going to sell ads or introduce subscription fees. <br><br>PRIVATE: We take your privacy seriously and will never give third parties access to your data.<br><br>For those interested in maximum privacy, Telegram offers Secret Chats. Secret Chat messages can be programmed to self-destruct automatically from both participating devices. This way you can send all types of disappearing content — messages, photos, videos, and even files. Secret Chats use end-to-end encryption to ensure that a message can only be read by its intended recipient.<br><br>We keep expanding the boundaries of what you can do with a messaging app. Don’t wait years for older messengers to catch up with Telegram — join the revolution today.', 'summary': 'Telegram is a messaging app with a focus on speed and security.', 'summaryHTML': 'Telegram is a messaging app with a focus on speed and security.', 'installs': '500,000,000+', 'minInstalls': 500000000, 'score': 4.448961, 'ratings': 5265220, 'reviews': 1459129, 'histogram': [351451, 106163, 272902, 631242, 3903460], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Telegram FZ-LLC', 'developerId': 'Telegram+FZ-LLC', 'developerEmail': 'support@telegram.org', 'developerWebsite': 'https://telegram.org', 'developerAddress': 'Business Central Towers, Tower A, Office 1003/1004, P.O. Box 501919, Dubai, United Arab Emirates', 'privacyPolicy': 'https://telegram.org/privacy', 'developerInternalID': '4683768920544607034', 'genre': 'Communication', 'genreId': 'COMMUNICATION', 'icon': 'https://lh3.googleusercontent.com/ZU9cSsyIJZo6Oy7HTHiEPwZg0m2Crep-d5ZrfajqtsH-qgUXSqKpNA2FpPDTn-7qA5Q', 'headerImage': 'https://lh3.googleusercontent.com/pgiel6OzR01do2sPxONlteJ5_GAwD6W-JpiF98hdns3XinShKZkziUd1B8sG-8qa', 'screenshots': ['https://lh3.googleusercontent.com/shqQKbsBIGC3kzpav3kekZCBQ0dNUsrZja93Fte01p-dVw_9mo-fNOXaeKNCUclNYPk', 'https://lh3.googleusercontent.com/eqN193Wmmv5RPdMsDPAR8VQJqnyk_DuXq3D5Pz0j8aMl6JoaI2dkaKzjVvNMbx5fZw', 'https://lh3.googleusercontent.com/TZpIMA3qMia-I6ROwhSNkjT5iXiFxUPJOf_OBXR1HnPjs0F3q_6ZG8g8vpKkgowEAA', 'https://lh3.googleusercontent.com/SHQuv3gFqm_P0icyDmGcoQmBd6NuGxW3EmdTncutIMeYxW7HAKCgP-ZqltQyYLAF2yI', 'https://lh3.googleusercontent.com/L6cksF8TfDJjWGlWOvGp2HNZV17woOb1JjQ-GSa1R50dX89veCdOEtWqaf97wZUmFg', 'https://lh3.googleusercontent.com/31ZNmmQ2fcTRju8F9K9RaYRKRzGR-tlH4FfjvkPKkzcwATp0C25P-fUgZpDf2Xw914R9', 'https://lh3.googleusercontent.com/lE-yVAcjm1rfr2TGIquOJ6vdkIR96VqW9AHPenKfUjjJr5L6kePiy-atQjC8e4kQ_RQ', 'https://lh3.googleusercontent.com/0zfne3O_M0c0FDZNxOdrsE1dF20SIchDzy_9E1UzbnM1IAX3LsCOePr4DTlfOM8z5w', 'https://lh3.googleusercontent.com/pl0i5aqdxd_3UB6QLEZKYsOkzKf-oyE0BQynYRi_rpbAhBQ4qATkUxiJv7UET0K00w', 'https://lh3.googleusercontent.com/xmKS4i25uwOn9hr23ETfN7ZH3TBTo-DUi8HE3gMQ1PBzF_BucjXyErz32E3UNvt_VLMH', 'https://lh3.googleusercontent.com/dkXRFToQ25OvIvpR-kWZXW9ZQJ9ax2MLGfidcMXye6GkwUPrKMAucjqTqsO1MFr5_BcM', 'https://lh3.googleusercontent.com/hRkLLiEWbl26MYzSLeSezpXzNVypeuxizZk47KhLtruTPVKfG4bnUB0P87KVuB1UBVpU', 'https://lh3.googleusercontent.com/0W9hrBPxU_XlF4mu3dDYuDFShGl-fxvmdsvCqBKO45fWZWG7nQHp6LFgcb-bCdLJIVE'], 'video': None, 'videoImage': None, 'contentRating': 'Mature 17+', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 6, 2013', 'updated': 1591423444, 'version': 'Varies with device', 'recentChanges': 'New Media Editor\r\n• Enhance video quality, add drawings, text, stickers.\r\n• Zoom in on media for high-precision drawing.\r\n• Put animated stickers on photos or videos.\r\n\r\nNew GIF Panel\r\n• Find GIFs quickly in emoji-based sections.\r\n• GIFs load faster.\r\n\r\nImproved Interfaces\r\n• Send, edit, delete messages with new animations.\r\n• Updated Video Player, Storage Usage settings, 2-Step Verification flow.\r\n\r\nThere are more changes than can fit in this section. Update the app to get the full changelog on Telegram.', 'recentChangesHTML': 'New Media Editor<br>• Enhance video quality, add drawings, text, stickers.<br>• Zoom in on media for high-precision drawing.<br>• Put animated stickers on photos or videos.<br><br>New GIF Panel<br>• Find GIFs quickly in emoji-based sections.<br>• GIFs load faster.<br><br>Improved Interfaces<br>• Send, edit, delete messages with new animations.<br>• Updated Video Player, Storage Usage settings, 2-Step Verification flow.<br><br>There are more changes than can fit in this section. Update the app to get the full changelog on Telegram.', 'comments': ['I am facing the issue with telegram app for third time in a week. It keeps showing status, connecting.... but does not connect at all. If I uninstall and install it again, it gets connected. I have not changed any setting in the app, nor there is any connectivity issue. It remains same even after installing latest version.', "Exceptionally superior in design and form. Easy to use and chock full of meaningful functionality. True to form in translating its vision into a tangible product. Its features are more refined than its rival's and a whole lot more fun to use, incredibly easy to access and is available in abundance thanks to the community that exists in support of the app. The only thing missing is encrypted video calling... and that's because they are working on making it truly encrypted.", "I once thought telegram was a great social app. Though I've not explored all its usefulness, it has become something disgusting to me. I go through a great ordeal just to have media downloaded. It starts downloading until the last mb to complete and then stops. I've used so much bundle to have media downloaded to no avail. It's such a shame especially as they claim its free😡😠😤", "The app is very flexible in use and this is the only app which have self destruct chat which is amazing feature, I'm using since 5 years and i found the best app from all the communication application and this is also a good app for file sharing, you can share files with high quality and with original size of files, and Stricker are the way to make our chat more interesting so i like this section more, also you can send and receive a short video and voice also in just one click, great features.", "I have been using this app for a long time now and I've been loving it. I would give 5 stars, but a little while ago a pretty annnoying feature was added: When you click on the left or right side of an image, it will scroll to a different image. I find this feature very annoying. I would really appreciate if you made this feature optional in the settings, so those who like how it was before can turn it off.", 'I heartly like this app, just like the description say simple, reliable, secured, user friendly.... i have one suggestion to make it even better, Dear developer please make Samsung user can save the marked photo in chat!!!! Please!!!!!! It will be easier and faster for us to select all photo and save at once just like iphone user.', 'Thank you for finally adding the option of folders but I think that there should be a tab for showing the folders vertically rather than just horizontal tabs for each folder because when the number of tabs increases, it becomes difficult to navigate through them. Please, add like, dislike, and comment as built-in features to posts. Thanks again for your hard work. ❤', "Used Telegram X before this. It's annoying if the keyboard is shown and you're trying to send a photo, the send button is blocked by the keyboard. Why not just make the keyboard go away when I'm selecting a photo? The Brush editor on photos is good but there's a bug: after annotating a photo w/the brush, my annotation goes up slightly. I drew an arrow in a photo & when I'm about to send it, the arrow was placed higher to where I drew it. Happens with all drawn annotations. It's annoying!", "Guys I really do like your app. I think you're the best! The one thing I don't get it... Abot creating the folders. If I move certain chat in created folder it will be logical than not to have same chat on two locations. Among all chats and in created folder. With this set up having several folders and with chats in several locations what to create folder than? It will be better when you place chat in folder, than this chat doesn't have to be among all chats list.", "The best messenger ever! Transfer huge files, choose video quality before you send, send uncompressed photos/images, edit your sent messages or even delete them for recipient as well if sent by mistake, no backups needed - if you lost your phone, you didn't lose anything in Telegram, easy registration - no usernames or passwords to remember, 2-factor authentication, password protection, channels and broadcasts for large groups, bots, etc, short a/v messages, location sharing, and NO ADS!!! 😎", "This is such an AMAZING messaging app! Kudos to the creators. Just bring video calling and it'll be perfect. I hope more people shift to telegram from whatsapp. It's superior in almost all aspects like animations, quality of the UI, features, speed, security, cross platform and so on!", "Telegram is great. It's truly one of the best messaging apps. What it needs is a better in-conversation 🔎 search with the ability to browse SHARED MEDIA like pictures separately, like you can in Facebook Messenger. Otherwise they are lost and require endless scrolling back... I also don't dig the default emoji set. 😔", "The app is constantly bugging ? Sometimes it takes a lot time to send audio videos images ? Sometimes some people can't send me messages, inconsistent to send messages in this case even tho the app is great when the connection is not good ( or the app bugging I can't really tell) I don't have other way other than use WhatsApp. WhatsApp is not so good, but at least is good doing what's supposed to do", "The best messaging app I have ever used, it has so many great features it's unreal, I'm just sad not everyone uses it. I downloaded it to get away from WhatsApp and FB Messenger and it's 100% better, the design, features, ease of use, updates are all better. The only reason I could not give it 5 stars is the 'Connecting....' issue. Quite often I will have a notification, open Telegram and the message won't show because its stuck on 'Connecting....'. if this was fixed, the app is 5 stars.", 'DISHEARTENING. 100 things updated, BUT NOTHING DONE TO IMPROVE ON THE POOR LEGIBILITY OF THE APP. Font-size of the Chat-List on the default screen of the app is very small (that has "Telegram" header)? The option available under Chat Settings only allows to change font-size of (inside the) conversation. Also, the font-size, while you type a message, is very small.', "The most powerful messaging app which even offers unlimited cloud storage for their user for free, and telegram gives the tools to their users to make use of it properly which is really awesome, and it gives the tools to their users which gives the ability to create their own custom made chatbots which are very helpful for organizing groups and channels. And this is just one kind of a tool and option which I've mentioned but there are tons of more options and customizations to check inside.", "Earlier I had given 4 stars but now post updates I am like why doesn't this app deserve 5 stars... N yes it's one of the best chatting purpose app. - stickers - quizzes facility - user friendly options for sending media Why it's not a perfect app I really dnt find any reason. Just lacking is the status facility like WhatsApp.", "Please, restore that editable button and let it applicable to recent and old post 🙏🙏🙏🙏. So that an error made last week can still be edit this week, I wont need to go and retype again, and this feature has been one of the major reason that made me to love telegram, despite no video call. Or it's my settings?", "I like the app! It has interesting customization options! The only thing I would add is a new way to interact with people. Maybe like the system Kik has. Everything this app has, I wish Kik did, but sadly, ain't happening. Good job! 💜", "normally it works perfectly fine but suddenly it stopped connecting to the wifi, so i can't use it anymore. I tried reinstalling it but now it won't let me log in anymore because it needs to connect to the wifi even though nothing is wrong with my wifi and it's frustrating", "I'm on Android 11 Beta 1 as you can already see it. Since the Android 11 developer preview 4 I'm having Telegram Gboard issue where the text input box doesn't show up while typing and after closing gboard text input box of telegram dont hit the bottom and it shows blank area of keyboard. I feel its happening because Android 11 introduced new Gboard sleek animation. other apps dont have this keyboard issue. please fix it using native api or something. its annoying. I love this app .Thank you", "1. I am not finding 'NEW CHANNEL'. I am unable to create a new channel. After your reply, I can now do. Thank you. 2. Folder section is very useful for organizing the chats. Number of folders need to be increased. A screen with only folder buttons will surely help to visit the chats.", "It's Awesome But Please add an option to separate downloaded files in any group and when we download a file,audio,video,document etc. all of these save in telegram documents folder but different names that's a issue. If you make these changes i will be very thankful to you.", "It's great that one can view all messages from the start of the chat..but why is there no option to delete read messages..finding relevant messages in a huge group becomes tedious..It'd be great if one could delete read messages and keep only important or usefull ones.", "This is rly great app and i enjoy it but with last update it was very bad decision to make video auto replayable when you open it without any option to disable it (not pausing but disable at all) and it's rly awful. It would be great if developers will add option to disable it.", "It's a good app with security bt there are some things which are missing ☹️ 1- IT DOES NOT HAVE VIDEO CALL OPTION THAT'S REALLY FRUSTRATING AS I HAVE TO GO TO ANOTHER APP FOR JST A VID CALL. 2- THERE SHOULD BE A COPY PASTE OPTION TO COPY THE ENCRYPTED SECURITY NUMBER AND SEND ASK THE OTHER PERSON IF HE ALSO HAS THE SAME( jst like Signal) AS WE CANNOT MEET I CAN'T SCAN QR CODE AND NUMBERS ALSO CAN'T BE COPIED AND SEND EASILY. Though except these 2 things telegram is a very nice app.", 'Fastest most responsive chat out there. So many good features but without the bloat. If there is a feature you like on your other chat app, chances are it already came out on telegram a year earlier. Plus the most fun animated stickers ever.', "I think Telegram is there greatest messaging app available. Side from it's great features what really interests me is the privacy it gives you the respect it at Telegram. They also have a plan to make profits not based on ads which males me more comfortable I'm not there product! Like Facebook or many iterating things that happen in WhatsApp!!", 'After downloading the movie also , I\'m not able to watch the movie.. As it says "App was unable to play this video. Try to play it with external player?" Hahaha after downloading the movie also, I\'m not able to see the movie in external player...😬😤 How rubbish is this app !!😤😤 I need this bug to be cleared as sooner... Worst app.. !! I need help... please do some needful thing !!!', 'Why r u guys waiting for! No video call option😂photo cannot edit before sending😂 Still not so demanding as people need above for daily usages. This app should be all in one like WhatsApp...poor thing is for video call and sending images still need to depend on other app. Privacy is strong, sending huge data 1.5gb max. plus point. Video editing impressive, Please update as demands I believe you guys can do it ! Good luck 👍', "This app is fine..But once we download a movie file (by half) and try to resume it next time we take telegram ..We cant resume download and have to download from the beginning...\U0001f92c Its irritating..We lose our data...Plz make option for allowing to resume our download!!! Plz fix it... Also it takes too much net for downloading.... Have better expectations from u guyzz...Fix I!! After the new update ..I can't even search to get a channel..Shows no results!!!\U0001f92cWHAT THE HELL IS THIS?!?? Plz fix!!!", 'I love the app, but the last update is really annoying. New animations are laggy and ugly, but if you turn them off, other animations disappear too. So, please, make it customizable, or just delete the new message sending animation.', 'Add an option to star messages in each contact or grp to refer if needed in future. That would be easy to check important messages from that chat instantly. Have been using this since years. This Has Best and updated stickers 👌. Liked them soo much', 'Thank You for implementing folder option. But it would be better if there was no limit to number of chayan which is currently fixed at 100 and all chats tab should be optional as it is not really needed anymore.', '1.please involve a feature to bookmark /star a message in any channel then and there and not just send it to saved messages. 2. please allow to go full screen on a channel hiding the left side chat enlistment row . otherwise a good app! keep going.', 'Love you telegram developers. What an amazing app that I ever had. Such an advanced features in chatting, Media sharing, username feature. I Really appreciate that. I can give you 1000 stars. But, Google limited me to 5 stars only. Keep going.', 'When we wanted to download any video it starts download and when we switch to another app or go to home page it stops downloading! Why? Kindly repair this thing and allows it to continue download when we we use another app or lock our phone also whatsapp allows this feature!', 'Its awesome app using from last 4 years..it has all the rich features which we need... A single bug i seen today that on download in progress its showing in Bytes which is really hard to know how much is downloaded and how much left...please fix this', "I love it more than whatsapp. You can download music, video games for emulators, movies. Plus it also has cool gif and stickers to add to the fun. Only bad thing is at does not have video calls from what i've seen and also the calls are not as good and clear as whatsapp and messenger", 'Very good app to download movies. It was better if it shows the results of all the groups in teligram when we search for a particular movie. In short you should make it in a way that it searches in all teligram groups when we search anything, thank you.'], 'appId': 'org.telegram.messenger', 'url': 'https://play.google.com/store/apps/details?id=org.telegram.messenger&hl=en&gl=us'}
