{'title': 'Share to Clipboard', 'description': 'Copy to clipboard straight from the Android "Share" menu.\r\n\r\nHooks into the Android native Share system for seamless integration.\r\n\r\nNo more annoying workarounds to do something that is so useful and essential.\r\n\r\nUnique to this app is that we also support sharing VCards (contact) and plan on adding many others.\r\n\r\nAlso, unlike many other solutions, this one doesn\'t have any visual bugs and phantom windows, just click share to copy from any app, and paste anywhere you like!\r\n\r\nThanks to many contributors, the app is available in many languages.                                                  \r\n\r\n\r\nFully open source, with source code available at:\r\nhttps://github.com/tengusw/share_to_clipboard\r\nContributions are welcome!\r\n\r\nYou can also support development using this link: https://tengu.it/donate/\r\n\r\nPlease let us know about any issues, preferably by email.\r\n\r\nDonations: https://tengu.it/donate/', 'descriptionHTML': 'Copy to clipboard straight from the Android &quot;Share&quot; menu.<br><br>Hooks into the Android native Share system for seamless integration.<br><br>No more annoying workarounds to do something that is so useful and essential.<br><br>Unique to this app is that we also support sharing VCards (contact) and plan on adding many others.<br><br>Also, unlike many other solutions, this one doesn&#39;t have any visual bugs and phantom windows, just click share to copy from any app, and paste anywhere you like!<br><br>Thanks to many contributors, the app is available in many languages.                                                  <br><br><br>Fully open source, with source code available at:<br>https://github.com/tengusw/share_to_clipboard<br>Contributions are welcome!<br><br>You can also support development using this link: https://tengu.it/donate/<br><br>Please let us know about any issues, preferably by email.<br><br>Donations: https://tengu.it/donate/', 'summary': 'A way to copy to clipboard straight from the share menu!', 'summaryHTML': 'A way to copy to clipboard straight from the share menu!', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.13, 'ratings': 235, 'reviews': 90, 'histogram': [39, 4, 7, 16, 166], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Tengu', 'developerId': '8737354932635431639', 'developerEmail': 'android@tengu.it', 'developerWebsite': 'https://github.com/tengusw/share_to_clipboard', 'developerAddress': '46 Tvuhot Haaretz Street, Tel-Aviv, Israel 69546', 'privacyPolicy': None, 'developerInternalID': '8737354932635431639', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/3utsO-s_nQTRoNZddjNtHdu1GiEzk9_2D_b2vNUlNrbj2Y7n74o8bljZTPcm9UonNA', 'headerImage': 'https://lh3.googleusercontent.com/5IMmO6TCz_ACsdL287E9LFJ9DMKWqYaTXEKIOYAxSXM6z_AWs07r5tpNKbdqY6fRCcE', 'screenshots': ['https://lh3.googleusercontent.com/ENfTrhNy7IU3o9KKiDAYpXfUsgNggnP0CYLNrTkGuH9CaU_lY7CIUd0-dBk0StBDyg', 'https://lh3.googleusercontent.com/5b1BW9h37fBwptX66SSKZTFjv7XzdJvp-I2AEbCbsKY0QAmi8NoleeGJn4BYaVM1Yl0'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jan 12, 2015', 'updated': 1589812248, 'version': 'Varies with device', 'recentChanges': "* Don't try to open emails and phone numbers, only accept share intents.\r\n* Add a copy-confirmation toast when the confirmation notification is disabled.\r\n* Translation: Updated Portuguese", 'recentChangesHTML': '* Don&#39;t try to open emails and phone numbers, only accept share intents.<br>* Add a copy-confirmation toast when the confirmation notification is disabled.<br>* Translation: Updated Portuguese', 'comments': ['Thank you! Since the latest pixel update I lost the simple ability to 1 click share to clipboard. This brings back a feature I use at least 20 times a day on my work phone. You have saved me a significant number of needless clicks each day. Simple interface, set and forget. Absolutely perfect.', "Works great for apps that don't have proper sharing.", 'This just uploads the image to google photos and gives you a link. There is nothing new or fancy going on here. I want to be able to actually copy an image to my clipboard on native android. Samsungs can do it, but the pixel and essential PH-1 cannot.', 'It notifies audibly, and puts up a notification that disappears before it can be used. /But I do want to use the notification; I cannot, because it lasts only a second./30 seconds would be enough.', 'Works!! No idea why this previously standard function was removed from android Q on my s10. Maybe it was just Samsung trying to add its own "features" to Android?', 'Works as intended. Has problems sometimes, providing only the link and no title.', 'So far the only workaround I could find that helps me bring back the missing Copy to Clipboard function in Realme UI 1.0 (Android 10)', 'App literally does nothing. Copy to Clipboard appears nowhere on any share menu. 0 stars if it where possible.', 'Good workaround for android 10 clipboard removal issue from apps.', 'The best copy to clipboard app!', "Don't work", 'Cant share photo on clipboard', 'Share option does not show', 'Not all heroes wear capes 🙏', "Doesn't work", 'Does what it says on the tin.', 'Thanks for using my logo', "Life saver when phone developers don't add a simply share to clipboard feature when people just want to copy the URL without opening a third party app.", 'Para mi funciona perfectamente y realiza la simple función que su nombre dice y que me han eliminado de Chrome.', 'Unable to share images to clipboard', 'Does nothing,', 'Not working', 'Excellent', "It doesn't work for me. I long press an image on Facebook. Press share external. Then I have every option to share except to clipboard. Not functional at all.", "I was hoping this would let me copy my own photos to the clipboard to paste \ninto the body of email replies, for instance or the body of posts. It \ndoesn't. It only copies the link--and I don't need a 3rd party app for \nthat, so what's the point?", 'Does the job', 'Essential app', 'Not working with images. Useless to me', 'No BS! Simply Adds The Clipboard Feature, Period!', "Awesome. Does just what it says it will. I think those that are rating It low don't realize that it hooks into the share menu and is not a standalone app. A lot of wicked stuff coming out of Israel these days. I would have paid for this. Keep up the good work, Tengu!", "Working perfect. Not been so satisfied when the link title was forcefully added, I see there's an option now to turn this off - how to access that option when there's no app icon?  /e: nevermind, simply reinstalled the app to get the icon back :)", 'Nesessary', 'This app is brilliant and always will be its a shame i had to get rid of it ,because i  got android 5.0 update and  it was inculded', 'great little tool for those of us that write a lot of text. I send the file from Writer+ to a grammer too named spellogram and then share it back to the originally open file. avoids the editor opening a new copy when spellogram shares to the app', "The app is working fine for me. 👍.  Don't know why others are complaining.", "Won't let me do anything", "Horrible I want to share a video on YouTube and I press clipboard and it said copy to clip board but I don't know how to paste it.CAN U LIKE SHOW A VIDEO OF AN EXAMPLE!", "Wish I didn't install it can't find it in my home screen", 'Good new thing for me.', 'To save in my sd card'], 'appId': 'com.tengu.sharetoclipboard', 'url': 'https://play.google.com/store/apps/details?id=com.tengu.sharetoclipboard&hl=en&gl=us'}
