{'title': 'Termux', 'description': 'Termux combines powerful terminal emulation with an extensive Linux package collection.\r\n\r\n• Enjoy the bash and zsh shells.\r\n• Edit files with nano and vim.\r\n• Access servers over ssh.\r\n• Develop in C with clang, make and gdb.\r\n• Use the python console as a pocket calculator.\r\n• Check out projects with git and subversion.\r\n• Run text-based games with frotz.\r\n\r\nAt first start a small base system is downloaded - desired packages can then be installed using the apt package manager. Access the built-in help by long-pressing anywhere on the terminal and selecting the Help menu option to learn more.\r\n\r\nWant to read the wiki?\r\nhttps://wiki.termux.com\r\n\r\nWant to ask questions, report bugs or give feedback?\r\nhttps://termux.com/community\r\n\r\nWant to join the Termux IRC chat?\r\n#termux on freenode', 'descriptionHTML': 'Termux combines powerful terminal emulation with an extensive Linux package collection.<br><br>• Enjoy the bash and zsh shells.<br>• Edit files with nano and vim.<br>• Access servers over ssh.<br>• Develop in C with clang, make and gdb.<br>• Use the python console as a pocket calculator.<br>• Check out projects with git and subversion.<br>• Run text-based games with frotz.<br><br>At first start a small base system is downloaded - desired packages can then be installed using the apt package manager. Access the built-in help by long-pressing anywhere on the terminal and selecting the Help menu option to learn more.<br><br>Want to read the wiki?<br>https://wiki.termux.com<br><br>Want to ask questions, report bugs or give feedback?<br>https://termux.com/community<br><br>Want to join the Termux IRC chat?<br>#termux on freenode', 'summary': 'Terminal emulator and Linux environment.', 'summaryHTML': 'Terminal emulator and Linux environment.', 'installs': '5,000,000+', 'minInstalls': 5000000, 'score': 4.4495444, 'ratings': 61996, 'reviews': 27289, 'histogram': [4893, 1231, 2845, 5166, 47859], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Fredrik Fornwall', 'developerId': 'Fredrik+Fornwall', 'developerEmail': 'contact@termux.com', 'developerWebsite': 'https://termux.com/', 'developerAddress': 'Fredsborgsgatan 2\n117 59 Stockholm\nSweden', 'privacyPolicy': 'https://termux.com/privacy-policy.html', 'developerInternalID': '4794253573543453457', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/m3oqSZCwmitiZ-Im-CQu_rqT5eLHilOp5IudBynv3COJUumFzuQaP2dgTDxRL_03f4x2', 'headerImage': 'https://lh3.googleusercontent.com/VQR8B6K4tRhxA0CGeFgbl0QQS7Bn6XAMofX8Ua0TD6XwkMBs58QVIgQacsHIxXJOOkI', 'screenshots': ['https://lh3.googleusercontent.com/6bceRPjMRf_boUzYdY0HN-UeV_yhnwN2fKDxTgOc4AX0zXc6Xjq0ZALZv5ubem3GODk', 'https://lh3.googleusercontent.com/efc4QE6HxgB_C4um7R5C9vCh_NpLeyXGf_PeKamJidVdcmmbGRIEuhwW2ZLIEJT4Tw', 'https://lh3.googleusercontent.com/jjDZv1I3JEkq6fbErIJmGHkr0W9maQ5FdaeVRIiFkU_f11BlYvKUQieFbMJfFWfNe88k', 'https://lh3.googleusercontent.com/aDk1CXpMq5N5gG1tfoRpPDH5jnJIVGd9ILcVvsrkIxRSnk8Bg6A5oURcGJeD0y_LxIfU', 'https://lh3.googleusercontent.com/zt7oMyeenTfaKbhaThIxpfmRyV0gKfa_982e7Prb9e4gEIHU8u7SyKJM28ghU0XUHJjY', 'https://lh3.googleusercontent.com/kf55rCMJMIWMZAvHIoINyWR6aN7xpenJEIsTktEJ03lYa_bDDnEqIWLw9xXnWn83ZBQ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 30, 2015', 'updated': 1585098011, 'version': 'Varies with device', 'recentChanges': '- Grab fragment when extracting URLs for selection (#1490).\r\n- Update bootstrap packages.', 'recentChangesHTML': '- Grab fragment when extracting URLs for selection (#1490).<br>- Update bootstrap packages.', 'comments': ['It\'s a terminal! If you need one, this is the one you want. No ads, support for tab completion & up-arrow command history, bash... It even add the all important Esc, Tab, Ctrl, etc to your keyboard so you don\'t have to install a special one. Did I mention no ads? Hilarious tidbit: since I installed Termux, the play store bombards me with every app containing "hacker" in it\'s description. Lol, dudes, I only use it to monitor / update / restart a few machines around the house, it\'s all. Haha.', "Personally, I really like Termux. So far, I put it atop of the list of command shells I've used on all my androids (and I've tried many); it's even more fun since I rooted one of my phones... (and one must install the 'tsu' package, in the usual 'apt' manner, to do the usual as 'root'). Try it, you'll like it.", 'I was trying to install php , nodejs , python etc. The packages is not intended. $ apt install php Reading package lists... Done Building dependency tree... Done E: Unable to locate package php $ apt install python Reading package lists... Done Building dependency tree... Done E: Unable to locate package python $ Please solve this error in next update.', "Awesome Linux Terminal emulator! Ping, Nmap, Python, MetaSploit and another software is very useful! But there is a one ... feature? When I writing code in vim or other software I can't move cursor on line. There aren't any buttons for row in single. It's all.", "Great app that provides anything I could ever ask for in a mobile SSH client. I especially appreciate the multiple keyboard options and the cute logos depending on the os. My only complaint is that the app doesn't recognise a Windows SSH server and likewise doesn't have an icon for it. Other than that though it's perfect.", 'Incredible. So notorious Idk what I can even say about it. Also very easy for anyone to customize it to other Linux CLI distros (Kali, fedora, parrot etc.). If you need to learn Unix based CLI, commands, shells, coding, this is where I would start, but also just as capable for experts. The only thing I can think of as a wish was that I could use it as a full system home launcher as well.', "Great! I didn't think I would find such an amazing emulator on android! Also for those complaining about not having a left/right button, you can just slide the additional banner to the left and type in the full command like you would a sms", "Great terminal - flexible, robust, compatible with many common cross-Linux distributions, including the metasploit exploitation tools, among other non-'root' user package installations that can be performed on a non-rooted device without 'sudo' - get a good virtual keyboard like the hacker's kb. Thanks for a good thing.", "Termux is the best Android terminal, hands down. For me at least, it's an invaluable tool to have in your daily workflow if you are planning to do any real serious coding/developing in a mobile environment. 10 stars (**********) to app/dev, and thank you for your great work :-)", "This app is freaking mind blowing. However, the app from the play store did not automatically download packages. I had to download version 0.94 with packages. The apk file was over 60MB. Wow bitcoin core on Android? Git on android. This app does not emulate linux, it creates an executable environment in data/data/com.termux that utilizes the phone's built-in linux kernal. Wow.", "I have reinstalled this app many times but everytime I can't install Python through on it. Always the error message is, Unable to locate the package Python on drive E:\\. Please fix this issue. I am interested to use the app and know more about it. Thanks", 'Great terminal emulator. Works amazing on non rooted phones (but works even better with rooted phones). I can even get a graphical desktop running. The app makes my phone just like a real linux system and comes with a handy package manager installed.', "I find this extremely useful, especially on a tablet. Granted, I am a programmer and an IT trainer so I probably want to do things on an Android device that many others wouldn't (!) but if you want a shell...", 'A very Amazing terminal emulator available on the Android platform. The one and only con i faced that;if you are using it in a older version of Android 7.0 Nougat you may face some error and usability of packages', "Whys the new update slow. I can't see what i type in real time. I use a note 9. It worked fine in the last version. Can you please look in to it", "Bash commands don't show up while I am typing them or after typed. I have a note 9. I would give it 5 stars but due to the issue I am giving it 2. Please fix. 5 stars will be given after fixed.", 'Very useful, I can connect to my faculty server and use it as a full Linux terminal experience on the go on the phone, no ads, no purchases, just a terminal, recommend a keyboard connected to the phone for best usability', "It's a clean nice shell, that works in the background as well. Really good for basic tasks and very easy to reset if you need to get a version with no installs. Highly recommended", 'I was not able to uninstall Lazy script package.......I started Lazy script, it worked untill ended the secession after that it showed that "python2 ls.py" cannot be opened. I tried to uninstall it still it was not able to uninstall, please do something and update it. I will change my rating once the issue is solved.🤔', 'I Would have given it 5 stars had it not been for the UI, I recommend you add touch gestures for arrows as in Termius App as this provides for more screen space on smaller devices. A floating customizable floating menu for common keyboard shortcuts can also be very handy.', 'Actually great but suddenly I get this error: exec("/data/data/com.termux/files/usr/bin/login"): Permission denied [Process completed (code 1) - press Enter] I haven\'t been on root since this happens I can\'t do anything, can someone help?', 'It\'s really nice to have basic shell functionality without rooting the phone. Weird - Google has a question, "Is the content of the app in English", and there\'s no obvious way to tell them that the question doesn\'t make sense in this context.', 'This app used to work well, now it takes 2-3 days to report on Facebook, but the Facebook ID remains in place. If you can comment, please share a little. No. Facebook ID is not reported and if it is then why that ID is not lost please give the app the ability to work well', "Have to say this is my favourite app of 2020. In terms of streamlining workflow for anyone who administers Linux based production servers through Samsung Dex, it's unrivalled. An absolute powerhouse of an app. Well done dev team, you've made my life much easier.", 'I was looking for a GNU/Linux terminal experience like this for Android OS for a long time. No issues in deploying things and installing new packages, everything as expected. Very impressive work!', 'One of the best app but im having a problem, i was using it on vmos and it was working properly but when i uninstall & try to reinstall it again it doesnt even download while other apps are downloading', "There's no install or any option and even the documentation page is not opening and throwing some error code 1016 dns not found.. I will improve the rating as soon as this fixes..", "to completely close this app i must go to settings apps termux force stop each time. otherwise keeps runing in background after being closed or exit. Update 5/5/20: downgraded to 1 star because the keyboard doesn't directly type to the console, it keeps trying to predict despite you turn off predictive android keyboard, it makes the whole app useless.", "It's literally a perfect terminal app on mobile. Smart thinking on all fronts and clearly created with a shell user in mind. Welllllll done. Love that ability of swiping up and down the console buffer. So smart. Keep up the great work.", 'I would like to give 5 stars but it is not possible to transfer files in my termux to my phone. If this could be solved then I could say this is the best app and one more thing, please make this open source, pls', "It's really very useful app that we can do many task very easily with ubuntu distro. It will be very powerful if it's support otg external HDD (NTFS format) and can establish communication between ubuntu distro and termux. However, thanks for this amazing app...", 'Awesome App. Python works quite well. I have been able to SSH with X forwarding into my server at home. It is like having all the firepower of Bash and Linux in your pocket!!', "Very good app and a great way to practice programming and coding,metasploit,nmap,w3n and many more!!Try it and you won't regret installing it😋", "This would be a great little terminal if it wasn't riddled with bugs. On the s10 input does not appear until I hit the space key a few times. Additional there is quite a bit of lag between hitting return and the command executing", '*Good first impression* I tried this to install Jupyter and IPyParallel to do clustering stuff... Till now I was able to host my Jupyter as local host and able to use notebook... Thanks to the developer I will report further if I find any bugs.', "It all started out well, until I tried cloning git And it kept asking for a password and user name, since then I've not been able to enjoy the app at all, perhaps someone might assist me 🙏🏾🙏🏾", "It's like having a mini debian installation on your phone. A little bit disappointed with the lack of Haskell support. JavaScript, Python and C worked excellently.", 'Working great on my pixel 4. Had some issues in the past with the samsung keyboard, not that I am back to gboard no issues. Use this all the time for mosh connectivity to do work.', 'On (Samsung s20 ultra 5g model) when I type absolutely anything in terminal I cannot see what I type. It only appears for 1 second as soon as I press enter please fix this critical bug 🐛', 'Nothing to complain. Absolutely love it. I manage my website from my phone directly everyday.'], 'appId': 'com.termux', 'url': 'https://play.google.com/store/apps/details?id=com.termux&hl=en&gl=us'}
