{'title': 'Termux:Styling', 'description': "The Termux:Styling add-on provides color schemes and powerline-ready fonts to customize the appearance of the Termux terminal.\r\n\r\nLong-press anywhere on the Termux terminal, select 'MORE...' and then 'Style' to use this add-on.\r\n\r\nWant to suggest a new color scheme or font?\r\nhttps://github.com/termux/termux-styling/issues/new", 'descriptionHTML': 'The Termux:Styling add-on provides color schemes and powerline-ready fonts to customize the appearance of the Termux terminal.<br><br>Long-press anywhere on the Termux terminal, select &#39;MORE...&#39; and then &#39;Style&#39; to use this add-on.<br><br>Want to suggest a new color scheme or font?<br>https://github.com/termux/termux-styling/issues/new', 'summary': 'Customize the appearance of Termux.', 'summaryHTML': 'Customize the appearance of Termux.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.67, 'ratings': 401, 'reviews': 152, 'histogram': [12, 4, 8, 56, 320], 'price': 1.99, 'free': False, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '18M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Fredrik Fornwall', 'developerId': 'Fredrik+Fornwall', 'developerEmail': 'contact@termux.com', 'developerWebsite': 'https://termux.com/', 'developerAddress': 'Fredsborgsgatan 2\n117 59 Stockholm\nSweden', 'privacyPolicy': 'https://termux.com/privacy-policy.html', 'developerInternalID': '4794253573543453457', 'genre': 'Personalization', 'genreId': 'PERSONALIZATION', 'icon': 'https://lh3.googleusercontent.com/pd9T7nl1Ab78hmL4h36iPtiRhVifyu-VhTlvAu3GMTrswr0b9kw5UhDhSr2CRMa4Cc4', 'headerImage': 'https://lh3.googleusercontent.com/fQ6StsaZ7EPQqYZfHXiUuFSX_udrHSE8auUXLv5J2RAACpKpiEnapG_19m7sKAmnfv4', 'screenshots': ['https://lh3.googleusercontent.com/fns10rc005k3f3orbAcirMlquJU-mrFUt_6_gZHM7N0RUke4HPIGCeK_COAyaWYIq-ya', 'https://lh3.googleusercontent.com/gDJt1ji27uDHrX58wwhPhXPGqBu6RFtEMR2b3OThqP-_wVa9gIrYYKXiW9TGY2YQ9xM', 'https://lh3.googleusercontent.com/HBNKtrtcbG7KlIRpNP5t38IVMPHOSPtgf9TVpGbmH4RWrdHQ1IdlLvI-Y3eabeKy7D2D', 'https://lh3.googleusercontent.com/5Vx4vpHW0lzm74Wu-bfBlMdzsogZwfVq__wBCXwSvhYHDR3-bfAjNNPno-TtZAeOdw', 'https://lh3.googleusercontent.com/IqQ77QwCkiuqTHCxdcaQVdnHh0hVeZMh36jrh5WNKlYksH2Kvju4ceHTJj70E3ONMsA'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 30, 2015', 'updated': 1590278980, 'version': '0.28', 'recentChanges': '• Update Fira font file from Nerd Fonts (#77).\r\n• Add Victor Mono font (#82).', 'recentChangesHTML': '• Update Fira font file from Nerd Fonts (#77).<br>• Add Victor Mono font (#82).', 'comments': ['Good, but I would also appreciate if font size could be changed', 'Termux is great, simple and effective.. so im showing my support by buying this add on.', "Plannned to use on my tv box, but because it's easier to purchase from my phone, then I purchase from my phone. But when I want to install it to my tv box, I have to purchase it again. Why is that? Must I repuchase for each device I'm using? update: can be installed, from web.", 'A great app. Like many of others, I bought this just for supporting the developer. ---- Found a tiny issue, with the styled termux, the text cannot be shown in selected area. Because with some styles, the selected backgroud color is close to the text color.', 'I love this Dev. Purchased for the support! PS: Tap a long time anywhere inside your termux window -> more -> style. Saw some people be confused because of that, so sharing this here (:', 'more colorful text style like rainbow on black + white background, also full magnificent & funct on immersive mode? ^^🌈', "I love Termux, it's the best Android emulator ever. Keep it up the great job Devs S2", 'thanks fredrik for making termux - absolutely outstanding - nice way to support development and have some easy fun with styling.', 'Appearance style for termux. Love it very much!', 'I do love this Dev , I bought this just for supporting the dev.', 'I did not read everything so i thought the app dosnot work IT WORK GREAT.!!', 'If you just want to "change font size" try the ordinary method of two-finger expansion on a touch screen. Magnifies. Works for me. This app provides a menu for selecting various light or dark color schemes, foreground and background, for the Termux terminal. See the Termux Github page for instructions how to use. You can also choose font (not size) but that\'s less important.', 'Very easy way to change font and background color for Termux, which is an amazing app in itself.', 'its good to be able to change the font, but I was hoping to be able to set a font size as I am using my tablet with a mouse in samsung dex mode, and I cannot pinch to set the font size. Also in termux in general, when in dex mode the keyboard wont pop up on screen when focus is set to termux', "Support the developer Like many others, I didn't need the styling add-on, but I bought it to support the developer for Termux itself. Nice work.", 'Seems to work just fine. Bought only to support the dev. Great work with Termux. Would love more customisations like prompt config, etc.', 'Cannot install, the play store shows me a non-informative error message every time I try. I really need this for powerline fonts.', 'Lovely add-on to improve the terminal experience on Termux. I personally love that it supports the Inconsolata font.', 'Very useful, as all of the Termux app series. Thank you to the developer !', 'I dont NEED styles, but theyre nice. Basically its a way to support the creator of termux, so thanks!', 'Great terminal app, using on a chromebook - I recommend you get the styling addon - includes the Solarized theme and Anonymous Pro font.', 'Nice way to support Termux development. Although everything can be configured manually.', 'Bought it just to support the developer, awesome work you done on Termux!', 'Great app! Bought styling to support the developer.', 'Same thing goes for this app. Why is is hidden? Not cool.', 'cool font choices but i was hoping for a font size option', 'Good thing to buy just to support the developer of a great tool!', 'Solid and stable, does the job.', 'Works great, thanks! I can finally have my perfect Fira Code and Solarised combo', "Does what it says it does but the main reason I got this app is so I can change the font size and it looks like it can't do that 😔", 'What I really want is to choose the size of the font.', 'Great app, supporting development!', 'nice addon for a great terminal app', "Don't really think that its gonna work", 'A theme for every day of the month!', 'im giving you a 5 Star fredrick. i have seen you in GitHub and know your a great developer . Styling could be a bit altered and i was gonna ask about how you got diffrent colors for certian things like numbers and Varibiles cause on mine they are the same color but i noticed you was running apt tmux inside termux so i might try it when im on again.. But good job still maintaining and adding more colors...', 'Color themes for termux', 'please give me back my money', 'i cant see this app on mobile what will do', 'bought to support'], 'appId': 'com.termux.styling', 'url': 'https://play.google.com/store/apps/details?id=com.termux.styling&hl=en&gl=us'}
