{'title': 'Termux:Widget', 'description': 'The Termux:Widget add-on provides a widget with shortcuts to run scripts placed in the $HOME/.shortcuts/ folder, allowing quick access to frequently used commands without typing.\r\n\r\nNOTE: This is an add-on which requires that the main Termux app is installed to use.', 'descriptionHTML': 'The Termux:Widget add-on provides a widget with shortcuts to run scripts placed in the $HOME/.shortcuts/ folder, allowing quick access to frequently used commands without typing.<br><br>NOTE: This is an add-on which requires that the main Termux app is installed to use.', 'summary': 'Execute Termux scripts from the home screen.', 'summaryHTML': 'Execute Termux scripts from the home screen.', 'installs': '5,000+', 'minInstalls': 5000, 'score': 4.53, 'ratings': 106, 'reviews': 45, 'histogram': [6, 4, 3, 5, 86], 'price': 1.99, 'free': False, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '39k', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Fredrik Fornwall', 'developerId': 'Fredrik+Fornwall', 'developerEmail': 'contact@termux.com', 'developerWebsite': 'https://termux.com/', 'developerAddress': 'Fredsborgsgatan 2\n117 59 Stockholm\nSweden', 'privacyPolicy': 'https://termux.com/privacy-policy.html', 'developerInternalID': '4794253573543453457', 'genre': 'Personalization', 'genreId': 'PERSONALIZATION', 'icon': 'https://lh3.googleusercontent.com/tGRl7zQcY4PgXBhnZOcvBoc369uJBw1ERqiWFkCfEb16vALZOGN8DCr82Gcr7Baut90', 'headerImage': 'https://lh3.googleusercontent.com/meIsX-1YdygfaR5FGGMPNXmMNc6ZsPPJoaOVqEoqpA1NnTuYJNvQaL049h_ZCuxZrw', 'screenshots': ['https://lh3.googleusercontent.com/yvQF2Jdemixl3ThDOcRmJzFS0W7X7vjpdMn1Jwl0-MNpRhew0Fcv0qH6dsKh6RkP5w', 'https://lh3.googleusercontent.com/ezbGuBpOVHxIK4R97KLUB3aijadDrC2f1HRxlLgd32VmbjTuScbO3FSYxkKDR4b3xA', 'https://lh3.googleusercontent.com/rSiKLfvW2yAaD7fK3irsGKEDqSfJbyARfLTP66i-WzTM36b1JX3VY8uRztUT9_Bo-A', 'https://lh3.googleusercontent.com/narddScZ5YHc85GVrxDVwu7F8srRFSjOIkEEAuJIvTGn2l71fUdT2GWF27HYkG0R5Yg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 30, 2015', 'updated': 1564960814, 'version': '0.11', 'recentChanges': '- Use a natural sort order of number, to e.g. get 1,2,10 instead of 1,10,2 (#25).\r\n- Put task notification toast at top of screen to avoid blocking toasts shown from termux-toast #33).', 'recentChangesHTML': '- Use a natural sort order of number, to e.g. get 1,2,10 instead of 1,10,2 (#25).<br>- Put task notification toast at top of screen to avoid blocking toasts shown from termux-toast #33).', 'comments': ["It doesn't install the widget. I created the $HOME/.shortcuts directory and put a script with the proper shebang and set it executable. When I try to add the widget, it isn't in the list of available widgets. It could be because I'm on a Kindle Fire HD 8 (2018/8th gen, not rooted) with side-loaded Google Play Store but I have working widgets for a dozen other apps from Google Play Store so that seems unlikely. Termux itself and the rest of the plugins all seem to work fine including Termux:Boot which runs a boot script just fine.", 'Termux is huge but free, this widget is a tiny missing feature but paid, well done😄. Must have though, very convenient. Thank you.', 'Used to be great. With the recent update, names of shortcuts disappear after some use. They all end up being called "Termux: Widget" which is useless, unless you remember where you positioned each shortcut.', 'Have been using this for several years now on phones and tablets. Very practical. Run a bunch of shell scripts at your finger tips!', "Payed and downloaded, but won't install. Running Android version 9 on a Google pixel 2.", 'Wow Termux is such a huge project thanks for giving us this tool god ! (Even if improvements about packages availability could be improved)', 'This is the dream come true app! Thank you!!! p.s. Would highly appreciate a dark theme.', 'Termux is life. Please make dark theme widget. Thank you very much.', "My bash scriptwon't work with it.", 'i want my refund. i downloaded this app but it is not installed in my phone..😡😡😡😡😡😡😠😡😠😡😠😡', 'Dark theme', "Really love this, use it to run my scripts that control my media servers. One facility I'd like is to be able to suppress the 'script {name} executed' message. We have the 'termux-toast' feature, can output our own message, also 'termux-notify'. Great application all-round, recommended.", 'As a developer that loves his shell, this is fantastic. I can write, edit, and quickly run scripts on the go with a tap... well done.', "Bought it, didn't install with error 505. Can't refund it. Pity, termux \nitself is very useful.", 'Termux = "Simply-Amazing"', 'Just the perfect widget for a superb app!', "Love it. Let's me automate script running.", 'br', 'Best', 'I was expecting that using termux-dialog and termux-toast from API package together with widget would allow me to create useful actions and tiny apps without terminal running in foreground, however, terminal shows up each time I press a shortcut.. EDIT: An option to exit terminal immediately after execution (without pressing enter) would effectively solve this. EDIT: Support for background tasks is simple and works perfectly fine! Thanks Fred! 5/5', "If this app doesn't deserve support, I don't know what does.", 'Well worth the money to contribute to an open source project like this one.', 'Lovely lovely app.', "It's nonobvious that scripts need a weird hashbang path without documentation. Also needs a way to establish that a certain script should run in the background and not bring up an interactive terminal session.", 'Very handy, though it would be good if it closed the termux session after itself without me having to press enter', 'Very useful! Love it', 'Worth the money', 'Was hoping that it has some setting to allow me to run a shortcut in background (without switching to termux); but maybe I was asking too much'], 'appId': 'com.termux.widget', 'url': 'https://play.google.com/store/apps/details?id=com.termux.widget&hl=en&gl=us'}
