{'title': 'Termux:Float', 'description': 'The Termux:Float add-on provides a floating terminal, allowing direct terminal access while running other apps.\r\n\r\nNOTE: This is an add-on which requires that the main Termux app is installed to use.', 'descriptionHTML': 'The Termux:Float add-on provides a floating terminal, allowing direct terminal access while running other apps.<br><br>NOTE: This is an add-on which requires that the main Termux app is installed to use.', 'summary': 'Use Termux in a floating terminal window.', 'summaryHTML': 'Use Termux in a floating terminal window.', 'installs': '1,000+', 'minInstalls': 1000, 'score': 4.33, 'ratings': 123, 'reviews': 62, 'histogram': [7, 4, 11, 15, 83], 'price': 1.99, 'free': False, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '80k', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'Fredrik Fornwall', 'developerId': 'Fredrik+Fornwall', 'developerEmail': 'contact@termux.com', 'developerWebsite': 'https://termux.com/', 'developerAddress': 'Fredsborgsgatan 2\n117 59 Stockholm\nSweden', 'privacyPolicy': 'https://termux.com/privacy-policy.html', 'developerInternalID': '4794253573543453457', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/GojT7ENQ8axOV1PJhcZcMNlSgTD4w_F-N5rkEW_hnZmJbkn8p0A8ncYx-9y1iLlyUq0', 'headerImage': 'https://lh3.googleusercontent.com/rvfRnwtuYRTg9slfRJUM9bJ-5bkHU0VqsJJ7zzdX6lfvK3LjAhBwd8TQUXidflXszDk', 'screenshots': ['https://lh3.googleusercontent.com/ibB2s4O6EdtlxWd-BWLZjTwXBsKJcBiCFZKpH2wd5LjcW8linTDhzSVQV1UT_Fetbg4', 'https://lh3.googleusercontent.com/XNUfyEl711SO2IsP_EKI7eGgTeeeogWBhMSd-gnHaLCl1q27imfH1-f4QzIM9PEYi0M', 'https://lh3.googleusercontent.com/vsGCEnd0OZDA3AzhifqhVul3dmoDUJNHcVOjl0uTDZR4yo1xnySwQpZVQ7sPMX_FCKCu', 'https://lh3.googleusercontent.com/YiZq415z0O-OmP4zBeDIvLoyU47OtAScelyAx1MvuzR78hTqq_BwgBwdxv4V3J7X6-k', 'https://lh3.googleusercontent.com/aO9kdAgqJ8KBZLz_JFMw_zN5p6eZe73xmkEKf9Bc42S_y-OZbIDx1M1g1Hui5WO1Y44'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 30, 2015', 'updated': 1568057289, 'version': '0.13', 'recentChanges': 'Use determined minimal font size instead of hardcoded (#20).', 'recentChangesHTML': 'Use determined minimal font size instead of hardcoded (#20).', 'comments': ["Awesome, great utility. Question - how do I paste into the window? Long hold doesn't work (moves & resizes the window) and Ctrl + Alt + V doesn't do anything, unlike in the normal Termux. Thanks", "Might be good for other devices, but doesn't work well with a Note 8/Tab S4, which have built-in floating windows anyway.", 'Great idea, but no idea how to close it. Exit works but only if you can get to the terminal, hos to close it when a process still has control?', "Not easy to close. The Termux style for font color doesn't work here.", "What's the point if you can't easily copy and paste into the window? Otherwise it's a great idea.", 'Please put options copy and past replace and possible Maximize and Min. float ex:200%, 50% then original', "i bought it to support Termux development ... but it wouldn't resize on my device ... so actually useless ... in any case i don't really need it", 'App wont show window Any suggestions?', 'Useless without ability to paste...', 'its very large window. how to config.', 'Works amazingly well!', 'Awww yisss so much CLI in my face all the time i love it!', "You get a terminal that you can move my tapping and holding for a moment, then dragging, and resive it by doing the same but pinching instead. You can hide it by pressing the notification in your notifications screen, and close it with the 'exit' command.  It works perfectly, I haven't had a single problem and it's very nice having a terminal with me wherever. Awesome app.  Even though the one from F-Droid didn't seem to work, I would still recommend this instead to support he developer for making this great app.", 'Awesome. How about ability to run more sessions in other floating windows. \n(Yeah! baby!)', 'Not entirely sure how to close termuxfloat.', 'Good.', 'Great idea but managing the floating window is clunky. I suggest the dev to take a look at hovernote in the play store - it implements the same idea in a more user-friendly way.', 'It works - on xiaomi have to activate the pop up  in other permission and working.. maybe next update can setting opacity and more smoother.. thx u Dvlpr', 'Termux styling isn\'t carrying over to "Float", I\'m not sure if its just my phone model, but it used to work before on my last phone.', "Is there a way to enable powerline font support as in the main app (with termux:styling)? Other than that, it's perfect!", 'good and coo developer. many thanks', 'Awsome', "I love that it's a fully functional floating terminal, and it inherits your termux settings, but it doesn't respond to the built in Android buttons, letting you drop the keyboard on back or home. otherwise I completely love it. it would also be nice if it would have some options to hide it other than the notification, and if it would open again from being relaunched. Termux:Float seems to not have a way to use the menu like Termux does, which makes it hard to use the clipboard", "Handy utility, draws over other apps providing dual window support. Responsive, easy to adjust, effective. Clipboard support would be a bonus, however, being that most or all touch events for the float have been determined, the addition of C/P probably isn't feasible. Thanks to the Developer & Termux Community for ongoing support.", 'This app is exactly what I was looking for, and a perfect addition to Termux. I am happy to contribute back to the developer for the great work!  The "toast\' instructions that pop up when you start the app were a bit unclear, however. To resize the window, long press, and then when the "Drag to position..." pops up and *while keeping your finger pressing*, use a second finger to change the window size. Similarly for font resize. Double tap, and on the second tap, keep your finger against the screen and then swipe up or down to change font size smaller or larger.', "Awesome for monitoring top while using an app, running quick commands, etc. The transparency is awesome. I do wish there was a way to launch it quickly - currently I've added it as a lockscreen shortcut so I can get it by double pressing power, tapping, and then touching the fingerprint scanner to unlock, but I wish there was a simpler way. I also keep adjusting volume when I don't want to, by exiting this with ctrl-D, where volume down is ctrl. Price is a bit high for an addon, but Termux itself is free and excellent, and the dev deserves a few bucks.", "This could be so much more useful and unobtrusive if there was an option to minimize it to a small facebook-chat-like bubble, it works and I like it, but it's a bit weird to have it around along with the on-screen-keyboard and other content at the same time...", 'Neither move nor resize works with tablet + mouse. Dear developers, some of us have progressed into the tablet age for some time now.', 'also I would love this to support multiwindow, but also the forementioned or better explaination of how.', 'App fails to install with error -505 on an HTC a9 (termux is currently installed and working)', "Termux and all it's related apps/tools are super useful ! One question: is it possible to have the Float be configurable so that it can also sit at desktop level and not on float of the other apps' windows ? In essence like a widget ?", 'Extremely useful having a terminal available at any time', 'I wish it can support split screen in the future release. Than it will be perfect', 'Would be good to have multiple sessions.', 'Nice to finally have a working float term.', 'Worth a couple $ to be able to use on top!', 'purchasing to support termux', 'Amazing app. Love it.', 'Love it.', 'Also, a nice way to be able to donate to the developer'], 'appId': 'com.termux.window', 'url': 'https://play.google.com/store/apps/details?id=com.termux.window&hl=en&gl=us'}
