{'title': 'LTE Cleaner', 'description': "Tired of the abundance of phone cleaners on the play store? Tired of them being extremely shady? Tired of them doing nothing? Tired of ads? Tired of having to pay? Me too.\r\n\r\nThere simply is way too many apps out there that claim to speed up you device. In reality, they don't do anything. LTE Cleaner only aims to clean your phone by removing safe to delete files. Which not only frees up a lot of space, But it also can improve your privacy. Since LTE Cleaners removes .log files, which well, log what you do.\r\n\r\nLTE Cleaner is %100 free, open source, ad free, and deletes everything it claims too.\r\n\r\nCleans:\r\n- Empty folders\r\n- Logs\r\n- Temporary files\r\n- Caches\r\n- Advertisement folders\r\n\r\nComing major features:\r\n- daily cleans\r\n- clean SD card\r\n- SAF file browser\r\n- optional default whitelist\r\n\r\nGitHub link: https://github.com/TheRedSpy15/LTECleanerFOSS", 'descriptionHTML': 'Tired of the abundance of phone cleaners on the play store? Tired of them being extremely shady? Tired of them doing nothing? Tired of ads? Tired of having to pay? Me too.<br><br>There simply is way too many apps out there that claim to speed up you device. In reality, they don&#39;t do anything. LTE Cleaner only aims to clean your phone by removing safe to delete files. Which not only frees up a lot of space, But it also can improve your privacy. Since LTE Cleaners removes .log files, which well, log what you do.<br><br>LTE Cleaner is %100 free, open source, ad free, and deletes everything it claims too.<br><br>Cleans:<br>- Empty folders<br>- Logs<br>- Temporary files<br>- Caches<br>- Advertisement folders<br><br>Coming major features:<br>- daily cleans<br>- clean SD card<br>- SAF file browser<br>- optional default whitelist<br><br>GitHub link: https://github.com/TheRedSpy15/LTECleanerFOSS', 'summary': 'A completely free, ad free and open source phone cleaner!', 'summaryHTML': 'A completely free, ad free and open source phone cleaner!', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.53, 'ratings': 249, 'reviews': 133, 'histogram': [14, 7, 7, 19, 199], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.5M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'TheRedSpy15', 'developerId': 'TheRedSpy15', 'developerEmail': 'hjadar15@gmail.com', 'developerWebsite': 'http://theredspy15.github.io', 'developerAddress': '2511 sw 11th ave', 'privacyPolicy': 'https://cdn.rawgit.com/TheRedSpy15/LTECleanerFOSS/d9522c76/privacy_policy.html', 'developerInternalID': '6754875610399368518', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/u6-bbdKEu-sXGsgLu__vjjYzhWbuu7c4CSYuDhgsZuCTau2ypQpaAQnk02Awz0mJaYEK', 'headerImage': 'https://lh3.googleusercontent.com/jWWMwkT_-XyjgMsLnmmOdKZaCRwfek99o5aaGy5Ozz6u5yxio_f_NaRjlTryegK78z0', 'screenshots': ['https://lh3.googleusercontent.com/2AteiESRZCPG1LjTOjtmE4ykuqdt46OQhnqSsYkXHwIL6th1Zpxr_aEI6_K9eiAtQWQ', 'https://lh3.googleusercontent.com/j0ZIoAedaAtCrw5W_MtyHTeQPypHHZAhpXqKZ1m-9DVgjLWwlb2IJoL7_CWnMIqgu-I', 'https://lh3.googleusercontent.com/lRLSBkbJvlekBNDIXLrV3oBYaenbfyZEjD0kj4NEymsa-ouMnZ3pZXJnLq5krIG53N4', 'https://lh3.googleusercontent.com/1YgIzeukuYmjW3ckM3kxTmStV-HRDWx4CEe75vSP7dvvmIySciPikaQVtKr95Q-qAw', 'https://lh3.googleusercontent.com/0qItI7pLf2V1Vsu5PcL2nITRJ2xa4zVA2nFjuJg6tTT_1gV9wYXxxQA9YNQHboM4Qxc4', 'https://lh3.googleusercontent.com/Ky4DtvVVih70BADCp7R1yUSFlvHmrOe3nkRPBoYn_gLqF46StYLo9PINHAhPNWe0VtM', 'https://lh3.googleusercontent.com/fEOGo79lmE65jPuD9K5-jKeYGnnVnl0YqHwrCtq0l3yNAwm2Go3H1AcPmLEOvE-E6A', 'https://lh3.googleusercontent.com/LcnG8ecFAcIxP4NQQd1z85vDa5Vc6k0Mqcmv6E8AZzfngk-C7eVkTayPFGzCO_SAIg', 'https://lh3.googleusercontent.com/dvDg7cJqM-2-HYQi7qn_Wvi6bVMEG2egQ0Nfo9_D7L1pbJ7XsDa1ADdHauPLnhIhTTs', 'https://lh3.googleusercontent.com/hRCd2lDIkOG0KZQTm_16jzad3ygYTVL4nVCrCXijQsjhBz8rTIRB8WpAj2fK-5auywI', 'https://lh3.googleusercontent.com/A1vbWNb393u1PAPIiysWfkuUZ0j6Fflv5PrYAIuS9vbaJolvJw1RzWPoKwrl6PRolg8O'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 19, 2018', 'updated': 1582518756, 'version': '4.1.0', 'recentChanges': 'No new features, just a lot of refactoring and fixing:  \r\n- Fixed display issues  \r\n- Updated Libraries  \r\n- Updated settings   \r\n- Fixed crash related issues  \r\n- Major code refactoring  \r\n- Better permission handling  \r\n- Better translations', 'recentChangesHTML': 'No new features, just a lot of refactoring and fixing:  <br>- Fixed display issues  <br>- Updated Libraries  <br>- Updated settings   <br>- Fixed crash related issues  <br>- Major code refactoring  <br>- Better permission handling  <br>- Better translations', 'comments': ["I don't come across many apps that actually work or do what they say but this one is an exception, it does all and more! I want to thank you for your hard work and time and hope you continue to update this app and not abandon it.", "Had another cleaner with ads always showed I had megabytes to clean the thing cleaners with ads don't tell you is the ads that come with the cleaner is what's junking up your phone this app is honest and straight forward and does what it claims and I like that it does great on my LTE phone this is a good app", "This app is really great. I'd like to make a suggestion. Please enhance the UI a little bit. Thanks. Like LIGHT theme.", 'No ads, seems to work well, just a simple cleaner, no gimmicks.', 'Very speedy and light gets the job done very well done sir I would like to know of the upcomming updates and features you want to improve as i am loving this app its the best so far and i tried hundreds highly reccomended', "Great app it's working well and no ads that junk up your phone with preloaded ads awesome keep it free and please don't junk it up k great job", 'Simple and to the point. More importantly No Ads.', 'Weighs in at: 4mb and is lightning fast! No ads and ONLY requests permissions for storage access (reasonable and logical).', "Excellent application I've had this for a little while now and it works great thank you so much", 'best app for cleaning you phone this app knocks spots off the big boys I can recommend this app keep up the good work team', "Thanks for this app. IMHO most features i seen and is open source :) It needs improvement thou for me to give 5 stars. Like 1) I need to know for sure what it is going to delete before hitting Clean (a preview clean button). 2.) An un-due Option. If I was going to develope this i move everything to a junk folder and 7 zip it up. 3.) I need to be able to edit the white list without delete the whole thing. I am jumping the gun a bit on the review since I didn't use the clean button (because #1)", 'Samsung Galaxy S8, Oreo 8.0.0 - This cleaning app works great!  The app is simple to use, works great, and no ads.  Thanks to the developer for a simple to use app that works very well.  **UPDATE June 18, 2019** Samsung Galaxy S8, Pie 9.0.0 -  This app just keeps getting better and better.  This app now has a new interface and still works fantastic.  Thanks again for sharing this wonderful app.', 'Kind developer, I can\'t believe how simple and awesome this app is. My only recommendation is that you add a "beautiful mode", where instead of locations and files, the app will show storage saved (in KB / MB) and number of empty folders deleted. Long-live Open source!', "Not bad would like more options regarding which areas of the device you want to clean. Don't really like the dark theme with green text look very 80s (reminds of the early Amstrad DOS days). As for a free app with no ads thats great we need to see more ad free apps built.", "Fantastic! Thank you so much for using your time making this! I literally have 0 money right now and it's very helpful! Works as it's supposed to with no issues. It's a huge time saver!", "For some reason, it's not work on Sony XperiaZ4. Had uninstalled.", 'Awesome cleaner app :) very useful, thank you for developing LTE Cleaner. Highly recommended. Can you please add an option to auto run the cleaner in minutes and hours? That would be great. Thanks in advance.', 'Free! Even a + 70 year-old can download and use this!! It really makes a difference! Make sure to use all the items on the settings!!', "So far, so good! Made it a part of my phone's home screen. Does what it says, all with the press off a button. Keep up the great work!", 'Does exactly what it says on the tin! Very simple and does not contain bullcrap or ads. A piece of software built for humans.', 'Awesome app. Would be great if you can add categories of item too.', 'Really needs a file/folder browser for exclusions!', 'Needs work. Does not display properly.', 'Awesome great platform', 'simple to download, simple to use and so effective!', "Update is awesome let's keep it and optimize it", "Buttons don't do anything (Samsung, Lollipop).", 'Amazing app that has been my most used one on my phone!', 'Adding app cach clear make this app great', 'Minimal, and efficient', 'Good SD card cleaner', "It's great awesome cleaner.", 'has no option to clean cache on my phone...', 'So far so good!', 'the only one useful cleaner', 'Have full network access privecy risk for this one star remove.', 'Good app', 'Excellent app', 'Great application', 'Best'], 'appId': 'theredspy15.ltecleanerfoss', 'url': 'https://play.google.com/store/apps/details?id=theredspy15.ltecleanerfoss&hl=en&gl=us'}
