{'title': 'Nori', 'description': "Nori allows you to connect to various photo hosting services and browse images by tags.\r\n\r\nLink your personal Flickr account, or search for images and GIFs on any of the other websites that Nori is compatible with.\r\n\r\nDownload any image to your device's storage, or set it as your new wallpaper.\r\n\r\nShare images with friends via your favourite messaging app.\r\n\r\n(Support for more sites is coming soon)", 'descriptionHTML': 'Nori allows you to connect to various photo hosting services and browse images by tags.<br><br>Link your personal Flickr account, or search for images and GIFs on any of the other websites that Nori is compatible with.<br><br>Download any image to your device&#39;s storage, or set it as your new wallpaper.<br><br>Share images with friends via your favourite messaging app.<br><br>(Support for more sites is coming soon)', 'summary': 'A search engine for tag-based photo hosting services.', 'summaryHTML': 'A search engine for tag-based photo hosting services.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.36, 'ratings': 122, 'reviews': 57, 'histogram': [6, 4, 8, 21, 80], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '1.7M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'tjg1', 'developerId': 'tjg1', 'developerEmail': 'tomg@fastmail.uk', 'developerWebsite': None, 'developerAddress': 'Appflame\n95 Pentre Jane Morgan\nCeredigion\nABERYSTWYTH\nSY23 3TG\nUnited Kingdom', 'privacyPolicy': None, 'developerInternalID': '7710817621262243765', 'genre': 'Photography', 'genreId': 'PHOTOGRAPHY', 'icon': 'https://lh3.googleusercontent.com/wldFHc1B8OfIzBXQrNJKKoxl-YZGOPYO8tw-cPcPpkkHPPciOwXSNCiwXLFJaiP_Ug', 'headerImage': 'https://lh3.googleusercontent.com/nWb1MNPInprO5gdgXM2a_7SS8t0fHHFSY2mVwA4qA3exei_OT8z35cefl5TPGsXGCw', 'screenshots': ['https://lh3.googleusercontent.com/t6nEBtnlQjak20zryPwwqnqJWpz5-dnu8HTuzebRjLGr7ThOujnTfQ8pvVGE3kat_mET', 'https://lh3.googleusercontent.com/-t5Vu8xGRJ5k_qY50elH0eQG7RRUvMzyrwdKT6h8K6i1l6U4jO68JLkodvCWIEXSgQ', 'https://lh3.googleusercontent.com/4OJXGSvirY8csfk8NTdOcfu4WdvOqrEcYHuwD_sVKhLBO9DuZJnGe5R8_wYqjzpJDPM', 'https://lh3.googleusercontent.com/J3ZCPiMl-0mymVUBrfcOB9oqN0Ax5vQLkyfIgFtDLEDPQncEEx2lRIyU57NAHUryd8SC'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Aug 18, 2016', 'updated': 1563875614, 'version': '2019.08', 'recentChanges': '- Disable the donation prompt\r\n- French translation\r\n- Italian translation\r\n- Portuguese translation\r\n- Fix disabling bandwidth-saver mode sometimes fetching low-res images.', 'recentChangesHTML': '- Disable the donation prompt<br>- French translation<br>- Italian translation<br>- Portuguese translation<br>- Fix disabling bandwidth-saver mode sometimes fetching low-res images.', 'comments': ["Pretty basic. Can't change save path, constant download notifications, no dark mode, save button at the top rather than the bottom, as well as a plethora of features that would be nice to have. Not a bad app.", "OK but no WebM controls (total time, seek bar, rewind, fast forward, etc), and current search term(s) don't show. If a WebM can't play, the error message won't go away and must kill task.", 'Great app but I have some suggestions. I wish there was a way to edit your search after looking something up. When looking at tags it would be great if you could long press a tag bringing up a menu asking if you want blacklist or favorite a tag. Also some websites have special tags for the artist, character, parody, and rating. Wondering if these could get a color code to help distinguish between normal tags', "Works well usually, but very recently has stopped working with certain sites. I don't think this the the fault of the app dev and is instead just it not being updated in a while.", 'Solid app, but would definitely benefit from features such as saving searches and search terms for faster searches, and a dark mode for late night viewing.', "Great app, it has its issues but far and few between. can display all kinds of booru content and with the right steps can view age restricted content, all within the vanilla app keeping in play store guidelines. used it for years, and lurking once in a while, nothing so far has topped it. 9/10 best booru browsing app I can recommend without needing to fudge with each booru sites' layout and backend. Protip: when adding a booru site to scrub through, remember if the url is http or https.", "Beautiful app. Just wondering how exactly would I find the service URL for a danbooru style service? I've googled and come up with nothing. Thanks", 'Does the job right, wish it had an easy way to refresh instead of closing out of the app.', 'A competitor to BooruNav, but got less features and parameters to tweak with. However, when it comes to app naming, I feel the dev of this app does know the thing.', 'it is an awesome viewer for any image database, including 621 and other booru sites', 'want to download source file rather than sample file.....', 'download shereens Flickr app, its marginally better .', 'Does what it should', 'Great app, works nice. It would be nice to have a way to set custom save \nfolder.', 'need update, not working', 'not working.', 'love it', 'Works well. However I feel like there should be a way to save pictures to a favourites folder, so its a list of urls that show the image like usual in the app, but not require you to download all the images you want to save', 'Suggestion: have a way to use your browser and have the app auto-detect a \nwebsite you can use. I think it would be the easiest way to make this app \nwork for the developers and the users.', 'the message "Nori quit unexpectedly" is flashing in my phone repeatedly whenever the app crashed', 'Pretty good image viewer with lots of neat features, would be way better if you added a slide show with a timer option!', 'Entering too many tags while browsing e621 causes a exception', 'You can browse e621 like a pro', 'The best app to browse danbooru-style boards ever!!', 'Purposefully censored.', "Download button is hidden in a sub menu? Why? Put it up front! Webm videos don't have a pause or seek bar. Why??? Why won't it let me watch webm on my old phone yet chrome does? Got something against jellybean users? I'll change the rating if you fix these.", "I miss the heart feature that another app has, but otherwise it's a pretty great app.", 'Works great on almost all booru sites!', 'Awesome', 'Not bad how do i add other image hosting sites though under URL', "I like viewing booru type sites on my phone. There have been several ways to do this that have came and went. Hopefully this one stays becsause it's the best one yet.", "I use this to browse image tagging sites like e621 and it's great!", 'Best image viewer app on the PLANET. It does EXACTLY what it says it does, and I love it. I would, and will definitely recommend this app to people. Thank you for this awesome app. 😀👍', 'Lovely, hate to manually go to each site and have browser tabs eating memory. Keep up the good work and begging for a dark theme.', "App's pretty good, but it seems to misfuncion with e621, as puttin in more than 1 tag causes the app to give an error message. Would love to see a fix :P"], 'appId': 'io.github.tjg1.nori', 'url': 'https://play.google.com/store/apps/details?id=io.github.tjg1.nori&hl=en&gl=us'}
