{'title': '10,000 sentences', 'description': '10,000 sentences is an app that will help you learn new words in your target languages.\r\n\r\nYou will be presented with a series of sentences where you need to guess the order of words. If your guess is correct, the app will find a new (and slightly more complex) sentence.\r\n\r\nThe application currently has 24 languages (see below for the list). Each language is available in two "directions". For example "French for English speakers" and "English for French  speakers". More languages will be added in future.\r\n\r\nIf you want to check the translations for words, make sure you have Google Translate installed. \r\n\r\nThe application uses "text-to-speach" (TTS), but not all languages are available on all Android phones. Some languages have also commercial TTS engines available on Google Play.\r\n\r\nAs you progress with new sentences, you can create "annotations" on words you don\'t know. Annotations can be anything, but the best usage is to use them to create your own dictionary. More than one word can have the same annotation (so, for example, one verb in different tenses will have one translation/annotation). \r\n\r\nThe application is free and open source. All the sentences are taken from the Tatoeba dataset (licensed under CC-BY 2.0).\r\n\r\nThe source is available here: https://github.com/tkrajina/10000sentences\r\n\r\nList of languages:\r\n\r\nCzech (for English speakers): 9268 sentences\r\nEnglish (for Czech speakers): 8126 sentences\r\nBulgarian (for English speakers): 12000 sentences\r\nEnglish (for Bulgarian speakers): 12000 sentences\r\nSerbian (for English speakers): 9634 sentences\r\nEnglish (for Serbian speakers): 6911 sentences\r\nDanish (for English speakers): 12000 sentences\r\nEnglish (for Danish speakers): 12000 sentences\r\nSwedish (for English speakers): 12000 sentences\r\nEnglish (for Swedish speakers): 12000 sentences\r\nUkrainian (for English speakers): 12000 sentences\r\nEnglish (for Ukrainian speakers): 12000 sentences\r\nDutch (for English speakers): 12000 sentences\r\nEnglish (for Dutch speakers): 12000 sentences\r\nFinnish (for English speakers): 12000 sentences\r\nEnglish (for Finnish speakers): 12000 sentences\r\nMacedonian (for English speakers): 12000 sentences\r\nEnglish (for Macedonian speakers): 12000 sentences\r\nHungarian (for English speakers): 12000 sentences\r\nEnglish (for Hungarian speakers): 12000 sentences\r\nPolish (for English speakers): 12000 sentences\r\nEnglish (for Polish speakers): 12000 sentences\r\nItalian (for English speakers): 12000 sentences\r\nEnglish (for Italian speakers): 12000 sentences\r\nEsperanto (for English speakers): 12000 sentences\r\nEnglish (for Esperanto speakers): 12000 sentences\r\nLatin (for English speakers): 12000 sentences\r\nEnglish (for Latin speakers): 11727 sentences\r\nTurkish (for English speakers): 12000 sentences\r\nEnglish (for Turkish speakers): 12000 sentences\r\nGreek (modern) (for English speakers): 12000 sentences\r\nEnglish (for Greek (modern) speakers): 12000 sentences\r\nRomanian (for English speakers): 8164 sentences\r\nEnglish (for Romanian speakers): 8186 sentences\r\nArabic (for English speakers): 12000 sentences\r\nEnglish (for Arabic speakers): 12000 sentences\r\nHebrew (modern) (for English speakers): 12000 sentences\r\nEnglish (for Hebrew (modern) speakers): 12000 sentences\r\nGerman (for English speakers): 12000 sentences\r\nEnglish (for German speakers): 12000 sentences\r\nFrench (for English speakers): 12000 sentences\r\nEnglish (for French speakers): 12000 sentences\r\nRussian (for English speakers): 12000 sentences\r\nEnglish (for Russian speakers): 12000 sentences\r\nPortuguese (for English speakers): 12000 sentences\r\nEnglish (for Portuguese speakers): 12000 sentences\r\nSpanish (for English speakers): 12000 sentences\r\nEnglish (for Spanish speakers): 12000 sentences', 'descriptionHTML': '10,000 sentences is an app that will help you learn new words in your target languages.<br><br>You will be presented with a series of sentences where you need to guess the order of words. If your guess is correct, the app will find a new (and slightly more complex) sentence.<br><br>The application currently has 24 languages (see below for the list). Each language is available in two &quot;directions&quot;. For example &quot;French for English speakers&quot; and &quot;English for French  speakers&quot;. More languages will be added in future.<br><br>If you want to check the translations for words, make sure you have Google Translate installed. <br><br>The application uses &quot;text-to-speach&quot; (TTS), but not all languages are available on all Android phones. Some languages have also commercial TTS engines available on Google Play.<br><br>As you progress with new sentences, you can create &quot;annotations&quot; on words you don&#39;t know. Annotations can be anything, but the best usage is to use them to create your own dictionary. More than one word can have the same annotation (so, for example, one verb in different tenses will have one translation/annotation). <br><br>The application is free and open source. All the sentences are taken from the Tatoeba dataset (licensed under CC-BY 2.0).<br><br>The source is available here: https://github.com/tkrajina/10000sentences<br><br>List of languages:<br><br>Czech (for English speakers): 9268 sentences<br>English (for Czech speakers): 8126 sentences<br>Bulgarian (for English speakers): 12000 sentences<br>English (for Bulgarian speakers): 12000 sentences<br>Serbian (for English speakers): 9634 sentences<br>English (for Serbian speakers): 6911 sentences<br>Danish (for English speakers): 12000 sentences<br>English (for Danish speakers): 12000 sentences<br>Swedish (for English speakers): 12000 sentences<br>English (for Swedish speakers): 12000 sentences<br>Ukrainian (for English speakers): 12000 sentences<br>English (for Ukrainian speakers): 12000 sentences<br>Dutch (for English speakers): 12000 sentences<br>English (for Dutch speakers): 12000 sentences<br>Finnish (for English speakers): 12000 sentences<br>English (for Finnish speakers): 12000 sentences<br>Macedonian (for English speakers): 12000 sentences<br>English (for Macedonian speakers): 12000 sentences<br>Hungarian (for English speakers): 12000 sentences<br>English (for Hungarian speakers): 12000 sentences<br>Polish (for English speakers): 12000 sentences<br>English (for Polish speakers): 12000 sentences<br>Italian (for English speakers): 12000 sentences<br>English (for Italian speakers): 12000 sentences<br>Esperanto (for English speakers): 12000 sentences<br>English (for Esperanto speakers): 12000 sentences<br>Latin (for English speakers): 12000 sentences<br>English (for Latin speakers): 11727 sentences<br>Turkish (for English speakers): 12000 sentences<br>English (for Turkish speakers): 12000 sentences<br>Greek (modern) (for English speakers): 12000 sentences<br>English (for Greek (modern) speakers): 12000 sentences<br>Romanian (for English speakers): 8164 sentences<br>English (for Romanian speakers): 8186 sentences<br>Arabic (for English speakers): 12000 sentences<br>English (for Arabic speakers): 12000 sentences<br>Hebrew (modern) (for English speakers): 12000 sentences<br>English (for Hebrew (modern) speakers): 12000 sentences<br>German (for English speakers): 12000 sentences<br>English (for German speakers): 12000 sentences<br>French (for English speakers): 12000 sentences<br>English (for French speakers): 12000 sentences<br>Russian (for English speakers): 12000 sentences<br>English (for Russian speakers): 12000 sentences<br>Portuguese (for English speakers): 12000 sentences<br>English (for Portuguese speakers): 12000 sentences<br>Spanish (for English speakers): 12000 sentences<br>English (for Spanish speakers): 12000 sentences', 'summary': '10,000 sentences will help you learn new words in languages you are learning.', 'summaryHTML': '10,000 sentences will help you learn new words in languages you are learning.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.34, 'ratings': 195, 'reviews': 109, 'histogram': [13, 5, 19, 17, 138], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.8M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'SCIO', 'developerId': 'SCIO', 'developerEmail': 'tkrajina@gmail.com', 'developerWebsite': 'http://github.com/tkrajina/10000sentences', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '6669443784116896188', 'genre': 'Education', 'genreId': 'EDUCATION', 'icon': 'https://lh3.googleusercontent.com/kTNeAy3wSQcF4E3DyCGkdT2XfgrpbGsGqSkirpTGpyT0xF5qH28eIAI4WojPkzko93Ya', 'headerImage': 'https://lh3.googleusercontent.com/iDwKjDIRuudCgadj5vNO7K7sMFJUzwYrIkrmznPx5ptXcLmVj1kBLDbDOh6VG-CLDQc', 'screenshots': ['https://lh3.googleusercontent.com/_meKQQ4aJXq_0p5ZjNFyGcVwiPfDIlcrgXkyHg8RSO2tG--6hTVLiAJwfxdw4q120w', 'https://lh3.googleusercontent.com/opVHRP134qlj1CzojorQKYpI68jBEOogohPEurexgts6vVwoYi0UcPnxcmRmJvhWkr8', 'https://lh3.googleusercontent.com/FVDEoUbSMsv_Hsl41waMMcNyYXX1cyeQddzJjYeotv8j2SEB78bJK8yWOAnwKUZI860', 'https://lh3.googleusercontent.com/O2Rdcsu0dL7KloTkB2z18KxIJgOTAx3sFeHszpMRkgl0L6TddVeKkW0ZPXA3bN4Fc_E-', 'https://lh3.googleusercontent.com/fRSOhqqir8jMG-My15SHmbe9V-r4eW1yG8X76uuWqMrsdOnp5oGYoI7hFCKrC5Z4_A', 'https://lh3.googleusercontent.com/QWNEfNdiYNlGQWrPSxW4yN49JN058LYubWKZjfsidk43NHUS-MjnZ67txQef_MOPqQ', 'https://lh3.googleusercontent.com/VFASFoGnZhH4Gtqen89-P7P_bq5TgEQOHmoTUz-YdtDT9aMZFSRhRjUHYbbop8v1W8bk', 'https://lh3.googleusercontent.com/O2pgCB6tpYV6cyWJqz69A0P4FuCCz9qN5nOpSe-HYCavFE6sCVVncatWmXeqH1d7BbfY'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 18, 2016', 'updated': 1567926080, 'version': '0.3.4', 'recentChanges': 'Removed google analytics tracking and custom Google service dependencies', 'recentChangesHTML': 'Removed google analytics tracking and custom Google service dependencies', 'comments': ["It's a good idea, but the real process of entering words feels depressingly slow. I would prefer choosing words from a single set for each sentence rather than one word from a different set. Also, the audio, both for individual words or for the entire sentence sounds too slow.", "The basic style is okay (and likely pretty good for rank beginners), but don't trust the pronunciation at ALL! It's just using text-to-speech from your phone, and holy cow did that screw up Esperanto (and if it screws up Esperanto, which has clear and consistent rules, I can't trust it for Estonian or Albanian, etc.). If you use this for anything but the top handful of languages (which I assume TTS can better mimic), mute it! (If it got decent recorded speech, I'd rate it 4-5 stars.)", 'Highly recommended. No need for internet access after download of a language. Fast and no nonsense.', "A good number of available languages and a even better number of sentences, 10000 per language. To tell a long story short, this app is incredible. I don't think I'm uninstalling it any time soon. Keep up the good work guys, you're doing great😍😘👑", 'Lot and lots of sentences... Great app.', 'The app was OK but the font of the choices seems to need calibration. Also, the "read the sentence" function wasnt working.', 'I have a request, could you guys add Japanese with English translation and Japanese pronunciation. I would be so happy. Thanks.', 'fantastic! ...but needs ability to save progress. if you have root use titanium backup to backup the data', 'Disappointing. This is supposed to be for people who are learning. Yet, for words you\'ve never learned or even seen before...ONE mistake is unacceptable. "Too many mistakes". This is not a good way to teach people. Learners cannot guess every single word in another language on the first attempt. We\'d all be multilingual if that were the case.', "Would you consider do add a Japanese language? It'll be very helpful.", 'Im so mad. My student called. In ENGLISH you dont conjugate or have fem/mas. I feel so bad that pwople are rating this have no clue HOW WRONG. we CONJUGATE every word CHANGES AS its NOT A SEPERATE WORD LIKE English so he took every word and added them together! So everything is wrong. HUGE LIKE HE CANT TELL THE DOFFWRENCE BETWEEN I YOU SHE HE BECAUSE HE ASSUMED IF THE WORD ON THE LIST SAYS SING IT MEANS SING. IT DOENST! IT MEANS YOU SING HE SING WE SING IN EVERY WORD AND ADJECTIVES CHANGE!!!!', 'I like your app but kindly request please add Urdu Pakistan language', 'Can you add Tagalog - English?', 'it was ok... except for one sentace, which caused me to just stop using it and I shal delete it - "woe to infedels" - this is not appropriate amd also that\'s nit the meaning of kaafir. that\'s an immoral way to behave.', 'short and simple . does what it promised', 'It was veryyy good', 'This is absolutely the best for sentence mining', 'Great app', 'amazing!', "great idea, but sadly there's no english for chinese", 'The app is great but would you please add audio in the app that will be \nhelpful if you do many thanks.', 'Love this app, hoping for more languages', "Brilliant app – the only one I have found on Android making use of Tatoeba like this!! Would easily be 5 stars if the sentence search were improved, so that it would search for sentences with all terms given. (eg: searching 'great app' would only show results with both 'great' and 'app' within the sentence) Many, many thanks and I look forward to this update! ;)", "It's so simple but at the same time so brilliant, this app is freaking amazing, thanks a lot!", 'This is by far the best language learning app I have ever seen. I have reviewed dozens of apps and websites for learning a language, and as a teacher I have tried many different methods. This app is unrivaled in its combination of simplicity and efficiency. Thank you so much for creating it.', "I really love the app, but I'm having the problem that when I try to add new collections it crashes. I had three installed, deleted one, and now I can't add a third. Great except for this problem.", 'it would be so nice if text is editable or provided with audio files or sentences serialized by numbers so I would be easy to go back to any sentence', "At Nexus 7 font is too small and buttons aren't big either and easily misclicked.", 'Please add Greek text to speech.', 'EXCELLENT! SUCH A MASTERPIECE TO LEARN!', 'Nice app 👍', 'Amazing', 'If you add "mark as ignore"  to main screen it will be very good. And the size of button is small . you need to resize it and remove shadow from them.', 'The option of urdu is not there... Make it vast some.', 'Can u add the urdu language?', 'Virus detected by Huawei security scan', 'Great app but please add Japanese!!!', 'So small buttons. "Correct" should be green.', 'need bangla language', "One of my favourite language-learning apps along with Duolingo, French Verb Master, Clozemaster, Quizlet and Lingvist.  How can I import new language pairs? I had a look at the GitHub page but couldn't find any instructions. I would like French-Spanish (i.e. for a Spaniard learning French)."], 'appId': 'info.puzz.a10000sentences', 'url': 'https://play.google.com/store/apps/details?id=info.puzz.a10000sentences&hl=en&gl=us'}
