{'title': 'Simple Search', 'description': 'This is a very basic app. Designed for people who wants to use a search widget with their preferred search engine.\r\n\r\nThis app contains a search bar to type in a search query, which will be opened in the Internet browser. A widget for the home screen will simply start the app.\r\n\r\nYou can change the search engine in the settings (Default is DuckDuckGo) or type in a custom search string. The app also saves the search queries as a history.\r\n\r\nSource code: https://github.com/TobiasBielefeld/Simple-Search', 'descriptionHTML': 'This is a very basic app. Designed for people who wants to use a search widget with their preferred search engine.<br><br>This app contains a search bar to type in a search query, which will be opened in the Internet browser. A widget for the home screen will simply start the app.<br><br>You can change the search engine in the settings (Default is DuckDuckGo) or type in a custom search string. The app also saves the search queries as a history.<br><br>Source code: https://github.com/TobiasBielefeld/Simple-Search', 'summary': 'Open source search app with a widget', 'summaryHTML': 'Open source search app with a widget', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.2380953, 'ratings': 84, 'reviews': 47, 'histogram': [8, 5, 4, 9, 58], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.5M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Tobias Bielefeld', 'developerId': 'Tobias+Bielefeld', 'developerEmail': 'tobias.bielefeld@gmail.com', 'developerWebsite': None, 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '6657224041644734701', 'genre': 'Personalization', 'genreId': 'PERSONALIZATION', 'icon': 'https://lh3.googleusercontent.com/XWPVmsAyD4VMvKSzasoc_DpbxL7tPSxLpbZZCk1sYW5gBFkQsBngBBXFFhPjm-Wjdma7', 'headerImage': 'https://lh3.googleusercontent.com/Y1jyttt5qtwUR6BwtIvcjSk5fIteDIDekKVJOnOgu6Dn7_o2_xnyrusKc18CCY1aGw', 'screenshots': ['https://lh3.googleusercontent.com/PYj8iCjOA9h6mAWNkb31Qpx0L0ZLrlsd0zY2JKkgdrkBjJZaES3gmZfFOSn_dSaxJdo', 'https://lh3.googleusercontent.com/uGLNR6gZrMAG0gtt0S1a8fI4Q9yUpCo3T-vTb9TaiuEbQK4DqfdOaq4PqIq2TlZSqTlG', 'https://lh3.googleusercontent.com/Cb8g-zWyvs96gbTT_20nLZvXH5DuWKNohuryVuESJTRR3u3A5Ts6iLPobz2iiEvu9RI', 'https://lh3.googleusercontent.com/-ouP-FvmtizBOPqmB1_O-ZnXV0GtpFL_4Ec7MQxi3xCtfl66kMJGbBC3syStnjdrNT0'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Apr 14, 2017', 'updated': 1530437906, 'version': '1.2', 'recentChanges': '- Added a new dark theme!\r\n- Added Metager as a Search engine\r\n- Now 3 different customized search engines can be set up', 'recentChangesHTML': '- Added a new dark theme!<br>- Added Metager as a Search engine<br>- Now 3 different customized search engines can be set up', 'comments': ['This is a great app. Great Google search button alternative. The only thing I hate is that there is no option to turn on suggestions. Fix this and it gets 5 stars from me. Another suggestion is to start the search field in the center of the screen since most phones are so big and reaching to the top takes two hands. Dark mode is great too!', 'More widget options like curved edges would be really nice. Overall a good alternative to Google search widget.', 'Completely and utterly without pretense, this app does exactly what I wanted and needed. It is exactly what it says it is. Even if all you want to do is use Google Search, this app circumvents all that added, useless fluff (and giant bubble rounded edges) and takes you right to the results, in your preferred browser. Fantastic.', "Nice just wanted a simple clean search widget that isn't connected to any other apps. I like the zero special permissions, my browsers already have too much access. Thanks for this dev!", 'Does exactly what it says. This is a really good option if you want to have a widget for a non-google search engine on your homescreen. It is also open-source, which is a huge plus.', 'What I was looking for. A simple widget to make fast duck duck go searches and whatcha the result in Firefox. And it is GPL! :) Thanks!', 'Showing that there is no place holder for the search query in your custom search engine UNABLE TO SEARCH DUE TO THIS MESSAGE', 'Exactly what I was looking for. A simple, no BS search bar widget that uses the engine I want and shows the results in my default browser of choice. A+', 'Kudos for the simple, effective idea. But it only shows and uses Yandex! A glitch? Unistalled.', 'Nice to have options for various searching engines, including DuckDuckGo.', 'it does nothave any settings for what browser to open search results with but open default one without asking.', "Does not seem to perform it's one function....searching.", "Doesn't work, just goes to search engines you already have", "Didn't like it!", 'Exactly what I was looking for. Thank you', "Just what I'm looking for.", "it's very cool", 'good.. no comment', 'Nice and simple.  I would love an old school ice cream sandwich style transparent widget option.', 'Simply great! Just what I wanted. Clear interface and quick setup. Thank you', 'Different languages', 'Excellent', 'Works for me, glad you added Ecosia. Thnx.', "It doesn't work. Just opens a bunch of browser windows to Google or whatever, where you have to type in the search terms again.", 'Bekar👟👟👟👟👞👞'], 'appId': 'de.tobiasbielefeld.searchbar', 'url': 'https://play.google.com/store/apps/details?id=de.tobiasbielefeld.searchbar&hl=en&gl=us'}
