{'title': 'Simple Solitaire Collection', 'description': 'Play Solitaire with this simple game!\r\n\r\nCurrently you can play AcesUp, Canfield, Forty&Eight, FreeCell, Golf, Grandfathers Clock, Gypsy, Klondike, Mod3, Pyramid, SimpleSimon, Spider, Tripeaks, Vegas and Yukon. If you want me to add more games, please tell me.\r\n\r\nHighly customizable:\r\nThere are 8 different looking card sets in this game, 18 different card backgrounds and 6 different background colours. So you have a large choice to customize your experience!\r\n\r\nSet up difficulty:\r\nYou can set up the difficulty for Klondike, Spider, Pyramid and Golf in the settings!\r\n\r\nAutomatic saving:\r\nThe current game will be saved every time you pause or close the app. So you can continue your game where you left it!\r\n\r\nHigh Score list:\r\nWhen winning a game, your score will be saved in a list of up to 10 high scores.\r\n\r\nGame features:\r\nThis game has a undo function to take back up to 20 card movements. A hint function shows you up to 3 possible card movements at once.\r\n\r\nLeft handed mode:\r\nThere is a option for left handed people to mirror the card positions to the left side of the screen.\r\n\r\nNo ads:\r\nThis game is completely free without ads, tracking or something else. Just have fun :)\r\n\r\nLandscape and tablet support: \r\nYou can switch to landscape mode, this is better for larger screens. It is also possible to lock the orientation in the settings\r\n\r\nYou can find the source code here: https://github.com/TobiasBielefeld/Simple-Solitaire\r\n\r\nIf you find bugs or have other ideas for improvements, let me know :)', 'descriptionHTML': 'Play Solitaire with this simple game!<br><br>Currently you can play AcesUp, Canfield, Forty&amp;Eight, FreeCell, Golf, Grandfathers Clock, Gypsy, Klondike, Mod3, Pyramid, SimpleSimon, Spider, Tripeaks, Vegas and Yukon. If you want me to add more games, please tell me.<br><br>Highly customizable:<br>There are 8 different looking card sets in this game, 18 different card backgrounds and 6 different background colours. So you have a large choice to customize your experience!<br><br>Set up difficulty:<br>You can set up the difficulty for Klondike, Spider, Pyramid and Golf in the settings!<br><br>Automatic saving:<br>The current game will be saved every time you pause or close the app. So you can continue your game where you left it!<br><br>High Score list:<br>When winning a game, your score will be saved in a list of up to 10 high scores.<br><br>Game features:<br>This game has a undo function to take back up to 20 card movements. A hint function shows you up to 3 possible card movements at once.<br><br>Left handed mode:<br>There is a option for left handed people to mirror the card positions to the left side of the screen.<br><br>No ads:<br>This game is completely free without ads, tracking or something else. Just have fun :)<br><br>Landscape and tablet support: <br>You can switch to landscape mode, this is better for larger screens. It is also possible to lock the orientation in the settings<br><br>You can find the source code here: https://github.com/TobiasBielefeld/Simple-Solitaire<br><br>If you find bugs or have other ideas for improvements, let me know :)', 'summary': 'Open source solitaire collection with 15 different games!', 'summaryHTML': 'Open source solitaire collection with 15 different games!', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.43, 'ratings': 715, 'reviews': 395, 'histogram': [35, 21, 42, 114, 500], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '16M', 'androidVersion': '3.0', 'androidVersionText': '3.0 and up', 'developer': 'Tobias Bielefeld', 'developerId': 'Tobias+Bielefeld', 'developerEmail': 'tobias.bielefeld@gmail.com', 'developerWebsite': None, 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '6657224041644734701', 'genre': 'Card', 'genreId': 'GAME_CARD', 'icon': 'https://lh3.googleusercontent.com/X5TVHPrX4cbfl5ZLehw_JSVt6aYOMQkO2NLLb3Er_NYa_N0upG87Z0cwxDr59AlCyw', 'headerImage': 'https://lh3.googleusercontent.com/FhItdbCnToU6QZX1wJCMEzNsvkKbKJ8xtfE-Gpez14j8cix-qx5CM3_PpSWMYdfqkTs', 'screenshots': ['https://lh3.googleusercontent.com/y-D6IVNwJyoEMttRzkcXqePHRoVcTJrG1TL5r4byyXWSV67gnp_kjep4Xh79gaO4GbQ', 'https://lh3.googleusercontent.com/dTUVxtFvDPct9IdusPBI5DQ-RWSPzq3GYdP_UKU39MpZlL_yXG-eoif2_nap4M7tg0o', 'https://lh3.googleusercontent.com/k5IccIcCHvcicC6Spd5XOLXxOeG8gzlhggiL79-_RuKA_2nk87-CoZgkzAmqjb82AmU', 'https://lh3.googleusercontent.com/GQj91_KdYQHcgWjcmGK7oFo7_VWZ2W_SD2LcYUe_wDnsaE3lHQ9hbWv8frKDOLlOsTZw', 'https://lh3.googleusercontent.com/w9moqxuiEgpEH08X1bguuls9Dwgrfb6tILtGR039Otg9QM00S3i2nWfkLEwqjOjJmg', 'https://lh3.googleusercontent.com/HEuPy0gUiKxphLorTTXL7_vOJxuu95u1oCEDYifK3P3-nn1RR3q88Zm8NYioxRlWTQ', 'https://lh3.googleusercontent.com/5juHBcmEK5kb4X78LXvjtCt62RLBaxFxUMTk7TEiqQ63C7Pl6wclBj9kaPs_32PXeQ', 'https://lh3.googleusercontent.com/3MaA_k99ZTOLVL_VdbeoBuxIXC_KVSgz9XBk9rbtRad8bZ9I8KKprOQItz1slFKLEA', 'https://lh3.googleusercontent.com/2KFxMiLDszKixCc9KuzMLU4BBM9cEee4Eyq2sm7f71D8THoHIMsAHIP1Aaa1c7LRaaQ', 'https://lh3.googleusercontent.com/5RR_E_4cZRLMWHeKzY775o8K73vvyP0QgWVAPFk60kJH6bWWPBz7zs_aGnhTbl2wxw', 'https://lh3.googleusercontent.com/JwIEePb1CzwI2sk5CzJbHRjIlK2DVbq87G8kBt915FrhS9_Z9LjdnvvKiAeYpz-1ww', 'https://lh3.googleusercontent.com/Cn7tA1dcAh2WP5_UNtqeVGQQYuzYn9mqSYXrpuX0nzCvKt4cobii5fLPesMoOLj7_CI', 'https://lh3.googleusercontent.com/Hj_HhRhZkF5xyaWjH7tWR2NwmPB8TAOXAsKIKQB4yIRd8_xD34BUoo3QgAkCqO_uOmM', 'https://lh3.googleusercontent.com/7-PnlEYSPDzKffNjPSTro-442Z9ngSe6gCHT8Ws1QCUJuZKT3JXcfJkW1JNuou9OBiU', 'https://lh3.googleusercontent.com/3F-xkVw3H0QekiRF5phID4Ow8M695NH6oqWTYKYgUnmibQVpPLLzexflf5ocx5GKvq-o', 'https://lh3.googleusercontent.com/5iuwz37T04_8FhSLyN0Vmo5YtGx-Rf3k0ZawYi_I1jNnxlQmyPI1PN9nzsDLhwqM4Eo', 'https://lh3.googleusercontent.com/2HxeZ0AKS52wRH1zzpcNvLlGbaiRwVL94cCtaTP41CjqIDkdoECEIE7U7cbiDBRKlhY', 'https://lh3.googleusercontent.com/jRjtCYfG1GxpQIrVLcAy18kXwm0G56RK9lIfDYK8Z9DGQdvuluQtyxxcuvBQHezT4A', 'https://lh3.googleusercontent.com/EM8bM6oBtbqoU-92rsz9M-br5OB4cRpsebCOCuyNDtoDfQ2bB9I5E_XDR8tT5sz8a98', 'https://lh3.googleusercontent.com/qwkhbEW8jrTVXETFvS5YR1gGNZoVb_Qouq8t1zLkTcsWORgj4XLdo76kIlkCIUDneP4', 'https://lh3.googleusercontent.com/9-XOX15DELxTgT1Dw5PeNYH_T-XYznpXAE5WJftRNnVrNHz7IIvidQ-sulF8-aSYbLE'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Oct 7, 2016', 'updated': 1532768995, 'version': '3.13', 'recentChanges': '* Added the ability to change the Appearance settings per game!\r\n* Added an option to change the text and stack color and to hide the auto complete button in the Appearance settings\r\n* The minimum amount of moves a game has to have when starting it can now be set up in the General settings\r\n* For games with simple rules, the amount of moves can be set up to make them always winnable!\r\n* Decreasing app size\r\n* Adding Chinese (simplified) translations', 'recentChangesHTML': '* Added the ability to change the Appearance settings per game!<br>* Added an option to change the text and stack color and to hide the auto complete button in the Appearance settings<br>* The minimum amount of moves a game has to have when starting it can now be set up in the General settings<br>* For games with simple rules, the amount of moves can be set up to make them always winnable!<br>* Decreasing app size<br>* Adding Chinese (simplified) translations', 'comments': ["Has a good ability to vary the rules to make games more difficult. No ads so far. That's great! But small card faces. Hard to see the very tiny numbering or lettering while the graphics fill most of the card. This could be better if another card face be added with larger than basic lettering and small graphics. Also the face up cards in a stack needs to be visible. It's often obscured by cards on top of it. Otherwise one of the best versions of ad free solitaire out there.", "Not quite as polished as some other ones, but it's solitaire, you don't need all the sound effects and card backs and other stuff. Just the fact that you don't have to sit through a 30 second ad every time you want to play makes this better than all the others.", 'Excellent variety of games, eg., some of my favorites. Just started so learning settings, but they\'re pretty basic. So far NO ads. Played another card game for years, even paid for the "ad free version." But they kept updating it and now it shows distracting banner ads and totally changed appearance; had to uninstall it.Happy with this game. Hope they don\'t screw it up with updates.', "Can't understand why the face of the card decks are so annoying but with the bazaar designs makes it hard to play the games. Didn't even get a real chance to explore all of the games because the designs were annoying and hard to read with small print.", "Just found your site,never saw it before ,,,graphics are nice with all the options ,,,my only proble is I don't know how to play most of the games,,,you don't give instructions how to play,,I am familiar with the basic games of solitaire but you have a lot of games I never played before,,,I like that people get bored playing the same game all the time,,,why can't you give instructions so I and others like me can download your games,,,thanks", 'No trackers observed. I wish Freecell have more big heart, spades, ... symbols at right corner. Because the actuals are too little.', "One of my all time favorite collections! Ive been playing for a few years now. Great for offline. Updateable backgrounds. Only 1non-intrusive split second ad to ckeck out or X out, for the Spider game. Nice work. And I love the depth of the games' settings! 😁", "Great app. Would be 5 star, only problem I have is the reset deck button doesn't work on games for me.", 'Well done, simple, works as expected, no annoying adds constantly popping up every 5 seconds.', 'For the most part I like it, but in portrait mode the cards are a little to small.', "The very best. It's the game. Twenty-four years I used windows solitaire but had to leave because of ads. This perfect jewel of fun is the best.", "Best Solitaire app I know. I never write reviews, but this is different. first, it's open source, which means the philosophy behind it is about sharing awesome stuff with the world openly. second, there are no ads, no bugs, no required internet connection, you can personalise your cards, deck, and background, you can customise the game to your needs... you have many Solitaire games to choose from, and they all have instructions so you can discover new games! I see the passion in the app, thanks!", "excellent collection of card games! the rules are included for any of the games you're not familiar with making learning a new types of Solitaire extremely easy. the best part is, there are plenty of different versions so if you get bored with one you can easily move on to another. enjoyable to the point of being addictive!", "This is what I've been looking for. No ads, no in app purchase, no network connection required, and no woodland creatures interrupting me every 5 seconds. Just pure and simple solitaire. I downloaded this app for Klondike, but now that's the game I play the least. This app taught me how to play all sorts of other games.", "All on all I love this app. I particularly like the Free Cell and Spider games. The Klondike game, however, leaves a lot to be desired. I am generally good at this game, and have started the game over to see if it is winable. Most of the time I don't get anywhere close. On occasion I will hit a winning streak and win a few. I have solved this for myself by rarely playing that particular game. I don't mind losing, but this game is set up for failure, so I just rarely click there.", "Works. Simple to use. No ads or Internet. Perfect! This is it if you are looking for a straight-forward off-line solitaire game. A refugee from Windoze this is my salvation on Android (Essential PH-2) for a quick game of Vegas rules solitaire. It runs fast and draws no appreciable power, but best of all it does not nag you to buy this or that -- or demand an internet connection. Tobias Bielefeld, deserves kudos for making this open source game available for free -- I'd gladly pay for it.", "App works fine mechanically, but randomness seems way off. In Aces up (where it is easiest to spot the issue) I would expect about 35% of the runs having one deal of four cards in all different suits. 25% for zero and two deals. Six deals about 0.1% and seven deals 0.01%. I routinely get six deals of all different suits in a run which is so unlikely I claim there's an error in randomness.  Unfortunate since the app is a nice relaxation with a decent interface and not crud.", 'Dang gone good game. Controls could be better. No ads.', "I like the game. The problem I have is not being able to make the cards move (ie: play), (physically). I don't understand what I'm doing wrong and the rules don't speak to the issue of HOW TO GET the flaming games to go!!! Not all the games did that. Grandfather's Clock and Gypsy are two I remember off hand. If you would be so kind as to address the problem and give me a clue how to make this game play I would be grateful. I want to keep the game, but I'd like to be able to actually play as well. If you let me know what to do to make this work, I will give you a higher rating. Thank you for the upcoming help, in advance.", "I really enjoy the simplicity of this application. Zero adds here folks! You can change alot of settings for your preference, wether it be the cards appearance, flip for left handed, hints, undo, etcetera. This app has plenty of solitaire game varities, some im familiar with others I'm learning. Thank you!", 'I am only rating on my own opinion and am in no way trying to advise anyone on this app. For me! It does not deal winning hands. When set for random deal. Seems like a win about every 25 to 30 deals before i get a winning hand. I play alott and have re dealt hands to see if it was just me but except for i think 2 hands could not win. Still might be me, but my other solitaire game i am able to win 50 to 55% of the time as apposed to 2 to 3%. But ill say again. That still might be me...', 'Great games and no adds. Good to be able to change so much to suit your needs', "I really wanted to like it because I am sick of the tons of ads on the other solitaire apps I've tried, but I had a hard time with seeing the cards, as in the suits and numbers on them are so small, even in landscape and tried multiple deck styles, I had a hard time distinguishing them.", 'Perfect. No ads. Works like my old Windows Solitaire. Exactly what I was looking for. Starts easy and fast. Needs no permissions and no "gaming account" or anything. Perfect. I wish more games would be so.', 'Just perfect. No ads and plenty of time to use in airplanes.', 'Excellent App! Instructions how to play are provided. The difficulty settings can be chosen making the games enjoyable to play. Thank you to the developer for making this great app and keeping it both free to use and free of ads.', 'I love this app! I have looked through so many solitaire games to find the right one and this is it. I only wish it had a size feature because the cards can be a bit hard to see when playing portrait style.', "All the varients you want, and none of the ads you don't.", 'Thanks for an easy simple solitaire game with no adverts. I love the easy interface and enjoy the fact that there are 17 variations to choose from. This is a well thought out open source game - thanks for that.', 'Beautifully simple solitaire app. So wonderful that there are no ads! Just enough customization options and no distracting, unnecessary over the top graphics. Great selection of games!', 'Good set of solitaire games. No ads and offline play. Could be improved and some sets are literally impossible without shuffle. But overall worth the time sink.', 'The stats suposed to be in main menu, not in inside game type But still, its good game anyway', "Thank you! This app is spot on. Very playable, no ads, and no unnecessary permissions. It's rare to find an app that doesn't ask for unnecessary permissions. Thank you, again.", 'Best solitaire game! Free, no ads, plays offline, all my fave games, great! One suggestion: in MOD3, allow autocomplete when only face cards are at the bottom. Thanks!', 'Great open source Solitaire app. No ads, no in-app purchases, no need for creating an account or give any information. Just what I was looking for! :)', 'Very occasionally you come across an app where the developer has clearly put in a lot of thought and care. This is one such app and is a joy to play. No unnecessary permissions.', 'Perfect. Several solitaire games and no ads. Can see cards clearly, unlike in some versions I tried. What more can one ask?', "Speedy app with plenty of options that's a joy to play. Two minor issues: Cannot right-left swap the positions of the stack and the aces kitty. There is no way to gracefully exit the app. Extra star when fixed.", "Nice collection, doesn't eat up battery like some others, however... And I can't explain this,... After playing 5 minutes this game leaves a ghost image on the screen, like it's burned in. (LG G4)", 'No ads and no in game purchases!!! Plus all of the great card games packed in a single app with a functional, easy and clean interface.'], 'appId': 'de.tobiasbielefeld.solitaire', 'url': 'https://play.google.com/store/apps/details?id=de.tobiasbielefeld.solitaire&hl=en&gl=us'}
