{'title': 'WebApps Sandboxed Browser', 'description': "WebApps is an open-source, secure, sandboxed browser for mobi/web app sites. What this means is that you can browse mobile websites/web apps securely within the app, but any external links will open in your default browser or other app. With the ability to create homescreen shortcuts, WebApps turns your favourite mobi/web apps into secure apps! \r\n\r\nWebApps automatically uses HTTPS for all requests, and by default actually blocks any 3rd party requests (e.g. analytics, ad trackers, etc) and any insecure requests (i.e. requests that are not using  HTTPS).\r\n\r\nThe main use for WebApps is that you can disable cookies, password saving, and flash/local storage on your default browser. This way, you cannot easily be tracked or have your session hijacked when on public Wifi. You can safely opt to use the mobile versions of some popular apps (like Facebook, Twitter, Google+, etc.) instead of using their Android app counterparts, since the Android apps can leak a lot of private data (e.g. automatic photo uploads, location, your contact list, etc.).\r\n\r\nFeatures:\r\n- Works like Mozilla Prism on the desktop. This is a mostly chrome-less browser that gets out of your way.\r\n- Much like FirefoxOS did, WebApps turns websites into secure apps on your phone (you can create shortcuts on your homescreen)\r\n- Completely full-screen browsing (auto-hiding action bar)\r\n- Securely browse mobile sites (uses HTTPS and rejects HTTP connections to avoid wire-tapping)\r\n- Blocks 3rd party requests (images/scripts/iframes) like the NoScript and NotScripts plugins on the desktop\r\n- Allows self-signed SSL certificates to be accepted and saved\r\n- Saves website certificates and warns if the certificate changes (can detect man-in-the-middle attack) \r\n- User agent setting allows more rich mobile experience (depending on site)\r\n- Uses much less bandwidth than native apps (like Google+ app). No background sync'ing.\r\n- Features local data storage and caching for reduced bandwidth usage and better speed.\r\n- Fully open source software.\r\n\r\nFor using Google's suite of apps, try the GApps Sandboxed Browser app, which works the same as this app but contains specific handling for Google's web apps.\r\n\r\nWebApps is open source. Visit the app's website for more information and source code. Contributions are welcome.", 'descriptionHTML': 'WebApps is an open-source, secure, sandboxed browser for mobi/web app sites. What this means is that you can browse mobile websites/web apps securely within the app, but any external links will open in your default browser or other app. With the ability to create homescreen shortcuts, WebApps turns your favourite mobi/web apps into secure apps! <br><br>WebApps automatically uses HTTPS for all requests, and by default actually blocks any 3rd party requests (e.g. analytics, ad trackers, etc) and any insecure requests (i.e. requests that are not using  HTTPS).<br><br>The main use for WebApps is that you can disable cookies, password saving, and flash/local storage on your default browser. This way, you cannot easily be tracked or have your session hijacked when on public Wifi. You can safely opt to use the mobile versions of some popular apps (like Facebook, Twitter, Google+, etc.) instead of using their Android app counterparts, since the Android apps can leak a lot of private data (e.g. automatic photo uploads, location, your contact list, etc.).<br><br>Features:<br>- Works like Mozilla Prism on the desktop. This is a mostly chrome-less browser that gets out of your way.<br>- Much like FirefoxOS did, WebApps turns websites into secure apps on your phone (you can create shortcuts on your homescreen)<br>- Completely full-screen browsing (auto-hiding action bar)<br>- Securely browse mobile sites (uses HTTPS and rejects HTTP connections to avoid wire-tapping)<br>- Blocks 3rd party requests (images/scripts/iframes) like the NoScript and NotScripts plugins on the desktop<br>- Allows self-signed SSL certificates to be accepted and saved<br>- Saves website certificates and warns if the certificate changes (can detect man-in-the-middle attack) <br>- User agent setting allows more rich mobile experience (depending on site)<br>- Uses much less bandwidth than native apps (like Google+ app). No background sync&#39;ing.<br>- Features local data storage and caching for reduced bandwidth usage and better speed.<br>- Fully open source software.<br><br>For using Google&#39;s suite of apps, try the GApps Sandboxed Browser app, which works the same as this app but contains specific handling for Google&#39;s web apps.<br><br>WebApps is open source. Visit the app&#39;s website for more information and source code. Contributions are welcome.', 'summary': 'WebApps turns mobi/web app sites into secure apps! Open source.', 'summaryHTML': 'WebApps turns mobi/web app sites into secure apps! Open source.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.01, 'ratings': 128, 'reviews': 60, 'histogram': [19, 0, 8, 32, 67], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.7M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Toby Kurien', 'developerId': '6699818065335710572', 'developerEmail': 'apps@tobykurien.com', 'developerWebsite': 'http://github.com/tobykurien/webapps', 'developerAddress': '3 Orchid close\nMidrand\nSouth Africa', 'privacyPolicy': None, 'developerInternalID': '6699818065335710572', 'genre': 'Communication', 'genreId': 'COMMUNICATION', 'icon': 'https://lh3.googleusercontent.com/FLNAooubl9neCcOJLmTFQL3YYOdWF14Bvvj29huMWbYUrG7oDGwbY1hQCuXGIRSPsbM', 'headerImage': 'https://lh3.googleusercontent.com/GuhYufI6ZuhNi7IX-8hR2Gx-Vc7nBAcPunQ3T1zUjzp2EXiMohIwmHSTsjuKv_lDdQ', 'screenshots': ['https://lh3.googleusercontent.com/uaTDsyPIZR6hmCTXBvUNOXYHdxj178lz91sTH3f1Tz7IRrt3gcWC4HLU8KlRPOaCofY', 'https://lh3.googleusercontent.com/1WsMWXQSjFx8utRTHAXnKjGQJJKSx771S_eQUaI4--mvgaeznlRwLHPSYV4KTN7IdaY', 'https://lh3.googleusercontent.com/pCUE6wyApf_IT8sXcFaSPO6SzfWHxE9-itpgM_-saaVjLHXDIQNZeGBPI7oQWC0K8OY', 'https://lh3.googleusercontent.com/oOmq2l1MXmIEa1nuIJprceDSGMYOw2P3JJewJajURIlTnriQBncyko7r94InVHoWIg', 'https://lh3.googleusercontent.com/P9NLckvHmU-Q7Z8s5YvDF1ZrX86Jc8Xo14VtXeny7e6dxNfHWsJUUFfRflB25xxiVvUA', 'https://lh3.googleusercontent.com/hkqeDsTQ-nPDzB2NI-OrcVcRsjId-8nuH0bvdxl72XQ1BTodDblFDA6do5P4SlyaCg', 'https://lh3.googleusercontent.com/OZGzR-6gJfP-hW-4qvsKjnPJEm-EbkMSgX1wxXy8er1daQnesn1mXPZ-Ai7pQq_UFA', 'https://lh3.googleusercontent.com/otdLyHtOhL7F5Zc6o5fOqO9zwo1XiOOXHFpmkDnPrFLvGHqd_T0x7egZmNCrM5WJ1tQ', 'https://lh3.googleusercontent.com/u3mPziMY0lGGAeWd7es6HKM9IyaL3bdPkbWFRY9-uvOz8-0n_1MfZ87D2l7zr4WotQ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 10, 2013', 'updated': 1588350842, 'version': 'v3.30', 'recentChanges': 'Now shows app icon, title and colour in recents/overview!', 'recentChangesHTML': 'Now shows app icon, title and colour in recents/overview!', 'comments': ['Great app but I would love it if you could allow us to rearrange out lists, add folder support and make the icons/titles smaller', "Messenger doesn't seem to open in the app. Says 'blocked'", "Love the app but I don't get any notifications on my social media sites making it not so useful for that.", 'If you know how to use it, this is one of the best browsers for privacy. Nice work !', 'Good app BUT Apps should not have the ability to open stuff in my browser. It ruins the entire point when it starts jumping out to my default browser app on my phone. Please allow the user to block web apps from opening stuff in the browser of the phone.', 'Pretty good. The feautres that I need to use it more often is the ability to block ads and receive notifications. Then I can run it like a normal app.', 'Great stuff. Please allow different/separate browser agent for each app.', 'If this app actually sandboxes the indiv websites as the Developer mentioned, then this app is THE ONLY web wrapper currently in existence that does this. Even the other popular app H***** doesn\'t, and the developer of H***** mentioned that it\'s technically impossible to do. WebApps does a great job in cache management as well. I removed the official Facebook app from my phone a long time ago, and this WebApps allows me to "securely" use Facebook again, including FB messenger. Great job Toby!', "Great, doesn't seem to have the same issues with connectivity Chrome has for some pwa sites. I use this mostly with homeassistant, only wish is that it support push notifications by option per site, which the dev has an issue on GH for anyway. This is fairly limited in features, but the privacy and stability are worth it for me.", "Pretty good app. I just struggled with broken sites in the beggining, but unblocking a few 3rd Party stuff brought back my experience. I just wish I didn't need to allow 3rd Parties to simply see images, but it is sandboxed, so it isn't all that much of a bother.", "just cause it works. privacy friendly, and to all those people complaining about facebook not being there.. seriously, you want all your data to be leaked? And that there's no https, well.. its a SANDBOXED browser. it doesn't require https connection to be secure, its already a sandbox. If you don't know what a sandbox is, google it.", "It doesn't work for me. Facebook sign on page barely loads but nothing else. I was able to load google news home but when I clicked a link I received a blank page.", 'Realllllly good, please add dark mode! Thanks', 'Great App but it doesnt support Facebook Messenger in the Facebook Web app. Any info about that issue ?', "it's a good app but it needs the ability to save images...", 'The idea of this app is good, but it still need some work to be better', 'one of the best app I have ever used... very helpful', 'logo is ugly', 'Kuchh kr to asan bna', "It's pretty cool, with the exception that... Please allow an option to use plain http, for the sites that haven't setup https... of course disabled by default, but available option", 'A great start! Two big problems. 1. How do we backup all our Webapps? 2. How do we download files from a site?', 'works perfect with TradingView! great utility for accessing web apps without any stupid bloat.', 'awesome', 'this is exactly the thing that I wanted for such a long time', "This app is exactly what I need to use Facebook without it's annoying app. One thing I'd like to see is an option to change the color. Yellow is a bit intense to be a constant on the screen.", 'One of the best apps for this purpose.', 'One of the  best FOSS apps. Tiny sacrifices in exchange for massive improvements in terms of privacy and security.', 'Need improvement.', 'This is one of the best I have found. I like how it always creates an icon and there are a lot of settings... However I wish it would let me use http addresses to make web apps as well. Its a pretty big inconvenience. Maybe I am misunderstanding the purpose of this app, I am not sure.', 'I love it but please for the love of open source get it updated on fdroid.', 'Excellence! Thank you Toby!', "Nothing better than Open Source. Loving this app. Great implementation. **@dev It seriously needs a option to change that yellow bar (material design crap). Not picking on you, but it's really ugly. Since the text and menu items are white, then any solid color would work (preferably black). Still 5*'s.", "The only other things I could ask for is that this app makes shortcuts that would show on the home screen and in the app tray for every webapp it creates and that webapps could use the notification system on Android. If those two features were added, they would be even closer to their natively coded cousins.  Now I can get an app experience using Facebook without being unable to edit my comments. Also, now I won't have to deal with the Facebook app's funky scrolling bug.", 'No ads, strong privacy and security, simple to use', 'Great app upto now just hope and pray that its a trusted application', "Can't access whatsapp Web on my tablet in this app because of outdated desktop user agent", "It's so fast...", 'Yes', 'چرنده', 'gr8'], 'appId': 'com.tobykurien.webapps', 'url': 'https://play.google.com/store/apps/details?id=com.tobykurien.webapps&hl=en&gl=us'}
