{'title': 'LibreOffice and OpenOffice document viewer', 'description': '<h1><b>View and modify documents created using LibreOffice or OpenOffice on the go using OpenDocument Reader! 📄🚶</b></h1>\r\n\r\n<b>OpenDocument Reader allows you to read your ODF* (Open Document Format) documents</b> created using LibreOffice or OpenOffice wherever you are. In the bus on your way to school wanting to look at your notes before the big exam? No problem! <b>With OpenDocument Reader you can read and search through your documents in a clean and simple way.</b> Is there just one last typo left to fix in your document before sending it out to colleagues? <b>OpenDocument Reader supports modification of documents now!</b> Fast, simple and well integrated.\r\n\r\nYou can start reading your documents from within other apps. Supported apps include GMail, Google Drive, iCloud, OneDrive, Nextcloud, Box.net, Dropbox and lots of others! Or use our integrated file explorer instead to open local files on your device.\r\n\r\n<h1><b>All features in one glimpse:</b></h1>\r\n- open ODT, ODS, ODP and ODG without a hassle\r\n- basic editing of documents to fix typos, add sentences, etc\r\n- securely open password-protected documents\r\n- search for keywords in your document and highlight them\r\n- print documents if your device is connected to a printer\r\n- read your documents in fullscreen to avoid distractions\r\n- select and copy text out of your documents\r\n- enjoy your documents even without internet connectivity - fully offline capable\r\n- read out aloud your documents using Text-To-Speech technology\r\n\r\nIn addition to that, OpenDocument Reader aims to support various other file formats as well as possible:\r\n- Portable Document Format (PDF)\r\n- Archives: ZIP\r\n- Images: JPG, JPEG, GIF, PNG, WEBP, TIFF, BMP, SVG, etc\r\n- Videos: MP4, WEBM, etc\r\n- Audio: MP3, OGG, etc\r\n- Text files: CSV, TXT, HTML, RTF\r\n- Microsoft Office (OOXML): Word (DOC, DOCX), Excel (XLS, XLSX), PowerPoint (PPT, PPTX)\r\n- Apple iWork: Pages, Numbers, Keynote\r\n- Libre Office and Open Office OpenDocument Format: ODF* (ODT, ODS, ODP, ODG)\r\n- PostScript (EPS)\r\n- AutoCAD (DXF)\r\n- Photoshop (PSD)\r\n\r\nThis app is open source. We are not affiliated with OpenOffice, LibreOffice or similar. <b>Made in Austria.</b> Ads are shown in order to support the development of this app. They are free to remove temporarily via the in-app menu. We highly appreciate all kinds of feedback via email.\r\n\r\n* ODF (Open Document Format) is the format used by office suites like Open Office and Libre Office. Text documents (Writer, ODT), as well as spreadsheets (Calc, ODS) and also presentations (Impress, ODP) are supported, including support for complex formatting and embedded images. Graphs are no problem either. If you want to secure your data you can even open password-protected documents. Other applications that are using this format are LibreOffice, OpenOffice, NeoOffice, StarOffice, Go-oo, IBM Workplace, IBM Lotus Symphony, ChinaOffice, AndrOpen Office, Co-Create Office, EuroOffice, KaiOffice, Jambo OpenOffice, MagyarOffice, MultiMedia Office, MYOffice, NextOffice, OfficeOne, OfficeTLE, OOo4Kids, OpenOfficePL, OpenOfficeT7, OxOffice, OxygenOffice, Pladao Office, PlusOffice, RedOffice, RomanianOffice, SunShine Office, ThizOffice, UP Office, White Label Office, WPS Office Storm, Libre Office, Collabora Office and 602Office.', 'descriptionHTML': '<h1><b>View and modify documents created using LibreOffice or OpenOffice on the go using OpenDocument Reader! 📄🚶</b></h1><br><br><b>OpenDocument Reader allows you to read your ODF* (Open Document Format) documents</b> created using LibreOffice or OpenOffice wherever you are. In the bus on your way to school wanting to look at your notes before the big exam? No problem! <b>With OpenDocument Reader you can read and search through your documents in a clean and simple way.</b> Is there just one last typo left to fix in your document before sending it out to colleagues? <b>OpenDocument Reader supports modification of documents now!</b> Fast, simple and well integrated.<br><br>You can start reading your documents from within other apps. Supported apps include GMail, Google Drive, iCloud, OneDrive, Nextcloud, Box.net, Dropbox and lots of others! Or use our integrated file explorer instead to open local files on your device.<br><br><h1><b>All features in one glimpse:</b></h1><br>- open ODT, ODS, ODP and ODG without a hassle<br>- basic editing of documents to fix typos, add sentences, etc<br>- securely open password-protected documents<br>- search for keywords in your document and highlight them<br>- print documents if your device is connected to a printer<br>- read your documents in fullscreen to avoid distractions<br>- select and copy text out of your documents<br>- enjoy your documents even without internet connectivity - fully offline capable<br>- read out aloud your documents using Text-To-Speech technology<br><br>In addition to that, OpenDocument Reader aims to support various other file formats as well as possible:<br>- Portable Document Format (PDF)<br>- Archives: ZIP<br>- Images: JPG, JPEG, GIF, PNG, WEBP, TIFF, BMP, SVG, etc<br>- Videos: MP4, WEBM, etc<br>- Audio: MP3, OGG, etc<br>- Text files: CSV, TXT, HTML, RTF<br>- Microsoft Office (OOXML): Word (DOC, DOCX), Excel (XLS, XLSX), PowerPoint (PPT, PPTX)<br>- Apple iWork: Pages, Numbers, Keynote<br>- Libre Office and Open Office OpenDocument Format: ODF* (ODT, ODS, ODP, ODG)<br>- PostScript (EPS)<br>- AutoCAD (DXF)<br>- Photoshop (PSD)<br><br>This app is open source. We are not affiliated with OpenOffice, LibreOffice or similar. <b>Made in Austria.</b> Ads are shown in order to support the development of this app. They are free to remove temporarily via the in-app menu. We highly appreciate all kinds of feedback via email.<br><br>* ODF (Open Document Format) is the format used by office suites like Open Office and Libre Office. Text documents (Writer, ODT), as well as spreadsheets (Calc, ODS) and also presentations (Impress, ODP) are supported, including support for complex formatting and embedded images. Graphs are no problem either. If you want to secure your data you can even open password-protected documents. Other applications that are using this format are LibreOffice, OpenOffice, NeoOffice, StarOffice, Go-oo, IBM Workplace, IBM Lotus Symphony, ChinaOffice, AndrOpen Office, Co-Create Office, EuroOffice, KaiOffice, Jambo OpenOffice, MagyarOffice, MultiMedia Office, MYOffice, NextOffice, OfficeOne, OfficeTLE, OOo4Kids, OpenOfficePL, OpenOfficeT7, OxOffice, OxygenOffice, Pladao Office, PlusOffice, RedOffice, RomanianOffice, SunShine Office, ThizOffice, UP Office, White Label Office, WPS Office Storm, Libre Office, Collabora Office and 602Office.', 'summary': 'View ODT, ODS, ODP and other documents created using LibreOffice or OpenOffice', 'summaryHTML': 'View ODT, ODS, ODP and other documents created using LibreOffice or OpenOffice', 'installs': '5,000,000+', 'minInstalls': 5000000, 'score': 3.9025145, 'ratings': 30877, 'reviews': 7825, 'histogram': [4909, 1206, 2305, 6020, 16435], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Stefl und Taschauer OG', 'developerId': 'Stefl+und+Taschauer+OG', 'developerEmail': 'support@opendocument.app', 'developerWebsite': 'https://opendocument.app/', 'developerAddress': 'Löwengasse, 1030 Vienna, Austria', 'privacyPolicy': 'https://blog.tomtasche.at/p/opendocument-reader.html', 'developerInternalID': '7551102949470492042', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/xjPoxEzwlH-KIopOngqJe9NZfw0aMu03rDASRALoubhihWvBNNHlEGcXT_P8D0zGylM', 'headerImage': 'https://lh3.googleusercontent.com/j_otwSovKIXTb6kZ8xwCHkkDnEManr4fFRjb_KTItKK9fDIEEWQa_Svu59939kUh7XY', 'screenshots': ['https://lh3.googleusercontent.com/98-RnMeyClNQczQNKmrbNHaJWiEynYNWAlx9c_C95OwAfWQhI1NwPWDcBgVbE3K4DcU', 'https://lh3.googleusercontent.com/H3ZtN72OnIJKgggUbbrSYjY3QjPqD6ZPga_WPkHwUs_pn3bAY4eob8rRRnk-pQucNw', 'https://lh3.googleusercontent.com/C6qOWAipcdXULlvF7Y11ep0FT6MLc83n1w3UvDo237DEgdim1eyoNGcsIAlruFN31GA', 'https://lh3.googleusercontent.com/axgOpiGU1OrlWKiVpf7veIJ5yUxDSXEiHCdXKCd0Hb96DeGGetJEI3YVivMNhQuGLKX7'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': True, 'containsAds': True, 'released': 'Oct 5, 2010', 'updated': 1590837316, 'version': 'Varies with device', 'recentChanges': 'Fix in-app purchase to remove ads. Please contact us at support@opendocument.app if you think your purchase was inadvertently refunded.', 'recentChangesHTML': 'Fix in-app purchase to remove ads. Please contact us at support@opendocument.app if you think your purchase was inadvertently refunded.', 'comments': ['Update: After reporting the bug below, it was fixed within a week. Back to 5 stars!!!! Here is the bug which was fixed: No longer works for password protected ods files. I had an open office spreadsheet with a suffix of ods. This was my master password file so I had it password protected. This was downloaded onto my phone. I went to open it because I need to look up a password. It no longer works. I then went back to the original master password file, removed the password requirement, re-downloaded the file and then was able to open it successfully because it was no longer password protected. It used to work.', 'While it did open my password protected .ods file i created on desktop with open office and copied to android phone, the data felt messier somehow and i could not input more data in the blank spaces, only in the spaces that already contained data making it useless for my needs. Also, the ads feel invasive.', 'Theres too much it wont do. I downloaded it to open an otd fie and it workes but for other documents it just cannot recognise them and if i ooen a document nd choose share then print i get a message "printer spooler will not work" or somthing like that. Itsa real shame the document area of the digital world isnt simlified into one basic file system.', "Does what it says on the tin, and I use LibreOffice on my PC too; great program. There's been some formatting weirdness with documents I've opened from said PC, but nothing a quick editing pass couldn't fix.", "4 of 5 ods files won't display graphs. The 5th actually has two graphs on one sheet and they display perfectly. Data columns are not separated eg dd/yy/mmhh:mmnn should be date, time and a number as 3 fields. All spreadsheets produced by libreoffice. Updated: 3rd star added for grid lines", 'Working fine so far, it even managed to open a password-protected .odf file. UPDATE! They have put a new ad banner on so that I can no longer open my .odf documents. Now uninstalling since it has become useless.', 'Just downloaded and the format and layout of the document from open office over to this app goes completely bonkers and is unusable. Only plus is that it actually managed to open the file at all on Android. Will be uninstalling though.', 'LibreOffice has saved my career since Microsoft ceased to support Word because of the age of my computer. It is in many ways easier to use and produces brilliant copy.', 'Not useful at all. The Microsoft Excel app does a better job of opening and displaying ODS files correctly. Plus the ads are ridiculous. Would not recommend.', 'LibreOffice is outstanding... every bit as good a Microsoft Office. And LibreOffice is free!', 'files saved in libreo office are unable to save page skip ctrl+L used in various printouts for printing on line printer continous stationery in various offices', 'Want to open my ODP files it changes the looks, locations of things and colors of things. Overall I find this app useless and trash.', 'good little app, support is quick to respond to any issue. recommended', 'Very useful. Simple, lightweight and ui is mobile friendly.', 'I got "This doesn\'t seem to be a supported file format." when I tried to open an ordinary pptx...', 'Love it, and amazing app that allowed me to reach the stars! Changed my life in general! Cant reccomend it more!', "It's as good as Microsoft Office, works more or less the same and best of all its free.", 'Nice app for read all pdf and ms doccuments', 'Nice app. Open and works all the time.', "I was searching for odt file viewer but I didn't found any app at last I found this Amazing I give 3 stars because It is not opening pdf files But still good", 'i have been using this app for years. it does open odt and ods files smoothly. enough for me. thanks for your effort.', "Doesn't let you open their own files, keeps saying it's unsupported!", 'It very useful I would like an option to lower and raise the upload to correct display black box on the bottom of the pdf display . Other than that It very good . I havent tried editing a doc yet but I will .I dont like the having to upload a private docx to open . Privacy would be a big issue. Had difficulty finding option to remove ads maybe google play want to display adverts. It better value than Microsoft however it need an option to read docx without upload', 'Most important thing is it works, and the developers are quick to fix problems. It does exactly what it says it will do. For me it is a godsend. I keep a very large .odt file on my phone and it handles it quite well.', "I've used this app for many years with great success and have always been able to search through documents. Suddenly, this feature does not work. As soon as I click in the search box, the app closes and I can't search.", 'So far it is the best open document viewer I have tried. Especially like the spreadsheet viewer.', 'Excellent developer support. I reported a crash and it was fixed the same day!', 'This app is just a full page ad server.', 'It does what it is supposed to do perfectly, i.e. it can edit .odt files from open/libreoffice', "Can't seem to open files in Google Drive online or downloaded", 'Opens my ODT docs, still need to work on the printing part. Document comes out very light when printed', "Works pretty well but didn't open My Samsung Health .gpx file.", 'Great fun loads of wins. You must play.', 'Works fine 👍. Add more editing tools to get the 5th 🌟.', 'Amazing app definetely better than WPS office 👌👌', 'I see how to edit a document but can not save my changes. You mention "hit save" but do not explain how.', 'useless app. only an advertiser', "PLEASE NOTE, this app is NOT from the Document Foundation, the actual developers of LibreOffice. This is a private app by some Austrian company. The name is disingenuous and misleading. Also, the app randomly complains a file is not viewable, and immediately uploads the file to some server (apparently for online rendering) without giving you a choice to opt out, which means you just uploaded potentially sensitive personal data to some random company's servers.", "I am new to this so I am hoping it works with a Samsung Galaxy tab. I need to be able to share documents on my tablet w/my friend on a computer because she can't type worth a lick!😄", "It won't show the entire ODS file - I can't scroll to see anything but the first 15 or so rows. It's also dark mode with no lines or formatting, making what is shown impossible to read or process. Full screen ads are annoying, but I can deal with the banner ads."], 'appId': 'at.tomtasche.reader', 'url': 'https://play.google.com/store/apps/details?id=at.tomtasche.reader&hl=en&gl=us'}
