{'title': '2048 (Ads Free)', 'description': 'Port of 2048 to Android.\r\n\r\nSwipe the tiles to move. Get to 2048! (And keep going for a high score!)\r\n\r\nThis app will never have ads, enjoy!\r\n\r\nCode is open source: http://github.com/tpcstld/2048', 'descriptionHTML': 'Port of 2048 to Android.<br><br>Swipe the tiles to move. Get to 2048! (And keep going for a high score!)<br><br>This app will never have ads, enjoy!<br><br>Code is open source: http://github.com/tpcstld/2048', 'summary': 'Port of 2048 to Android.\r\n\r\n+No Ads!\r\n+No permissions!', 'summaryHTML': 'Port of 2048 to Android.<br><br>+No Ads!<br>+No permissions!', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 4.557377, 'ratings': 17391, 'reviews': 3529, 'histogram': [712, 325, 885, 2097, 13369], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'tpcstld', 'developerId': 'tpcstld', 'developerEmail': '2048@tpcstld.me', 'developerWebsite': 'http://tpcstld.me', 'developerAddress': None, 'privacyPolicy': 'https://tpcstld.me/2048-privacy/', 'developerInternalID': '8514143770018886556', 'genre': 'Puzzle', 'genreId': 'GAME_PUZZLE', 'icon': 'https://lh3.googleusercontent.com/5JrXBphEEsLGqTbdEUKzmfjT2QWuQOI_CwU7r6G53SBNRrSRj1VFL4CY6Ue19z9irYQr', 'headerImage': 'https://lh3.googleusercontent.com/oDrWPsGwqmlRy3Qp4j7VCzC4pgNL5mX9Ok6-P7y5PO46qb9_Y5GzQ7r9vU3-oiYfMQ', 'screenshots': ['https://lh3.googleusercontent.com/1zqoAbYw_dnSHYpbksE-ZGaoJUpl8YJBuquTPD50Ob-X6mX-xvGKy7QkEYCiGR9VWlg', 'https://lh3.googleusercontent.com/duL84fETEHJ07dZbXna23Kq6B6r9EaAIDacVij5SdC9M94vymHAodav2rmf8ad0R_g'], 'video': 'https://www.youtube.com/embed/dmqDI2zR2EU?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/dmqDI2zR2EU/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 19, 2014', 'updated': 1588920144, 'version': 'Varies with device', 'recentChanges': '1.3.0 Your highscore can now be preserved with Google Play Cloud Save! This feature is automatically enabled if you sign-in via Google Play Games. :)\r\n1.3.1 Bugfixes.\r\n1.3.2 You will no longer be continuously prompted to login to Google Play Games if you chose not to. Oops, sorry folks!\r\n1.3.3 Fixed the tap area for the "endless game" overlay.', 'recentChangesHTML': '1.3.0 Your highscore can now be preserved with Google Play Cloud Save! This feature is automatically enabled if you sign-in via Google Play Games. :)<br>1.3.1 Bugfixes.<br>1.3.2 You will no longer be continuously prompted to login to Google Play Games if you chose not to. Oops, sorry folks!<br>1.3.3 Fixed the tap area for the &quot;endless game&quot; overlay.', 'comments': ["Best 2048 game. Without a single ad. I recommend all to download this if you're looking for a 2048 game.", 'This is the first 2048 game I ever played. I go back to it every so often when I want to play a game with out all that. added on stuff', 'Good game, but having two undo moves would be helpful. Oh and ability to play past 2048 too!', 'Fantastic and simple, thank you for making this ad free version!', 'Simple and fun. Props for not including ads.', 'Great, no ads, fun to play, definitely recommend', 'A great open source and ad free way to play 2048!', 'Nice and simple, with no ads.', 'classic 2048 with no ads, unlike voodoo. downloaf it', 'best 2048 ever. more importantly, its no ads!', 'the lack of ads makes this incredible', 'Works well, like endless mode', 'Very good... challenging game', "This is the best of all 2048 games. Could you please add the option to undo two moves? Sometimes I ruin my game trying to undo and swipe the board instead of the undo button! I've had to quit a few times when I had a really high score! Thanks.", "FINALLY a version of 2048 that doesn't have ads and other garbage. Doesn't take up much space or drain my battery too much. Too bad Google prioritizes apps with ads in search... If you are looking for an Android 2048 game this is the app to get.", "Very fast & smooth gameplay. It's the best if you don't want to compete with others in the leaderboard. I wish I could save the high scores (say, top 10) with a name, so that multiple users can play it on the same device.", 'I\'d rate it 0.001 stars if I could because that is how and the game is. I can only say one thing "LAG" fix it cause you gonna loose players a lot of players also when it is not lagging it is way too EASY 2 and 2 = 4 and so one and the boxes are soo small fix and I might give it 0.002 stars OH and also (add free) also a lie. Mabey not fill screen ads but on the bottom of the screen (FIX IT) 😡 I have 1 million other complaints but 500 max letters because they don\'t want me to insult them', "This game is a good game for relaxation and to keep yourself calm (unless you're a competitive person). But after a couple rounds the game sort of losses purpose. But it is very fun.", "It's a very nice game. Totally AD's free. You will never see a single annoying AD ever in this game. My highest score her is 6,21,096 I never thought I do go that far. It's addictive, atleast for me.", "I loved how the app is so light and requires no permissions, other developers should learn from this, but I didn't like that the app has no dark mode and that it has an Undo feature, which allows me to score over 1 million blind. Coming from the Windows Phone which has a much more strict and difficult version of the game, playing this on Android was extremely easy it felt boring after scoring a million, and like someone else mentioned, the score overlaps the logo.", "2048 is a fun game, and this version is the best I've found. It's small and fast, with great play control. And the best thing is, zero permissions needed. No spying or advertising.", 'No ads!! Amazing. I can play offline and it is totally ad free, which is basically unheard of these days. Totally recommend it!', 'Challenging and addictive. I really enjoyed getting to the screen that said "You Win"! That was at 22076. It allowed me to continue the game with an end score of 22776.', "This is awesome its actually ad free! Its a very fun game Its absolutely amazing i love the game so much it really is a fun game when I'm bored its so fantastic very nice game all positive its such a good game!!!! ♡♡ very nice game", 'Everything was working smoothly and all of a sudden the app keeps freezing. It runs fine for about a minute then it freezes and only starts working again if I restart it.', 'Great game addicting. I love the undo feature, but it only allows one undo, as if I accidentally bump the screen it lets me fix it. Only real complaint is that in the very late game, >32768, it will start to freeze after only a few moves. Restart and happens again.', "A good game to play at your last selection! It's a good game, and especially because it is not complicated! 10/10", 'This game is having a glitch ., when we fail we can press undo button multiple times ( like 25 or more ) and by doing mutiple times we can bypass failing and continue playing. fix this !!!!', "Fun little game. Took me about 2 weeks to master. I got all the way to 8192! I'm not sure it's possible to get to 16,384 in the game but maybe! Love that someone made this with 0 ads. I'd pay $0.99 for it!", "Took a while to get the hang of it but I'm currently at 16384 and almost ready to double that. Hint: undo repeatedly till you get the tile you want. It doesn't always put it in the same spot.", 'Best game for any time, simple and challenging. Best score 151584.', 'Puzzle game in which the user moves the blocks in order to combine them and reach that oh-so-great 2048 (or any higher number if you can!) by adding same numbers to obtain the block x2 (4 and 4 makes 8 block / 8x2 makes 16 block). That said, as simple as it sounds, is very challenging and entertaining. A real brain warmer and mind exercising app among the sea of trash that is the Store these days. There are no ads or permissions of any kind, works offline, is simple and works great. 5 stars!', "I rather like it after playing for at least ~8 hours total. Imo I'm decent at this game, and playing it for a few hours over the course of a week or two should be practice enough, if you feel as though you need some. The no ads bit of this particular version of 2048 is great. I understand the point of ads but they annoy and destract me in a game that requires focus like this one.", 'It gets a bit boring after a while but still it is good especially that ot has no ads', 'Casual time killer to sharpen your mind in the process. Seems a bit sluggish on Android 10.', "You're the hero my friend. There are hundreds of implementations of this game uploaded to Play, but only you had the decency of not putting ads in it. I don't see why all those other programmers think that they can shamelessly monetize something they didn't invent, something that even a high school student can implement.", 'There is now an easy cheat: undo over and over until the new block appears in a favorable location. It would be better if the pseudo-random number that determines the new block depends on a seed (drawn once per game) and the state of the field after the last slide, so that re-trying the same move is useless.', 'Brilliant puzzle game. Whenever I feel like sitting down and doing nothing I play this game. It never ceases to amaze me as to the number of tricks you pick up as you go. I eventually managed to beat it! I doubled 2048 then doubled 4096 once more then doubled 8192 till I GOT TO 16384!!!! Awesome! Many thanks to the developer! Have you got another similar more challenging game?', "Love the game and it's well developed, except for one thing. Everytime I start Up the game, it automatically signs into Google play games. It's all fine, but for some reason that takes way to long and in the mean time I can't use the app, which makes quick sessions impossible. It would be great if I could play while it's logging in.", "This version of 2048 is really good in my opinion. They really captured the look and feel of the game from the browser, and made it into an app that you can take with you. Also, they have made it so that you can play offline, which is one of the features that I was really looking for when deciding to keep or uninstall the game. If you're a fan of 2048, this is defiantly the app for you!"], 'appId': 'com.tpcstld.twozerogame', 'url': 'https://play.google.com/store/apps/details?id=com.tpcstld.twozerogame&hl=en&gl=us'}
