{'title': 'Traccar Manager', 'description': 'Traccar Manager is a mobile application to manage GPS tracking devices. It requires a Traccar server instance to work.\r\n\r\nBy default application is configured to use free demo Traccar service. To manage devices you need to register user on http://demo.traccar.org/.\r\n\r\nTraccar (Server) is a free open source server that supports more than 100 different protocols and GPS tracking devices. You can use this application with your own hosted instance of Traccar. For more information visit https://www.traccar.org/.', 'descriptionHTML': 'Traccar Manager is a mobile application to manage GPS tracking devices. It requires a Traccar server instance to work.<br><br>By default application is configured to use free demo Traccar service. To manage devices you need to register user on http://demo.traccar.org/.<br><br>Traccar (Server) is a free open source server that supports more than 100 different protocols and GPS tracking devices. You can use this application with your own hosted instance of Traccar. For more information visit https://www.traccar.org/.', 'summary': 'Traccar server console', 'summaryHTML': 'Traccar server console', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.17, 'ratings': 447, 'reviews': 255, 'histogram': [67, 4, 22, 44, 308], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '10M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'Anton Tananaev', 'developerId': 'Anton+Tananaev', 'developerEmail': 'support@traccar.org', 'developerWebsite': 'https://www.traccar.org/manager/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '7510277361579248162', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/HLp9CH5gqtQITzXFN_id0V2wvMYQRl80j1aHaJNedsI9e3r6HiAkOZGcmilTtG2sYg', 'headerImage': 'https://lh3.googleusercontent.com/P_VedZmpEbjOTozkROFa06Mw7c8V1_YggZlwIpQyCv6kWO_7qZ0A6pq-G6b9kTnunk08', 'screenshots': ['https://lh3.googleusercontent.com/vH40J4_8JpTQCeDyc3n7NhZ7yXBIBdqwo8RtWhqojlQJVgw6TPUyD68j3I7Fts9okSA', 'https://lh3.googleusercontent.com/Wary674meTl-4_MZuX1mZdV-n96LJZPn9Mjb7GKGKXnmUmUbPijh7sfb4w_B7F45TudH', 'https://lh3.googleusercontent.com/x7osEDIQPUFT78XzcF6yqmWPH_9pP6UgtNNvhy7-yBc9zutHnL6bpns7N__1cdll0KVj'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 7, 2016', 'updated': 1569475081, 'version': '2.9', 'recentChanges': 'Add missing files', 'recentChangesHTML': 'Add missing files', 'comments': ["Excellent concept, great work so far, but, Overall interface works quite poorly, no advantages over the web interface. Drop-down menus behave oddly, sometimes don't fit on screen, require press&hold, etc. Notifications of events do not pass through to android notifications, vibration, tone sound, etc. An open incredible opportunity.", "Working perfectly for over a year. Suggestion: Add conditions to notifications like: - If offline for more than X minutes, notify - most tracking devices don't continuously upload location so if I enable notification if offline I get notified every minute.", 'Great app ever. Hope update user experience and more responsive better', 'This app does not connect to the server. The client connects fine and works well with server as long as you use a phones gps. If you try to connect a obd2 gps tracker that uses imei number....forget it you need the client app it does not recognize imei', 'Fantastic app. My only recommendation is to be able to change the server ip when needed without reinstalling the app. If the server ip changes, the app hangs.', 'Really like it!!!. is very smooth. I like i dont have to sign in all the time!!!', 'great app , service and concept. Just want to know that default demo server is always free? What are the limitations of free demo server?', 'Best app in its field. Easy to use. Works like a a charm.', 'Do what suppose todo. But you can do exactly same in any browser.', 'Great app. How to add Google map?', "Doesn't even start. Needs a lot of work.", 'Amazing job with the client and server!!!', 'Not user friendly, takes long to respond', '👍 Great developer.Thanks for everything .', 'Great piece of software', 'i cant load this applacation whats wrong', 'An Amazing gps platform', 'Excellent, great job', 'Até agora sem problemas', 'Great contribution', 'sài rất tốt cảm ơn', 'super app', 'baad', 'Thanks', 'Good aplication', 'Ok', 'Excellent', 'good', 'very good', "Why would you need the app when you can just use the browser to access the GUI on port 8082? The app doesn't seem to be more than an embedded browser.", "I'm in this industry more than 7 years but this is one of the greatest apps \nI have ever experienced", 'Great tool !', 'Top Application! I have this running on an RPi and tracking many vehicles with cheap Chinese trackers. Very little configuration required, but it is possible if you need to make it work for your application.  Anton... You have created an amazing application, for which I am very grateful. Thank you for your dedication and attention to detail in creating Traccar.', 'ردیاب های خوبیه فقط  تو ایران درست پشتیبانی نمیشه با تشکر از همه ی دست اندرکاران', 'On point', 'Great', 'Powerful', "For some strange reason I can't log onto my server with this version. I can with TraccarM, but this app always reports invalid email or password, and I have no idea why.  I even added another user, and I have the same problem. [edit] Found the issue. Email is case sensitive, plus trailing space sensitive. Swype capitalised and added a trailing space! Double whammy!", 'Fast, accurate and free! Great GPS Tracking Application for hundreds of different devices. Also includes phone tracking!', "It's fast and very accurate. Now I can easy trace my car anytime anywhere."], 'appId': 'org.traccar.manager', 'url': 'https://play.google.com/store/apps/details?id=org.traccar.manager&hl=en&gl=us'}
