{'title': 'Quill - Ghost blog admin with full offline support', 'description': '<b>In November 2017, Quill joined forces with the Ghost team to become the official Ghost Android app! Quill itself will no longer receive any updates. Please install Ghost Android from https://play.google.com/store/apps/details?id=org.ghost.android. Read the announcement at https://blog.ghost.org/android/. To my users - thank you for your support thus far, and I\'ll see you on the other side!</b>\r\n\r\nGhost (https://ghost.org) is a simple, powerful blogging platform that allows you to share your stories with the world.\r\n\r\nQuill brings Ghost\'s elegant design to a 100% NATIVE Android app. It is designed to be simple, beautiful, and fast, with FULL OFFLINE SUPPORT. That means you can write, edit and publish blog posts on the go, in the subway, or on a flight - with no frustrations! Then all you need to do is sync it later when you have an Internet connection.\r\n\r\n<b>HIGHLIGHTS</b>\r\n• Simple, intuitive interface based on <b>Material Design</b> principles and Ghost\'s web interface (along with some <b>tasteful animations</b>!)\r\n• <b>Markdown editing with preview</b> - swipe to switch between editing and previewing\r\n• Native <b>image upload</b> from your phone or a web link\r\n• <b>Offline mode</b> - Quill is designed to work 100% offline -- just sync when you\'re connected later! Ideal for travellers and journalists.\r\n• <b>100% Markdown compatibility with Ghost</b> - insert images, footnotes and code blocks like you\'re used to\r\n• <b>Attach tags and a cover image</b>\r\n• Works with <b>Ghost Pro (ghost.io)</b> blogs as well as <b>self-hosted blogs</b>\r\n• <b>Conflict handling</b> - when a blog post is edited simultaneously from the app and elsewhere (e.g., via Ghost web), Quill will detect the conflict and show you a nice UI to decide what to do - so you never lose your hard work!\r\n• <b>Free with no strings attached</b> - no ads, no in-app purchases, and certainly no data harvesting of any sort, now or in the future (you can actually check the code yourself to verify this - link below). None of your data is saved by me <i>except</i> for crash-reporting or analyzing anonymous usage statistics.\r\n\r\nQuill has been translated to several languages: German, Spanish, French, Italian, Japanese, Simplified Chinese, Korean, Croatian and Norwegian. If you\'d like to see support for your language, contribute @ http://tiny.cc/translate-ghost-android.\r\n\r\n<b>GHOST VERSION COMPATIBILITY</b>\r\nQuill has been tested against versions 1.0.0 to 1.15.0 of Ghost. Older or newer versions may not work correctly because the Ghost admin API is not stable yet (see note below).\r\n\r\n<b>IN CASE OF ISSUES</b>\r\nIf you find a bug please email me (vickychijwani at gmail dot com), report it on Github (link below), or describe the issue in your Play Store review. Try to include as many details as you can, and mention the app version, Ghost version, and Android version.\r\n\r\n<b>HOW DOES THIS APP MAKE MONEY?</b>\r\nIt doesn\'t (and probably never will). No ads, no data harvesting, no "pro" version - no strings attached. Quill is a pure learning/fun project for me, and is my way of giving back to the wonderful open-source community.\r\n\r\n<b>LINKS</b>\r\nFork on Github: https://github.com/vickychijwani/quill\r\nReport bugs and propose new features: https://github.com/vickychijwani/quill/blob/master/CONTRIBUTING.md\r\nHelp translate the app to your language: https://hosted.weblate.org/engage/quill/en/\r\n\r\n<b>TECHNICAL NOTE ABOUT THE GHOST API</b>\r\nThe Ghost API is neither completely stable nor publicly-released at this point. This means that Quill may stop working correctly after major Ghost releases that change the behavior of the API. I will try to track such changes and update the app as soon as I\'m made aware of issues.\r\n\r\nQuill for Ghost is an unofficial app. Ghost and the Ghost Logo are trademarks owned by The Ghost Foundation.', 'descriptionHTML': '<b>In November 2017, Quill joined forces with the Ghost team to become the official Ghost Android app! Quill itself will no longer receive any updates. Please install Ghost Android from https://play.google.com/store/apps/details?id=org.ghost.android. Read the announcement at https://blog.ghost.org/android/. To my users - thank you for your support thus far, and I&#39;ll see you on the other side!</b><br><br>Ghost (https://ghost.org) is a simple, powerful blogging platform that allows you to share your stories with the world.<br><br>Quill brings Ghost&#39;s elegant design to a 100% NATIVE Android app. It is designed to be simple, beautiful, and fast, with FULL OFFLINE SUPPORT. That means you can write, edit and publish blog posts on the go, in the subway, or on a flight - with no frustrations! Then all you need to do is sync it later when you have an Internet connection.<br><br><b>HIGHLIGHTS</b><br>• Simple, intuitive interface based on <b>Material Design</b> principles and Ghost&#39;s web interface (along with some <b>tasteful animations</b>!)<br>• <b>Markdown editing with preview</b> - swipe to switch between editing and previewing<br>• Native <b>image upload</b> from your phone or a web link<br>• <b>Offline mode</b> - Quill is designed to work 100% offline -- just sync when you&#39;re connected later! Ideal for travellers and journalists.<br>• <b>100% Markdown compatibility with Ghost</b> - insert images, footnotes and code blocks like you&#39;re used to<br>• <b>Attach tags and a cover image</b><br>• Works with <b>Ghost Pro (ghost.io)</b> blogs as well as <b>self-hosted blogs</b><br>• <b>Conflict handling</b> - when a blog post is edited simultaneously from the app and elsewhere (e.g., via Ghost web), Quill will detect the conflict and show you a nice UI to decide what to do - so you never lose your hard work!<br>• <b>Free with no strings attached</b> - no ads, no in-app purchases, and certainly no data harvesting of any sort, now or in the future (you can actually check the code yourself to verify this - link below). None of your data is saved by me <i>except</i> for crash-reporting or analyzing anonymous usage statistics.<br><br>Quill has been translated to several languages: German, Spanish, French, Italian, Japanese, Simplified Chinese, Korean, Croatian and Norwegian. If you&#39;d like to see support for your language, contribute @ http://tiny.cc/translate-ghost-android.<br><br><b>GHOST VERSION COMPATIBILITY</b><br>Quill has been tested against versions 1.0.0 to 1.15.0 of Ghost. Older or newer versions may not work correctly because the Ghost admin API is not stable yet (see note below).<br><br><b>IN CASE OF ISSUES</b><br>If you find a bug please email me (vickychijwani at gmail dot com), report it on Github (link below), or describe the issue in your Play Store review. Try to include as many details as you can, and mention the app version, Ghost version, and Android version.<br><br><b>HOW DOES THIS APP MAKE MONEY?</b><br>It doesn&#39;t (and probably never will). No ads, no data harvesting, no &quot;pro&quot; version - no strings attached. Quill is a pure learning/fun project for me, and is my way of giving back to the wonderful open-source community.<br><br><b>LINKS</b><br>Fork on Github: https://github.com/vickychijwani/quill<br>Report bugs and propose new features: https://github.com/vickychijwani/quill/blob/master/CONTRIBUTING.md<br>Help translate the app to your language: https://hosted.weblate.org/engage/quill/en/<br><br><b>TECHNICAL NOTE ABOUT THE GHOST API</b><br>The Ghost API is neither completely stable nor publicly-released at this point. This means that Quill may stop working correctly after major Ghost releases that change the behavior of the API. I will try to track such changes and update the app as soon as I&#39;m made aware of issues.<br><br>Quill for Ghost is an unofficial app. Ghost and the Ghost Logo are trademarks owned by The Ghost Foundation.', 'summary': "[DEPRECATED: I've joined the Ghost team! Please install the official app.]", 'summaryHTML': '[DEPRECATED: I&#39;ve joined the Ghost team! Please install the official app.]', 'installs': '5,000+', 'minInstalls': 5000, 'score': 4.55, 'ratings': 124, 'reviews': 80, 'histogram': [9, 1, 3, 4, 104], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '9.2M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Vicky Chijwani', 'developerId': '7517511132981135868', 'developerEmail': 'vickychijwani@gmail.com', 'developerWebsite': 'http://vickychijwani.me', 'developerAddress': None, 'privacyPolicy': 'http://vickychijwani.github.io/quill/privacy.html', 'developerInternalID': '7517511132981135868', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/eXvEYgkXHXRLnOUPSTqTVrcZtdso9WvOr8zhV1g8CU8idhOrc09Hz7xpEJ0BR_tA7dOe', 'headerImage': 'https://lh3.googleusercontent.com/_k7MUVdNCKDIpW33f6Jhfj5I4cFKHqAavB9kYM4nSJLkCEYeq_tn-ZHObjNGbd45tQ', 'screenshots': ['https://lh3.googleusercontent.com/YLMIwy2f3ZS2qpkyzla1aVg8VvfGUf3y-VBZvVYB1lCOunOed3vUh_kNMh5oieIYUWY', 'https://lh3.googleusercontent.com/OvORZgYPfpNtI1nKPK_31UmPuQDU7KXezuFePe_dtN3P1flpYmwFZN1W6Xz3G0sVsw', 'https://lh3.googleusercontent.com/LkvyDGm2psxZ-CCh2EvZ8BfukC_rjORuIxWByEAtyRk7Bjrg9nLnTaVILJeJ0ZPrYQ', 'https://lh3.googleusercontent.com/vTNdDH6vEQtWZVgTN4JK1r1aemB2zltmE-N2gc8pRs9Cednz2N8ib8UycG3ZRA1l_PI', 'https://lh3.googleusercontent.com/x-vAr3xExPv375hojRBTsbo9BsQfqDFDsJw9xe8jD5jtDyx9d-Zc7fmxvBnRfyxzCP0', 'https://lh3.googleusercontent.com/lrkzBw7ROD0MeVrEmGr8u2EuHY7EuRabR-N49RwZor7Soj5iZJyaHRwNnnx6l40qIi4', 'https://lh3.googleusercontent.com/exfPiEjzgBzQS41zKcZ1jvYIKe4Rg-QEN3zYecVc2cFoTtopfnAUZe0LV99nzONdISk', 'https://lh3.googleusercontent.com/nG7PL5QBFIOwZvO0QFhA3sCAJDBcLmoj_EefklXhHvoS9juKagFr8vvrcEqJ2PUcwg', 'https://lh3.googleusercontent.com/zI96ANgtPXRMRoGiOJmVwHzPgZuU8pblWdNCH76awKRE1R96UT-BoVYV_cY_Iqb4PQ', 'https://lh3.googleusercontent.com/K5NvBVmSQO_9_-Zr_XlWh14OkJyxtzNJLaZN5yHOr0kGF2fdA3BzFEL0NSAgV9l17A0', 'https://lh3.googleusercontent.com/H2uHMhCFqJi9tl3xVl60p1lhHsvxPQVjpdn2isgBrBGhnaPMre6gXpjOEFHtWPu8y19n', 'https://lh3.googleusercontent.com/6PltDo3fr4vMCu1adC441CPNKCoBaF5hY0aUz3pwVMM8l5paqITXix_4vwUuLcUIpKQ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'May 15, 2016', 'updated': 1511121999, 'version': '2.2.2', 'recentChanges': 'Quill is now Ghost for Android! https://blog.ghost.org/android/', 'recentChangesHTML': 'Quill is now Ghost for Android! https://blog.ghost.org/android/', 'comments': ['As mentioned this software is deprecated, and refers to an official package for Android, which since has also been deprecated. There is alternative it seems.', "The stupid app doesn't let me login, after putting the site url, it just keeps loading, Pathetic Trash, doesn't even deserve 1 star.", "I don't understand how this app is supposed to work?? not enough info. can sign in", 'Fantastic app for managing a Ghost blog. Simple, intuitive, and functional.', 'This might honestly be the best app ever. EDIT: Ghost 1.0!!! 🎉', "App on this tablet (tab a) doesn't connect and says my ghost is older than 1.0 however it is latest stable build. :( other wise great app and works on nexus 7.", 'Much better than trying to use the Ghost editor on a mobile browser!', 'Wonderful, thanks!', 'Works really great. Incredibly well designed, and free to boot! Thanks for an awesome app.', 'Well... i am new to Blogging. Having seen this app opened it and i have difficulty filling out the first line. There does not appear to be a help point on the opening page. The owner contacted me on another issue and i have accidently lost her email perhaps she may contact me again.', "Quill is a wonderful app with just one main flaw in my opinion. Unfortunately it only allows you to log into one site at a time, meeting you'll be doing a lot of logging out and in if you manage or contribute to more than one Ghost blog. Beyond that limitation, the features and user experience are just right!", 'Crashes after successfull login. Already send a report. Otherwise, was once the best app, hands down!', 'Later edit: the issue about crashing at login was solved by following the recommendation from Vicky and I modified some things in my blog, in database. Thanks for help :)', 'This app works fantastically with self-hosted Ghost. It makes mobile publishing so much easier.', 'This app is so simple and well done.  Offline support works great and the developer is responsive.  Very much looking forward to support for Ghost 1.0', "Can't believe this app is free and so damn good!", 'A really great app. The only feature missing for me is scheduling posts to publish in the future. That would earn the 5th star! EDIT: Looking forward to Ghost 1.0 support!', 'Wow, what a great app! Thank you so much! This is FOSS at its finest.', 'Wonderful app admin ghost blog. U will love it. Thanks Vicky.', 'Cant create a login', 'The best app for managing your Ghost blog', 'Just love it. Simple, awesome and free.', 'Amazing work. Basically flawless.', 'Nice', 'The best way to use ghost from a mobile device!', 'Stunning and simple to use.', 'Very handy', "I've been looking for a good blog editor that will work offline (I spend a fair time off-grid in my campervan). This is EXACTLY what I wanted!  Nice interface and nice markdown editor with preview. No ads, no distractions, just an clean editor which publishes to Ghost or saves local without problems. PERFECT!   Also excellent response from the developer when I had a minor problem (of my making).  Nice job Vicky.", "Over all a really great app for publishing stores on the go. A few minor sync issues but given the rest of the features and UX (along with the app being free), you really can't complain to much", 'This is the ghost tool I have waited for with offline editing and perfect material design aesthetic this app hands down feels like an offical app with every feature aupported perfectly and responsively', 'This is a very good app indeed. Clean interface and easy to use. Great job Vicky. Highly recommended.', "Awesome app if you're using Ghost for your blog!", 'Nice to see and it works very well!', 'Thank you very much!!!', "If you have a Ghost CMS and want a good client to post to your site this is a must have. The only thing I would suggest is adding sharing intent. I'll see things in Google news and want to share them to my site, but I can't share that content to my Ghost blog from this app.", 'This app is a joy to use. Very excited to see more features get added. Would love to manage all my ghost blogs with this.', 'Great UI, very slick and seems to work offline. Very happy!', 'Would 100% be a 5 star app if it supported multiple blog accounts', 'This little app is awesome. Does all I need it to and super simple to post and keep your blog up to date', 'Absolutely love the app. Makes it easy to jot a few things down on the go'], 'appId': 'me.vickychijwani.spectre', 'url': 'https://play.google.com/store/apps/details?id=me.vickychijwani.spectre&hl=en&gl=us'}
