{'title': 'DigiLux: Fingerprint Gestures for Phone Brightness', 'description': 'Please note: Devices with large circular fingerprint sensors are most likely to be supported, others cannot because of hardware limitations. You\'re more than welcome to try, but there are no guarantees you device will be supported; no Samsung support.\r\n\r\nEnjoy your large screen, but find using the notification shade brightness widget one handed difficult or inaccessible? Always been upset that you have physical controls to manage your phone\'s volume, but not its brightness? Well, worry no more! This app lets you use your finger print sensor as dedicated brightness control hardware in addition to many other single handed use niceties.\r\n\r\nYou\'ve turned off the lights and crawled into bed completely knackered. Your phone goes off, your crush just texted you. You want to read it, but you also quite like seeing and don\'t want to sacrifice your eyes to the relationship gods for this person; at least not yet, maybe ever, who knows?! Life\'s a journey and all that. But! You\'ve got this app installed! So You merely swipe your finger to the left and your eyes are no longer an Icarus drifting defiantly and foolishly into the sunlight of your phone\'s screen.\r\n\r\nYou read the message, you giggle, your eyes are saved and your can proceed to sleep. You don\'t text back immediately though, you close your eyes with a smirk: "Good things are worth waiting for". Right you are you beautiful person. Right you are.\r\n\r\nThis app uses Accessibility services.\r\n\r\nThis app enhances one handed phone usage of your device by providing the following:\r\n\r\n1. Gestures and Brightness control:\r\n\t* Customize how much each swipe increases or reduces the brightness.\r\n\t* Position the slider closer to the top or bottom of your screen.\r\n\t* Change the color of the slider and it\'s background.\r\n\t* Choose whether you want the slider to show up or not.\r\n\t* The ability to map gestures to actions, keep the gestures you already use and love!\r\n\r\n2. Auto changing wallpapers: Android 8.1 added the feature where a light wallpaper gave a light notification shade, and a dark wallpaper a dark notification shade. The app now lets you choose wallpapers for either scenario and set the time for the app to automatically change over. A future update will let this automatically sync with sunrise and sunset at the user\'s location for pro users.\r\n\r\n3. Auto rotation: Auto rotate apps only certain apps to landscape, all others will remain in potrait mode. (limited to 2 for free users)\r\n\r\n4. Accessibility Pop up button: Run out of gestures? Use a pop up for those actions you still want, but would rather not use gestures for.\r\n\r\n5. A trial period: You can now tap the "Gift" icon in the Action Bar to try the premium version of the app for 10 minutes first, 30 seconds next and 10 seconds on subsequent taps. If you want another 10 minute trial, just have to disable the app in accessibility settings, and reenable it again. This closes the app completely and resets the trial status. A handy timer shows how much time is left in the trial in the same Action Bar icon.  \r\n\r\nPremium features:\r\n\r\n* Pick your slider colors based on your wallpaper! Please note live wallpapers are not supported.\r\n\r\n* Add a dimmer for when you want your brightness to go down just that much more.\r\n\r\n* Add as many apps as you want to the auto rotation list.\r\n\r\n* Restore Adaptive brightness depending on an ambient brightness threshold when the screen turns on.\r\n\r\n* Apply a dark screen filter over the the Application Window to further dim the screen. Android OS limitations however prevent the filter from drawing over the Notification Drawer.\r\n\r\nGoogle Plus Page:\r\nhttps://plus.google.com/communities/101040733188459773494\r\n\r\nSupported Devices:\r\n\r\nThis app depends on a FingerPrint Gesture API introduced in Android Oreo. Please note, this app is not compatible with your device if it doesn\'t have it installed.\r\n\r\nSupported devices include:\r\n\r\n* All Google Pixels\r\n* Nexus 6P\r\n* Nexus 5X\r\n* One Plus 5T (Removed in Pie)\r\n* The Essential Phone\r\n* Xiaomi Mi A1(Removed in Pie)', 'descriptionHTML': 'Please note: Devices with large circular fingerprint sensors are most likely to be supported, others cannot because of hardware limitations. You&#39;re more than welcome to try, but there are no guarantees you device will be supported; no Samsung support.<br><br>Enjoy your large screen, but find using the notification shade brightness widget one handed difficult or inaccessible? Always been upset that you have physical controls to manage your phone&#39;s volume, but not its brightness? Well, worry no more! This app lets you use your finger print sensor as dedicated brightness control hardware in addition to many other single handed use niceties.<br><br>You&#39;ve turned off the lights and crawled into bed completely knackered. Your phone goes off, your crush just texted you. You want to read it, but you also quite like seeing and don&#39;t want to sacrifice your eyes to the relationship gods for this person; at least not yet, maybe ever, who knows?! Life&#39;s a journey and all that. But! You&#39;ve got this app installed! So You merely swipe your finger to the left and your eyes are no longer an Icarus drifting defiantly and foolishly into the sunlight of your phone&#39;s screen.<br><br>You read the message, you giggle, your eyes are saved and your can proceed to sleep. You don&#39;t text back immediately though, you close your eyes with a smirk: &quot;Good things are worth waiting for&quot;. Right you are you beautiful person. Right you are.<br><br>This app uses Accessibility services.<br><br>This app enhances one handed phone usage of your device by providing the following:<br><br>1. Gestures and Brightness control:<br>\t* Customize how much each swipe increases or reduces the brightness.<br>\t* Position the slider closer to the top or bottom of your screen.<br>\t* Change the color of the slider and it&#39;s background.<br>\t* Choose whether you want the slider to show up or not.<br>\t* The ability to map gestures to actions, keep the gestures you already use and love!<br><br>2. Auto changing wallpapers: Android 8.1 added the feature where a light wallpaper gave a light notification shade, and a dark wallpaper a dark notification shade. The app now lets you choose wallpapers for either scenario and set the time for the app to automatically change over. A future update will let this automatically sync with sunrise and sunset at the user&#39;s location for pro users.<br><br>3. Auto rotation: Auto rotate apps only certain apps to landscape, all others will remain in potrait mode. (limited to 2 for free users)<br><br>4. Accessibility Pop up button: Run out of gestures? Use a pop up for those actions you still want, but would rather not use gestures for.<br><br>5. A trial period: You can now tap the &quot;Gift&quot; icon in the Action Bar to try the premium version of the app for 10 minutes first, 30 seconds next and 10 seconds on subsequent taps. If you want another 10 minute trial, just have to disable the app in accessibility settings, and reenable it again. This closes the app completely and resets the trial status. A handy timer shows how much time is left in the trial in the same Action Bar icon.  <br><br>Premium features:<br><br>* Pick your slider colors based on your wallpaper! Please note live wallpapers are not supported.<br><br>* Add a dimmer for when you want your brightness to go down just that much more.<br><br>* Add as many apps as you want to the auto rotation list.<br><br>* Restore Adaptive brightness depending on an ambient brightness threshold when the screen turns on.<br><br>* Apply a dark screen filter over the the Application Window to further dim the screen. Android OS limitations however prevent the filter from drawing over the Notification Drawer.<br><br>Google Plus Page:<br>https://plus.google.com/communities/101040733188459773494<br><br>Supported Devices:<br><br>This app depends on a FingerPrint Gesture API introduced in Android Oreo. Please note, this app is not compatible with your device if it doesn&#39;t have it installed.<br><br>Supported devices include:<br><br>* All Google Pixels<br>* Nexus 6P<br>* Nexus 5X<br>* One Plus 5T (Removed in Pie)<br>* The Essential Phone<br>* Xiaomi Mi A1(Removed in Pie)', 'summary': "Control your phone's brightness with your fingerprint sensor!", 'summaryHTML': 'Control your phone&#39;s brightness with your fingerprint sensor!', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.35, 'ratings': 270, 'reviews': 182, 'histogram': [64, 32, 29, 29, 113], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': '2.5M', 'androidVersion': '8.0', 'androidVersionText': '8.0 and up', 'developer': 'Tunji Dahunsi', 'developerId': 'Tunji+Dahunsi', 'developerEmail': 'tjdah100@gmail.com', 'developerWebsite': 'http://tunjid.com', 'developerAddress': '39380 Medallion Court,\nFarmington Hills,\nMI,\n48331', 'privacyPolicy': None, 'developerInternalID': '7994588015927690862', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/YoLWp1KxiM8AP2M0g0q1ILsO9a4L4195Xdfb2Sc8L6Xyw2nT9eY6kqoRGko9OrrtwpXC', 'headerImage': 'https://lh3.googleusercontent.com/syBGg3bQdyCs8xhJmaTtUr0ApxMuG75q1lwxHNHzvV7XMnMYlRD5MipA3WgQ3v9uA406', 'screenshots': ['https://lh3.googleusercontent.com/vSiECi5LQCpzRa-2Csi0CxhUYbktBNunvaVVEFvaCndjAdKX4YbVs41GgFXBs1kXU1t-', 'https://lh3.googleusercontent.com/qUiIU5Kvr2NHHQikShSlCbLmrYptP6XtV6HbyZLtNbtZeA9_WF4A5qqhy6kBujWimQ', 'https://lh3.googleusercontent.com/8ZnNud2VD5xSiByQSeAPjU0y9qfKjJ67PlrRkmzl_BTx5taLNEdukZdHOrJMSpveeWM', 'https://lh3.googleusercontent.com/bDiLkcDNse7ZHskAPnNdzvkwpCyvhi5tH2pqkSnlJq3-7Ls2S0owE56wuhman3QlVfY', 'https://lh3.googleusercontent.com/X1mDhusq1TALJtAHnMJvDAl7mGxFmorFYk-RRa5TsV6srk8sTey24dygUPG0emdvTg'], 'video': 'https://www.youtube.com/embed/w0MJAcF4X9w?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/w0MJAcF4X9w/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Oct 8, 2017', 'updated': 1581194378, 'version': '9.0.1', 'recentChanges': 'This update allows you to see apps that were recently screened for auto rotation to help debug issues with auto rotation.\r\n\r\nAs bonus, it lets you see a timeline of the last 9 apps that showed up.', 'recentChangesHTML': 'This update allows you to see apps that were recently screened for auto rotation to help debug issues with auto rotation.<br><br>As bonus, it lets you see a timeline of the last 9 apps that showed up.', 'comments': ["Been using this app with no problems whatsoever on stock Android 10 (pixel 3). However, it does not work on a custom rom (dirty unicorns). Is there any reason it isn't working here? EDIT: All other fingerprint apps work (the ones that use fingerprint for authentication anyway). I'm back on stock and Digilux works fine, now. Thanks!", 'Not working at all on my LG V40 w/ Oreo 9. All permissions set, yet absolutely no fingerprint swipe actions work. Lastest system update for this phone is installed. Seems like a great app... Would love to use this as advertised. Please fix....', "I absolutely love this app both in concept and execution. Unfortunately, I can't really use it on my phone (Pixel 3 XL) because of a very noticeable stutter during scrolling that crops up when it's running. I don't think I can take stars off the score for that, though. My phone isn't technically on the supported devices list and it may well be a problem with accessibility services in Android 9. At any rate, I'll absolutely reinstall and use this app if/when that stutter issue gets worked out. EDIT: I have just one other app running on my device that uses an accessibility service: LastPass. I imagine it has a bit of overlap with DigiLux in what it's doing, as both of them would have to listen for certain app states, right?", 'I will add another star for the developers effort. it\'s still not where I want it to be because when the notifications are pulled fully down the brightness still goes Haywire when you try to adjust and I often do that when it\'s full screen so it\'s hard to retrain myself maybe you can get to that eventually and I\'ll give it a five-star Review thank you I understand the API issue I hope Google accommodates you eventually or I will give their apps bad reviews all Google apps for making things unnecessarily hard on Developers. Update: I appreciate the detailed response. It may very well be that Google intentionally broke your program cos you embarrassed them by writing an app with features that should be standard but that they can\'t get right, who knows. Or it could be they changed the apis etc.. drastically because they\'re automatic brightness adjustment was totally whacked out in Android 8. If you can fix the jumpiness, ghost adjustments etc.. I will give this app 5 stars I\'m adding a star now for your response but I have to be honest with people here: at present the app is pretty unusable for me as it is, but that\'s thanks to Google I guess. PREVIOUS REVIEW BUT I NO LONGER BLAME THE DEVELOPER: Almost like the guy that wrote this program just wants your fingerprints and then for you to realize it\'s too crappy to actually use, so he doesn\'t have to properly update it. Once you install this "app" nd give it the permissions accessibility Etc it turns your notifications into a jumpy inconsistent haphazard style of navigation with Jitter flaky graphics in the notifications and God forbid you pull down the notifications all the way and then try to swipe left or right on fingerprint censor it does this spooky creepy type of light adjustment that\'s completely inconsistent and almost ghost like. Like it\'s not even you moving the slider. Great idea bad execution. Fix it or get this time waster off of the goddamn store. I\'m on a Google pixel Android 9 pie.', "Wonderful app. I can't go back to not adjusting the brightness with my fingerprint slider. The addition of making it extra dim is a great feature too that I use in bed in the dark. One feature I would LOVE but I'm not sure how feasible it is: the ability to toggle a monochrome filter that can also be triggered through gestures. It's the only thing I'd want to add when making the screen extra dark when reading in bed. Thanks for a great app!", "Looks like a well thought out app, but doesn't work at all on my phone (Nokia 4.2, Android 9). i.e gestures are not detected at all. It also introduces system-wide scroll animation stutter (but not the flick animation, for some reason). Great if it works, useless if it doesn't, hence I'm giving it a score of 50%, or 2.5 stars (rounded up to 3).", 'I was using and loving this app until most recent update. Following this it consistently disables the adaptive brightness setting. It does so regardless of whether the option to restore after turning the screen on and off is checked. Please fix so that I can reinstall! Update: I reinstalled and as soon as I make a brightness change it once again turns off adaptive brightness. Pixel 3 XL 😕 Update: still does not restore adaptive brightness despite numerous reinstalls.', 'WARNING TO Oneplus 5T users (may be applicable to all Oxygen OS users). Once you allow Accessibility service permission to this application your phone TOUCH latency will go crazy. When you scroll any content on screen by holding your finger then you see a lot of JITTERING. As if the screen refresh rate went down to 15 fps. Although, flicking the same content will seem smooth. It took me god knows how many System data wipes to realise its not Oxygen OS at fault but this app alone for the issue.', "The notification shade gesture is very slow compared to the stock Pixel 3 implementation... There is noticeable lag when using the Digilux implementation. So I am uninstalling, even though I like using the left and right gestures for brightness control. Also double swipe gestures are very clunky, had to do it several times before it would take.. kind of feel like I wanted my money upgrading to premium for the double swipe gesture feature since it doesn't work reliabily at all..", 'It still doesn\'t work on mine ☹️ (Android 9, Nokia 7 plus) Edit: Yes, the stock gesture works, and I have all permissions turned on for the Digilux app, but it doesn\'t read any gestures from it (except the stock "swipe down on fingerprint scanner for notifications" ) I also check my developer settings menu, and I noticed that Digilux isn\'t listed in my "Running Services" 🤔', 'Good app , using for awhile only to change brightness. everything was ok until I find out giving accessibility permission (to recent release of app) changes chrome browsers open tabs from preview to url list.kinda weird reaction but its true! turning off accessibility revert chrome browsers tabs. please fix it soon', "It would be more awesome if it could control directions ,I mean cursor ,it should work like touchpad in laptop , Don't mind if you can't do that,it's just suggestion,I am not challenging you,as I am not any developer ,", "I use this app to control the brightness on my Pixel 2 XL and it works great. I do have a bug though that pulls whatever video I'm watching out of fullscreen mode when swiping for brightness. With that bug fixed this is easily a 5 star app for me.", 'Most useful app. With it fingerprint readers (especially on the back of phones) become an indispensable feature! Also volume buttons and power buttons give out, but the fingerprint reader is non mechanical.', 'Loads of customization options to quickly perform actions, than having to tap, swype screens or press buttons. Brilliant, now that all settings have been unlocked for free. Good job.', "While this app is good but There is a serious. When u adjust brightness it kills adaptive brightness and auto adjust sensor don't work well. Which is very frustrating", "Great application if you still have a fingerprint scanner on your device. It's seamless and works when I want it to. Be confident and give it a shot.", "Hi! I use xiaomi mi A2 lite with android Pie and build 10.0.3.0 and it's not working :( do you know what could be the issue? EDIT: now I got the build 10.0.4.0 and still not working...", "Hi Bro,   Ur app is very helpfull for use. But, might be, it make chrome (browser) can't not auto hide addressbar when use. can U help me to solve?!  (I'm us android9 on essential phone)  tks much Bro!", 'hey, your apps is smart.. but one thing, can add swipe to scroll up/down ? i think it will be useful feature.. i will purchase your apps absolutely !', 'works, but lacks the feature I am looking for: lock the phone, and long touch option', 'Does what it is made for. 2 issues: disables the animation when the quick settings panel is expanded, and disables Adaptative Brightness', "Does exactly what's promised. Please include a feature to set scroll option. Thank you for the app, great work.", 'isnt working on zenfone 5 pie update, the accessibility option automatically turns off every time', 'Very good! Brightness Control under Pie is perfect now!', 'Hey tunji the app worked awesome on Android 8.1 but I just got the update to Android 9 and the app does not work', 'before this app was working fine but after updated my phone in Android pie this is not working ... have any suggestions', 'not working on Android Pie. OnePlus 5t - your supposed supported device', "Really promising app but doesn't work on Moto g6 play android 9", "Nice app.But can't be useful for mobiles with back round fingerprint", 'Dose not work on Xaomi A1 after udating to android 9 (pie).', 'Not working on Oneplus 5T with official pie (non beta)', 'One of the most useful app to make ur hardware better', 'dont work on android 9:(( ... it was one of my best installed apps', "Made my oneplus 5t lag, didn't work very well anyway", 'this is great but can we have a scroll feature', 'Love the ad banner', 'Its not working in redmi 6 pro... Help me out.. will give you 5 stars then', "don't not work on Android 9", 'Want it to work on my LG g5. Pls support this device'], 'appId': 'com.tunjid.fingergestures', 'url': 'https://play.google.com/store/apps/details?id=com.tunjid.fingergestures&hl=en&gl=us'}
