{'title': '2048', 'description': "2048 Puzzle Game\r\n\r\n-------------------------------\r\n\r\nThis is the android port of the 2048 game made by Gabriele Cirulli https://github.com/gabrielecirulli/2048               \r\nIt's just a webview that loads the locally stored HTML files of the original game.\r\nNo ads, no permissions required. Just open source. :) \r\nI just wanted to make it instantly playable without Internet and with a quick access icon for my smartphone. It is a bit slower than native code since everything runs in an android webview. If you want you can contribute fixes/speedups here https://github.com/uberspot/2048 \r\n\r\nLong touch for 3+ seconds anywhere on the game if you want to toggle the fullscreen mode.\r\n\r\nYou can view the code here https://github.com/uberspot/2048-android", 'descriptionHTML': '2048 Puzzle Game<br><br>-------------------------------<br><br>This is the android port of the 2048 game made by Gabriele Cirulli https://github.com/gabrielecirulli/2048               <br>It&#39;s just a webview that loads the locally stored HTML files of the original game.<br>No ads, no permissions required. Just open source. :) <br>I just wanted to make it instantly playable without Internet and with a quick access icon for my smartphone. It is a bit slower than native code since everything runs in an android webview. If you want you can contribute fixes/speedups here https://github.com/uberspot/2048 <br><br>Long touch for 3+ seconds anywhere on the game if you want to toggle the fullscreen mode.<br><br>You can view the code here https://github.com/uberspot/2048-android', 'summary': '2048 Puzzle Game. This is the android open source port.', 'summaryHTML': '2048 Puzzle Game. This is the android open source port.', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 4.144479, 'ratings': 54987, 'reviews': 2826, 'histogram': [4581, 2758, 5245, 9948, 32452], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '856k', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Uberspot', 'developerId': 'Uberspot', 'developerEmail': 'onexemailx@gmail.com', 'developerWebsite': 'https://github.com/uberspot/2048-android', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8602241210468462846', 'genre': 'Puzzle', 'genreId': 'GAME_PUZZLE', 'icon': 'https://lh3.googleusercontent.com/1WuAV3KAYHaaVR-_njzGfkSNZlN5N1iBc_CRTsOHngX8TfS9CoYdg2pSVEzs5Ava2cgA', 'headerImage': 'https://lh3.googleusercontent.com/ZSs-n7XrdYg--5P2eJdFHe8P0bJ3gePzCr_ck2Q8_u0VihGcbN0--0ew68Qjy7SYtcGc', 'screenshots': ['https://lh3.googleusercontent.com/OQ2Zx9sblklp7CoLCdIko3zdKkZWqRXCps8gze_b0_91qAZ4gHI3uSRcs37Xqf-cODo', 'https://lh3.googleusercontent.com/Xhn9X4vJ7Z6XIW99yyiqD-PGUlvJvQ5_-BJsSkk55HwJS8K34uQWVK4R3hyh0jFKrdc', 'https://lh3.googleusercontent.com/s0C6bOqKQDux3xbVbiFtvvWZxpkgBUFSMiV-vHKEMsi73LJz86v8equE-UMdQ2Ts8sI'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 14, 2014', 'updated': 1548104202, 'version': '2.2', 'recentChanges': "Version 2.2: \r\n - Bumped minSdkVersion from 8 (Froyo) to 14 (ICS)\r\n - Update changelog library that had breaking changes\r\n - Detect and utilise the phone's system language (thank you BValeo)\r\n - Added Slovenian translation (thank you urmatej)\r\n - Added Czech translation (thank you Mongata)\r\n - Added Italian translation (thank you RyuzakiKK)", 'recentChangesHTML': 'Version 2.2: <br> - Bumped minSdkVersion from 8 (Froyo) to 14 (ICS)<br> - Update changelog library that had breaking changes<br> - Detect and utilise the phone&#39;s system language (thank you BValeo)<br> - Added Slovenian translation (thank you urmatej)<br> - Added Czech translation (thank you Mongata)<br> - Added Italian translation (thank you RyuzakiKK)', 'comments': ['I like the app but the dark mode switch is too hard to trigger. It feels random whether it activates or not Everything else is great', 'Best 2048 mini game just under 1 mb', 'Controls not very responsive', 'Layout on tablets is poor.', 'My highest score is 144468. I like this game and want to improve...', 'Good, very good. No permissions needed', 'Small, ad-free and without any extra permissions. My new favorite 2048 game implementation, but the random generator is not truly random.', "If playing fast, at 2048 I usually unattentionaly choose button 'new game'. Really annoying that you can not undo that. No idea what are benefits of placing that question at all???!", 'Accidential game resets when combined 2048 and swiping while "Would you like to continue" screen not yet visible. Please fix it. It\'s very frustrating to lose progress all the time', "The latest update zeroed out my high score. I had a killer game going too with a 16384 tile, an 8192 tile, and a 2048 tile across the top (love that undo button). I was going to take a screen shot but now I'll just have to start over.", 'Addictively simple yet satisfying. Anyone know the maximum score possible? I got to 131072, but the following day it had reset to zero', 'Now differently broken.  Randomly quits. Very annoying  was:Last update broke it. Now main square randomly jumps up and down.', 'It was a entertaining time killer. But it got a little boring after a wile', 'Exellent! Would be nice to be able to set a night mode ( white numbers on \nblack background) so as not to disturb others at night.', ':/', "It's a gd game but not the best", '2048 and no ads, what could be better than that? :-)', 'I Just Love the Game Thats All', 'It is very good condition with all of our own way', 'My mother and I love this game and this is a brain game.', 'It is a very fun game to play.', 'Basic 2048, no issues', 'Good time spending game', 'Awesome', 'Being able to undo just one move should be enough to correct false moves, 50 is ridiculous and makes the game annoyingly slow. 3 moves and everybody is happy, yes? Oh and the occasional dropping of 4 has ruined many a game. The undo button took me from a high score of 73000ish to 290552 in one game, finally defeated by a dropped 4.', "Since latest update, it's moving very slow.  The animations are fine, but the time it takes from my finger movement to display is too slow.  I was already moving ahead of the animations before, but now I don't even want to play due to the latency.", 'I first became a fan of this game when i got an app that u had to earn coins to unlock diffrent colored lights. How u got coins was to play games and it just happened tbat one of the mini games was this kind of game!!!', 'Good idea. +1 for Open Source.  Edit: Cannot stand blurriness anymore.', 'My daughter (a Mathie)  told me about this game.  I am happy there is an undo button now.  I wish this version were available for the Kindle.', 'Since I upgraded my android this game keeps crashing.', 'Undo feature slows down app', 'Ad free port of the original open source game.', 'good excercise before i go to work..', 'Make the Undo button optional please.', 'Addicting to try to get the 2048  tile', 'Lag city', 'Loved it', '♡♡♡♡♡♡☆☆☆★★★♥♥♥', "You must limit the undo stack...  The game starts slowing down at 20k. It's almost unplayable with 5-6s waiting time between 2 moves...", 'Fantastic app, latest updates (undo and changelog) greatly appreciated'], 'appId': 'com.uberspot.a2048', 'url': 'https://play.google.com/store/apps/details?id=com.uberspot.a2048&hl=en&gl=us'}
