{'title': 'KeePassDroid', 'description': 'KeePassDroid is an implementation of the KeePass Password Safe for Android.\r\n\r\nRead/write support for .kdb and KeePass 1.x.\r\nRead/write support for .kdbx and KeePass 2.x.\r\n\r\nThis application does not have access to the Android internet permission for your safety.\r\n\r\nPlease report issues at https://github.com/bpellin/keepassdroid/issues so I can follow up.', 'descriptionHTML': 'KeePassDroid is an implementation of the KeePass Password Safe for Android.<br><br>Read/write support for .kdb and KeePass 1.x.<br>Read/write support for .kdbx and KeePass 2.x.<br><br>This application does not have access to the Android internet permission for your safety.<br><br>Please report issues at https://github.com/bpellin/keepassdroid/issues so I can follow up.', 'summary': 'KeePass for Android', 'summaryHTML': 'KeePass for Android', 'installs': '1,000,000+', 'minInstalls': 1000000, 'score': 4.0877924, 'ratings': 36560, 'reviews': 11966, 'histogram': [4254, 1804, 2715, 5488, 22296], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Brian Pellin', 'developerId': 'Brian+Pellin', 'developerEmail': 'bpellin@keepassdroid.com', 'developerWebsite': 'http://www.keepassdroid.com', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '6390593845570994188', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/Vy8gAaAozsOnE2wB2Ll4PkVDWrhm5nR4Y5XEwhopBrlbEMypae1_5d4zcN1IDfA_za5v', 'headerImage': 'https://lh3.googleusercontent.com/txV2k_1G3bQkoEU-7tXzFvINLYbleQML74LcHevJjlrqLAmM8Ja4deE1W95Y42R7xg', 'screenshots': ['https://lh3.googleusercontent.com/9fGb-DgAwBf0YVxEZvVr-imDUT3OTCUIAYvbuW-7V7N0XZ7XcdvWhWJldQmiZz7ZsQ', 'https://lh3.googleusercontent.com/H-gBH01B3ZcYcYuOW2IuHSZ6pkMRA2QjxY4aLyXHt1GF9Y5thBwW90RCUX2lSxBhCpg', 'https://lh3.googleusercontent.com/CHXL9NQtNtcbSttMr-kpWBwHaBTT9vM-wKtT8VjFUm6JB_InIc8BwiTPVLO5ZH-RVdhC', 'https://lh3.googleusercontent.com/Y1Ay7YZvxXJ-7SpGIMt2YbdOMFRJpF3BK6kbA-r93VToWRW9bZ0xUD3Ob9lqdcopeNk'], 'video': 'https://www.youtube.com/embed/4lG58DoXH-c?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/4lG58DoXH-c/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': None, 'updated': 1590723445, 'version': 'Varies with device', 'recentChanges': 'Fix biometric password saving', 'recentChangesHTML': 'Fix biometric password saving', 'comments': ["Since yesterday's update (May 25th) opening the database via fingerprint recognition doesn't work anymore (Pixel XL). EDIT - yesterday's update was 2.5.11. I downloaded 2.5.10 from github; it also failed. Then I downloaded 2.5.7; it worked OK. Further EDIT - 2.5.8 works, 2.5.9 fails. New version 2.5.12 fixes the problem. Thanks for the quick response.", "Great app, but please allow us to add a custom time for the timeouts. I'd prefer to be able to pick a longer time for clipboard and application timeouts. 5 minutes is too short for me and I don't want to leave it set to never.", 'Latest update on new moto edge plus (Android 10) no longer works with fingerprint authentication. Hope it can be updated quickly - I use it a lot and the master password is difficult to type on a phone.', 'I use KeyPass on pc for years and was delighted to find an Android app I could use for my phone. A recent extension association bug popped up that not let me open my vault anymore. But it got fixed in no time. Keep up the good work.', 'Since the last update, I can no longer open the database from Dropbox. Great otherwise, but this makes me nervous', "I've used this app for years, across probably a dozen devices from phones and tablets to laptops and desktops. It felt like my right hand. Last week, I used it one morning and it was fine. Later that morning, I couldn't log in through my phone. I tried my laptop. Still no luck. Followed the instructions in the error notification; no luck. I have always used just my master password, never biometrics or key file, and I KNOW I didn't forget my password in just over an hour. DON'T TRUST THIS APP!", 'After Updating its not accepting master password. Kindly please do something. I have used it for many years. I know that I have entered right password as I have written and saved it in my other file. But its not accepting. Its really frustrating after years of using its not accepting original right password. As so many mails written to them but there is no response from their team. Google also should take note of this.', "I've used this app for years and it used to be great. Suddenly it stopped working and now I am completely locked out of all my passwords. I have tried contacting the developer for support, but he has been non responsive. So without support for such important information I cannot recommend this app.", "Dangerous app to use. I've had KeePass for some time. Today I went in and deleted a couple of old entries that were no longer applicable. The app then locked me out, and my password and biometric scan no longer work. I've lost access to all my passwords and I can find no resource to tell me how to get them back. My KeePass file is stored in Dropbox but I can't even get in by clicking the Dropbox file now, which used to be my go-to fix when KeePass previously glitched. I'm screwed now.", 'A must have. The best password manager available on the Android platform. Brilliant app.', "I've been using this app for years & it has been great! Earlier today the DB got corrupted as others have experienced. Tried to revert to my Dropbox version but found it had not sync'd in over a year. 😳 Found DB file on phone & emailed it to myself to access from PC. Downloaded KeePass v1.38 (v2.44 won't work as DB is v1.x) on PC. Under Tools, ran Repair Database File, chose DB, and voila! It repaired it. Copied back to phone & verified it works and syncs with Dropbox. I hope this helps.", "Almost perfect Useful application but with a few bugs 1. You cannot update group name 2. You cannot delete the groups 3. The password field is editable even if you didn't enable the edit option 4. It random disable the biometric unlock 5. Nice to have : the option to backup the encrypted file to Google drive, Dropbox or other services", "Been using the app for years, simple and just worked. Last update corrupted database with cannot log in error. Completely unrecoverable. Had to pull a backup of the database and that worked, but I know it will corrupt it again. Going to be finding a new solution and hoping that I didn't lose to many passwords since my last backup.", 'OneDrive does not work. Still not able to open kdbx file from OneDrive - this was working few weeks ago, before the March version - so before 2.5.8', 'I am waiting for an update which will fix the issue of opening my old dB file having extension. Kdb', "All of the sudden I am not able to access to my file. It kept saying I have invalid password. I have been using this for many years now and it decide to fail on me today. If you are looking for a long term app, don't use this apps.", 'This app is perfect. Free. No ads. Does what it says. I use it in conjunction with the PC version to sync all my passwords. Highly recommend this app above and other password manager!', 'A few enhancements and fixes needed: 1. Please add Auto-fill service. 2. Some devices report Fingerprint problem. 3. Biometric save not working, it says "Invalid Key Problem". If I un-tick this it works using same password.', "Excellent thing. However, I'd love if a feature to upload the key file in g drive or other cloud sites.", 'Was working great until a few weeks ago. However recent update just killed my database. Another user suggested doing a db repair on their pc. Will give that a try but would be nice if developer addressed the issue.', 'Version 2.5.8 has serious bug. Cannot open database with error message "Invalid password or keyfile" . It happen after entry is changed and saved.', "Good password app. Have been using for a few years now. Can't go wrong for an open source app and functionality.", "I've been using this for years with my database in Dropbox. It works perfectly for me. I appreciate that it is open-source, so the code can be reviewed.", 'Happy with the ease of this app. No issues copy and pasting from my database.', 'I get file not found error when I open the file with the app - already for quite long, some time ago it was working.', 'I just donated some money for you. Best app, used by me for years. Great job!', 'hello. biometric login dpesn\'t work for me. when I check "save password with biometrics" I get a next error "Invalid key problem". w/o this check application is working.', 'Difficul to use. It requires manually selecting username and password then copying and pasting into the app you are logging into or retyping. Very clunky.', 'Latest update really messed up the app - "invalid database" errors on a DB that opens everywhere else. Use another app.', "Just suddenly stopped opening my database file. Reinstalled, rebooted, nothing's working right anymore.", 'Great app until this last change with biometrics. I cannot login anymore.', "Database issues all the time. Don't get this app, unreliable.", "I've been using the app for a couple of years and it works well. Nice and clean, no excess.", 'I cannot add or update an account or password from the app, only from web.', "Latest version won't allow me to open at all, please fix it, thanks", 'Big fan of this app. Does everything I need out of a keepass dB reader. Would he nice to add fingerprint unlocking', 'Unfortunately the app stop working some time ago. Thia is ridiculous.', 'Reliable app which I use across all operating systems', "I've been using this for a couple years with minor issues but have been mostly satisfied. Now with the latest version, I cannot log in", "Keepassdroid is a well written app. I use it daily to access my accounts. My only complaint is that the switch to the Biometric API recently implemented requires an extra tap now before it asks for my fingerprint. That's annoying."], 'appId': 'com.android.keepass', 'url': 'https://play.google.com/store/apps/details?id=com.android.keepass&hl=en&gl=us'}
