{'title': 'Ultrasonic', 'description': 'WARNING: There is a problem with latest Subsonic server version. Please visit https://github.com/ultrasonic/ultrasonic/issues/238 for a workaround.\r\n\r\nUltrasonic is a Subsonic (and compatible servers) client to Android. You can use Ultrasonic to connect with your server and listen music.\r\n\r\nMain features:\r\n* Thin\r\n* Fast\r\n* Dark and light theme\r\n* Multiple server support\r\n* Offline Mode\r\n* Bookmarks\r\n* Playlists on server\r\n* Ramdom play\r\n* Jukebox mode\r\n* Server chat\r\n* And much more!!!\r\n\r\nThe source code is available with GPL license in Github: https://github.com/ultrasonic/ultrasonic\r\nIf you have any issue, please post in: https://github.com/ultrasonic/ultrasonic/issues\r\nPlay store icon designed by: http://www.flaticon.com/authors/sebastien-gabriel', 'descriptionHTML': 'WARNING: There is a problem with latest Subsonic server version. Please visit https://github.com/ultrasonic/ultrasonic/issues/238 for a workaround.<br><br>Ultrasonic is a Subsonic (and compatible servers) client to Android. You can use Ultrasonic to connect with your server and listen music.<br><br>Main features:<br>* Thin<br>* Fast<br>* Dark and light theme<br>* Multiple server support<br>* Offline Mode<br>* Bookmarks<br>* Playlists on server<br>* Ramdom play<br>* Jukebox mode<br>* Server chat<br>* And much more!!!<br><br>The source code is available with GPL license in Github: https://github.com/ultrasonic/ultrasonic<br>If you have any issue, please post in: https://github.com/ultrasonic/ultrasonic/issues<br>Play store icon designed by: http://www.flaticon.com/authors/sebastien-gabriel', 'summary': 'Free and open-source music streaming client for Subsonic API compatible servers', 'summaryHTML': 'Free and open-source music streaming client for Subsonic API compatible servers', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.97, 'ratings': 188, 'reviews': 100, 'histogram': [20, 13, 16, 37, 99], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.0M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Óscar García Amor', 'developerId': '%C3%93scar+Garc%C3%ADa+Amor', 'developerEmail': 'ultrasonic@moire.org', 'developerWebsite': 'https://ultrasonic.github.io', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8975783336696288755', 'genre': 'Music & Audio', 'genreId': 'MUSIC_AND_AUDIO', 'icon': 'https://lh3.googleusercontent.com/Q6eOeMK8opg1VWc7aROYuh_-2ngcLc_bwJnIwhpYM0I2aboe-YET_ipU_PdwMt6nre4', 'headerImage': 'https://lh3.googleusercontent.com/ZjU9v1ZClNPM03AA3l3wyGO6AYzunO0EZ2e0WUkPSMbohOv70wvnJDamZiBB_GxrRzM', 'screenshots': ['https://lh3.googleusercontent.com/Dtz51wRqo4zmtSpCJN32C1fFH_DisNFM5wyjuc9dFNehJ5FGk2PFrsYrx2j9K2BVVBo', 'https://lh3.googleusercontent.com/oX9SGXTkXD6NnvyfgmkO-1TRkVafo8bEKTF7tycjFd-kVNKqxWaIBYY4OJpROVCaLEI', 'https://lh3.googleusercontent.com/4UJIAb8ZYDBlb8HiILyGgycFqpLGSZdfdgpOOSwVIbaqOa1ZZLaBmzvDe-CRIY0POA', 'https://lh3.googleusercontent.com/H7Y4PbCibHNePO1P3gtYGFLIb7Wxad7dlLqBb9nAbJ-51RV7mFK2tzNoH639G6Xv0TI'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 26, 2015', 'updated': 1531820801, 'version': '2.5.0', 'recentChanges': 'Bug fixes\r\n    #196: Server API version not detected if UTF-8 BOM is present.\r\n    #199: Bookmarks not working.\r\n\r\nOthers\r\n    Default server settings removed.', 'recentChangesHTML': 'Bug fixes<br>    #196: Server API version not detected if UTF-8 BOM is present.<br>    #199: Bookmarks not working.<br><br>Others<br>    Default server settings removed.', 'comments': ["Fantastic, dare i say perfect app! I'm using it with Airsonic as server. Initially i tried the Airsonic app for the phone to access but it was truly awful.Ultrasonic, as well as browsing by categories, and allowing searches, allows you to explored your database by folder. With 3.6tb of audio archive that is godam essential. Many features and i havent had a skip or dropout yet. Brilliant.", "Confusingly, the version on GIT is the latest, and this version appears to be depreciated; bugs that break it so much I can't use it. Don't bother getting this version from play store, grab the latest GIT commit. I've been a DSub user for a while, but it's lack of development has left it full of bugs, this is the obvious alternative.", "UltraCool! It works with airsonic. If it can't find my server then it shuts down the app. This bug is a little annoying because it tends to block me from accessing server settings. Not a deal breaker! but not quite 5 stars ;) Good work!", 'Intermittent issue with connectivity to both local and remote Airsonic servers. When error occurs, pretty much locked out of app even after clearing app cache. However, I tried version 2.6.1 and seems to get me around the issue. Works well with Airsonic!', 'With this latest update can\'t connect anymore to my subsonic server. Get error all the time. "Connection failure. A network error occurred. Please check te server address." With official app connection is flawless. Please fix it, love this app, untill update had no problems like this.', "Development is technically dead. almost no updates in a whole year, and SD card access isn't functional. I like the UI more than Dsub but as-is without sdcard support the program is useless to me.", "Actually works! For some reason Let's Encrypt is not recognized as valid, but the app has an HTTPS override for that. plays in the background!", "Works well but hasn't been updated in a year and Android 10 has started having issues with running the app.", 'I have only problem with sdcard, no write permission and no access menu. More info on GitHub.', 'How can i get the app to use SDCARD as the cache location for Music?', "Very good app overall, but using LG phones, I installed the MusicFX app to open up the built in Android Sound FX. Unfortunately, Ultrasonic doesn't have a means to get to the Android Sound FX in order to modify them so I'm stuck with the basic MusicFX setting and can't modify it. Had to uninstall MusicFX.  Also, not able to change cache to SD card which has MUCH more space on it.", "Having trouble getting connected with the 6.1.4 server update. Also, when it doesn't connect the app crashes instead of letting you change the settings.", 'Greap app. i just wish it had the option to manage/edit playlists and it would be perfect.', 'Sleak UI, works well with airsonic.', 'So awesome!', "Works about as well as the default app, but suffers the same issue I hated \nabout it. It will not show the player controls on the lock screen. Android \nflags its content as sensitive and hides everything. Changing the order of \nthe current playlist is difficult, I often remove a song as I'm trying to \nmove it. I can't press undo like some other apps in case I made a mistake.", "Love this app, but has caused hard reboots randomly for the longest time now, I'll supply log data or anything needed to finally get it stable.", 'No Chromecast support.', 'Works great! Responsive developer.', 'This is the best damn music player there is. If only it would play my cached songs even when offline.', 'So far this is the best player that I found for my Airsonic server. Though I still miss two features, Android Auto support and the possibility of selecting media library folders like in the official Subsonic app.', "The best for the ***sonic lines. I'm using Airsonic as a server and it's awesome!", 'Simple, fast and does the job. Only one bug I can see is that when you want to quit the application completely, the notification tends to get "stuck" and no matter how often you press that X, it just stays there and will not shift.  Still, it\'s the best subsonic app I\'ve used. (Though I\'m using Libresonic!)', 'Works great on goole pixel, connecting to libresonic container on linux docker. Great work, recommended for E.', 'Are you adding follow me mode? Android Auto?', 'Great app, but does anyone know a fix for the shuffle glitch?  It resets the playlist every time the phone is tilted or the screen is turned on/off...', 'This app is good.  Would be great but skips bad on LG phones (like mine)', "Would be nice if this app asked for write permissions, as is now supported on Android M. Cache settings feature is available but doesn't work.  No way to Grant permissions to write to the SD card, because it doesn't ask permissions in a modern way.", 'Still not fixed!!!  Cache location does not works on Nougat!!! . "/storage/????-????/Music" as i understand it has it root back to kitkat. A checkbox /sdcard/Music would be nice.', "It's simple, it works for my needs (just play my music from my server). No ads. No bull.", 'Thank you.  Simply the best option.', "Best android app for Subsonic. Don't like that you took the Star icon/function and playlist toggle away from the now playing screen and placed them exclusively in the context menu with the new update. This makes it easy to accidentally unstar a song since you can't tell if it's starred from the now playing album cover screen.  Also would be nice if the player included the album year in the song info.  Minor nitpicks. Overall a great app.", 'Love it!', "Coming along nicely. Would like to have 'random play' within folder, genre or artist. Unfortunately,  it seems that development on this app has stalled. Pity.", "Very nice all wondering if you could add local up address to server config. So when I'm on my home WiFi it uses that and when I'm out it uses the main. DSub has this option.", 'So far no complaints. I would like to see a better random playlist creation, and ability to download said playlist to cache so you can avoid data costs by loading it up on Wi-Fi. Good otherwise. Cheers', 'love it its a great subsonic app great to see it back in the google play store updated and taken care of again :)', 'Please, please, please add Chromecast support. ;)', 'reboots my phone at random times', "So glad it's back.  Awesome."], 'appId': 'org.moire.ultrasonic', 'url': 'https://play.google.com/store/apps/details?id=org.moire.ultrasonic&hl=en&gl=us'}
