{'title': 'BeHe Keyboard - Programming & More', 'description': "With BeHe Keyboard you can enjoy programming and using special keys (such as CTRL and ALT) on your android device without forgetting the design.  You can switch between keyboard faces with a simple press of a button, so it's easy to use BeHe Keyboard as your main keyboard. The app features three keyboard faces (QWERTY, so you can use it for regular typing, Arrow Keys, so you can use it in the terminal, and Programming for, well, programming). There are multiple themes for the app with more to be added in the future. You can also select which keyboard to display first. \r\n\r\n\r\nAlso, BeHe Keyboard is fully open-source, so if you think that this keyboard is spying, go check the source yourself.\r\n\r\n\r\nNEW! BeHe also supports AZERTY layout and emojis.\r\n\r\n\r\nFollow me on twitter: https://twitter.com/VlathXDA\r\n\r\n\r\nCheck the source code: https://github.com/VladThodo/behe-keyboard\r\n\r\n\r\nContributors:\r\n- seigneurfuo (AZERTY layout)\r\n- timkrief (AZERTY layout)\r\n\r\n\r\n\r\n\r\nFor any feedback or complaints about this app, please send me an e-mail.", 'descriptionHTML': 'With BeHe Keyboard you can enjoy programming and using special keys (such as CTRL and ALT) on your android device without forgetting the design.  You can switch between keyboard faces with a simple press of a button, so it&#39;s easy to use BeHe Keyboard as your main keyboard. The app features three keyboard faces (QWERTY, so you can use it for regular typing, Arrow Keys, so you can use it in the terminal, and Programming for, well, programming). There are multiple themes for the app with more to be added in the future. You can also select which keyboard to display first. <br><br><br>Also, BeHe Keyboard is fully open-source, so if you think that this keyboard is spying, go check the source yourself.<br><br><br>NEW! BeHe also supports AZERTY layout and emojis.<br><br><br>Follow me on twitter: https://twitter.com/VlathXDA<br><br><br>Check the source code: https://github.com/VladThodo/behe-keyboard<br><br><br>Contributors:<br>- seigneurfuo (AZERTY layout)<br>- timkrief (AZERTY layout)<br><br><br><br><br>For any feedback or complaints about this app, please send me an e-mail.', 'summary': 'Programming & Hacking. Now in material design', 'summaryHTML': 'Programming &amp; Hacking. Now in material design', 'installs': '5,000+', 'minInstalls': 5000, 'score': 3.9, 'ratings': 128, 'reviews': 86, 'histogram': [15, 3, 15, 37, 56], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '1.0M', 'androidVersion': '4.3', 'androidVersionText': '4.3 and up', 'developer': 'Vlad Todosin', 'developerId': 'Vlad+Todosin', 'developerEmail': 'vladtodosin@gmail.com', 'developerWebsite': 'https://twitter.com/VlathXDA', 'developerAddress': 'Hunedoara, Romania 337532\nWill provide full adress on request', 'privacyPolicy': None, 'developerInternalID': '8045902168613247622', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/z1MK_BUYXDecrQdie6BkUzl0zPpqktALZT3-zoWG5GnyepuiQ4pHPm7KIIT_48mUCw', 'headerImage': 'https://lh3.googleusercontent.com/vkI-hshFboX5L6x7dzBrAL-Zuyw36t00Ii8p00RwnQAQgZc2_XT0zfhyMmKPs2v57To', 'screenshots': ['https://lh3.googleusercontent.com/vsTCTICs9gtTfJotj5zb1mZawgH3CEY_m8Dtppk7QUu3jVeIGqF1Vs9taFh4lCVp9A', 'https://lh3.googleusercontent.com/0kL5zvLUuSfKPovgQDR0KjJ6gJrpUyOgl1Z5wQfLoKkL2HpwfhqJ5X8GqRVm4TfCpVM', 'https://lh3.googleusercontent.com/-EqZ-FexUzaPQBuzZ5h9iNatWwAwkYE-RjqL8CvVU9lc-LWSxn2IG5uAFEub93-ATg', 'https://lh3.googleusercontent.com/ezirmAGOFY6mD8FdWomTb_qM6pJS-KW8MOs6fQvzQFZauZ529uG1fk2DnM1ZsG7zOQY', 'https://lh3.googleusercontent.com/arwYkhX_30OXmStUMive65VdwDIicGrauRBzCaz5rNLgMv_XUL4RkAH3amO5CHRPC2E', 'https://lh3.googleusercontent.com/tIKz3fe2K8Yh2__n65tMb_b72wnKyhROEFkPnADOm3wdEFEPTTcjisu7utirTd17sO4', 'https://lh3.googleusercontent.com/wu2eCK8LZfVx37Ls-YpSRYWVIOhZFBDL1TLsmxRF2K0mIOymwLXcLEl0bhiU5pv1vFY', 'https://lh3.googleusercontent.com/PigubZpV_EjH2jElGs2b0kaD-c-R3jVx9LmeZLvfmxsbpG3fA0_UrKN2__n5L_IzpNs', 'https://lh3.googleusercontent.com/OsRnB6EV2mlAcLqtW0Aw867Iy3Y4KlGPpvBC4D_7CQC3FupY_kFCvJr4A8yNLVqHTQ'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 10, 2017', 'updated': 1521383216, 'version': '1.1.3', 'recentChanges': '• AZERTY layout\r\n• Emojis!\r\n\r\nEnjoy!', 'recentChangesHTML': '• AZERTY layout<br>• Emojis!<br><br>Enjoy!', 'comments': ["It is very promising. I am writing this with your app. However, I cannot use it constantly, because it does not have german,french,romanian layout. I like the big squares and I think you could made the characters inside look better by bolding them and tweaking the size a bit bigger. Inside the screen where are the lovely arrow keys,ctrl,alt there is room for Home and End keys. Also the Capslock does not work for on|y big letters(if you want to write only big letters,y have to press the caps lock for each letter). I appreciate very much the fact that this app is open source, and has minimal permissions required. If you want to get yourself inspired, search for the complete app Hacker's Keyboard(on GitHub) which is way better than gboard,but unfortunately it was removed from Google Play.", "I think this is currently the best programming keyboard on the play store, but I have an issue with custom keyboard height. Every time I shifted on numbers and symbols page, the height somehow reset to probably the default height, it can be quite annoying while using the standard keyboard. Other than this minor problem, it's still a solid keyboard that does its job. Though I hope you could find the time to look into it. Thank you.", 'The shift key seems to be broken. Instead of changing to capitals mode, it switches between different keyboard layouts (symbols, etc).', "It's almost perfect , expect for one thing, the emoji keys is a mess. :( I would rate this 5 if the emojis are fixed. No more other flaws, except for the emoji that look likes codes instead of emiloji. Still very impressive tho. I hope it gets fixed.", 'This keyboard is really good, kindly add greater than and less than button.', 'Least performing keyboard I have ever used. Minimal functionality, antiquated features, clumsy responses, too basic, uncivilized, primitive. Bland themes lacking any creativity whatsoever. A disappointment, to be generous. GBoard, Lastpass keyboard and others, leave these Open Source keyboards far in the dust.', 'For basic keyboard, this wins. Also seeing app crash after single character input if predictive selection is enabled. Runs as it should w/ that feature disabled.', 'Cute, but rather useless. Still, a major plus : no ads.', 'Enabling text prediction crashes the app.', 'amazing!!! Best keyboard for programing!', 'Best open source keyboard', "I stalled and the space bar wouldn't work.", 'where are the greater and less than signs?', "You out auto caps but not double space period. The car starts! But it doesn't drive.", 'Simply amazing! Thanks man!', 'Theres no escape key', 'I like the looks and functionality. The crash also occurs on android p btw, \nbut only with autocorrect turned on', 'Amazing. A beautiful keyboard for usual texting and great for coding in programming code. The one feature I am missing is choosing how strong and long the vibration is (the key click vibration)', 'Same issue - crash when auto capitalisation is on. Sometimes keyboard \ncovers the text box. Maybe just with addes number buttons to normal layout? \nOtherwise good.', 'Le faltan mejores opciones a la hora de escribir y el auto-corregir errores en ESPAÑOL, los puntos que estan en la parte inferior izquierda molesta mucho.', 'Everytime I press the "Ok" button in the Arrow layout the app crashes.', 'Would definitely use it but it crashes after I type a single letter \n(Android 8.1)', 'keep crashing on keypress.. plz fix it', 'Programming keyboard without the escape key, are you kidding me?', 'A great lightweight keyboard and would propably be my daily driver if it \nhad a nordic qwerty layout.', 'From where we get emoji in this keyboard.', 'crash', "Keyboard stopped typing after an hour. The numbers mode key is super awkward. There's also no keypress popups like on the AOSP keyboard. But, it is open source and has arrow keys which is awesome.", 'Really like the no track concept but need some work (problems with accents, not all are displayed, and some letters are hard to find). Hope in some future improvements.', 'Looks good but crashes after I type one character.', 'world of abdroid was lacking it,and u created it,u heavenly angel', "I think I'm in love. Finally something on my phone with numbers and arrows AT THE SAME TIME!", 'Nice keyboard for programming', 'Works perfect', 'good idea but is it possible to make it height adjustable? Also didnt see the underscore key, which is a big draw back for me. everything else was pretty great. good app!', 'Exactly what I was looking for. Essential for coding. Good work, Vlad!', "First properly good alternative keyboard to Google's?! Yay! couple of requests for features: * When pressing shift with the number row enabled, switch to showing corresponding symbols * Auto capitalization after not just periods, but new lines too (and other punctuation such as !?:) * Toggleable pop-ups of the key you're hitting, helps me a lot * And lastly, bare-bones auto-correction (mostly just for punctuation, youre -&gt; you're, theyre -&gt; they're, Im -&gt; I'm, Ill -&gt; I'll.. go as crazy as you want without hurting performance too much ;) Thanks a bunch for this app!", "Sounds good, doesn't work... Keyboard closes upon keypress immediately. Makes keyboard unusable", "Great keyboard...i love the concept of a beatified programmers keyboard with easy access to the extra keys for phone users. One concern though, i could find the '&lt;', '&gt;', '_' keys...all of which are vital.", 'Much better than stock Samsung keyboard. Open source code hosted on Github. Exactly what I was looking for.'], 'appId': 'com.vlath.keyboard', 'url': 'https://play.google.com/store/apps/details?id=com.vlath.keyboard&hl=en&gl=us'}
