{'title': 'HTTP Request Shortcuts', 'description': "Place shortcuts (widgets) on your home screen to submit HTTP requests to all your favorite RESTful APIs, webservices and other URL resources. Great for home automation projects!\r\n\r\n- HTTP and HTTPS\r\n- GET, POST, PUT, DELETE, PATCH, HEAD, OPTIONS and TRACE\r\n- Basic Authentication, Digest Authentication & Bearer Authentication\r\n- Custom request headers\r\n- Custom request body (text only)\r\n- Upload files as form-data\r\n- Option to accept all certificates (if you know what you're doing)\r\n- Support for HTTP proxies\r\n- Built-in icons, support for Ipack icons and custom icons\r\n- Display response as a toast, window or dialog, or run silently\r\n- Grouping into categories through tabs\r\n- Value injection through variables (e.g., text, numbers, passwords, selections, colors, dates, …)\r\n- Run arbitrary JavaScript before & after execution, including special actions (e.g., vibrate, show toast, parse and process response…),\r\n- Import & Export in JSON or cURL format\r\n- 3rd party integration (e.g. Tasker)\r\n- Themes (with Dark Mode support)\r\n\r\nSome ideas what to use HTTP shortcuts for:\r\n- Execute a script on your web server\r\n- Control your home automation system and IoT devices\r\n- Interact with your RaspberryPi and Arduino tinkering projects\r\n- Automate workflows\r\n\r\nThis app is open source, find it on Github: https://github.com/Waboodoo/HTTP-Shortcuts. It's also completely free and contains no ads, because who wants those anyway.", 'descriptionHTML': 'Place shortcuts (widgets) on your home screen to submit HTTP requests to all your favorite RESTful APIs, webservices and other URL resources. Great for home automation projects!<br><br>- HTTP and HTTPS<br>- GET, POST, PUT, DELETE, PATCH, HEAD, OPTIONS and TRACE<br>- Basic Authentication, Digest Authentication &amp; Bearer Authentication<br>- Custom request headers<br>- Custom request body (text only)<br>- Upload files as form-data<br>- Option to accept all certificates (if you know what you&#39;re doing)<br>- Support for HTTP proxies<br>- Built-in icons, support for Ipack icons and custom icons<br>- Display response as a toast, window or dialog, or run silently<br>- Grouping into categories through tabs<br>- Value injection through variables (e.g., text, numbers, passwords, selections, colors, dates, …)<br>- Run arbitrary JavaScript before &amp; after execution, including special actions (e.g., vibrate, show toast, parse and process response…),<br>- Import &amp; Export in JSON or cURL format<br>- 3rd party integration (e.g. Tasker)<br>- Themes (with Dark Mode support)<br><br>Some ideas what to use HTTP shortcuts for:<br>- Execute a script on your web server<br>- Control your home automation system and IoT devices<br>- Interact with your RaspberryPi and Arduino tinkering projects<br>- Automate workflows<br><br>This app is open source, find it on Github: https://github.com/Waboodoo/HTTP-Shortcuts. It&#39;s also completely free and contains no ads, because who wants those anyway.', 'summary': 'Submit HTTP Requests from Shortcuts on your Home Screen.', 'summaryHTML': 'Submit HTTP Requests from Shortcuts on your Home Screen.', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.52, 'ratings': 1006, 'reviews': 543, 'histogram': [60, 40, 20, 80, 804], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '4.2M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Waboodoo', 'developerId': 'Waboodoo', 'developerEmail': 'android@rmy.ch', 'developerWebsite': 'https://http-shortcuts.rmy.ch/', 'developerAddress': None, 'privacyPolicy': 'https://http-shortcuts.rmy.ch/privacy-policy', 'developerInternalID': '9181622880082024576', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/LoWUvfHd2Cae7fle8KCYfMfGloZBN7BWcHZFybYe73TosMBpOe0dQMBv1dwJ-0qyqA', 'headerImage': 'https://lh3.googleusercontent.com/ZxbDEhjRPa7wbY9ZdSAtIwWdt7eoaTxnUlSo4kIaOT05PhzdEzkxsxSlZEx9CPHKuKaf', 'screenshots': ['https://lh3.googleusercontent.com/vphbxBeeipKsEdS1Cs1eMPnIrkxPzUe4HklI6kSCVMcb2CN-HC-lzM8gJlsvH1JzxA', 'https://lh3.googleusercontent.com/BUevv_vyVitmZkKBPWVrCaR7jWd0vOTFYDt7SoCu-IO9VVmDKzbqCGnlM-EcT74YWTyv', 'https://lh3.googleusercontent.com/WrUyITua5p9AlwkGuL_rjbQh32Jv2g1EI9KNxlkGBepv_obltGrW4E3l73z0kr-Lzw', 'https://lh3.googleusercontent.com/9UqmU-4b8f2U7ZwOWKQ0N0sl2EO01GiBC0GkaMHClJlkInHVchlf5PLhFJ39sAFZIx0', 'https://lh3.googleusercontent.com/L4sxQjjhNDLQKg072wbds6-XaTNgLLxTDeC576TAR1omAghH5PzmsYk7az8DxzdKqlo', 'https://lh3.googleusercontent.com/dyPJlADYO3fkRraY0--DErb30JvuhfUwsn8dKy9d-d_--h7lrgisggLoqel3KnaXnf7G', 'https://lh3.googleusercontent.com/HppX9X5-7iPQomZRhXqCieQwxDg0cePqiQ_f2N93UaCNUINguh9Cb-ZhlRoPcrBTM3g', 'https://lh3.googleusercontent.com/jWsew4Vi85Hn6flMd0ZxxK0EAnZbKU6Cyt_xmLugKPcJwdPHDk3UOsIgFHEZwAQD-YE'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Apr 19, 2015', 'updated': 1591544704, 'version': '1.32.1', 'recentChanges': None, 'recentChangesHTML': None, 'comments': ["Great App. There aren't any good functioning apps for Pi-Hole at the moment. With this app I was able to create widgets that send a POST to turn on or off ad filtering. The ability to create the widgets with this app is my favorite ability it has. I love that no apps need to open with them, I just get a little toast that says Pi-Hole disabled or enabled.", 'Finally an app that can handle the simple task of making a curl request when pushing a home screen widget. Thank you! Tried some automation apps but none of them worked as I wanted. But with this app all it takes is a tap on a home screen widget and the curl request gets send. No hassle, no unnecessary hoops to jump through', 'This is a marvelously flexible and well thought out app. Ideal for simple experiments, Tasmota tinkering and the like, but the more you use it, the more you realize you can do with it. We need more developers like this.', 'as we say in the u.k: "ronseal - does exactly what it says on the tin". i wanted a nice, friendly-looking way to send cURL requests from my \'phone. brilliant. especially tapping import from curl and simply typing my request to see what fields in this UI got populated and why', 'It is amazing tool. I have just finished kind of easy task management tool which suits my purposes, bud there was one question: how to share ideas to my app from phone. Here is solution. Nice. Looking for some donation link.', 'Works just great. Handy widgets for easy API access.', "Was working great with curl to Energenies Mihome servers but since the update 2 days ago it no longer works at all.. Hope it'll be fixed soon. Email sent, I hope it helps. Been really good up until this blip. Added a star for the quick reply :) UPDATE Just downloaded v1.26.1 from github and apart from not allowing import the data from newer now removed app after I recreated the shortcuts they are now working so looks like a bug in the update, well the tiny bit that I use. 2nd UPDATE Developer has been REALLY helpful, tracked down the problem and will be fixed in an upcoming version, if you have a similar problem to mine check out the github page and get v1.26.1 as that seems to work ok. I'd really like to thank the developer for troubleshooting and sorting this so quickly.", "Extremely functional app, I used it today to create a shortcut that allows me to generate itunes music's links from Spotify just by hitting share. Limitless potential. Kudos to the developer.", "This works flawlessly, is really easy to use, and it's free with no ads. Can't ask for more! I've been using it for years for my home automation. Love opening my garage door with my phone!", 'Very good launcher. For shortcuts to websites the original icon can be displayed.', 'Exactly what I wanted. Works perfectly', 'I use this to control appliances I have made as well as other home automation. If you are looking to make rest calls from your phone, look no further!', 'just perfect !!! for my custom home automation triggers handles: - variables to not repeat stuff for several icons - pre/post actions - customizable feedback (toast, etc...) - confirmation to run a sensible action - highly customizable with custom scripts. - and fully open source to be confident. Great job !!!', 'Thank you for what you have given us. Exactly what I was looking for. The bonus feature that delighted me was the variables option. As a fellow developer, I have a small suggestion to improvise on it. You can give an option to set the variable while executing a shortcut. for example, I am using a shortcut to turn on my AC via smart devices. The AC temperature is one of the body params. If I get an option to send the temperature variable value everytime I execute the shortcut, it will be helpful.', 'Amazing, just what I needed to make web requests', "Just noticed that most of my shortcuts no longer work. I think this might be to do with implementation of javascript as pre/post actions. I was sending a GET command and then setting a variable and triggering a sequence of shortcuts, all to control an internet radio. Have tried lots of things to nail down what's going wrong. Variables are being set and read and shortcuts are being triggered I think possibly not in sequence or timing out? Unfortunately, the app is no longer useful to me.", "This is the best app I've used in a long time. It has a LOT of options and is built very, very well. It'd be great to see a basic comparison function. I'm currently using this with a horribly built API - the API always returns 200 even when there's an error and instead the user needs to parse the response body to figure out whether there's an issue. If I could compare a string instead of just updating a variable, that would be helpful. Or some way to specify what constitutes a failed req", "privacy policy says no data is collected or sent to dev or 3rd party except to bugsnag for crash reports. i can confirm with Lumen that the device build fingerprint is sent to bugsnag prior to a crash and even before you have time to go in and disable crash-reporting in the settings! there are other apps out there that perform the function of this app without sending your device's private data up without consent. to the dev/s: promise me the app will not do this in future releases i may try out.", 'this app is a must have when working with Arduino esp chip or php. it allows you to make a simple app to talk to devices with get / post commands and has a lot under the hood if you like to dig in and get more complex.  One feature i would like to see is an option to have it download a new config file from a web server ether on start or by clicking a button. i have a automation setup and when i make changes its a pain to send the new config to each device and import it.   anyway thanks for the work you have put into this app and making it open sourced!.', 'I would have liked to find a forum to ask questions, because I am probably missing something, but to me the app is completely unusable. When trying to add a shortcut via curl command, for example, I see no way to save the command once I type it in. If I just use "back", it doesn\'t save the shortcut. Even when editing a "regular shortcut", I have no clue how to save the "basic request settings" info. There is no "save" button, and if I just go back, I return to the main "create shortcut" menu, and the URL I typed in isn\'t saved in the "basic request settings"... I must have typed this URL a hundred times now. This is so frustrating.', 'really great app, thank you😀 pretty much perfect and reliable. if I could wish for one more feature it would be, shortcut made out of a widget, wich always shows the last response happened (text and linefeed only), right on top of the icon. oh, mDNS would be a real milestone..', 'I replaced the buggy tasker HTTP calls with this app, and it works wonderfully! Works even on my Android TV with the sideloaded APK from the Github project page. I would like 2 changes : make it visible in Android TV play store, and use Materials Design Icons (mdi:xxx). Keep up the good work!', "This app does exactly what I needed it for. I recently purchased a Particle Photon and the four relay board. I uploaded the 3-internet-relays.ino with RelayShield.h. Since I'm fairly new to the whole phone controlling my Arduino thing I did have a misunderstanding setting the app up. But a few trial and errors and I have it working. I needed to install the access_token and the arg parameters in the tab: Request Body/Parameters. (I was had put them someplace else It worked great after that.", 'Doesn\'t work with Android 9.0 pie. If you set a shortcut (widget) up as "default" it does nothing. If you set a shortcut up as "legacy" it will do nothing but then once you open the app it will execute. So yeah shortcuts in the app work but the widgets do not on Android 9.0. works on older version of Android. Developer just needs to update the app to get widgets working again', "Didn't work on my Google Pixel 3 running Android 10. I could create entries. I could not add them to my home screen as shortcuts", 'Honestly, I can hardly believe an app like this exists. It does exactly what I need to make calls to my arduino to turn outlets on and off straight from my home screen and very quickly. Fantastic and easy to use app.', "I've only had a brief play so far, but can already see this is fantastic. User friendly, with all the options you might want. Such a simple idea for an app, with practically endless possibilities for the user. Great job!", "Fantastic app! I found it to be very easy to use with a clean interface and design. I'm now able to get the customization I've been looking for. The developer was responsive and helped me get great results.", "Works great. It allows me to create shortcuts from URLs. I can use a custom icon or a shortcut from an icon app. It them lets me add it to my launcher widget. It's what I needed!", 'Intuitive UI with zero learning curve. There is an option for desktop shortcuts! Highly customizable request execution flow and seems it to cover all I can think about. A dark theme would be a nice addition!', "Great, can't ask for more from a free app. It does what I need - POST and GET API calls (and a hell of a lot more) and was simple for a non-dev like me to work out how to configure API's", 'Do one thing and do it well. Just what I was looking for.', 'Super functional application! Supports variables, scripts, etc. Highly recommend! Also it would be great to have auto-incrementing variables and variables like timestamp, GUID, random number in some range, etc', "Brilliant maker tool. I use this to send commands to Arduino projects, both for program functions and debugging. It's easy to use.", 'Fantastic app and I found it reasonably intuitive to use. It would also be great if there was a way to put the created shortcuts onto a smart watch.', 'Fantastic app. Simple, fast, functional. Been using it for DIY IOT projects and it works great. Dev even fixed a bug for me.', 'How to make a POST request with form-data key value pairs? I am using postman in my system for API testing; and it will be nice, if the app contains an option to specify form-data key value pairs with a user friendly UI for GET and POST requests. Anyway is it available with custom headers?', "Found this app after a long painful search. I use this to add mobile support for my personal automation projects (with no code :D). It's been working great!", 'Love it for controlling my home automation. The ability to set variables from a response an use it in other requests makes it great for systems that use CSRF protection.', 'Superb, simple and does exactly what i need. No clutter interface and plenty of options.'], 'appId': 'ch.rmy.android.http_shortcuts', 'url': 'https://play.google.com/store/apps/details?id=ch.rmy.android.http_shortcuts&hl=en&gl=us'}
