{'title': 'Text Fiction - Play Zork!', 'description': '<b><u>SYNOPSIS:</u></b> TextFiction - An interpreter for interactive fiction stories (aka: terp, z-machine, text adventure engine, interactive book reader)\r\n\r\n\r\n\r\n<b><u>DESCRIPTION:</u></b>\r\n\r\n<i><b>West of House</b>\r\nThis is an open field west of a white house, with a boarded\r\nfront door. There is a small mailbox here. A rubber mat saying \'Welcome to\r\nZork!\' lies by the door.\r\n\r\nWhat next? >_\r\n</i>\r\n\r\nWith interactive fiction novels you\'re more than just a passive book reader, following the adventures of the hero. Instead, you become the hero! Explore the world, make decissions and ultimately decide on the outcome. IF stories are fun for hours, immersive as hell and play at your own pace, making them the ideal pass time for a long road trip and short work breaks alike.\r\n\r\nTextFiction is definitely the best adaptation of the genre available for Android. You control the protagonist through a novel SMS like interface which replaces the need for typing commands with intuitive touch controls. Users of chat apps will instantly feel at home! The barrier-free design also makes this app the perfect choice for users with disabilities.\r\n\r\nHundreds of free RPG stories from dozens of literature genres (sci-fi, fantasy, mystery,... ) are available for download, ensuring entertainment for months to come. You can\'t get more offline games for free in one single app!\r\n\r\n\r\n\r\n<b><u>FEATURES:</u></b>\r\n* Supports z3, z5 and z8 z-machine games (may be wrapped in zblorb), no glulx\r\n* Unique, instant messanger like user interface\r\n* Configurable action keys to cut down on typing (long press to modify).  \r\n* Tap words in the story to copy them into the commandline. Double tap to clear.\r\n* Nightmode and classic Terp mode ("Lucy", "Mina" and "Jason" colorscheme)  \r\n* Optionally uses the Text To Spech engine to read stories out loud (long touch a bubble to start/stop narration).\r\n* Touch sensitive borders/corners for moving in the designated cardinal direction (may be fiddly on small screens).\r\n* Saving/restoring progress (including autosave when navigating away from the app)\r\n* A real battery saver due to low power consumption and no ads (TextFiction is one of the few games that don\'t need wifi).\r\n\r\n\r\n\r\n<b><u>FAQ (please don\'t abuse the reviews as a support forum!):</u></b>\r\nQ: I\'m new. What\'s an interactive story?\r\nA: Have you ever read a novel and longed for taking part in the plot yourself? Interactive stories allow you to do exactly that. Textfiction is like a fanfiction reader (a library app for free books) that only describes to you the setting, but allows you to choose your own actions, often resolving in alternative endings.\r\n\r\nQ: Are the games free?\r\nA: Textfiction itself free to play. Most of the interactive novels are in the public domain and may be downloaded free of charge to your library.\r\n\r\nQ: How do I save/restore a game?\r\nA: Press the "Plus" button to bring up the menu. Save/restore commands won\'t work.\r\n\r\nQ: Do I loose my progress when going back to the libary app?\r\nA: No! Whenever you leave the story screen, the game performs an auto save. It does not, however, perform an autorestore when you return (leaving the game is suppose to be a reset).\r\n\r\nQ: Why is the story output erased when I restore a game?\r\nA: When you restore a game, you move to another part of the story. The current chat history no longer applies and gets discarded to avoid confusion.\r\n\r\nQ: Can I change the action buttons?\r\nA: Yes! just write something in the commandline, then long press a button to modify it.\r\n\r\nQ: Can I write my own fanfiction stories?\r\nA: Yes! The authoring tool of choice can be found here: http://inform7.com\r\n\r\nQ: Why does my bluetooth keyboard repeat the enter key?\r\nA: Text Fiction comes free of charge. Unfortunately, this means no budget for buying troublesome hardware in order to check the problem out.\r\n\r\nQ: Will a 1* rating convince you to change the app according to my whims?\r\nA: Go kiss a Grue', 'descriptionHTML': '<b><u>SYNOPSIS:</u></b> TextFiction - An interpreter for interactive fiction stories (aka: terp, z-machine, text adventure engine, interactive book reader)<br><br><br><br><b><u>DESCRIPTION:</u></b><br><br><i><b>West of House</b><br>This is an open field west of a white house, with a boarded<br>front door. There is a small mailbox here. A rubber mat saying &#39;Welcome to<br>Zork!&#39; lies by the door.<br><br>What next? &gt;_<br></i><br><br>With interactive fiction novels you&#39;re more than just a passive book reader, following the adventures of the hero. Instead, you become the hero! Explore the world, make decissions and ultimately decide on the outcome. IF stories are fun for hours, immersive as hell and play at your own pace, making them the ideal pass time for a long road trip and short work breaks alike.<br><br>TextFiction is definitely the best adaptation of the genre available for Android. You control the protagonist through a novel SMS like interface which replaces the need for typing commands with intuitive touch controls. Users of chat apps will instantly feel at home! The barrier-free design also makes this app the perfect choice for users with disabilities.<br><br>Hundreds of free RPG stories from dozens of literature genres (sci-fi, fantasy, mystery,... ) are available for download, ensuring entertainment for months to come. You can&#39;t get more offline games for free in one single app!<br><br><br><br><b><u>FEATURES:</u></b><br>* Supports z3, z5 and z8 z-machine games (may be wrapped in zblorb), no glulx<br>* Unique, instant messanger like user interface<br>* Configurable action keys to cut down on typing (long press to modify).  <br>* Tap words in the story to copy them into the commandline. Double tap to clear.<br>* Nightmode and classic Terp mode (&quot;Lucy&quot;, &quot;Mina&quot; and &quot;Jason&quot; colorscheme)  <br>* Optionally uses the Text To Spech engine to read stories out loud (long touch a bubble to start/stop narration).<br>* Touch sensitive borders/corners for moving in the designated cardinal direction (may be fiddly on small screens).<br>* Saving/restoring progress (including autosave when navigating away from the app)<br>* A real battery saver due to low power consumption and no ads (TextFiction is one of the few games that don&#39;t need wifi).<br><br><br><br><b><u>FAQ (please don&#39;t abuse the reviews as a support forum!):</u></b><br>Q: I&#39;m new. What&#39;s an interactive story?<br>A: Have you ever read a novel and longed for taking part in the plot yourself? Interactive stories allow you to do exactly that. Textfiction is like a fanfiction reader (a library app for free books) that only describes to you the setting, but allows you to choose your own actions, often resolving in alternative endings.<br><br>Q: Are the games free?<br>A: Textfiction itself free to play. Most of the interactive novels are in the public domain and may be downloaded free of charge to your library.<br><br>Q: How do I save/restore a game?<br>A: Press the &quot;Plus&quot; button to bring up the menu. Save/restore commands won&#39;t work.<br><br>Q: Do I loose my progress when going back to the libary app?<br>A: No! Whenever you leave the story screen, the game performs an auto save. It does not, however, perform an autorestore when you return (leaving the game is suppose to be a reset).<br><br>Q: Why is the story output erased when I restore a game?<br>A: When you restore a game, you move to another part of the story. The current chat history no longer applies and gets discarded to avoid confusion.<br><br>Q: Can I change the action buttons?<br>A: Yes! just write something in the commandline, then long press a button to modify it.<br><br>Q: Can I write my own fanfiction stories?<br>A: Yes! The authoring tool of choice can be found here: http://inform7.com<br><br>Q: Why does my bluetooth keyboard repeat the enter key?<br>A: Text Fiction comes free of charge. Unfortunately, this means no budget for buying troublesome hardware in order to check the problem out.<br><br>Q: Will a 1* rating convince you to change the app according to my whims?<br>A: Go kiss a Grue', 'summary': 'Text adventure interpreter for interactive fiction stories with a messanger UI', 'summaryHTML': 'Text adventure interpreter for interactive fiction stories with a messanger UI', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.3134923, 'ratings': 2542, 'reviews': 662, 'histogram': [191, 60, 171, 453, 1664], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '537k', 'androidVersion': '2.3', 'androidVersionText': '2.3 and up', 'developer': 'Onyxbits', 'developerId': 'Onyxbits', 'developerEmail': 'android@onyxbits.de', 'developerWebsite': 'https://textfiction.onyxbits.de', 'developerAddress': None, 'privacyPolicy': 'https://textfiction.onyxbits.de/privacy/', 'developerInternalID': '6813402359070758301', 'genre': 'Role Playing', 'genreId': 'GAME_ROLE_PLAYING', 'icon': 'https://lh3.googleusercontent.com/E4KLwmzmdCzFHQGlS3ehCw0S8xPKKZnYi7w3KzkMRtqelu4yh328_lPZcrDqjyBw0pIN', 'headerImage': 'https://lh3.googleusercontent.com/Kqu6MyMCwBMVO_mMIqQKY4jsPGbJLyI9ghZ7pzAg3mE7tE9K60ql-54s5SH6V5YCCJQ', 'screenshots': ['https://lh3.googleusercontent.com/ktG_cDjcIxguSlN82RiB7Tz0w2Fgslqz8BjqVU66S34WwIXR_2Uolonr-v4CF2LjHA', 'https://lh3.googleusercontent.com/SibjHpgziahr1Y4Jgawr-uHS98dw47pWgNj0GjWAN5wtuw6gwlHuEgAXw154ydbO6v8', 'https://lh3.googleusercontent.com/3Kqh2I52sv8E8T1tWwqyWu16pIUGXtTyEDAc0uOe2UsUhbrwLvaVXrwV8nLBmT2IExU'], 'video': 'https://www.youtube.com/embed/8al0RzkDqgM?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/8al0RzkDqgM/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 27, 2013', 'updated': 1410950161, 'version': '2.6', 'recentChanges': 'Full changelog: http://www.onyxbits.de/content/release-notes-text-fiction-v26\r\n\r\nThis is a bugfix release.', 'recentChangesHTML': 'Full changelog: http://www.onyxbits.de/content/release-notes-text-fiction-v26<br><br>This is a bugfix release.', 'comments': ["I love text adventures and I like being able to load one of my choice. Do you really have all of them? Tapestry comes to mind. I didn't give you a 5 because sometimes I get stuck in the help or some other menu and can't return to the game, and once I just reached a point in a game where it wouldn't do anything further-seemed to lock everything up. Couldn't type anything and had to stop Text Fiction and start over. This was Dreamhold and it kept doing that even when I restored the game so I had t", "I like it I really do. It has a few issues but none are game breaking. The hint system seems to be the biggest problem,(doesn't work properly for any game I've tried yet) but i just tend to skip that and look it up using Google instead of trying to figure it out in game.", 'So far only played Zork, blast from the past, but it works well and there have been no problems. Instructions for getting to the save, restore etc options could be clearer but generally I am enjoying using the app', 'This is a great way for me to be able to get in to text adventure games and play other peoples games. You should get this game if you want to play them or just want to play more!❤', 'downloaded this to try it out on my chromebook. imported version of hitchikers guide to galaxy that includes invisiclues. when I type in "hint" it brought up the clues but then locked up, could not select a clue or quit. Maybe this can be handled better in next release?', 'Great app, love to be able to kill a little time navigating the white house with boarded up door searching for treasure or joining Ford Prefect through time and space on the heart of gold.', 'As a rating for the text fiction app itself I would say it is very useful to those that like text based games I but as a player with autism I would like to say that this application is not always easy to figure out how to use and what things do what things so I think this app will be much better if it was more accessible to players who do not always understand something straight away or might not think the same way as the other kids that play the game', 'Basically a gateway to the world of reading and playing games. Have to download the games individually but the system makes it super easy to do so. Saving the progress is kinda weird, but I guess the games are supposed to be played in one sitting and saving would be useless then.', 'Works well. Easy to use interface. Makes these sorts of games very accessible.', 'The interface is responsive and intuitive, and I love having access to the customizable keybinds.  Two small complaints, though.  The corner controls can\'t be disabled with a single command. I keep hitting "go west" or "east" when trying to tap a word.  I had to hold each compass point and manually clear them before I could start playing comfortably.  The other issue is that I\'ll sometimes double-tap the back button when trying to close the keyboard and get sent back to the game-select window.  This is especially annoying since it clears the history.  90% of the time it isn\'t a problem, but some rooms have events play the first time you enter.', "I like some of the features, including tapping words you want to add to your commands and direction tapping on the edges. There are some icons here for quick words like open/close/get and so on, which i dont really use all that much. Some of the pictures for these quick commands are not really all that great in my opinion, either. For instance, the open and close icons show a padlock that's either unlocked or not...Why not a door or a chest that opens and closes? Other than that it's great!", "Pretty neat. Some of the books/games work better than others, but so far no complaints about the app itself. It's easy to use.", 'Great app for playing the classic text adventures, very handy that you can click any word on the description to use it', 'I love this type of game where it is just words and no visuals because it is a bit more interactive and lets your imagination run but I wish there were more games.', 'Best interactive fiction interpreter! Slower scroll and great themes!', "I really love this! There's many wonderful stories to go download. You have to download them off of a website in your browser but a button in the app takes you right to it. Don't worry! It's safe - I've never had any problems with security downloading them before. I do have a critique. I wish when restoring a game it would give you the history log of what you've done, or at least the last message it had for you. Instead I have to blindly pick an option without knowing what last happened.", 'Loving the app so far. I think that folks like me who experience limited joint mobility might need larger buttons, or an alternate layout, as I kept hitting the wrong buttons. But I love the effective way the UI allows the games to be played without needing to type everything out. Thanks to the devs for inspiring me, I might write one myself someday.', "Amazing app, just wish there were more classic games to choose from, some of the sci-fi infocom games for instance. The classic text adventures are still better than almost anything they've got on the mobile game market coming out nowadays. Notes: little glitchy with data corruption (save often), couldn't figure out how to clean up my old save data, and a classic looking interface option would be nice.", "Wont load downloaded files. I wanted to play. Found three titles to start. Downloaded them and then nothing. File not found error. Obviously the script is not placing the files in the right folder. But I have no intention of debugging someone else's issue.", "Great free app, you are not limited to the 183 games in the download section, you can also download and play many, many hundreds more free text adventures from the interactive fiction database. Good UI and features. By the way people who say you can't save are wrong - don't type save in game, just tap the + icon for various options including save /restore.", "Great looking app, good design and colors... But settings are limited, no way to assign *.z5 files to be associated with the app. No way to change my download directory, no way to import files. So basically, it won't open a file if its not set to whichever directory it thinks the stories should be in. And since it doesn't say which directory it is, you can't manually move them there.", "Nice interface, but when i switch apps to my flow chart program to update my map, it doesn't save. I need to keep saving my game when i go into any room before switching over. A quicksave would be good to get around this, because needing to name each save file before it saves is annoying. Wish i could keep using it, but it won't work if i can't map zork1 as i go.", "I love interactive fiction and it feels great to be playing these games again. The only thing I'd say is that I thish this app worked with glulx and tads games.", "hello. i've been using this emulator for years. i just want to ask. can i add some more command in commandline? (i mean not changing the current commandline. i want to add some more after 'wait' commandline.) thankyou for replying.", 'This is a great interface for text fiction games. Besides the keyboard it has some convenient features such as speech recognition, and some handy functions are represented by icons for speed. Tapping on a word in the text brings it to the input line! Enjoy.', "Doesn't work. When I try to play a story, it downloads a file. I can't open any of the files :(", "Love it! Occasional lag on my Motorola G-1, but lag is forgivable. Minimal privileges required; nice UI. I've had a couple incidents where I tried to hit the built-in submit button and accidentally gone southeast; it's better to use the return key on the keypad.", 'A very unique game, unlike many other games. I really like how you can determine the outcome of the story. I do think the display could use some colour, framing or other visual aids- maybe a different font for each story', "I downloaded this and to me, it wasn't what it should have been at all... It said that I had no games in my library... That I needed to download games... And the instructions for that were greatly lacking.... It says play Zork but it didn't play Zork... It seemed as if it might be a platform just for downloading stuff... Just like Amazon's Audible isn't a book but a platform for downloading books that are read to you... Which I like, and when I signed up it, there was no confusion about it.", "Nearly perfect, but the one fatal flaw is that it can't save. I was looking forward to playing long adventures like zork or enchanter, but without saving progress it's pretty much impossible.", "I can't figure out how to put Sofia's limbs back on her in the game Afflicted. I've used the words reassemble and reattach but nothing works. Other than that, it's an awesome game.", 'This is a text-based game with no graphics, just your imagination. Much fun exploring and meeting challenges. The app emulates the old DOS based game very well.', 'Excellent app. Thouroughly enjoyable, but it needs an option to overwrite old saves. I have tons of old saves I cant use or dont need. A way to clear them out would be awesome.', "I love it so much, this has been introductory for me so I can't say too much, but I've been having a blast with all the games so far and it's really easy to download new games.", 'This is a great app! A great way to play text adventures. It even makes it easy to download games so you can start playing right away.', 'If I could give it zero stars I would....I loved the original zork, so I was excited to play this....downloaded stories, went to my play zork game and it said no stories so I did as it said and clicked import where it once again said no stories, congrats on making something 10 times more difficult than necessary....smh in disgust !', 'Programmable shortcut buttons are a snazzy idea and very useful. This is a good interpreter but downloading from standard websites like ifdb and supporting more formats would get 5 stars.', 'Amazing to play any number of old (& contemporary) IF/games. Would be 5* if keyboard would auto hide after every command & it used a bit more screen width.', "It's good if you want a good story to get involved in.", 'Classic. Clean. And Easy. But tedious. In long books, a messenger UI can become pleonastic and tiresome. Apart from that, easily the best Z-Interpreter out there.'], 'appId': 'de.onyxbits.textfiction', 'url': 'https://play.google.com/store/apps/details?id=de.onyxbits.textfiction&hl=en&gl=us'}
