{'title': 'WarmShowers', 'description': "Members of Warmshowers.org can use this app to find hosts using both map and textual search interfaces. Hosts can be contacted directly through the app. Host information can also be downloaded and stored for off-line usage. \r\n\r\nFor more information on WarmShowers please see the website: https://www.warmshowers.org. You must create an account on the site before being able to use this application! Visit https://www.warmshowers.org/user/register to sign up.\r\n\r\nWe love to hear your experiences and suggestions, even problems! Contact us on Github - https://github.com/warmshowers/wsandroid - or leave feedback here.  Please mention what version, what device, and the specific issue you're having.\r\n\r\nThis application is open source under the Apache 2.0 license. Code is on Github: https://github.com/warmshowers/wsandroid", 'descriptionHTML': 'Members of Warmshowers.org can use this app to find hosts using both map and textual search interfaces. Hosts can be contacted directly through the app. Host information can also be downloaded and stored for off-line usage. <br><br>For more information on WarmShowers please see the website: https://www.warmshowers.org. You must create an account on the site before being able to use this application! Visit https://www.warmshowers.org/user/register to sign up.<br><br>We love to hear your experiences and suggestions, even problems! Contact us on Github - https://github.com/warmshowers/wsandroid - or leave feedback here.  Please mention what version, what device, and the specific issue you&#39;re having.<br><br>This application is open source under the Apache 2.0 license. Code is on Github: https://github.com/warmshowers/wsandroid', 'summary': 'Hospitality for touring bicyclists through Warmshowers.org!', 'summaryHTML': 'Hospitality for touring bicyclists through Warmshowers.org!', 'installs': '50,000+', 'minInstalls': 50000, 'score': 2.85, 'ratings': 596, 'reviews': 392, 'histogram': [268, 23, 41, 53, 208], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.5M', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'Warmshowers.org', 'developerId': 'Warmshowers.org', 'developerEmail': 'wsl@warmshowers.org', 'developerWebsite': 'https://www.warmshowers.org', 'developerAddress': '3980 N. Broadway Suite 103, PMB 187\nBoulder, CO 80304', 'privacyPolicy': 'https://www.warmshowers.org/privacy', 'developerInternalID': '9053953076743204794', 'genre': 'Travel & Local', 'genreId': 'TRAVEL_AND_LOCAL', 'icon': 'https://lh3.googleusercontent.com/WH1uYwwtzVcixVRJNbrM9VDcPUPobjhyRFM2wAN2izs0GjIc8LufdvY3EezQkrCp0nkI', 'headerImage': 'https://lh3.googleusercontent.com/0_lEiyXMKjvIhVHq4ALXVyv9khqiGhS2HRDVGGOkiZ6qET33qTuFl4cesY_qvB_YJDU', 'screenshots': ['https://lh3.googleusercontent.com/YMrtwizeUiOlQ1BuBYac0lfFbIW-GQMZUlvpGfc3oZj2CTBOCcYl2aMrxqRd1FKCLgxG', 'https://lh3.googleusercontent.com/GFvh0vgr7u9dbyWlVnb8GKnkTdfRAWLW6_1cqCu7ozcDPky8zzLOQVK3UN2IqYhlXg', 'https://lh3.googleusercontent.com/YyscbjdsK_v4GRvOYnaq-Bny6E61wLbx2UjL89ihl2DvgYl_USTGuCcFXW1YaPUTEMo', 'https://lh3.googleusercontent.com/VIKRgqh_ZlMM52dd0J01YwQsWjZnD6wtLkCqlSK5h414rPd8vupgEpy4nR1pe3YaGKc', 'https://lh3.googleusercontent.com/-KPHeyK24gOgenVnVN8OP0OKvBx2Pp3OL8TXDTHP2_6gyLAz8216Hjc3-PvV3jEI5w', 'https://lh3.googleusercontent.com/A13xqT35Yj1S5C17T_aPhmATuLyylWrWk3-63HhO32q5xmHiiKsDpZyuU8GsmTPmyg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 19, 2012', 'updated': 1585251593, 'version': '3.1.6', 'recentChanges': 'v3.1.6:\r\n- The app is now available in Italian.\r\n\r\nv3.1.5:\r\n- Fix automatic message reload, s.t. new messages are fetched even when the app is closed (especially after a device reboot).', 'recentChangesHTML': 'v3.1.6:<br>- The app is now available in Italian.<br><br>v3.1.5:<br>- Fix automatic message reload, s.t. new messages are fetched even when the app is closed (especially after a device reboot).', 'comments': ['Reports failed internet connection. My internet works fine.', "The login page has been fixed, everythig's fine now !", 'This app was great for a little over a month, then it suddenly stopped letting me log in. All I ever get is "authentication failed, please re-enter credentials." I guess I\'ll just log in through the internet, as that works fine. I tried deleting the app data and uninstalling / reinstalling, but the error persists. If it weren\'t for that error I would love the app, but it is completely useless if I can\'t log in.', "When I'm on the road, I would prefer to use the app instead of the website. I'm so sorry that it is IMPOSSIBLE to LOG INTO this APP. Please fix and post new update for us. Otherwise — WarmShowers is an excellent program for bike-tourists and hosts alike. I have found it to be a welcomed respite, quite safe, and a wonderful way to connect with good people.", 'Good app, the map is a really nice feature, however it should be possible to cache the hosts on the map, once loaded. Internet is not always good/available, and it would decrease the load on your servers. (check how ioverlander does it)', "Don't want to be overly critical of Warmshowers as they do an incredible job but just like everybody else I can't log in any more. Works fine in a Web browser but not in the app. Will update review when this gets fixed.", 'suddenly began experiencing same login problems others have - authentication failed. but prior to this, i loved the app! i find it much easier than the mobile version of the website to search for hosts, etc. hoping it will be fixed soon!', "With the latest updates in September 2019 it looks very good and it's really useable on Android phone. Messages are showing like in the web view and I was able to read and respond to the new messages. Keep up the good job!", "authentication failed? It used to work and now it doesn't let me login for no apparent reason. Which is a shame because I am currently on a bike tour! Please fix it warm showers people ! D: !", "i do love your website and its whole concept but for some reason since some month ago i cannot approach to the site therefore installed this app and it was the same. please help. I've been an active member since eight years ago.", 'It was quite good. But stopped letting me log on. So I reinstalled it. Now it just crashes whenever I try to use it. Shame because the website and the community are great.', 'Amazing app I love the app as it allows one to search for hosts and message them very easily. The app does freeze up now and then, the solution to this is by swiping the app away when you are in the multitasking window.', "I love the community but I struggle with. the app. I just changed the email used for the account... but I can not sign in anymore from the app. I rechanged the email for the previous one... still can't log in!", 'Cannot get past the login page. I enter user name and password and always get the "failed to connect... check your internet connection " error.', 'cant use this app at all with my samsung phone....if I try to log in there appears the notice connection to surver failed,no internet connection... i tried several times with different very good internet connection.... a shame as I am cycling currently to Laos,China, Vietnam....', "I can't log in with the app although I can do i it at the WarmShowers website, using the same login details. It makes the app pretty much unusable for now.", 'does not work at all. would give 0 stars. no help from app creator to solve issue. will not connect to internet, even though i can connect on laptop with website.', 'App is useless. Cannot log in using checked and double checked credentials. Very basic stuff and very poor form for an organisation that solicits donations.', "The app js totally unusable as it doesn't let me log in. Reading the previous reviews, its clearly an old issue and I can't understand why nobody bpthers to correct it.", 'had to uninstall the app. now reinstalled I cannot login. I get the message "communication with server failed. please check internet connection". there is nothing wrong with my connection', "App has vastly improved with the last update, however, with newly integrated openstreet maps, it loads reaally slowly, to the point it's just barely usable. So it really needs to be improved.", "Terrific app, but the login bug is back. I'm running it on Android system (the latest update version) on a Samsung S8. Solutions?", 'Warm showers is great website for those travelling by bicycle. like what everyone has been saying for a longtime, the app stops you signing in. Use the website on your smart phone', "Brilliant update. It now uses Open Source maps, new filters mean I can remove anyone who doesn't really use the app so I don't hang around waiting for replies. Thanks to the Warm Showers team!!!", "Serious flaws, the flag is at my old address, but when the listing is displayed, the new address is given. Problem is, it's 11 km away, with a bike in a hilly area, that is a lot", "There's something wrong with your notif implementation. Keeps pinging me about same read notifs as im riding all day + How do i add an image to my profile pic? Overall great app 👌", 'poor app. been using WS for years online but the never ending "authentication failed" is enough to not use the app.', "Brilliant resource for travelling cyclists. New filters mean we can now remove anyone who hasn't logged in this week/month etc so it's now super useful. Thanks loads for listening", 'Cannot log in no matter how many times I try. Have reset my password multiple times.', 'Not working. Cannot find hosts or read messages, after reinstall I cannot login, the same as some user here.', "It doesn't load the map", "used to be a great app but currently it doesn't allow me to login!", 'What everyone has been saying for a longtime, the app stops you signing. Use the website on your smart phone', 'It can be nice app but cannot login with my credentials. If can help me with that issue i would be really happy', 'I cant access to the app because say, autentication failed, please re enter your credentials, whats going on warm? Please help us', "the app doesn't let me log-in... please fix that! I'm on a Pixel 2 running Android 9.0", 'Standard -- app no longer allowing login (at all). Please address this! :)', '"failed communication with server...." couldn\'t use the app.', 'Nice experience, similar to the website but more streamlined and quicker', 'Great app but have some issue with logg in recently on mobile.Hope it will be fixed'], 'appId': 'fi.bitrite.android.ws', 'url': 'https://play.google.com/store/apps/details?id=fi.bitrite.android.ws&hl=en&gl=us'}
