{'title': 'taz.app', 'description': 'Täglich die neueste Ausgabe der "tageszeitung" (taz) direkt auf Ihr Smartphone oder Tablet. \r\n\r\nOptimiert als "aPaper" für Android bietet die App komfortables Lesen der gesamten taz als PDF oder als optimierten Text - mit allen Regionalausgaben, der sonntaz am Wochenende und einmal im Monat "Le Monde diplomatique". Für Abonnenten steht außerdem ein Archiv mit allen Ausgaben seit 2011 zur Verfügung.\r\n\r\nSeit dem 5.2.2017 werden nun auch alle Bilder bei dem Blättern auf einem Tablett dargestellt.\r\n\r\nDer Bezug ist über ein Abonnement möglich. Kostenlose Demoausgaben bieten die Möglichkeit alle Funktionen zu testen.\r\n\r\nWeitere Infos unter http://www.taz.de/android', 'descriptionHTML': 'Täglich die neueste Ausgabe der &quot;tageszeitung&quot; (taz) direkt auf Ihr Smartphone oder Tablet. <br><br>Optimiert als &quot;aPaper&quot; für Android bietet die App komfortables Lesen der gesamten taz als PDF oder als optimierten Text - mit allen Regionalausgaben, der sonntaz am Wochenende und einmal im Monat &quot;Le Monde diplomatique&quot;. Für Abonnenten steht außerdem ein Archiv mit allen Ausgaben seit 2011 zur Verfügung.<br><br>Seit dem 5.2.2017 werden nun auch alle Bilder bei dem Blättern auf einem Tablett dargestellt.<br><br>Der Bezug ist über ein Abonnement möglich. Kostenlose Demoausgaben bieten die Möglichkeit alle Funktionen zu testen.<br><br>Weitere Infos unter http://www.taz.de/android', 'summary': 'Daily the latest edition of "daily newspaper".', 'summaryHTML': 'Daily the latest edition of &quot;daily newspaper&quot;.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.2, 'ratings': 941, 'reviews': 447, 'histogram': [112, 18, 56, 131, 621], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': '4.1', 'androidVersionText': '4.1 and up', 'developer': 'taz.die tageszeitung', 'developerId': 'taz.die+tageszeitung', 'developerEmail': 'app@taz.de', 'developerWebsite': 'https://taz.de/', 'developerAddress': None, 'privacyPolicy': 'https://dl.taz.de/AndroidAppDSE/', 'developerInternalID': '6963107132331084114', 'genre': 'News & Magazines', 'genreId': 'NEWS_AND_MAGAZINES', 'icon': 'https://lh3.googleusercontent.com/cYq6WKRQB_yQ-o9otqzftZjt4K2levkHiLa7qLO3XgGicsLvwSaSzT1fXEhcaOlXoZk', 'headerImage': 'https://lh3.googleusercontent.com/pDEggWsLI7_rNTFCQFXzDHBCjyUuWsGelx44TuubmVhr47zCX-PiZdQiMJQt-yrH8I4', 'screenshots': ['https://lh3.googleusercontent.com/0_ePs1ZXNS9lXgVUJQMDlXQrQjDwJiJKOk059AkTebTec7WalTNJPSqOyS3ZjJm21jE', 'https://lh3.googleusercontent.com/O-4fBlN_rz4gSo1L6GmMK12z11rLRoTED3M_C4_OAuEg_1peVulso-OQUXV4p-VamfTC', 'https://lh3.googleusercontent.com/WltFwWGUg5AuFFRbAtXELMybWREujh14Mdg318eamFox-uPrYsXMcRL30lNOibvkIQ', 'https://lh3.googleusercontent.com/cLLQn39gEimtDylAS5vDFciBX78JWpoXXx4ThxHUXuS4zmWhfTFVBd1w9vaKti9MUg', 'https://lh3.googleusercontent.com/9H0Wjs50uklIml7kOAEfBIAruKGFCd52HqlbMcT2j56A9TCPOXL7Tapt4WXLCMqDoQ', 'https://lh3.googleusercontent.com/Xx37pL7oh8xp1rKg0rEt8Fr9EzOGJ0fXhsxNluSksP29lb5DaxmMhk_bvE4iDrrddI8', 'https://lh3.googleusercontent.com/O9bTJiVaDPRIQmlR4aGFey7sJYsz7tRBNIxHeIyKLu_GyIlm71kahZfkDXULkvoPyGM', 'https://lh3.googleusercontent.com/ziJHrs47L8izaBXwJc34JRGzat_kIdOyl_I0RxDahH1VnMta7Zj38ufuxvce5IeM2iA', 'https://lh3.googleusercontent.com/19-oTztKCDdC1saGQExbSVWxRthfpp-VQMeXSL2Lk_ZSe1sYt-fhfx6fvh9AGmHljA', 'https://lh3.googleusercontent.com/sn_tS-Lq8xTWvCmhOU-9y00awwtv2FEG3ap-vlVH_aEeJWzTroyD9zwRjeGgjP2uIQ', 'https://lh3.googleusercontent.com/msPVOl6IEbyuI7arHdAwNXGCMQl4Lfs2gQ2XFPwS4dn6p-S287jnp9GtkL_aAjt1-78', 'https://lh3.googleusercontent.com/OXjpkUsDoEyV-yZaebbt1AvCYuudrIS0IfrBWSouhXaY99lh0ZLMWolyXgoLOj0Ntw', 'https://lh3.googleusercontent.com/iHXbDktaZa1VT5zwwpfoWImfZnHtk-vXYM-EdNeSZ5SLNoz8nHzDaGFCbJCAM2LgIn8', 'https://lh3.googleusercontent.com/0mt2kZDTUYGqsdVBy55PyB22XfyxdUdrnveEz-BykcUMnaOAevX3lO5jZdgUE4ctr-8'], 'video': None, 'videoImage': None, 'contentRating': 'Mature 17+', 'contentRatingDescription': None, 'adSupported': True, 'containsAds': True, 'released': 'Jun 7, 2012', 'updated': 1584721763, 'version': 'Varies with device', 'recentChanges': '* Update genutzter Bibliotheken', 'recentChangesHTML': '* Update genutzter Bibliotheken', 'comments': ['Just a wrapper for a pdf. Unreadable on smartphones without lots of scrolling and zooming. Quite useless app overall. I can also download the pdf on my own from the website and have the same result.', 'Sachlicher, guter Journalismus, der gänzlich ohne Hetze, Panikmache und ähnliches auskommt. Einfach eine klasse Zeitung und die App macht was sie soll.', 'Unvergleichliche Zeitung, und die App dazu funktioniert: alles ist gut', 'Ausgaben herunterladen geht nur noch, wenn man den Zugriff auf Crashalytics erlaubt? Das ist schade. Hoffentlich lässt sich das anderweitig lösen.', 'Als App für das Handy will ich kein ePaper haben oder runterladen, sondern einen Ort außerhalb des Handybrowsers, wo ich die Artikel aus dem Internet lesen kann. Dies ist hier weit verfehlt, es besteht noch nicht einmal die Möglichkeit darauf. Sondern nur die TAZ auf das als elektronische Ausgabe auf das Handy zu laden. Platz und Zeitverschwendung!', 'Kein Artikel kann runtergeladen werden :-(', 'Top Zeitung, Top App!!', 'Seit kurzem kann ich keine Ausgabe mehr lesen. Diese werden zwar heruntergeladen, beim Versuch sie zu öffnen kommt dann aber eine Meldung, das fehlende Ressourcen heruntergeladen werden und dabei bleibt es dann.', 'Seit kurzer Zeit speichert die App Fotos vom der Taz zwischen ohne das ich das will? Wie kann ich das abschalten? In den Einstellungen gibt es dazu nichts.', 'Seit dem letzten Update wird oft eine Seite vor/zurück geblättert, wenn ich einen Artikel vom Seitenrand öffnen möchte.  Die app ist sonst aber sehr gut.', 'Bin sehr zufrieden mit der App. Das Lesen macht einfach Spaß! Viele nützliche Funktionen, es wirkt einfach durchdacht. Und dazu gibt es regelmäßig sinnvolle Updates. Top!', 'Die Umblätter-Empfindlichkeit ist viel zu hoch..wenn ich runterscroll, passiert es so oft, dass ich versehentlich umblätter. Und wenn ich zurückblätter hat er sich natürlich nicht die Stelle gemerkt.  EDIT: Jetzt ist das interface und usability besser, aber die App stürzt oft ab und hat Fehler beim Runterladen von Ausgaben......', 'vorher war es besser, nun stürzt die App nur noch ab. funktioniert immer noch nicht.', 'Endlich eine vernünftige App. Prima Bedienung, relativ stabil. Merkt sich die letzte Position.', 'MD sieht super aus!! Der Viewer läuft noch ein klein wenig stockend und muss beim schnellen scrollen kurz die Seiten buffern. Wenn ihr das noch fixt habe ich nichts mehr auszusetzen. Super Arbeit!', 'Super! Damit macht Taz lesen auf dem Handy bzw. Tablet endlich Spaß. Die neue Version ist eine ganz ganz große Verbesserung !', 'Die app gibt Zugriff auf die printausgabe der taz (digitalabbo mit verschiedenen preisstaffelungen). Die Vorschau lässt sich auf aktuellen tablets flüssig blättern und die epub Ansicht funktioniert auch auf kleinen Bildschirmen gut. Zusätzlich kann man jede printseite als pdf öffnen (ohne drm).', 'Nach dem Systemupdate auf JellyBean 4.2 ging die Anmeldung nicht mehr. Dann auf die taz.APP 1.1.4 aktualisiert und seither geht gar nichts mehr (Seiten werden nicht mehr angezeigt). Bitte schnell beheben!', 'Works very well, but first you have to get used to it.', 'Angeblich free, dann aber doch nur mit Abo nutzbar', None, 'grundsätzlich okay, faire zahloptionen!! navigation sehr chaotisch, willkürlich, umständlich (wie komme ich auf seite 1 zurück?, wie kann ich alle themen ohne pluszeichen auf einmal öffnen?) ab und zu freeze. mini-buttons auf hd-phones. vertikales wischen zu sensibel, mehr toleranz nötig.bitte weiter entwickeln  richtung stimmt.', 'Bin digi-taz-Abonnent und von dem reader ganz begeistert... macht, was er soll und ist auch noch hübsch gemacht.', 'Nicht die beste performance, Navigation teils umständlich, aber besser als im eReader', 'An sich eine gut bedienbare Anwendung. Es fallen aber ein paar Punkte auf die noch verbessert werden können:    * Automatisches herunterladen der neuen Ausgabe ist scheinbar von der Ortszeit abhängig -> läuft zu abwegigen Zeiten wenn man im Ausland ist   * Ernsthaft langsam, da laufen andere anspruchsvollere Anwendungen deutlich flüssiger   * Aus dem Modus in dem ganze seiten angezeigt werden kommt man nicht mir in den startmodus zurueck (um einen anderen Tag auszuwaehlen z.B.). Man muss erst in die fliestextansicht fuer einen einzelnen artikel wechseln', 'Navigation sehr umständlich, sehr langsam, stürzt manchmal ab. Da "zahl ich nicht"', 'Sehr gut alles, lässt allerdings keinen download bei tethering via Bluetooth zu :-\\', 'äußerst umständlicher Zugang und wenig komfortabel', 'Eigentlich hatte ich vor, mir einen Tablet PC zu kaufen, nicht zuletzt, um die taz darauf zu lesen. Aber diese App ist so gut durchdacht und gemacht, dass ich die Zeitung nun prima auf meinem Smartphone lesen kann. Vielen Dank an die taz!', 'Im Gegensatz zur Webseite gibt es hier keine aktuellen Artikel für Nicht-Abonnenten bzw. Käufern von Einzelausgaben, nur eine ältere Ausgabe zum Testen. Kein Inhaltsverzeichnis oder brauchbare Suchfunktion,  Navigation gewöhnungsbedürftig (blättern!).', 'Zudem sehr unübersichtlich und umständlich. Tolle Zeitung, miserable App!', 'Hii farnds'], 'appId': 'de.thecode.android.tazreader', 'url': 'https://play.google.com/store/apps/details?id=de.thecode.android.tazreader&hl=en&gl=us'}
