{'title': 'Primitive FTPd', 'description': 'A simple FTP server. Allows to exchange files with other machines over wifi. No more USB cable searching. Runs without root privileges. Is not started when device boots (but can if you wish). Control yourself when the server runs. While it runs it prevents standby to avoid long uploads and downloads to abort (configurable). Transfers can be encrypted by SFTP.', 'descriptionHTML': 'A simple FTP server. Allows to exchange files with other machines over wifi. No more USB cable searching. Runs without root privileges. Is not started when device boots (but can if you wish). Control yourself when the server runs. While it runs it prevents standby to avoid long uploads and downloads to abort (configurable). Transfers can be encrypted by SFTP.', 'summary': 'A simple FTP server.', 'summaryHTML': 'A simple FTP server.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.49, 'ratings': 476, 'reviews': 256, 'histogram': [33, 4, 19, 57, 361], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.9M', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'wolpi', 'developerId': 'wolpi', 'developerEmail': 'wolpi.dev@web.de', 'developerWebsite': 'http://github.com/wolpi/prim-ftpd', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '6969204716942066519', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/_cSG1hunofc0PRcFJeSfsBbDHDJ3LDDMYcjNXwAWI6Pkeu1BziCDhQHj3NyPYiMK8K4', 'headerImage': 'https://lh3.googleusercontent.com/nADNTLHuIDN6GoSxUS6IJvQQP__T-9DMty8peaFSYc1kEyNkmNiAB_yjPpZVT9JQTr1f', 'screenshots': ['https://lh3.googleusercontent.com/Z_y4xo0p6rk9J29BM-4WaIi5qENLe4w9Pz_a8duixmlrKI90i5v4MjG2ESHviagMJDM', 'https://lh3.googleusercontent.com/CX0eN-wVpjwcnTZGpmvBGjNqGjF0KLo1QLsIP1ca8oF-_-pkExm0gk3tG1eYprGhlvQ', 'https://lh3.googleusercontent.com/2sc3T6-uGruRQUBr5bwd8neCvKMeS40TOS4B1e0jpOAeP0fQCI_rmT7XbSTQV9JdNlk', 'https://lh3.googleusercontent.com/yKsWLjY6BFgoRMA3Yo76SE8BwI-dQLVpVj0Z38MHAHU01-WmenV72g_UV_vIPogvs2S0', 'https://lh3.googleusercontent.com/K59ftyaTdFHWZRgg9HrUAb9x0twdAAz1oNaKWK0A3euezab2TpnzWuHGF5dZe5QK9b4', 'https://lh3.googleusercontent.com/IqBNej_hAckFfCrvgwC019WjvhNkU4GCDQa2_kVznpWJTlqy_y_oki-J3gwSXKluYQ', 'https://lh3.googleusercontent.com/4_3xB0Ya5xgw0EpMPjThQ3KhRphs3y4yQLdzmyIMhcnDa_4ycOAuxGwMG7oDYg6ai48', 'https://lh3.googleusercontent.com/bgqFD1cLyKuTqYwjWenTrs9-gE4ta7BGAr2ZwDbywPtygGXYmxr2tRAGf66atQ-H85E'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Dec 8, 2012', 'updated': 1587076450, 'version': '6.3', 'recentChanges': '* support for sftp public key auth via ed25519\r\n* translation updates', 'recentChangesHTML': '* support for sftp public key auth via ed25519<br>* translation updates', 'comments': ["Works well, even supporting sftp with public key, but it insists on continuing to run in the background when off, using resources when it doesn't need to.", 'Lightweight, efficient, functional, ad-free and free to use. Not at all pretty but I like it - who needs an FTP server to be pretty? :-)', 'light, efficient, does just what it should to. Really the best.', 'Love this ftp server app.. Still using it.. :))', 'Very nice app, simple and doing just what it says it does.', 'After an update, now moronically gives itself a public IP address. So worthless.', 'Finally I managed to transfer files over wifi. I wanted secured link (one that do not broadcast openly my files across building). I have tried many (s)ftp, (s)http, and (s)"xyz" servers, and this one works repeatedly, both ways (PC <-> phone). Very good, even for superficially informed, like myself! Thanks, developer!', 'Simplistically and beautifully done. It never fails and super easy to setup and use. Could be more useful if we can somehow restrict the FTP directory to a particular folder. And sharing with friends in a group becomes easier and safer.', "One of the best FTP servers for Android. It even offers SFTP, although I don't have write permissions through SFTP on Android 8 on my SD-Card for some reason (FTP works fine, writing through SFTP on Android 6 works fine as well)", "Hi, I used to be able to install this app on my device, but now it says it's not optimized.. Sad.", 'Works great especially on Nougat devices. Used another program for a few years but due to android updates I had to switch to Primitive FTPD. Keep up on the android security framework changes and Primitive ftpd could easily capture pole position.', "Functionally I like this app a lot. It does exactly what it's supposed to. However the app interface is cluttered and plain ugly so this could need some improvements.", 'Super convenient and easy to use. Now using it as my primary way to transfer files from/to my phone from my PC.', 'Works great. Unlike other apps I tried, this works with Windows command line FTP, which I think means it supports active mode.', "Has the features I needed (start on boot, etc.) and ones I didn't think I needed (IP address displayed when tethering to PC).", 'Have been using it for a long time. Installed it on every Android device since. Excellent piece of software.', 'Like in the old days, no adds, simply does what it suppose to do, free open source softwarez, long live tha linux :-)', "Nice, but can't configure to share internal and external storages simultaneously - either external only, or copy errors from it, root or no root.", 'FTP has saved me countless times, Easy and pretty much accessible anywhere a browser supports it.', "Nothing primitive about this app. This is 2019, this FTPd offers SECURE FTP. Do not waste your time and money on apps that don't. THIS APP SHOULD NOT BE FREE!", 'Very Usefull App! No ad and wow this powerful FTP Sharing is open source. Hope i always see future deveplopment from you.', 'Great FTP/SFTP server. Works with SD cards. thank you Deceloper(s)', 'Its simple, fast and straightforward. No ads.', 'Being able to run without root is great. Not being able to run with root is not great at all.', "I've been using this app for years and it just keeps working.", "Couldn't tell if internal storage was available for service. Other servers can, but I can't see it in here. Uninstalled.", 'Could not connect to server directory.', 'Very good app. Does exactly as described.', 'Wonderful app. Open source and works great.', 'Very simple to use and works like a charm!', 'Weird and old APIs... using the third option makes the choose folder gui inside settings obselete...', 'Well done! What a nice app! Waiting for you to add some more features 😁😁😁 if help is needed contact me!', 'Please, remove "primitive" word from app\'s name. This app is fully functional and good. Thank you for your job!', 'This ftpd server worked great on my Nintendo switch.', 'Best stable ftp server with good preferences', "very old APIs. doesn't actually work.", 'no ads. fast.', 'Open Source... Made in Germany-Quality. Just Perfect !', 'Sometimes the simplest one is all you need.', 'only lets me share archives, will not allow me to view files insid3 them. useless.'], 'appId': 'org.primftpd', 'url': 'https://play.google.com/store/apps/details?id=org.primftpd&hl=en&gl=us'}
