{'title': 'Roku Remote', 'description': "The free Android application allows you to:\r\n\r\n· Control your Roku player or Roku TV from your mobile device.\r\n· Browse, add, and rate Channels from more than 2,000 streaming channels offered in the Roku Channel Store.\r\n· Quickly launch your favorite Roku Channels on your Roku player or Roku TV from your mobile device.\r\n· Enter text in your Roku player on-screen interface using your device's keyboard instead of the included remote.\r\n· Name and switch between multiple Roku players and Roku TVs.\r\n. Additional features include shake to pause, voice search, homescreen widget and notification controls.\r\n\r\nTHIS APP REQUIRES A ROKU PLAYER OR ROKU TV\r\nTo use this app, you must connect your Android device to the same network as your Roku player or Roku TV.\r\n\r\nHAVING TROUBLE FINDING YOUR ROKU PLAYER OR ROKU TV?\r\nNote: If the app does not recognize your Roku player or Roku TV (you see a “No Roku Devices Found” message after you sign in), try going to network setup again on your Roku player or Roku TV. This will wake your Roku player or Roku TV on your home network. Then, select “Try Again” in the Roku app.\r\n\r\nGo to https://github.com/wseemann/RoMote for FAQs or to get help.", 'descriptionHTML': 'The free Android application allows you to:<br><br>· Control your Roku player or Roku TV from your mobile device.<br>· Browse, add, and rate Channels from more than 2,000 streaming channels offered in the Roku Channel Store.<br>· Quickly launch your favorite Roku Channels on your Roku player or Roku TV from your mobile device.<br>· Enter text in your Roku player on-screen interface using your device&#39;s keyboard instead of the included remote.<br>· Name and switch between multiple Roku players and Roku TVs.<br>. Additional features include shake to pause, voice search, homescreen widget and notification controls.<br><br>THIS APP REQUIRES A ROKU PLAYER OR ROKU TV<br>To use this app, you must connect your Android device to the same network as your Roku player or Roku TV.<br><br>HAVING TROUBLE FINDING YOUR ROKU PLAYER OR ROKU TV?<br>Note: If the app does not recognize your Roku player or Roku TV (you see a “No Roku Devices Found” message after you sign in), try going to network setup again on your Roku player or Roku TV. This will wake your Roku player or Roku TV on your home network. Then, select “Try Again” in the Roku app.<br><br>Go to https://github.com/wseemann/RoMote for FAQs or to get help.', 'summary': 'Turn your Android Device into a control center for your Roku Player and Roku TV', 'summaryHTML': 'Turn your Android Device into a control center for your Roku Player and Roku TV', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.96, 'ratings': 436, 'reviews': 198, 'histogram': [61, 30, 39, 39, 265], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '4.4M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'William Seemann', 'developerId': 'William+Seemann', 'developerEmail': 'wseemann@gmail.com', 'developerWebsite': 'https://github.com/wseemann/RoMote', 'developerAddress': '3042 E Stillwater Landing #104\nUrbana, IL 61802', 'privacyPolicy': None, 'developerInternalID': '4671521637053888893', 'genre': 'Entertainment', 'genreId': 'ENTERTAINMENT', 'icon': 'https://lh3.googleusercontent.com/IunQG9COeTN37t3j9ZN_uq4VAH13GMkfGGpANGzHXlqo2lkLD7tpB-w_37Wuumo-1N1m', 'headerImage': 'https://lh3.googleusercontent.com/OSZHRSBNijZLx7h6inN7tHnvBJlxzzY25FH6TNuvmJXN-_ojX8K3ql3AKGf3TR9-ZGE', 'screenshots': ['https://lh3.googleusercontent.com/ItjrwRVxD3hL0XiFI9K6KW7oucscb2NChtdW-9pUgJ7Y2q4bgAYmQp_FVwvtPcUn_ms', 'https://lh3.googleusercontent.com/THQ5vpbpnxo3w8XK0xIwMueyuOE4_em9OqE8xDu9Gha_3w3GC6OmvI9l95_YWxXR8zFi', 'https://lh3.googleusercontent.com/y0-2kSqTevr3XpNBtlp4BUFsY5dtX3EoO35bA1MYWEc3yxmFe2sbAHto8WpQkTcO3Do', 'https://lh3.googleusercontent.com/5B6ZLBSRrqpE6AnBcvMdreh-WipgB5AydZ9g5vbUp2o2FDsY2jYO4eCVIK2ZZKU2jg', 'https://lh3.googleusercontent.com/pZwI-6Cj45aa5KAbTcSrupdwEMNrir4S_qsTtZuBtK2yTWCOAFizrAO4P7w3xr22Ci57', 'https://lh3.googleusercontent.com/yHPwgUs8kLkTmEDz_Pah4dVYMzlSiXCXlwuYF8Y3CFUcSmeK94Z8TavXM-yksSeg0vBP', 'https://lh3.googleusercontent.com/uymf8VXmADEQ5ngqBF29e8FkmLtnwE_n2gqmlCDU6PRkyb-iiuGhLs8Bm4ud4Olz7A'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 26, 2016', 'updated': 1589150000, 'version': '1.0.15', 'recentChanges': '- Bug fixes', 'recentChangesHTML': '- Bug fixes', 'comments': ['Working great, with volume options and no ads at the bottom.', "Very simple, works great, the reason I picked this app over others is because it doesn't require unessicary permissions.", "So far, this is the only Roku remote app that works on my Chromebook. It is also the best one that I've tried. It immediately saw my tv, and can even wake it from sleep mode. I am very pleased.", "It connects to both of my roku's so I can just switch over on the appmy kids always lose the remote so this always works out for me", "I've tried all the other Roku apps. This one is quickest and easiest. No bothersome ads, either. Plain and Simple.", 'Open source Roku remote! Found my devices and works perfectly.', "This remote works perfect for my tv just don't know how to turn the volume up or down but then that it is a great replacement remote control", 'Its good I could not find my remote so I got this and this helped when I was looking for my remote!$', 'i have tried all and this is the only app that works for roku', 'App has to be full screen or buttons overlap', 'Downloaded this because the private listening function on the official Roku remote app is junk and no other apps seem to have this feature. So I was excited to see in the pictures that the private listening button was there, but sadly when I downloaded this app and connected to my TV there was no private listening button or any way to enable it.', 'It works flawlessly. No adds.', "Headphone feature doesn't work", 'I am very pleased with this app for my roku infact it is way better then the original. This one easy to use, the volume at first I thought was not working but in fact it did you have to press the volume button a few on off kind of thing (I am probably not discribing it the best way) you will notice each time you hit the button it goes down one notch at a time and I can turn my TV off with this remote so impressed. I am very please. Also no problem connecting.', 'some features not working. Headphone doesn\'t work and the rewind 5 to 10 second button that\'s at the lower left does nothing. I know these can work since they work on other apps I\'ve tried. Wish it could default to "Remote" tab when launching app instead of "Device\'s" tab, more redundant steps. since I got the LG v35 this app looks stretched taller a bit.', 'Thank you for this remote!! I\'m not very financially stable, I must use my phone\'s hotspot to watch TV. Considering my Remote broke, this is the only app that allows you to use your hotspot to work the Remote. All the other remotes WiFi only! Stupid! Want to stay #1? Find a way for it to work without WiFi or Hotspot. You\'ll dominate! P.S. Even if i didn\'t need my hotspot i would still use this remote. Much better, faster than the rest. The response time is incredible, "Real Remote Quality"!', "I tried this ap to replace a remote for a Roku Streaming Stick 3500R (circa 2014). It's excellent. Functions better than the remote with no ads. I was also able to link it to a Streaming Stick on a second TV. Both sets were previously connected to my WiFi. I read the reviews for several aps before choosing this one. Five stars!", "Keyboard didn't work for me.", "Definitely the best roku remote app I've used so far. I like that the power button is able to wake my tv from sleep mode, and that it doesn't need to reconnect when the app is closed or left in the background. Great replacement for the remote I immediately lost after buying my tv.", "I lost my remote so I downloaded this app. It works perfectly, then, I seen that it has an option to find your remote. I was so excited to find my remote, to only find out that the option DOESN'T EVEN WORK! Please fix, I need that remote. Thank you", 'The most stable app on the market. The official Roku app constantly loses connection (half a dozen times a day). So fsr this app has not lost connection once. The widget is stable too. While this app is free I would be willing to pay for it.', 'Better than official Roku remote by far. More responsive and quicker to open and switch among multiple devices. Latest update displays the friendly name of the device, too. Open source with no ads and no nags.', "Doesn't scale for the new wider phone screens. Would be 5 stars if it did. Otherwise it's a fine roku remote replacement that doesn't disconnect every time your phone screen turns off.", "Just what I was looking for. Works as well if not better than the original Roku remote widget (removed for some reason). I'd straight up pay if we can get more app features working on the widget (volume, channel buttons). Great work 👍", "Was looking for a replacement once the official axed the remote widget. That's was the whole reason I downloaded in the first place. I have a widget again, I'm happy!!!", "I give it 4 Star the remote works fine but the audio (headphones) don't work for me :(", 'thanks so much for the great app. my Roku remote would not sync until this app. Went to settings after installing and paired it without any problem. thanks', '1 of the many few that actually works. Everything worked fine but here recently the wiget of the remote on my home screen disappeared and i can seem to find it to put it back in there!;!', "has amazing control and it works perfectly and I didn't even have to pay for anything it is totally free.. I really recommend this app for your Roku TV.", 'Why is the app is not connecting to Roku device while i hav connected my roku through hotspot using the same mobile? Why is it always luking for wifi connection?? You guys dont know how to connect your app with roku on hotspot?', "Has no ads supposedly, but in the channels list the first thing in the list, which can't be moved or removed, is and add channel. I understand wanting to monetize, but don't pretend you're not and don't mess with my channel order. Uninstalling.", "cant get it to connect to my roku !! this is like the 5th app I have tried and none of them recognize my device. all the information is the same on my phone and roku but still tells me the ssid isn't recognized.", "I have used this app for over a year for headphone function. Since the update, all it does it cut in and out and it's so annoying. Please fix this issue", "Didn't work ... tried to use to enter in username and password on an app to make it easier - it would show that the letters were entered but I got constant errors.", 'No pairing. Waste of time', 'Works great for when my kids misplace the remote. 😒', 'Works most the time but this is the third time in a month that I ha e had to uninstall and reinstall the app to use it the channels section wont come on and the remote wont work til I do', 'works like a charm, helps incase u lose ur remote, e, cepty Roku 4 had a remote finder witch j think is cool as hell, but i use the app on my tablet so my app remotes huge!! !', 'Dumped the Roku Widget that was updated and no longer worked as a widget. This app is perfect.', 'WoW did not think it would be this easy! And it works better than my actual remote! Now I dont have to yell at my kids when I cant find it!'], 'appId': 'wseemann.media.romote', 'url': 'https://play.google.com/store/apps/details?id=wseemann.media.romote&hl=en&gl=us'}
