{'title': 'Word Counter - Count Words, Sentences & Paragraphs', 'description': '<b>Word Counter</b> is a free and easy to use android application for counting words, sentences, paragraphs and characters in your text as you type. This text tool is designed to boost your productivity and make your life easier. The app can be extremely useful when posting or submitting to platforms which have limits imposed on number of characters, words or size.\r\n\r\nTop Features\r\n\xa0\xa0•\xa0<b>Count as you type</b>\r\n\xa0\xa0\xa0\xa0Count number of characters, sentences, words and paragraphs of the given text as you type.\r\n\r\n\xa0\xa0•\xa0<b>Access to advanced Stats</b>\r\n\xa0\xa0\xa0\xa0Generate following advanced stats for the text\r\n\r\n\xa0\xa0\xa0\xa0\xa0\xa0★\xa0 Time Stats(Reading time, Speaking time, Writing time)\r\n\xa0\xa0\xa0\xa0\xa0\xa0★\xa0 Unique words\r\n\xa0\xa0\xa0\xa0\xa0\xa0★\xa0 Average word length, Average sentence length\r\n\xa0\xa0\xa0\xa0\xa0\xa0★\xa0 Shortest sentence length, Longest sentence length\r\n\r\n\xa0\xa0•\xa0<b>More control to you</b>\r\n\xa0\xa0\xa0\xa0Control how the stats are calculated from settings screen\r\n\r\n\xa0\xa0•\xa0<b>Never lose your typed text</b>\r\n\xa0\xa0\xa0\xa0Automatically save notes when you accidentally leave the apps. Access these texts in future under <b>Drafts</b> section. Edit or delete these drafts as you want. Drafts will also have history when you change any exisiting drafts\r\n\r\n\xa0\xa0•\xa0<b>Save important notes</b>\r\n\xa0\xa0\xa0\xa0Save current text with their stats. Always have your important text and notes one click away!\r\n\r\n\xa0\xa0•\xa0<b>Keep notes up to date</b>\r\n\xa0\xa0\xa0\xa0Edit saved notes as and when data and content of those notes change. You can easily edit your saved notes to keep the notes up to date!\r\n\r\n\xa0\xa0•\xa0<b>Folders for notes</b>\r\n\xa0\xa0\xa0\xa0Organize your write ups and stories by storing them in custom folders!\r\n\r\n\xa0\xa0•\xa0<b>Backup & Restore data</b>\r\n\xa0\xa0\xa0\xa0Export your data manually wherever you want anytime and restore it later so that you never lose your data\r\n\r\n\xa0\xa0•\xa0<b>Open directly from another app</b>\r\n\xa0\xa0\xa0\xa0Now quickly access Word counter from other apps while sharing text.\r\n\r\n\xa0\xa0•\xa0<b>Directly paste copied text</b>\r\n\xa0\xa0\xa0\xa0The app will prompt you to paste recently copied text from clipboard\r\n\r\nPremium Features\r\n\xa0\xa0★\xa0<i><b>Benefits of Premium Plan</b></i>\r\n\xa0\xa0\xa0\xa0Buy our premium plan and get :-\r\n\xa0\xa0\xa0\xa0\xa0\xa0•\xa0<b>Automatic backup of your data on Google drive and Dropbox</b>\r\n\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0Automatic backup of your data everyday on Google drive  and Dropbox so that your data is always safe. You can restore the data anytime you want from settings\r\n\xa0\xa0\xa0\xa0\xa0\xa0•\xa0<b>Frequency counter</b>\r\n\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0Get most frequent words along with frequency of text/word/pattern entered by you\r\n\xa0\xa0\xa0\xa0\xa0\xa0•\xa0<b>Export as PDF</b>\r\n\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0Export notes and all its stats as PDF file\r\n\xa0\xa0\xa0\xa0\xa0\xa0•\xa0<b>Four more themes</b>\r\n\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0 Four extra beautiful themes  (Green Dark, Oceanic Light, Oceanic Dark, Grey dark)\r\n\r\n\r\n\r\nThe word counting app now works with multiple languages such as Arabic, Czech, German, Spanish, French, Indonesian, Italian, Polish, Portuguese, Romanian, Russian and Vietnamese.', 'descriptionHTML': '<b>Word Counter</b> is a free and easy to use android application for counting words, sentences, paragraphs and characters in your text as you type. This text tool is designed to boost your productivity and make your life easier. The app can be extremely useful when posting or submitting to platforms which have limits imposed on number of characters, words or size.<br><br>Top Features<br>\xa0\xa0•\xa0<b>Count as you type</b><br>\xa0\xa0\xa0\xa0Count number of characters, sentences, words and paragraphs of the given text as you type.<br><br>\xa0\xa0•\xa0<b>Access to advanced Stats</b><br>\xa0\xa0\xa0\xa0Generate following advanced stats for the text<br><br>\xa0\xa0\xa0\xa0\xa0\xa0★\xa0 Time Stats(Reading time, Speaking time, Writing time)<br>\xa0\xa0\xa0\xa0\xa0\xa0★\xa0 Unique words<br>\xa0\xa0\xa0\xa0\xa0\xa0★\xa0 Average word length, Average sentence length<br>\xa0\xa0\xa0\xa0\xa0\xa0★\xa0 Shortest sentence length, Longest sentence length<br><br>\xa0\xa0•\xa0<b>More control to you</b><br>\xa0\xa0\xa0\xa0Control how the stats are calculated from settings screen<br><br>\xa0\xa0•\xa0<b>Never lose your typed text</b><br>\xa0\xa0\xa0\xa0Automatically save notes when you accidentally leave the apps. Access these texts in future under <b>Drafts</b> section. Edit or delete these drafts as you want. Drafts will also have history when you change any exisiting drafts<br><br>\xa0\xa0•\xa0<b>Save important notes</b><br>\xa0\xa0\xa0\xa0Save current text with their stats. Always have your important text and notes one click away!<br><br>\xa0\xa0•\xa0<b>Keep notes up to date</b><br>\xa0\xa0\xa0\xa0Edit saved notes as and when data and content of those notes change. You can easily edit your saved notes to keep the notes up to date!<br><br>\xa0\xa0•\xa0<b>Folders for notes</b><br>\xa0\xa0\xa0\xa0Organize your write ups and stories by storing them in custom folders!<br><br>\xa0\xa0•\xa0<b>Backup &amp; Restore data</b><br>\xa0\xa0\xa0\xa0Export your data manually wherever you want anytime and restore it later so that you never lose your data<br><br>\xa0\xa0•\xa0<b>Open directly from another app</b><br>\xa0\xa0\xa0\xa0Now quickly access Word counter from other apps while sharing text.<br><br>\xa0\xa0•\xa0<b>Directly paste copied text</b><br>\xa0\xa0\xa0\xa0The app will prompt you to paste recently copied text from clipboard<br><br>Premium Features<br>\xa0\xa0★\xa0<i><b>Benefits of Premium Plan</b></i><br>\xa0\xa0\xa0\xa0Buy our premium plan and get :-<br>\xa0\xa0\xa0\xa0\xa0\xa0•\xa0<b>Automatic backup of your data on Google drive and Dropbox</b><br>\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0Automatic backup of your data everyday on Google drive  and Dropbox so that your data is always safe. You can restore the data anytime you want from settings<br>\xa0\xa0\xa0\xa0\xa0\xa0•\xa0<b>Frequency counter</b><br>\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0Get most frequent words along with frequency of text/word/pattern entered by you<br>\xa0\xa0\xa0\xa0\xa0\xa0•\xa0<b>Export as PDF</b><br>\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0Export notes and all its stats as PDF file<br>\xa0\xa0\xa0\xa0\xa0\xa0•\xa0<b>Four more themes</b><br>\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0 Four extra beautiful themes  (Green Dark, Oceanic Light, Oceanic Dark, Grey dark)<br><br><br><br>The word counting app now works with multiple languages such as Arabic, Czech, German, Spanish, French, Indonesian, Italian, Polish, Portuguese, Romanian, Russian and Vietnamese.', 'summary': 'Count words, characters, sentences, paragraphs, size and save notes & essays', 'summaryHTML': 'Count words, characters, sentences, paragraphs, size and save notes &amp; essays', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.5526314, 'ratings': 1919, 'reviews': 869, 'histogram': [131, 0, 50, 232, 1504], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': True, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Spians Labs', 'developerId': 'Spians+Labs', 'developerEmail': 'spianslabs@gmail.com', 'developerWebsite': None, 'developerAddress': 'Ved road, Singanpor cross road, Surat - 395004, Gujarat, India.', 'privacyPolicy': 'https://sites.google.com/view/spians/word-counter/privacy-policy', 'developerInternalID': '6068370672555136608', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/9hr0YGpCJxzepGdwHGFkl26zlojRJOxOOIKC37LoRjkbzpatigtWTksii6MJ2QlH_es', 'headerImage': 'https://lh3.googleusercontent.com/eLL1BeVs_3Ij-6u5wdJ-iRv_MHms7fmNgDUUBTEx8Bayh-hM139C9YTKNe3NYuZlakIQ', 'screenshots': ['https://lh3.googleusercontent.com/cYAo14vyxBFcqBRbOHpupmdX3LSRbg9a_yEvR-xI5P6sKbt7PPcKbvJSUn5H51o4Wyg', 'https://lh3.googleusercontent.com/tCX7YxaCge7DeDdM0wmXyu6ZoI4Cs-P61XmyVB3Y7W0Jax6iYJlMHl2GOBMIJAybEf28', 'https://lh3.googleusercontent.com/oD0geba4ayNPIXKNAIyXJpI9JAvmtwzwopOINL_7V7H3g47dKFO0Tf_A5kjHaLNfGPYs', 'https://lh3.googleusercontent.com/3iVUdBNliErRwNT0sp70ybgeHeyLRuy2h0zDPHAUHmnM-vE300orXFJgKeitjFWNmWY', 'https://lh3.googleusercontent.com/4gHTJJrWud-jlYmuoQTZg6ed0xWYJmnNBZE5rbo_AhKDtP5nrvvYAPz3L_U0qKzLDoA', 'https://lh3.googleusercontent.com/O-v8QpEdInpPSwHdkZ2vZrE56XOdDSOYv-ooO5TStUypgqMBAFQR92oDpx2Go29YG2s', 'https://lh3.googleusercontent.com/iONmrbn9AJ7Bw3rzOO3i0ncZ0bqsL10VEmqI9rRxjRUzfSXjHaKyx8K_S534u828TA', 'https://lh3.googleusercontent.com/qU5KMJX59_dmT_CcMJx4rv-1nJWHLviFflhWYVASL0HkerYZHuwvfIf1jVeJiBrg5w'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Apr 19, 2016', 'updated': 1588587274, 'version': 'Varies with device', 'recentChanges': '- feature: Introducing folders to organize your writings! Now organize your notes that way you like by creating different folders\r\n- Fix: Dropbox connection not working for backup & restore functionality\r\n- Fix: Text getting cleared on rotating the device\r\n- Bug fixes and performance improvements', 'recentChangesHTML': '- feature: Introducing folders to organize your writings! Now organize your notes that way you like by creating different folders<br>- Fix: Dropbox connection not working for backup &amp; restore functionality<br>- Fix: Text getting cleared on rotating the device<br>- Bug fixes and performance improvements', 'comments': ["I like this app but I have a few feature suggestions. *1st)* Would you please add undo & redo buttons? Sometimes mistakes happen and it helps to undo what I wrote or go back to something that I wrote. *2nd)* Can you please add a feature where we can compare two versions of the same paragraph and identify the slight differences that exist? It would help if I knew which words are different and which ones are the same. Sometimes I'll make slight edits to something but can't remember what I changed.", "This app has deleted my work more than once while I had the app open but wasn't actively looking at it. The automatic backups have maybe a 25% chance of actually appearing.", 'Really good app, gives the word count and many cool features about the text,really helpful 👍👍💯💯', 'Great for prepping Social media posts when word count is limited. Especially for writers involved in to-the-minute events like international news.', 'It is really one of the best App, easy to use and results are within seconds.', 'Best app for word counting & paragraph.Even Read and speaking time also included to facilitate the user. Thanks Developer', 'It be nice if you can add-in a picture in the background of your note, while writing.', 'Perfect app and I usually use it when I want to count words and many functions the app offer it for everyone.', 'It is nice but it is also weird without scanning', 'Great app accurate AF! IMPORTANT for content writers using phone to jot down articles.', 'The app is very good, but the interface is too complicated.', 'It did as it says. Thanks to this, it was way easier to do my essays that require a certain amount of words ! Thank you very much !', 'Very good app. I liked the use. Thank you..', "It's easy to use.. allowing you to multitask. I use it to apply for Grant's.", "The only word counting app you'd ever need that also has notes you can write in and save.", 'Simple, quick and easy to navigate.', "Best word counter app I've ever used!", 'Easy to use, amazing to keep of my comedy or story writing and have to make it to a certain amount. Yes I could use Microsoft Word but who wants to carry laptop around. This is quick and easy to navigate. Download it and check it out for yourself to see the magic.', 'Easy to use! Help me save a lot of time as my lecturer would usually indicate how many words are needed in an assignment and I know immediately, while writing, that I am not giving an answer that is too short or too long.', 'So far, this has been a superlative app.It helps me immensely, with its neat features and easy to use layout.Good Job!!!!', 'The app is quite easy to use. Congrats to the developer.', 'I love the stats that it has attached to everything you put in there. Average time to read the amount of words? Check. How long would it take to read aloud? Check. How long would it take to hand write? Check. Plus it counts the unique number of words you use.', "Nice app to keep an eye on the words count while writing. It would help you if you're writing a quality story of your own.", "I'm amazed - I love the app. It provides you with everything necessary for free and I did not saw any ads - I'm happy with this !", "I enjoy it because it shows me how many characters I have so I won't go over the limit.", 'Nice app I hope to see undo and redo buttons there someday', "It does what it says it'll do and I've found it very useful.", 'it is the wonder full app for learning typing. on the mobile by physical keyboard.', 'Very useful and nice set up. Thanks a lot!', 'The best I had a school project and it helped counted the words for my project 100-150 is the amount of words', 'Nice and helpful for essay writing and other stuff, I love it 🙂', 'Good app.....user friendly......does what you want', "I used to use this app faithfully, but now it deleted an entire essay I typed up when my screen rotated. I type something else just to make sure it wasn't my fault and no, it did it again. I'm so upset that I can't use this app until that problem can be fixed.", "It's very easy to use and the interface is simple. But I wish that you could just add a folder or category option so I can sift through and arrange the notes that I've written and made.", 'The app is absolutely awesome. Before now I was wondering how to ease the stress of manually counting the number of words my write ups contains, but with the advent of this app, those complaints are history now.God bless the developers richly. Nevertheless, I would still want you guys to brainstorm and come up with additional exciting features to make this app cynosure of all eyes. Thanks, once again.', 'Really helpful, I recommend this app to all.', "I like that it's simplistic but the save feature is wonky. Don't care for it. Opened a note just to have it completely erased when trying to save it and replaced by a different note. There's no undo. It's just gone. No thanks.", 'Great little word counter app. O really like the user interface, very accessible, user friendly, and intuitive, while also looking professional and doing exactly what it says on the tin. The only odd thing is that unlike every other app installed on my phone, I have to manually search the Playstore for this app to update it, rather than it notifying me of an update. Strange.', 'Great tool. I create notes in "Notes" to copy and paste into an online system that limits character count. This tool makes it easy to get my message correct before completing it.', "It's a great app, saves the work once you name it and if not saves it as a draft, so your work is always saved even if you exit the app. Just one thing is that the scrolling for me is not smooth: if you're writing a lot, it's not quick to scroll up and down to read what you have written or come down to the end of your last sentence if you've just opened it. So maybe a scroll bar would bring this app to a 5* level, that's all I can think of."], 'appId': 'wordtextcounter.details.main', 'url': 'https://play.google.com/store/apps/details?id=wordtextcounter.details.main&hl=en&gl=us'}
