{'title': 'Blitzortung Lightning Monitor', 'description': 'Simple to use map based application visualizing real time full area lightning data provided by the blitzortung.org lightning location network project. The current thunderstorm situation at your fingertips.\r\n\r\nFeature summary:\r\n - realtime display of lightning data\r\n - display of historical lightning data of the last 24 hours\r\n - for regions Europe, North & South America, Asia, Africa and Australia/New Zealand\r\n - lightning strike time color coded\r\n - reduced data volume and fast response\r\n - current lightning strike time and lightning count\r\n - optional user location display\r\n - alarm function shows distance/direction of storms\r\n - alarm background service\r\n - support for notifications and vibration alarm\r\n - single stroke display for blitzortung.org participants\r\n\r\nPlease visit http://www.blitzortung.org for more information regarding the community based lightning location project. http://www.blitzortung.org.\r\n\r\nThe raster display ensures a fast performance of the application even if there is a very high thunderstorm activity. Blitzortung.org participants can visualize all stroke locations individually.\r\n\r\nIf you would like to contribute to a translation of the software in your language, please do not hesitate to contact the author of the software.\r\n\r\n<b>Note to Australian/US west coast users:</b> The blitzortung.org network is currently concentrated on the eastern part of the continent. If you would like to help to extend the coverage to other parts of Australia/South America/Asia/Africa, please participate in the blitzortung.org network. Further information can be found here http://blitzortung.org/Webpages/index.php?page=2. Thank you!\r\n\r\nProject Repository: https://github.com/wuan/bo-android\r\n\r\n<b>Using the GPS location provider in combination with the background service can lead to high battery use. Please use the network or the passive location provider for background operation.</b>', 'descriptionHTML': 'Simple to use map based application visualizing real time full area lightning data provided by the blitzortung.org lightning location network project. The current thunderstorm situation at your fingertips.<br><br>Feature summary:<br> - realtime display of lightning data<br> - display of historical lightning data of the last 24 hours<br> - for regions Europe, North &amp; South America, Asia, Africa and Australia/New Zealand<br> - lightning strike time color coded<br> - reduced data volume and fast response<br> - current lightning strike time and lightning count<br> - optional user location display<br> - alarm function shows distance/direction of storms<br> - alarm background service<br> - support for notifications and vibration alarm<br> - single stroke display for blitzortung.org participants<br><br>Please visit http://www.blitzortung.org for more information regarding the community based lightning location project. http://www.blitzortung.org.<br><br>The raster display ensures a fast performance of the application even if there is a very high thunderstorm activity. Blitzortung.org participants can visualize all stroke locations individually.<br><br>If you would like to contribute to a translation of the software in your language, please do not hesitate to contact the author of the software.<br><br><b>Note to Australian/US west coast users:</b> The blitzortung.org network is currently concentrated on the eastern part of the continent. If you would like to help to extend the coverage to other parts of Australia/South America/Asia/Africa, please participate in the blitzortung.org network. Further information can be found here http://blitzortung.org/Webpages/index.php?page=2. Thank you!<br><br>Project Repository: https://github.com/wuan/bo-android<br><br><b>Using the GPS location provider in combination with the background service can lead to high battery use. Please use the network or the passive location provider for background operation.</b>', 'summary': 'Have a quick overview of the current thunderstorm situation whenever you want.', 'summaryHTML': 'Have a quick overview of the current thunderstorm situation whenever you want.', 'installs': '500,000+', 'minInstalls': 500000, 'score': 3.5662022, 'ratings': 5855, 'reviews': 1987, 'histogram': [1285, 510, 469, 785, 2805], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '3.3M', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'WuAn', 'developerId': 'WuAn', 'developerEmail': 'blitzortung@tryb.de', 'developerWebsite': 'https://blitzortung.tryb.de', 'developerAddress': None, 'privacyPolicy': 'https://blitzortung.tryb.de/privacy-policy/', 'developerInternalID': '7213302727771382621', 'genre': 'Weather', 'genreId': 'WEATHER', 'icon': 'https://lh3.googleusercontent.com/Ohe7z6JSYseXZgZDwPRVxFHY2XbrRch1hgnhm7ZRqcSv_cIVKToF9QVePJFEj1Wno66q', 'headerImage': 'https://lh3.googleusercontent.com/vSvM0RdY0Qjy7b28JD9_06v9ph9qOEZyyryNZSoTxPMF2ypf0zKoMn1vbe0Iqa4fh8AP', 'screenshots': ['https://lh3.googleusercontent.com/2LuPSm2pAb5EQ3Kb_Rt4_dSpzqdPeP9hyxqn30vwjTE0Rrf7Yg1ER_TZ5VbHigiE-A', 'https://lh3.googleusercontent.com/6OKdOLPqBHRUko1b3IhBZkGu_DpdYnIuVVTF5zngeu6cS5ASUJaSChtLPCM2h7fqNw', 'https://lh3.googleusercontent.com/u8m56T93iVmTTm6znGz2EXK_7XQD4iY48J34amqkpyacecTvyz-qihk14Y1KPBC8hTQ', 'https://lh3.googleusercontent.com/Y7YDPDuFjVxXFj9DQDWdjjipOmoY0Bq6gctGDItHddfLqCqTeGdOXt322-i5etfPkkM', 'https://lh3.googleusercontent.com/lAtfhzNnXByZP6dsXt4iHtmbkiDmksLVc5rIps8aia1XWLHdbAg_veL0UWkN-AAmYmBo', 'https://lh3.googleusercontent.com/N5LEmbHWbCbrnGv9MI1YmDp5oXdSPA8m7a3DlC5PAeU_0RxM9J3rPT8qnMO3q1aUSvc', 'https://lh3.googleusercontent.com/IjiPmlVOgQAgSkye42dHyaRtTKmPJg-tYAdbnm3OQFJgzAnDFeuHdI3G7ipKA5SsUXo'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'May 10, 2012', 'updated': 1591629864, 'version': '2.1.0', 'recentChanges': '  - Global data mode\r\n  - Local data mode\r\n  - Auto raster size\r\n  - Internal improvements', 'recentChangesHTML': '  - Global data mode<br>  - Local data mode<br>  - Auto raster size<br>  - Internal improvements', 'comments': ["The app currently is great. I use it to track lightning in storms when I storm chase. Learning the minute key isn't very hard. Once you use it a bit it becomes easier to understand what type of lighting storm your dealing with when understanding the numbers and size of storm. It's a great app overall and I would recommend that storm chasers use it. Now it only tracks lightning, so there's no other radar settings than the lighting radar.", 'Very good app with surprising number of possibilities.', "Does not include real time tracking like the i is versions low quality graphics , doesn,t really help with storm development , dev. Is rude and unprofessional , we did not kill your app, YOU did, instead of listening to the feedback and try and resolve the issues with Google maps , you down graded the app and then dropped support on Google play because you didn't like the feedback you were getting, then blamed the users for the apps failure rather then take responsibility uninstalling.", "I've used app every thunderstorm! Allows one to easily predict the direction and severity of electrical storms (and when to take cover). In the past, I would witness lightning and wonder about the distance when it wasnt very clear by calculating by time lag of thunder(when thunder constant and omnidirectional). Now i have a clear picture of events in real time. Ive installed another lightning tracker app and toggle between them as they inhance each other. thanks.", 'Works good after the update', "Best app ever until the recent map update. What have you done. The satellite map was clear and excellent. This new map is absolutely awful low resolution and places written in local dialect? It looks like a child drew it. Why ? Please bring back the old map Google satellite may be outdated but its clear and precise. At least give us the choice. Trust me you've shot yourself in the foot with this one", "Bring back satellite maps! I love this app. Well I did until this update! The map no longer has the option for satellite view. The new style looks awful.Every major road is a wishy washy red and look like veins. I never thought I minded the look of veins until now! Or it looks like the stuff in War of the World's that creeps over the ground although that makes it sound cooler than it is. As other users have said, it's now painfully slow to load and the colours on the map are the same as strikes!", "Love this app. Has great data, and it has inspired me to purchase a Blitzortung Lightning Detector to contribute to the data. I wish everyone would get over the openmap situation, if you don't like it go and find an app that provides the 'boring outdated google maps' that costs the developer to provide to you, at cost. I am very happy with this app and will continue to contribute to this amazing science hobby. Thanks guys great work on keeping up with all the bad reviews, and thank you for this app.", 'I have used Blitz happily for years. It appears that the developers have taken it off Play store and turned off data delivery, so my beloved app no longer works. Supposedly it has been migrated to some place called F-droid. But I cant find any way to download a replacement app or even figure out how to use F-droid. So it appears that this wonderful app is effectively no longer available, even for us loyal users. Such a shame.', "The lightning tracking is accurate and sophisticated, but the map is very slow to load (even on fast wifi) and just looks like a blurred pixellated mess. Previous map for older version was significantly better and loaded/zoomed instantly. UPDATE following reply - as constructive feedback, why not have a 'download offline map' option as part of the app? Much better than the first impression of a really fuzzy map.", "Previously rated this app a 1 star due to the map changing from an informative Google earth style to a childish difficult to read OS style. Today I have come to use it and its not displaying any lightning information and an exclamation mark triangle in the top right. This app has been great for ages and now it seems wrecked. I've downloaded blitzortung from the play store from a different author and guess what. It's working and it's a Google earth style map...... Bye bye guys..... Uninstalled!!!", "edit from 4 to 1 star: this app works when it wants. I can't get any infomation and wants location acces. So... i can't see the database without providing location. Data mining or stupid design? I don't care aboute notofication and i don't think this stupid operating system needs location acces to have a map with 150 logos on it.", 'Update from my previous review: Maps are crude and low res and lack contrast...horrible to look at. Rude reply by developer which is a shame. The resolution is so poor you cannot read some of the town names (what few there are) even with the resolution at highest. (as per their suggestion) Only just seen previous reviews by others. Sad. Going to delete app. Pity. RIP', "maps are no longer detailed which is difficult to see where exactly the lightning strikes occur. If there is an error in the app as the developer don't you think you should fix it? It appears however that the entire app has changed. I've since uninstalled. it's not as good as it was.", 'Despite "worse" map in new version I downloaded app from F-Droid store and it works great. After all of this years having no problems with the app it\'s unfair to be so critical for some issues and still having a solution to have the app for free. So thank you guys and keep on the good work!', "Terrible update. This worked fine until you updated to this version. There's no more option for map satellite view, the maps now take ages to load and resolve fully and the colour is truly terrible. Far too light all over. Please restore this back to the previous version. It was great and did not need changing", "Was good...until the update. It is now really slow to load, difficult to see strikes against the map colours - no sat. view anymore (that i can find) ... Shame. Bring back the old map as i think i may have to uninstall otherwise, it's not great as it is.", 'Great app. I use it all the time.', "Hey there. On your site it says that you're retired from Google Play, but as I can see you still answer the questions, and there's no dates as to when. BTW if you're still leaving...you can ignore the feedback here but don't leave us without updates please :) I would have missed a couple of thunderstorms passing by if I didn't have your app with alerts set up...", "I used to love this app till the June 2019 update! The new map view is awful and I'll be continuing to use the old version. Sad, as other than that it's excellent", 'Very poor map quality and just shows how many strikes in any particular area rather than individual locations of contact. Please listen to your comments and revert back to how it used to be, NOT BROKEN', 'Not liking this app since its recent update. The Maps are terrible in dark or light and there is no other option. The info you need is all there, but looks horrible, please change it back again.', 'Great concept, but lags too much to be useful. Surely using the same data feed as e.g. LightningMaps or even the Blitzortung website, but lags badly (like several minutes) behind both with displaying latest events.', 'Overall this has been a good and stable app until the last two updates. Blank screen or if not blank freezes, even after uninstall and reinstall. Please fix.', 'It seems that very recently the look of the Maps & god knows what else has been changed. If it had remained as it was, it would have scored 5 How can I revert it back to how it was?', "Was a great app until the last update. now it doesn't seem to work properly if at all. keep getting error messages and don't show the storm I was watching", "I can get real time lightening maps online, this thing loads every 60 seconds which seems a bit rubbish when I can just go online and see real time on blitzortung. shame the app isn't as good as the website", 'Its Pretty Good... and would be better if one could get the "strikes Per" on the left side of the display to disappear, as it somewhat obsucates the map...', "🌩️👍🌩️I've tested almost all the Lightning tracker apps and this one is the best, Thanks to a lot of customization and notifications. Hope there will be more. App is free and no ads. 1 thing would be nice : showing stations. Shame it's leaving the playstore due to some entitled and uneducated subhumans 😔.", 'Was a massive part of my UK weather page on Facebook as loved the detail in towns, reliability and accuracy.....however your new update is disappointing and would rather pay monthly before the update.', 'Looking at developer response, I immediately uninstalled.  Clearly they don\'t care what people have to say.  Hard to care about a thing when it\'s creators don\'t.  EDIT:  I guess I need to clarify what I mean.  When a developer responds with: "Do you want to motivate us with the one star? No problem, we removed the app from play store and stopped data delivery. So you can stop complaining about the map."  There is something wrong.', 'this app is a very good implementation of the web site. The ability to add alarms for a radius is very nice as well.', 'As of late the application fails to display any lightning data. There is a triangle with an exclamation point on the top right of the map.', "Satellite map gone :( This isn't navigation app, what is the reason to observe all these roads and streets ... and it's loading so slow now", "The best lightning monitor! I've set it to monitor lightning activity near me in the background and it works great! (just remember to exclude the app from any battery optimization)", "What have you done with this app ? It was really good until you updated it.!!! If it's not broke then don't fix it . A good app ruined, shame. Do us a favour , put it back as it was, i think you would please a lot of people who have used the app in the past .(found another one ). Works 10 times bettet !!! Bye.....", 'After the last update, the map does not appear, and the application loads hard.', 'it works fine, but detracting from score due to removal of satellite maps.', "it was a brilliant app until the update... the map doesn't load and it's horrible! bring back the old map!!!", 'Took quite a while to load the first time, but patience paid off - the new version is a lot more responsive and quicker to navigate. Would it be possible to use openstreetmap files already downloaded on the device, such as the ones used by osmand?'], 'appId': 'org.blitzortung.android.app', 'url': 'https://play.google.com/store/apps/details?id=org.blitzortung.android.app&hl=en&gl=us'}
