{'title': 'Codeforces WatchR: Users, Contests, News, Problems', 'description': 'Nice and user-friendly application, which leverages Codeforces API to bring more competitive programming to Android devices. Codeforces Watcher allows:\r\n1. Watch for activity of any Codeforces user.\r\n2. Sort users by rating and last participation date.\r\n3. Shortlist and register for upcoming Competitive Programming contests: Codeforces, LeetCode, HackerEarth, AtCoder, TopCoder, CS Academy, CodeChef, Kick Start.\r\n4. Follow Recent Actions.\r\n5. Browse and search for Problems.\r\n\r\nEven more amazing features are coming ...\r\n\r\nThis is an open-source project (<a href="http://www.google.com/url?q=http%3A%2F%2Fbit.ly%2Fxorum_gh_cw&sa=D&sntz=1&usg=AFQjCNHK3uh_beiKiyaCzcC8y0g11w0k2A">Codeforces Watcher on GitHub</a>) developed and supported by <a href="http://www.google.com/url?q=http%3A%2F%2Fbit.ly%2Fxorum_source_gp_cw&sa=D&sntz=1&usg=AFQjCNFpxIpO7corOmCwrSiA6XPfsMvjcA">xorum.io</a>. Development: Bohdan Evtushenko. Mentorship: Yevhenii Kanivets.\r\n\r\n<h1>General information</h1>\r\n\r\n<small>Copied from official Codeforces website: codeforces.com.</small>\r\n\r\n<h2> What is Codeforces? What kind of a site/resource is it?</h2>\r\n\r\n<b>Codeforces</b> is a project joining people interested in and taking part in programming contests. On one hand, <b>Codeforces</b> is a social network dedicated to programming and programming contests. On the other hand, it is a platform where contests are held regularly, the participant\'s skills are reflected by their rating and the former contests can be used to prepare. \r\n\r\n<b>Codeforces</b> constantly develops and we plan to improve the platform to give the participants the opportunity to organize their own contests, filling the project with learning content, developing <b>Codeforces</b> as a training and learning platform.\r\n\r\n<h2>What should I do to participate in contests? Is preliminary registration required?</h2>\r\n\r\nContests are regularly held on <b>Codeforces</b>. Participating in them is free and open to everybody. Every month we organize approximately six contests. To participate, you have to be registered on the site (if you have an OpenID or a Gmail account, then you won\'t even have to memorize the password) and register for the oncoming contest. \r\n\r\nMake sure that you are present in the list of the users, registered for the contest, before the registration ends. Usually, if you can\'t take part in the contest officially (e.g. if it\'s the contest for the second division and you are in the first one), then you can register for the contest to participate out of competition.\r\n\r\n<h2>What are the rules of the contests?</h2>\r\n\r\nThey are usually held according to the original <b>Codeforces</b> rules. If it is specially stated, then the International Collegiate Programming Contest rules ACM-ICPC or some other modifications can be used. \r\n\r\nIn brief, on the contests held by <b>Codeforces</b> rules you write solutions to the problems that are tested during the contest on a very small number of tests. Those who have passed that set of solution tests, their authors can block (refuse to resend the solutions of this task in future even if they find a mistake). Such authors receive the opportunity to look through the sources of other contestants, look for mistakes there and suggest the tests on which these solutions do not work. Thus, you can hack somebody else\'s solution and earn points through it.\r\n\r\nAfter the contest all the solutions that have passed the pretests and haven\'t been hacked are tested on the final set of tests. The value of a task decreases during the contest (the faster you solve the problem, the more points you receive), unsuccessful hacks take off the points and the successful ones add them.', 'descriptionHTML': 'Nice and user-friendly application, which leverages Codeforces API to bring more competitive programming to Android devices. Codeforces Watcher allows:<br>1. Watch for activity of any Codeforces user.<br>2. Sort users by rating and last participation date.<br>3. Shortlist and register for upcoming Competitive Programming contests: Codeforces, LeetCode, HackerEarth, AtCoder, TopCoder, CS Academy, CodeChef, Kick Start.<br>4. Follow Recent Actions.<br>5. Browse and search for Problems.<br><br>Even more amazing features are coming ...<br><br>This is an open-source project (<a href="http://www.google.com/url?q=http%3A%2F%2Fbit.ly%2Fxorum_gh_cw&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNHK3uh_beiKiyaCzcC8y0g11w0k2A">Codeforces Watcher on GitHub</a>) developed and supported by <a href="http://www.google.com/url?q=http%3A%2F%2Fbit.ly%2Fxorum_source_gp_cw&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNFpxIpO7corOmCwrSiA6XPfsMvjcA">xorum.io</a>. Development: Bohdan Evtushenko. Mentorship: Yevhenii Kanivets.<br><br><h1>General information</h1><br><br><small>Copied from official Codeforces website: codeforces.com.</small><br><br><h2> What is Codeforces? What kind of a site/resource is it?</h2><br><br><b>Codeforces</b> is a project joining people interested in and taking part in programming contests. On one hand, <b>Codeforces</b> is a social network dedicated to programming and programming contests. On the other hand, it is a platform where contests are held regularly, the participant&#39;s skills are reflected by their rating and the former contests can be used to prepare. <br><br><b>Codeforces</b> constantly develops and we plan to improve the platform to give the participants the opportunity to organize their own contests, filling the project with learning content, developing <b>Codeforces</b> as a training and learning platform.<br><br><h2>What should I do to participate in contests? Is preliminary registration required?</h2><br><br>Contests are regularly held on <b>Codeforces</b>. Participating in them is free and open to everybody. Every month we organize approximately six contests. To participate, you have to be registered on the site (if you have an OpenID or a Gmail account, then you won&#39;t even have to memorize the password) and register for the oncoming contest. <br><br>Make sure that you are present in the list of the users, registered for the contest, before the registration ends. Usually, if you can&#39;t take part in the contest officially (e.g. if it&#39;s the contest for the second division and you are in the first one), then you can register for the contest to participate out of competition.<br><br><h2>What are the rules of the contests?</h2><br><br>They are usually held according to the original <b>Codeforces</b> rules. If it is specially stated, then the International Collegiate Programming Contest rules ACM-ICPC or some other modifications can be used. <br><br>In brief, on the contests held by <b>Codeforces</b> rules you write solutions to the problems that are tested during the contest on a very small number of tests. Those who have passed that set of solution tests, their authors can block (refuse to resend the solutions of this task in future even if they find a mistake). Such authors receive the opportunity to look through the sources of other contestants, look for mistakes there and suggest the tests on which these solutions do not work. Thus, you can hack somebody else&#39;s solution and earn points through it.<br><br>After the contest all the solutions that have passed the pretests and haven&#39;t been hacked are tested on the final set of tests. The value of a task decreases during the contest (the faster you solve the problem, the more points you receive), unsuccessful hacks take off the points and the successful ones add them.', 'summary': 'Activity of Codeforces users, upcoming contests, recent actions and problems.', 'summaryHTML': 'Activity of Codeforces users, upcoming contests, recent actions and problems.', 'installs': '5,000+', 'minInstalls': 5000, 'score': 4.72, 'ratings': 202, 'reviews': 32, 'histogram': [4, 0, 6, 28, 163], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '7.4M', 'androidVersion': '5.0', 'androidVersionText': '5.0 and up', 'developer': 'xorum.io', 'developerId': 'xorum.io', 'developerEmail': 'hello@xorum.io', 'developerWebsite': 'https://xorum.io', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '4656166362077634217', 'genre': 'Education', 'genreId': 'EDUCATION', 'icon': 'https://lh3.googleusercontent.com/tXaag0fFMQKNLgEkMu1xYbWzXlKCunVm2JHHpcZ2KzR_Be_2wMpQJ75pldnalOW-MAwW', 'headerImage': 'https://lh3.googleusercontent.com/ZDPyGe485nJeMR5IxVXkpA_648o5uLImG6NfiqwSNaraHoXXuKFBne9dug4QPLDJ6ms1', 'screenshots': ['https://lh3.googleusercontent.com/9AF001vvLDHYITC79r04zW27-TZao5dCeAE-Ms4lrtzv4UlQzgGpwkd0A_S6_hcWrg', 'https://lh3.googleusercontent.com/W4TirgInXcle8v6mN7qxWL3VWBz_3j9gJVwzKjjIPtzw0G8XpMA47at2pKzEUz0j4w', 'https://lh3.googleusercontent.com/6BB6gLOxvmQJFpwubTLmEL6PoTkMUUjlSlFLVWc-iLkx6movgVeZHEyZbjn-eGRsuahx', 'https://lh3.googleusercontent.com/4e8a9As8zsX90slsoYQ39v99b7z3gaquTxrBWmc9zisE_Tyb0w1hffeu0Kx6YBpEDg'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jun 19, 2018', 'updated': 1591250772, 'version': '1.6.0', 'recentChanges': '- Update "Add User" dialog.\r\n- Add rating changes to rating\'s graph.\r\n- Fix minor bugs.', 'recentChangesHTML': '- Update &quot;Add User&quot; dialog.<br>- Add rating changes to rating&#39;s graph.<br>- Fix minor bugs.', 'comments': ["I'll change my rating to a 5 star if you change the add to calendar to automatically fill out end time. (And maybe even add automatic custom features for Google calendar like color and notifications?) Really good app, download it.", 'It added problem description. Which i ve been looking for so many days.', 'Thanks for great Would love to see feature like search problems by tags', 'Very good experience', 'It would be great if you consider to add a widget for upcoming contests', 'The design is great, experience is seamless.', 'Keep on loading contest details', 'The app is really good. I am eagerly waiting for you guys to add the access to question.', 'Good but some features need to be added.', 'Cool! So fast and easy to use.', 'nice apps need feature: login into my account', 'Nice work. It is really helpful 😊', 'Hey you are a real good app dev.', 'So far so good... ❤', "It's Good", 'Awesome.', 'Well done.', 'Good app', 'Almost good.', 'Love it', 'useful app', 'Useless.'], 'appId': 'com.bogdan.codeforceswatcher', 'url': 'https://play.google.com/store/apps/details?id=com.bogdan.codeforceswatcher&hl=en&gl=us'}
