{'title': 'SuperGenPass', 'description': "SuperGenPass is a different kind of password manager: instead of randomly generating and storing passwords, it combines a Web site's domain and your master password to generate a unique password for each Web site you visit using a strong crypto hash.\r\n\r\nThis tool helps prevent cross-site password compromises by creating a different password for each site that you visit. A malicious or compromised site won't be able to use your password to get into any of your other accounts, as each password will be unique.\r\n\r\nThis is the same algorithm as the one used on http://supergenpass.com/ and is designed to integrate into the Android experience as much as possible.\r\n\r\nYou can launch SuperGenPass straight from the web browser by long-pressing on the URL bar→share page→SuperGenPass.\r\n\r\nThis app also includes a strong PIN generation algorithm. It's a slightly modified version of RFC4226 HOTP (modified to work with domains instead of numerical counters) and is designed to never generate easily-guessable pins, such as 1234, 0000, 1985, 8675309, or 0007.\r\n\r\nThis password generator is licensed under the GPLv3 (GNU GPL version 3).", 'descriptionHTML': 'SuperGenPass is a different kind of password manager: instead of randomly generating and storing passwords, it combines a Web site&#39;s domain and your master password to generate a unique password for each Web site you visit using a strong crypto hash.<br><br>This tool helps prevent cross-site password compromises by creating a different password for each site that you visit. A malicious or compromised site won&#39;t be able to use your password to get into any of your other accounts, as each password will be unique.<br><br>This is the same algorithm as the one used on http://supergenpass.com/ and is designed to integrate into the Android experience as much as possible.<br><br>You can launch SuperGenPass straight from the web browser by long-pressing on the URL bar→share page→SuperGenPass.<br><br>This app also includes a strong PIN generation algorithm. It&#39;s a slightly modified version of RFC4226 HOTP (modified to work with domains instead of numerical counters) and is designed to never generate easily-guessable pins, such as 1234, 0000, 1985, 8675309, or 0007.<br><br>This password generator is licensed under the GPLv3 (GNU GPL version 3).', 'summary': 'SuperGenPass — a database-free password manager', 'summaryHTML': 'SuperGenPass — a database-free password manager', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.54, 'ratings': 305, 'reviews': 96, 'histogram': [12, 3, 24, 33, 231], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '329k', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'staticfree.info', 'developerId': 'staticfree.info', 'developerEmail': 'steve@staticfree.info', 'developerWebsite': 'http://staticfree.info/projects/sgp/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8974715838603478290', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/UfuqctOlKzlnbBkdasxhKKCsb4VadjFYUSWAWqFqmRd_Smx0eAF4ALn1LE40SfybydV6', 'headerImage': 'https://lh3.googleusercontent.com/miuJHdF27DfF1Wk2DMwoLIhamjeCW2C2GKMoTsb1Vnqo8I1uyCDij-C6qNya7lzmuw', 'screenshots': ['https://lh3.googleusercontent.com/YWIGbfJqJqDKWdPY5Pq7q4XInW3A6DXvMMaN0JiDKvzDUWmdzWIHwNZEWbsIEfjdPA', 'https://lh3.googleusercontent.com/hToCjC-qRvJCAzg5INYiZ937OwQwNcH03KaDAVK3Cn8R3l3hRdjZ6PR0gAvchEUt-w80', 'https://lh3.googleusercontent.com/01E3ayggi4K5gbWpvseuEg2RoKZGFbhZoaSuFqBwttL6JuJdVr427YT5iS_x1H4hMAOL'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': None, 'updated': 1521513028, 'version': '3.1.1', 'recentChanges': 'Add support for storing master password on NFC tags.', 'recentChangesHTML': 'Add support for storing master password on NFC tags.', 'comments': ["It's a nice program and almost a must-have: a nice simple deterministic password-generator. (The password-generation is available online (google-search: supergenpass mobile): so, it has device- and platform-independent support. Note: the site's-domain-or-keyword field in this app allows spaces and the capitalisation of letters is ignored whereas, with the web version, this isn’t the case.) The deficiencies of this app include: it should have a quicker and neater way to change the length of the generated password; password-length is limited to a maximum of 24; generated passwords are strictly alphanumeric (no symbols).", 'Not a plugin but more secure.', 'Kelly nelson', 'Switching from a dark grey to white background in the v3 update makes the visual hashes/patterns much harder to see now. Would you consider adding an alternative dark Material theme in a future update?', 'I have been using this for a few months now and it works fast with no force closes. The password visual hashing is a good idea and now I have different passwords for every forum as recommended without overloading my brain. If there was a way to export the domain list or save it that would be great, possibly with password protection.', "Possible to change length from main screen? Lots of users have requested for this option. Few websites don't use large length so forced to change every now and then by going to settings which is bit tedious", 'Learn how to use it, and you can legitimately ditch password managers. This app is a must-try.', 'Great! But there are two wishes: first, separate field for secret password like in the parent app, second, make appearance of identicon the same as in desktop version', 'Brilliant. Use it all the time.', 'My fave password manager', 'Love this application.', "Does the job well, very usable. Wonder if it can install itself as a custom keyboard so it's easier to use from other apps?", 'Handy for making quick passwords on the go. 5 stars if I can switch the generated pass length & salt/master passwd from main screen.', 'Sometimes even the ugly ones get the girl. I mean get the job done.', 'Been using for ages. Would have been PERFECT if the length field is on the main page.', 'Very simple app, no permissions needed and does its job flawlessly', "I don't see an option for adding the secret password.  Could that be added?", 'Very useful and stable app. It would be better if master password could be remembered for session for example.', 'Not new user', 'TLD Option?', 'The new icon is really not well designed, but the real issue is the text "SuperGenPass" causes the last "s" to be displayed on a second line (i.e. a page-return), which really looks awful in the drawer. Please fix this so this otherwise outstanding app could be 5-star worthy.  Reply to Dev Comment: The original icon was better than the key you replaced it with. Suggestions for titling could be to just insert a space. i.e. Super GenPass or Super Genpass', "Great app to calculate your passwords and save to the clipboard, loses one star as there's no option to see your master password as you enter it", 'Been using this app for ages. Great for supergenpass users on Android!', 'Wish it could integrate with all apps on the system', "Allows you to generate passwords easily. Requires no permissions so there is no chance of leaking info. Don't know if it's secure to leave PW on clipboard, but it's easy to copy something else", 'New icon is ugly.', 'That visual hash idea is rather clever! Awesome job!! Btw, people 1-starring this just for a difference of opinion about the app icon are beyond petty. Grow up!', 'Wish it could be integrated into the OS to work inside all apps natively.  Might be something to request in cyanogenmod.', "So nice to be able to have this option on my phone. I just wish I didn't have to go to a browser or physical app to run.", 'SuperGenPass is great and this app brings it to mobile. Loving it!', 'Great app - works perfectly.', 'My faithful sidekick.', 'awesome!', 'Very useful', 'Idea', 'Best password management solution out there. Use it for all my passwords.', "Add ability to launch via hotkey so I can launch from within browser or apps. Vibrant don't have hotkeys built in boo", 'I have it bound to search+p for quick access. Would be even better if it was an "input method"', 'This is one of my most used apps. Thankyou so much for bringing it to Android.', 'Works good but should allow selection of length and choice of special characters'], 'appId': 'info.staticfree.SuperGenPass', 'url': 'https://play.google.com/store/apps/details?id=info.staticfree.SuperGenPass&hl=en&gl=us'}
