{'title': '24h Analog Clock Widget', 'description': "This is a homescreen widget that displays a 12-at-the-top 24 hour analog clock. Noon is at the top, so that the hour hand mimics the path of the sun.\r\n\r\nIn addition to the time, it will display when the sun rises/sets for your current location on the dial. \r\n\r\nThis widget offers 2x2 and 3x3 sizes, and is fully resizable on 4.x devices.\r\n\r\nPermissions:\r\nThe sunrise/sunset feature uses the location permission. This will not impact battery life as it never actively requests location - it only uses cached locations acquired by other apps.\r\n\r\nNOTE: if the widget's hands suddenly disappear, please try removing the widget from the homescreen and then re-add it. If that doesn't work, please contact the developer. This is a known issue and is being looked at presently.\r\n\r\nNote note: Support for the Galaxy Note is coming soon! If you are a developer and want to help with the effort of bring Note support, please contact the developer below.\r\n\r\nSource code is available on the site.\r\nlicense: GPL v3", 'descriptionHTML': 'This is a homescreen widget that displays a 12-at-the-top 24 hour analog clock. Noon is at the top, so that the hour hand mimics the path of the sun.<br><br>In addition to the time, it will display when the sun rises/sets for your current location on the dial. <br><br>This widget offers 2x2 and 3x3 sizes, and is fully resizable on 4.x devices.<br><br>Permissions:<br>The sunrise/sunset feature uses the location permission. This will not impact battery life as it never actively requests location - it only uses cached locations acquired by other apps.<br><br>NOTE: if the widget&#39;s hands suddenly disappear, please try removing the widget from the homescreen and then re-add it. If that doesn&#39;t work, please contact the developer. This is a known issue and is being looked at presently.<br><br>Note note: Support for the Galaxy Note is coming soon! If you are a developer and want to help with the effort of bring Note support, please contact the developer below.<br><br>Source code is available on the site.<br>license: GPL v3', 'summary': '12-at-the-top 24 hour analog clock homescreen widget', 'summaryHTML': '12-at-the-top 24 hour analog clock homescreen widget', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.33, 'ratings': 478, 'reviews': 256, 'histogram': [23, 19, 43, 81, 310], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '263k', 'androidVersion': '2.1', 'androidVersionText': '2.1 and up', 'developer': 'staticfree.info', 'developerId': 'staticfree.info', 'developerEmail': 'steve@staticfree.info', 'developerWebsite': 'http://staticfree.info/projects/24h_clock/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8974715838603478290', 'genre': 'Personalization', 'genreId': 'PERSONALIZATION', 'icon': 'https://lh3.googleusercontent.com/e8xoXj479Opm_V_LE0jw5a9s8Ia0sIm57oAfIzrkJztkQt5sDXl8DRkDs80aoMUnc3jr', 'headerImage': 'https://lh3.googleusercontent.com/k_caJDMugAZuDOK-vVn0HzU1BAjAkYKQVvexYyftB34KkNRi8dpwmviSYfmtLHiyjTI', 'screenshots': ['https://lh3.googleusercontent.com/n7_gore969T0WjKBIH7Wk6hWYQAsedFqLtU0qqMYPAwupvMS3Bq-VNeeCfuDBDnT4w', 'https://lh3.googleusercontent.com/JREJWaMZuOnorKE8J8DDTXoGAW8drGvXxEU7Y_fl_1k9lBG1tukilEhwE_C4CKIUFi8S'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 25, 2011', 'updated': 1365777475, 'version': '0.4.2', 'recentChanges': '0.4.2: \r\n•  should fix disappearing hands; if this problem persists, please contact the developer.\r\n\r\n0.4.1:\r\n• fixes upgrade path for 2.x devices\r\n\r\n0.4:\r\n• adds resizable widgets on 4.x devices and 2x2, 3x3 for 2.x devices\r\n• widget can now be used as a lockscreen widget on 4.x devices\r\n• detects some timezone inconsistencies when travelling\r\n• performance improvements\r\n• adds French translation (thanks, Mathieu Belleville!)', 'recentChangesHTML': '0.4.2: <br>•  should fix disappearing hands; if this problem persists, please contact the developer.<br><br>0.4.1:<br>• fixes upgrade path for 2.x devices<br><br>0.4:<br>• adds resizable widgets on 4.x devices and 2x2, 3x3 for 2.x devices<br>• widget can now be used as a lockscreen widget on 4.x devices<br>• detects some timezone inconsistencies when travelling<br>• performance improvements<br>• adds French translation (thanks, Mathieu Belleville!)', 'comments': ['Great widget. Easy to read well designed face. Accurate sunrise and sunset times.', 'Nice, but clock face is too small... More color options would be great, too. An option for a smooth 2nd would also be nice.', 'Great idea, Midnight at the bottom! To that reviewer who complained wanting noon at the bottom--there are DOZENS others already like that. I wish the military would have had midnight at the bottom when I was in the Air Force. By the way, why can\'t I find any "settings" so I can make it a wallpaper on Android?', 'I love this clock face. I would give it 5 stars if it would reliably advance in time with the digital display. Often, it hangs on a time display while real time passes. Please fix this.', "Hello Steve  Is it possible to request an update on the Widget? I use a Sony Xperia XZ Premium device, it has state-of-the-art technology and specifications, but unfortunately using the 24 Hour Clock Widget doesn't seem to refresh or keep up with the correct time settings - I looked at all the reviews and noticed that there hasn't been any recent response to questions or comments pertaining to the same issue. Are you not wanting to improve on such a remarkable App and Widget anymore? I'll send you another email in around 3 weeks from now if I don't hear anything from you, in addition - I'm going to Cc in Google Play Management, just to get some suggestions on how to approach getting the support that I would need.  I appreciate your efforts if any, and really hope that you're still developing this ground-breaking App...   Jermaine K. Newby", 'Perfect to memorize the better clock. Thank you!', 'Excellent. A few years ago I made some real (not virtual) clocks based on this design.', 'I like it. I wish it had a wallpaper or screensaver option and a few color themes.', 'I really love it but I wish there was something new. the dark version for Android wear is a nice change can we get that skin for this?', 'Cool widget, does everything according the description', 'Works and looks great!', 'But there are no settings or something is mulfunctioning on my system. There is no gadget also. It works only as app and around it is black screen with that message "this is prewiew of the ...." and no other options i cant remove that message.but clock works. Surize/sunset marker is good idea i was thinking similar year ago.one sugesstion, add smal top down icon of earth which is spinning in real time with location and 12o\'clock set as the sun...something like that.and make it so that it can be turned on/of', 'Nice and simple design but the time is always out when I return to my home screen and takes an age to update. Currently using Nova launcher on Gs6. If it did work it would be nice to have a few more options, such as specifying border width, transparency etc.', "It does only have one style, but of all the styles it could be in, it's the most neutral/universal timeless one. It doesn't look dated or pixelated or half-assed. It's super cool that it incorporates a sunrise/sunset gauge-- a feature I wasn't expecting to find when I was searching for a 24-hr analog clock. There are only two ways that I can imagine this widget being even better: adding the ability to toggle displaying the minutes hand/minutes.", 'It loses track of what area to shade and reverts to default when offline. The widget app should store its last locale along with a table of sunrise and sunset times - or just remember the last online shading, as a close approximation, until one goes back online again.', 'I was long-looking for a 24h face that includes the sunrise and sunset crosslines. This app has it all but with a dull face. It needs to give some color and theme options.  Also, we tend to shutdown the position option to save battery life... The widget needs to remember the sunrise and sunset times and keep them on the face when no position function is available rather than reseting to be at 6am 6pm constantly.', 'I just happened to get a watch recently that had a 24 hour dial on it. It got me thinking about how odd it is that the standard analogue clock goes around twice every day. I mean, a 24 hour clock is a much clearer indication of where we are in relation to the day. Also, I like apps that do what they do. Simple and clean. This one ticks all the boxes for me.', "Night shadow never moves from 6 and 18, I wish it would see my time zone and location to adjust for sunset and rise. Why can't I change colors on the clock? Grey and white is boring sometimes. Other than that, nice widget. I have Samsung Galaxy S6 with Android 6.0.1 on Sprint.", 'I can resize it to be small or fullscreen! Clock gives two perspectives i want.  1. How much sunlight i have left. 2. The full day in one circle.  This allows a view of the whole of my day, that the standard clocks fail to show.   Makes the ampm standard clock seem irrational.  The min & hr hands starting from dif ends takes getting used too, but is the way it shouldve been all along.  Makes sense.', 'The clock face doesn\'t really jell with the current Android style, so the ability to change it would be welcome. That aside, having midnight at the bottom is a nice touch, as is the sunrise/sunset marking. ...side note: another reviewer said there\'s a "12-hour minute hand" and gave it one star... Whut? It\'s a sixty-minute minute hand, ya dingus.', 'My phone says: This app has 787 irregular activities since last charge = \nexcessive processor usage when screen is off. Can you explain why?', "The instant GPS is off the night day feature stops working. Why can't it remember and use the last known location? Also no option to show civil twilight. Other customization such as font or colors would be nice.", "If I could change the orientation of the face, or remove the sunrise/sunset times, I would give it 5 stars. Also lacks theming. Other than that, awesome widget. It's on my home screen.", 'Love this app -- none like it -- works great!! Thank you!! :)  Wish I had an option to show 24-hour daylight for a location other than my own (to be abke to choose location of family member living elsewhere).', "If you don't have GPS on all the time, this app will forget where it is and the day/night dial will go 50-50 white and grey. It needs to be able to save the most recent location and use that until GPS is turned on again.", 'Wish it was the default clock. Stuck to my homescreen! Would be amazing if it had options, possibly day/night gradient? Nice work!', "We have 24 hours in a day. Why use a clock or watch that shows only 12? This delightful app also shows when it's dark during that 24 hour day and it is fascinating to see the shaded portion of the dial shrink a little each day towards midsummer and then grow to its maximum at midwinter.", "Wonderful 24 hr clock. I like the full day clock. This is a great open source widget. It would be nice to have an option to turn the right side into PM as I'm not that good with 24 time.", "Unfortunately it appears to be broken by lollipop. Disappearing hands on N6,  N9 & my N4 after it's upgrade.", "Very tasteful and clean design.   I was hoping to use it as a Daydream on my Android 4.4 phone. I'd love to see that functionality added.", 'Sunrise and set works great at 68 degrees North and everywhere South. Brilliant widget. I wish it would save the location so that going offline does not flat-line dawn and dusk.', 'Could you make it configurable? I prefer "midnight-on-top" because it is more like a standard watch; iq more easily/natural to read.  (and maybe choose a black dail?) I love the sunset/sunrise indication! Maybe add the moon-phase as well  :-)  Thumbs up for the simplistic design.', 'Love love love! If there was just a bit of customizability (even just a dark scheme) I would give it five stars!', 'Configurable would make it 5. 0 attachments the top & skins would be win. Permissions are excellent & props for only using cached data. Most important: this widget fails to suck. :-)', 'Others have tried to get too "arty". I love this one. Some color choices and live wallpaper options would make it perfect.', 'I love the simple, readable interface and day/twilight indication. I would like some the option to remove the minute hand.', 'Keeps not updating the time....works for a while, then freezes....  Its a shame...', 'Would be killer to be able to manually enter my wake time and bed time to show as small lines on the clock face to REALLY see my day from beginning to end (very similar to the shaded night time feature). 5 stars for a few customization options. Overall it does look good and it does what it says.', 'Makes more sense than a 12 hour clockface. Sunrise and sunset at a glance, noon at the top. The only missing options are to align solar noon to the top, and to put the 0/60 minute at the bottom.', 'The time it displays is always a few minutes slow.  It is pretty, but not useful for telling time.  Please fix it.'], 'appId': 'info.staticfree.android.twentyfourhour', 'url': 'https://play.google.com/store/apps/details?id=info.staticfree.android.twentyfourhour&hl=en&gl=us'}
