{'title': 'Units', 'description': 'Units is a powerful unit-aware calculator. \r\n\r\nIt can convert between ≈2,400 different units, making it an ideal unit converter for complex or obscure tasks. It has everything - from basic distances, volumes and temperatures, to kitchen weight-to-volume conversions, to chemistry- and physics-specific units and equations. \r\n\r\nUnits can convert between dimensions, for example,  multiplying distances to get area and volume. \r\n\r\nUnits is licensed under the GPLv3 (GNU GPL version 3) and is inspired by GNU Units.', 'descriptionHTML': 'Units is a powerful unit-aware calculator. <br><br>It can convert between ≈2,400 different units, making it an ideal unit converter for complex or obscure tasks. It has everything - from basic distances, volumes and temperatures, to kitchen weight-to-volume conversions, to chemistry- and physics-specific units and equations. <br><br>Units can convert between dimensions, for example,  multiplying distances to get area and volume. <br><br>Units is licensed under the GPLv3 (GNU GPL version 3) and is inspired by GNU Units.', 'summary': 'The most powerful unit-aware calculator, with over 2400 units.', 'summaryHTML': 'The most powerful unit-aware calculator, with over 2400 units.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 4.18, 'ratings': 369, 'reviews': 125, 'histogram': [29, 22, 40, 36, 239], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '229k', 'androidVersion': '1.6', 'androidVersionText': '1.6 and up', 'developer': 'staticfree.info', 'developerId': 'staticfree.info', 'developerEmail': 'steve@staticfree.info', 'developerWebsite': 'http://staticfree.info/projects/units/', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '8974715838603478290', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/kj0ax42YAWzEQj9HeY4TG_nQgD12TZ4J5FRoaMiFFSN_OyQJTP8nYPcB8TSKbVpCr_M', 'headerImage': 'https://lh3.googleusercontent.com/1gaYkc1dd8-4TFXqLqivfIIFjmLIByvogEmDiQ0Ghno7U1iGD5_wqQRGh-5dHz1MoOs', 'screenshots': ['https://lh3.googleusercontent.com/Nk8qrSg6YRam_XE8rziCUiicj8xqCrDjWXSS1JLU2q6C0Wwn1oJp-CG8zPYThM0QEA', 'https://lh3.googleusercontent.com/tANFZXaKtaHKI_FpIUUIogzwdp9KewtLkH_KJ1mkSdR1QrU42_MlrcsKWC3FOxc-tLE', 'https://lh3.googleusercontent.com/m68iLTGhth3QjKjosA-ny4m220xhJ3J2YaVDqHmpA5LBBlDIK_jH_tedAdv0kt5qyek', 'https://lh3.googleusercontent.com/-Fz6XJc5mat2-rRbQuUMcAnGI6vzHCZ78pKMdB_3ZOSNNaW-T_76KcCFQwqU_D2EIsa2'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Jul 11, 2010', 'updated': 1316071235, 'version': '1.0', 'recentChanges': '•Adds advanced keypad. Just swipe the keyboard to the left!\r\n•Improves keypad UI; now defaults to search units.\r\n•Fixes rounding error.\r\n•Adds Russian translation (thanks Andrejs Gorbunovs!)\r\n•Numerous other bug fixes.', 'recentChangesHTML': '•Adds advanced keypad. Just swipe the keyboard to the left!<br>•Improves keypad UI; now defaults to search units.<br>•Fixes rounding error.<br>•Adds Russian translation (thanks Andrejs Gorbunovs!)<br>•Numerous other bug fixes.', 'comments': ["Linux's unit made easy", 'I bought a new phone nd was finding this app ....I hv to scroll  down a bit longer to found dis app ...there are still many apps of converter here on google play bt it is only this app on which I can trst by heart......this app helps me alot to solve problems of Bullshit physics .....thnxx fr giving us such a nc app', 'Having been spoiled by the power of the Unix Units program, I went looking for a clone of it. Found it finally! Great!  By the way, it doesn\'t just convert, it does arbitrary calculations like "3 ft + 2 in".', 'Been looking for something like this (even considered trying to port qalculate) - particularly like the autocomplete. Needs more and useful data units (technically gigabytes is correct but desperately need GiB etc). Ideally more scientific functions on advanced keyboard without needing to use autocomplete so could replace calculator.', "It has a terrible interface. It's not set up well at all. You can't select a from unit and a to unit, press convert and get an answer. Nothing is clearly labelled. It's far from intuitive or user friendly. Keep looking.", "Package file incorrectly signed Update won't install.. says package file was not signed correctly...", "Finally, somebody thought of not reinventing wheel and reusing existing code instead for this task! Should be in the top downloads IMO, but maybe people on Android don't like GPL or too many features :)  One feature I miss is possibility to overlay the units database - e.g. to update currency conversions. Also integration e.g. with calculator++ would be nice.", "For a long time, I've wanted to have the power of Google's search calculator on my phone.  Come to find out, it's backed by GNU units, which is also the basis of this app.  Adding in the interface that improves on the built-in calculator, and you've got the best back-of-the-envelope calculator available on the play store.    Quick question for the developer: does it do a periodic units_cur update to make sure the currency exchange rates are up to date?", "I'm a tech-head.  I would suffocate without this app. Many thanks.", 'Awesome. Unlike the tons of other converters, this one can do things like converting time and distance to velocity which is hugely helpful. FLOSS too.', 'I use it daily for stuff ranging from fuel consumption to astrophysics. You can input your mass in pounds divided by squared height in inches and ask for result in kg/m2, and it will figure it out and give you your BMI', 'Could have been simplified a great deal but overall a very good option especially for a wide array of different measurements common and rare.', 'Was looking for something that allows you to build complex unit structures on the fly like Univerter did for Windows. Seems to work very well.  Input method is pretty straightforward and efficient.', "It's missing one unit, the cubit. You gotta be careful with orders of operations but that just like any calculator.", "I've been using this app for all conversion needs, but today I found it does not have meters per second. What..?", 'This app knows every concevable unit! Not quite as versatile as the linux command line tool, but still very useful.', 'I like it, but it needs some corrections: 1 GB is not 1000000 kB.', "Units has long been a staple for Unix command line users. It's nice to find it on Android", 'Contains every conceivable unit! Free, open source and requires no special permissions to run', 'Perfect. I could not ask for more.', "Great for simple stuff and the only calculator I've seen on android useful for an engineer.", "Degree C &lt;-&gt; Deg F doesn't add the 32 degree offset.", "Don't use it often but it is invaluable on occasions", 'Will make use of this', 'I am an engineer and this app is one of my must haves.', 'The suggested units make this more handy than the command line version.', 'Not immediately intuitive. But worth reading the help: this really is very clever.', 'title', 'You want to convert something to something else?  You want this app.', "Works great, can't beat the price!", 'Would be nice to select colors in settings.', 'Useful  and open  source.', 'gtra', 'Rules', 'Perhaps need an update.', 'Thanks -- 4s!', '___.', 'Lol', 'Great', 'Awsome app'], 'appId': 'info.staticfree.android.units', 'url': 'https://play.google.com/store/apps/details?id=info.staticfree.android.units&hl=en&gl=us'}
