{'title': 'Transistor Radio', 'description': 'Transistor is a bare bones app for listening to radio programs over the internet. The app stores stations as files on your device\'s external storage. It currently understands streams encoded in MP3, AAC and Ogg/Opus(*).\r\n\r\nImportant note: This is an app of type BYOS ("bring your own station"). It does not feature any kind of built-in search option. You will have to manually add radio stations.\r\n\r\nTransistor is free software. It is published under the MIT open source license. You can find the code on GitHub (https://github.com/y20k/transistor). GitHub is also a good place to file bugs or even to contribute, if you are interested.\r\n\r\n+ How to add a new radio station?\r\nThe easiest way to add a new station is to search for streaming links and then choose Transistor as a your default handler for those file types. You can also tap the (+) symbol in the top bar and paste in streaming links directly. Please note: Transistor does not feature any kind of built-in search option.\r\n\r\n+ How to play back a radio station?\r\nTap the Play button ;).\r\n\r\n+ How to stop playback?\r\nTap the Stop button within the app or on the notification - or just unplug your headphones.\r\n\r\n+ How to start the sleep timer?\r\nTapping the Clock symbol in the stations detail screen starts a 15 minute countdown after which Transistor stops playback. An additional tap adds 15 minutes to the clock. Playback must be running to be able to activate the sleep timer.\r\n\r\n+ How to place a station shortcut on the Home screen?\r\nThe option to place a shortcut for a station on the Home screen can be accessed from the station\'s three dots menu. A tap on a shortcut will open Transistor - playback will start immediately.\r\n\r\n+ How to rename or delete a station?\r\nThe rename and delete options can be accessed both from the station\'s detail screen. Just tap on the three dots symbol. You can manage the list of stations also from a file browser (see next question).\r\n\r\n+ Where does Transistor store its stations?\r\nTransistor does not save its list of stations in a database. Instead it stores stations as m3u files on your device\'s external storage. Feel free to tinker with those files using the texteditor of your choice. The files are stored in /Android/data/org.y20k.transistor/files/Collection.\r\n\r\n+ How do I backup and transfer my radio stations?\r\nTransistor supports Android 6\'s Auto Backup feature. Radio stations are always backed up to your Google account and will be restored at reinstall. On devices running on older versions of Android you must manually save and restore the "Collection" folder.\r\n\r\n+ Why does Transistor not have any setting?\r\nThere is nothing to be set ;). Transistor is a very simple app. Depending on your point of view "simple" is either great or lame.\r\n\r\n+ Which Permissions does Transistor need?\r\nPermission "INSTALL_SHORTCUT" and "UNINSTALL_SHORTCUT"\r\nThis permission is needed to install and uninstall radio station shortcuts on the Android Home screen.\r\n\r\nPermission "INTERNET"\r\nTransistor streams radio stations over the internet.\r\n\r\nPermission "READ_EXTERNAL_STORAGE"\r\nTransistor needs access to images, photos and documents to be able to customize radio station icons and to able to open locally saved playlist files.\r\n\r\nPermission "VIBRATE"\r\nTapping and holding a radio station will toggle a tiny vibration.\r\n\r\nPermission "WAKE_LOCK"\r\nDuring Playback Transistor acquires a so called partial wake lock. That prevents the Android system to stop playback for power saving reasons.\r\n\r\n(*) Opus playback is only supported on devices running Android 5.0+', 'descriptionHTML': 'Transistor is a bare bones app for listening to radio programs over the internet. The app stores stations as files on your device&#39;s external storage. It currently understands streams encoded in MP3, AAC and Ogg/Opus(*).<br><br>Important note: This is an app of type BYOS (&quot;bring your own station&quot;). It does not feature any kind of built-in search option. You will have to manually add radio stations.<br><br>Transistor is free software. It is published under the MIT open source license. You can find the code on GitHub (https://github.com/y20k/transistor). GitHub is also a good place to file bugs or even to contribute, if you are interested.<br><br>+ How to add a new radio station?<br>The easiest way to add a new station is to search for streaming links and then choose Transistor as a your default handler for those file types. You can also tap the (+) symbol in the top bar and paste in streaming links directly. Please note: Transistor does not feature any kind of built-in search option.<br><br>+ How to play back a radio station?<br>Tap the Play button ;).<br><br>+ How to stop playback?<br>Tap the Stop button within the app or on the notification - or just unplug your headphones.<br><br>+ How to start the sleep timer?<br>Tapping the Clock symbol in the stations detail screen starts a 15 minute countdown after which Transistor stops playback. An additional tap adds 15 minutes to the clock. Playback must be running to be able to activate the sleep timer.<br><br>+ How to place a station shortcut on the Home screen?<br>The option to place a shortcut for a station on the Home screen can be accessed from the station&#39;s three dots menu. A tap on a shortcut will open Transistor - playback will start immediately.<br><br>+ How to rename or delete a station?<br>The rename and delete options can be accessed both from the station&#39;s detail screen. Just tap on the three dots symbol. You can manage the list of stations also from a file browser (see next question).<br><br>+ Where does Transistor store its stations?<br>Transistor does not save its list of stations in a database. Instead it stores stations as m3u files on your device&#39;s external storage. Feel free to tinker with those files using the texteditor of your choice. The files are stored in /Android/data/org.y20k.transistor/files/Collection.<br><br>+ How do I backup and transfer my radio stations?<br>Transistor supports Android 6&#39;s Auto Backup feature. Radio stations are always backed up to your Google account and will be restored at reinstall. On devices running on older versions of Android you must manually save and restore the &quot;Collection&quot; folder.<br><br>+ Why does Transistor not have any setting?<br>There is nothing to be set ;). Transistor is a very simple app. Depending on your point of view &quot;simple&quot; is either great or lame.<br><br>+ Which Permissions does Transistor need?<br>Permission &quot;INSTALL_SHORTCUT&quot; and &quot;UNINSTALL_SHORTCUT&quot;<br>This permission is needed to install and uninstall radio station shortcuts on the Android Home screen.<br><br>Permission &quot;INTERNET&quot;<br>Transistor streams radio stations over the internet.<br><br>Permission &quot;READ_EXTERNAL_STORAGE&quot;<br>Transistor needs access to images, photos and documents to be able to customize radio station icons and to able to open locally saved playlist files.<br><br>Permission &quot;VIBRATE&quot;<br>Tapping and holding a radio station will toggle a tiny vibration.<br><br>Permission &quot;WAKE_LOCK&quot;<br>During Playback Transistor acquires a so called partial wake lock. That prevents the Android system to stop playback for power saving reasons.<br><br>(*) Opus playback is only supported on devices running Android 5.0+', 'summary': 'Transistor is a bare bones app for listening to radio programs over the internet', 'summaryHTML': 'Transistor is a bare bones app for listening to radio programs over the internet', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.61, 'ratings': 278, 'reviews': 154, 'histogram': [8, 8, 13, 22, 225], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.1M', 'androidVersion': '4.4', 'androidVersionText': '4.4 and up', 'developer': 'Y20K', 'developerId': 'Y20K', 'developerEmail': 'mail@y20k.org', 'developerWebsite': 'https://github.com/y20k/transistor', 'developerAddress': None, 'privacyPolicy': None, 'developerInternalID': '9068054212198332105', 'genre': 'Music & Audio', 'genreId': 'MUSIC_AND_AUDIO', 'icon': 'https://lh3.googleusercontent.com/uwUC529pMd3PvStbHOaAi8pSnFh-7x9YFTJIWWNY4gzg54cbwAbZSGePkZ3hCC4KbqWH', 'headerImage': 'https://lh3.googleusercontent.com/ZSSNg81xx6dNv6tJsKvSKHEhvyl_2z3_njlbnY68FkYsFQo2hWN30O-Cd7IGLaWPYQ', 'screenshots': ['https://lh3.googleusercontent.com/Cw6NhkCVBpAnDA3M3PJso5QZVIz9InKbVlyY-oSz8SrWNVO_0Ef95DWFESU7sXZtCg', 'https://lh3.googleusercontent.com/FzAhpVrmRIw4ZkYjT9d56MCLOdK8Ugaj3w8Ts4wMUvi_dPZt2gEzYsVlPxT61gNFRA3M', 'https://lh3.googleusercontent.com/rOErflcQEL1qmuDunESqWX5rjEegbiWSGM1dS2TaADQeieif2XxdZvOslr85XMDmkeT_', 'https://lh3.googleusercontent.com/EaMH2929_jo7X2M_OjiC_bvb9UhQSjR_PLwwpzaux7KzuIao-RpcvcJiOz2NafmeEw', 'https://lh3.googleusercontent.com/RksZoMQngfHvlIDEIOJqaQtOWa6spLH0dUFaRqqa5OsYNzP8c6BTfGIynSGESUzOerA', 'https://lh3.googleusercontent.com/rVSquFMCXmlvMeDgpwQ2ajEnApeEXsVBgnFDfB7YEOTwCfMP8ogltiouk9iW4pN2tm8'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 16, 2015', 'updated': 1581494372, 'version': '3.2.4', 'recentChanges': '- updated Indonesian language version', 'recentChangesHTML': '- updated Indonesian language version', 'comments': ["Awesome. There should be more apps like this. You have to add stations manually but once you're done, you have a lightweight, non-intrusive, and ad-free app with nice usability and even a sleep timer. I wish this were available for Linux & Windows, too. The only thing I'm missing is a dark theme - a switch for making the stations view background black would be great.", 'Excellent for just streaming audio with great codec support, the only possible things missing that I could think of are a way to manually re-order the list of stations and a way to view bitrate, but those are minor issues in a very reliable, easy to use app', 'Great app, no bloat. I would like to customise the buffer size though, for slow connections. Second the wishlist request to be able to arrange stations other than alphabetically. It does one job, and it does it well.', 'Does the job. Bigger stations logos would be look nicer through.', "very good app otherwise, but i find that constantly changing color schemes are annoying and they could be configurable instead... (the blue-black-white estonian flag scheme was fun though)... also dark background theme is missing... on android 5, all homescreen shortcuts revert to default app name on upgrade, but that can't be changed i guess? i also want option to bypass the stop-on-headphone-unplug as it's bad when stream stops, you lose piece of live show if you happen to listen such stuff...", "No ads! ...however... Doesn't have any preloaded stations or search function. Essentially useless unless you can paste a direct link for the station into the app.", 'Very convenient app without bloated interface, trackers or ads', 'Editing not possible anymore?!!! --> sah, swipe up... Not very intuitive...', 'Very bare bones. Not nearly as good as RadioDroid.', 'Excellent free BYOS app!! Great new icon btw ;-)', 'Fantastic app, just what I need', 'I use it daily. since 2017.', None, 'the best app', "Minimum interface, that's nice. Really good app. Thx.", 'Excellent!', 'Great little front-end for audio web-streaming ... small, unobtrusive, and functional. Perfect where storage space is at a premium.', 'Great app! Love the simplicity. Basic Chromecast Audio support would be fun!', "Perfect.some more parsing features can be added.so far it's great!", 'Great barebones radio app, please consider an option to backup the stations \nas an enhancement, right now I copy the collection folder manually, thanks', 'Best radio app for custom radio stations', "It's a very neat app, but streams keep dropping for me when my screen's off. Maybe add a setting to adjust the amount of seconds to prebuffer before the stream starts? Would be useful. c:", 'Location based Stasion Option Will Be The Best 6 stars', 'Super simple, plus saved stations transfer when you switch phones and migrate data over a cable.', 'Genius, installed it on both my tablet and phone, works like a charm!', 'Its almost same like Mr.Recorder app. Please add the option for recording.', '1. If you leave currently playing station screen, control is lost - have to restart a steam and then can stop it. Constantly accessible controls would be good.  2. No (direct) way to edit URL if mis-typed - must reenter entire URL.  3. Default name cuts off IP/URL so similar names can be difficult to distinguish - must rename immediately to distinguish (or edit pls/m3u files directly).  4. Biggie for me personally: no AAC support.', 'Superb software. Any chance support for .m3u8 streams?', 'Very Nice and Smooth to  use.', "Love your app wish I could give it 5 stars however I'm on a samsung galaxy s 7  now I would like to trade in my phone to get a nexus I am running into a lot of issues with my samsung I love the security but you're app keeps crashing quite often especially when I have lock screen on my phone does have a pass fries so maybe that has something to do with it but it does continue to keep crashing I have kept my phone up to date", 'Simple and works well', 'Like the concept, but kept crashing. Did file a bug report. A little complicated to add stations.', 'The same stream works perfectly fine in browser, but unfortunately there is nothing but pauses, stutters and app closes on Sony Z3, on the same wifi network as my browser on a MacBook. Used to work really great but has gotten worse and no its no longer usable :(', 'There are no adds and it is simple. I like it!!!', 'It stutters from time to time.', 'Awesome', "It totally replaced TuneIn Radio for me as all I need is a simple way to play a stream (I only listen to one station in the car). I also love that it uses Android 6's backup feature. All devs need to get on board with that.  I only have a couple suggestions 1) A way to have it auto connect/disconnect on bluetooth. 2) A setting to pause playback when navigation gives directions (I listen to talk radio mostly & pausing would help to not miss things)", 'Just what I am looking for. Thank you for creating this simple, lightweight yet so powerful radio app. The only thing missing for me is the "Sleep timer" feature. And make this available to run in the background even after closing the app in recent list.', "So we can use this app only if we have a link to a radio, why developers didn't think if I have a link I don't need any app I can play it. There are hundreds of thousands of free links why can't you add those, at least you should've provided few links.", 'Can you add some stations or genre by default,  would help a lot for first time users'], 'appId': 'org.y20k.transistor', 'url': 'https://play.google.com/store/apps/details?id=org.y20k.transistor&hl=en&gl=us'}
