{'title': 'YubiClip', 'description': "This app reads YubiKey OTPs or static passwords over NFC from a YubiKey NEO, copying the OTP/password to the clipboard for use with other apps or websites.\r\n\r\nOnce installed the app does not need to be started. Just swiping the YubiKey NEO against the phones NFC reader will cause it to run, displaying a message to indicate that the OTP has been copied, all without leaving the currently running app.\r\n\r\nNote that the default NDEF programming needs to be used. If you've reprogrammed the NDEF tag of your YubiKey NEO, you will need to change it back to the URL: https://my.yubico.com/neo/\r\n\r\nThis can be done using the personalization tool: http://opensource.yubico.com/yubikey-personalization-gui/\r\n\r\nWhen using a YubiKey NEO with a static password in scan code mode you will need to configure which keyboard layout to use in the YubiClip Settings. Currently only the US layout is supported. If you would like to see additional layout support, please consider contributing code via a pull request to our source code repositiory: https://github.com/Yubico/yubiclip-android/", 'descriptionHTML': 'This app reads YubiKey OTPs or static passwords over NFC from a YubiKey NEO, copying the OTP/password to the clipboard for use with other apps or websites.<br><br>Once installed the app does not need to be started. Just swiping the YubiKey NEO against the phones NFC reader will cause it to run, displaying a message to indicate that the OTP has been copied, all without leaving the currently running app.<br><br>Note that the default NDEF programming needs to be used. If you&#39;ve reprogrammed the NDEF tag of your YubiKey NEO, you will need to change it back to the URL: https://my.yubico.com/neo/<br><br>This can be done using the personalization tool: http://opensource.yubico.com/yubikey-personalization-gui/<br><br>When using a YubiKey NEO with a static password in scan code mode you will need to configure which keyboard layout to use in the YubiClip Settings. Currently only the US layout is supported. If you would like to see additional layout support, please consider contributing code via a pull request to our source code repositiory: https://github.com/Yubico/yubiclip-android/', 'summary': 'Read YubiKey OTPs or static passwords over NFC from a YubiKey NEO.', 'summaryHTML': 'Read YubiKey OTPs or static passwords over NFC from a YubiKey NEO.', 'installs': '10,000+', 'minInstalls': 10000, 'score': 3.73, 'ratings': 168, 'reviews': 66, 'histogram': [28, 8, 26, 20, 84], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '25k', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Yubico', 'developerId': 'Yubico', 'developerEmail': 'info@yubico.com', 'developerWebsite': 'http://www.yubico.com', 'developerAddress': None, 'privacyPolicy': 'http://www.yubico.com/privacy-policy/', 'developerInternalID': '8876865762321473579', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/GO_LIEPQ0UMnr0zsfOE_o7B1sXH3bYqfMuATty3h6_aiKcFt1wBjeOG1pktSmHMIw6sj', 'headerImage': 'https://lh3.googleusercontent.com/hZnzNXL5HdCZoLYxyaRuhICbwU_3BsFtgoPggHNn4QUqQGBhQXQ5uHgbJOKkTwrz6Eo', 'screenshots': ['https://lh3.googleusercontent.com/4upH1rkbBpjt38uHl80aoDYNEZz73sbAY-XgOrjrAIBUD-Ho_JYgu-StGLjS2zO30w', 'https://lh3.googleusercontent.com/JYtC326lJymmsTuSLFTttSYjObXv67L9qMCvzefc8lqS0OJKqfYVQ6h1azFweE0AYeYp'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 6, 2013', 'updated': 1537780861, 'version': '1.3.0', 'recentChanges': '* Update to newest Android API level.\r\n* Handle new NDEF URI scheme.', 'recentChangesHTML': '* Update to newest Android API level.<br>* Handle new NDEF URI scheme.', 'comments': ["There's a new version of this app as of today, but github says the last commit was on 2018.09.24", "Cowards don't allow comments on YouTube. Why no yubikey on mobile devices as traitors try to rape our data every way possible ..like criminals in customs or police.", "This app worked fine for a long time until yesterday. Since then I've got it to work only once. Now when I try to grab my code from my Yubi Neo it opens my browser and says successfully authenticated. It will not copy my key to my clipboard or to notifications. I've closed the app, restarted my phone and turned it off, turned NFC on/off multiple times. Nothing seems to help.  On a Galaxy S7 Edge.", 'I have "used" Yubiclip for about a year. It used to work occasionally with Lollipop, but now with Marshmallow it hardly ever works with NFC. It always wants to go to the web address instead of the clipboard.  Come on guys! It can\'t be that hard and I can\'t be the only one complaining!? Yubiclip has not been updated for almost a year!  And every time I install and then reinstall to try too make it the NFC king it says error -504 try contacting support.', 'I was excited to get the yubikey neo. The neo works as it should ALONE with \nsites like GitHub. Sites that need this p.o.s. "neoclip" app, you\'re out of \nluck. Gitlab works with the neo plugged into the computer, does not work \nwith neoclip. is this even a live project or did I basically get scammed?', "It worked perfectly for a long time, but now when I scan my Neo it doesn't copy the OTP codes to the paste buffer anymore. It opens the Yubico website saying the authentication was successful. In other words, it ignores the app.  EDIT: Reinstalling the app fixed it :)", "Works fine on my Nexus 6 running 6.0.1. However doesn't work on my Nexus 10 running stock 5.1.1.  I checked and my devices can NFC with each other so it is not a broken with the NFC chip. Also force closes when toggling the notification option but again only on my Nexus 10.", "Edited my previous, was able to get it working on Android 7 after a lot of reinstalling and clearing defaults. The one complaint is updates looked to be slow on the past and was never able to get it working until now for the first time (after 2 years), should provide better info in description to clear defaults on Android 7 for Chrome or it just won't work", 'Does what it is supposed to do but doesnt clear the clipboard, no matter the delay. It just gives the notification clipboard cleared but i can just paste it anyway. Running on a stock Samsung Note 4 (N910c Android 5.1.1 N910CXXU2COJ5)', "I would give this a 5 star rating if you could make the app copy the code and instantly input it to whatever field is selected. For example, I'm trying to sign into my Facebook account all I would have to do is selected the 'password' field then scan the yubikey and it automatically copy's the password to the clipboard and pastes it into the field without having to press and hold the field to past the password in.", "Stopped working of late, no phone update, no app update, just won't copy to the clipboard anymore. Tried with customised ones, and a fresh out of the box Neo, no dice.", 'Wipes the fields every time a code is entered and disables normal input from the YubiKey.', 'Does nothing. Still just a demo page comes up using the otp saying it was successful. Useless?...', 'For this to work in Marshmallow, you have to delete all browsers (i.e. Chrome Dev, Firefox Beta). Only then when you swipe with NFC will it ask if you want to use Yubiclip.', "It'd be nice if it could work like a straight-up hid, like on my PC, but I'm not complaining about being able to get my otp over NFC and using the clipboard.", 'Works after following their support\'s suggestion (had to also reinstall yubiclip to get it to work: "Go into the system settings, Apps, Chrome, Open by default. Change "Open supported links" from "Open in this app" to "Ask every time". Click on "CLEAR DEFAULTS" if the button is enabled. If you\'re using a different browser than Chrome you may have to repeat the steps there as well."', 'It used to work pre-nougat, but now the yubikey links open in Chrome.  Edit: fix! Go to Settings -- Apps -- YubiClip -- Defaults, change to "ask every time". Scan yubikey; should work', '9 out of 10 times, it DOES NOT work', '188 КБ, не требует каких-либо разрешений, бесплатно, без рекламы, без внутренних платежей. Однако, при включенном NFC и установленном приложении HTC Nexus 9 32 GB LTE (Android 7.1.1) на Yubikey Neo реагирует звуковым сигналом без всплывающего уведомления и копирования чего-то в буфер.', 'Works as advertised. Copies code from RFID to clipboard, letting you paste it into any field.', 'Works flawlessly on the Google Pixel.', "It's okay!", "Doesn't work", 'Works intermittently on Nougat, great when it does work.', 'No problem using this on my Nexus 5X running Marshmallow. People with issues probably just need to reset their default application so they can choose YubiClip after tap.', 'Scan opens chrome and navigates to an invalid URL instead of copying text to clipboard.', 'Opened browser for me after Marshmallow upgrade, reset app preferences via settings &gt; apps option in top right corner', 'Broken on Marshmallow.  Please fix!', 'Works Great', 'Works great', "App is good and easy to use. But the issue is it doesn't clears the clipboard in my Note 4 910G which is a big vulnerability issue. Please fix and I will rate again.", 'Finally,  you can have your own HOTP token copied to the clipboard for immediate use on the device. This wasn\'t possible with their demo app last year. I would prefer a choice of default action,  "copy" or "display toast/notification" that user can set,  and later change. Option to clear after 10 seconds is clever,  but needs to be longer (or a user selectable value: 10, 20, 30 seconds).', "This let's me do wish I needed with my NEO. Wish it would save the always open option rather than making me select it every time", "YubiKey NEO is really a great security innovation in today's mobile world. No need to plug in something.. Just swipe.", 'The app works with the exception of the clear clipboard functionality on my Nexus 4.', 'Works as advertised', 'Love it', 'Perfect', 'Ads a space before otp, which makes it useless in a combined password otp scenario.', 'Makes it a bit more convenient to use my neo with my nexus 7 ☺'], 'appId': 'com.yubico.yubiclip', 'url': 'https://play.google.com/store/apps/details?id=com.yubico.yubiclip&hl=en&gl=us'}
