{'title': 'Yubico Authenticator', 'description': 'Yubico Authenticator allows you to use a YubiKey to store OATH credentials (TOTP and HOTP supported, as used by Google, Microsoft, Dropbox, Amazon and many more) used for 2-factor authentication.\r\n\r\nStoring the credentials on an OATH enabled YubiKey ensures that your credentials are safe, even if your phone is compromised.\r\nIt also makes it easy to move between multiple Android devices.', 'descriptionHTML': 'Yubico Authenticator allows you to use a YubiKey to store OATH credentials (TOTP and HOTP supported, as used by Google, Microsoft, Dropbox, Amazon and many more) used for 2-factor authentication.<br><br>Storing the credentials on an OATH enabled YubiKey ensures that your credentials are safe, even if your phone is compromised.<br>It also makes it easy to move between multiple Android devices.', 'summary': 'Allows you to use a YubiKey to store 2-factor authentication credentials.', 'summaryHTML': 'Allows you to use a YubiKey to store 2-factor authentication credentials.', 'installs': '100,000+', 'minInstalls': 100000, 'score': 3.22, 'ratings': 674, 'reviews': 255, 'histogram': [235, 47, 20, 74, 296], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '2.9M', 'androidVersion': '4.0.3', 'androidVersionText': '4.0.3 and up', 'developer': 'Yubico', 'developerId': 'Yubico', 'developerEmail': 'info@yubico.com', 'developerWebsite': 'https://www.yubico.com', 'developerAddress': None, 'privacyPolicy': 'https://www.yubico.com/privacy-policy/', 'developerInternalID': '8876865762321473579', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/6LdZ1ptZBTryXmfDPBbRUzvMNn25XX-79kQ0mXZE3YhEKmFSCgldpjpmV2D7HqSZwQ', 'headerImage': 'https://lh3.googleusercontent.com/D8A1ZVXA_6_RLdHEnvAsUKIN2gVWOovJnPmIdroqb8pO1slEnZwF2pr8ZcmtoNWlqY8', 'screenshots': ['https://lh3.googleusercontent.com/SrneTPVAqI2DLzY9XbU3qxvUrqe-UAM75nlx6Rcf2gBbtLpWluanmzlntsqIphEJhw', 'https://lh3.googleusercontent.com/4CehCUXtiSHcFHTHFFEBI0MMi5sxpeRlMcbC7CjjPRIQG5j0zkT7qXtkhA08NR-CIY0', 'https://lh3.googleusercontent.com/SsTE6DQEZniLc0Au0uBQLAkxHVvZ1gnUFNW-J0DkGyx5ZTYsfq0P5QkYJWOYkmLX80Y', 'https://lh3.googleusercontent.com/tB2php3wRa7HENnK_aU7JJVWVYQqnF3L5oU6NalkWZZALyPDs3dxSG2v7HJfxa41qyZ9'], 'video': 'https://www.youtube.com/embed/W7if0FW12D0?ps=play&vq=large&rel=0&autohide=1&showinfo=0', 'videoImage': 'https://i.ytimg.com/vi/W7if0FW12D0/hqdefault.jpg', 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Sep 3, 2013', 'updated': 1568351714, 'version': '2.2.0', 'recentChanges': ' * Add support for Light/Dark/AMOLED themes.\r\n * Make camera requirement optional.\r\n * Handle externally launched otpauth:// URLs.\r\n * Minor bug fixes.', 'recentChangesHTML': ' * Add support for Light/Dark/AMOLED themes.<br> * Make camera requirement optional.<br> * Handle externally launched otpauth:// URLs.<br> * Minor bug fixes.', 'comments': ['So far so good!, have had once or twice communication error, either try again or restart app, not a huge deal, alot better having the codes stored on hardware where Fido2 isnt supported. Remember folks, anywhere you have 2fa enabled, print Off or write down your backup codes incase you cant use your key or codes. All in all happy so far with the app, running it on s10 plus on android 10', 'Same problem as most. It reads the tag, beeps and then nothing happens. I see people complaining about this since February. The software experience is abysmal in every OS. Yubico should stick to making hardware and just outsource the software, this is ridiculous.', 'It aint work: : "Error in YubiKey communication. " Installed n re-installed aint fix the problem. Same problem with PasswordSafe that in the past was working fine with yubikey via NFC. ------------------------------------------------------------------- Non funziona: "Error in YubiKey communication. " Installata e reinstallata. Non funziona nemmeno piu con Password safe che una volta funzionava.', "Added about 30 TOTP codes and after doing so, suddenly started to get the error: Error In Yubikey Communication. I've tried to uninstall and reinstall, and even tried this app on multiple phones. What's worse is even on the Windows app from Yubico the codes are gone. Fortunately I had made a backup when I realized how ugly the app was, fearing bad development. Sad waste of time. Hope they fix this issue soon.", "If you have a Yubikey and you worry about losing your OTP tokens the next time you have to replace or wipe your phone, this is the solution you've been looking for. It stores the tokens on the key. What would make it better? Being able to make a copy onto your backup key.", 'Correction: it did download to my Chromebook after 10 minutes! It is not working properly though. I followed all of the instructions exactly the way I did for my mobile devices including tapping the Yubico as the final step. It is not registering. It worked okay on my two android mobile devices. I am using a Hp x360 14 chromebook.', 'Super frustrating and, basically, useless. Tried with 2 separate YubiKey NFC 5 keys, on two separate Android devices with NFC support. All I get is "YubiKey communication error", "NFC read error" or (most of the time) just nothing except for the "Tap or insert your YubiKey".', 'Works perfect with my Pixel 3 and Yubikey 4/5. TOTP, and Yubico OTP slot via NDEF, work seamless via NFC and make mobile authentications easy and secure.', "Doesn't work, error in communication every time I tap the NFC", 'None of the features seem to work. Tapping a key usually does nothing even though my phone vibrates in response to the NFC reading. Scanning the QR code does nothing. Disappointing.', "The magnetic strip on a credit card triggers an “OAUTH“ error. I'm bummed that this isn't compatible with my credit card storage case. I have to remove all of my credit cards from the case to get the app to recognize my Yubikey using NFC.", "Yubikey 5 NFC isn't working with Pixel 2 XL running Android 9 (Security Patch Level: October 5, 2018). Its working fine on my Nexus 9 tablet running Andrdoid 7.1.1 (Security Patch Level: October 5, 2017).  I suspect something is wrong with the application and Android 9. I hope its fixed soon. I'm really excited to use my Yubikey.  If I put it right on top of the finger print scanner, it seems to be working better. Still not perfect.", 'Same as others described. Tapping the key does nothing, phone vibrates and reads but nothing on the app. QR code does nothing. Other apps such as last pass and google were able to read the key.', 'Fast and allows to use all features of the yubikey otp module. (i.e. Password protection, read write)', 'Ok I guess, store otp offline, on your key. the ui is ugly and there could be better options and a better experience. Most people looking for this kind of security are also open source enthusiasts, yubikey stopped being open source hardware and software, the fdroid apps are no longer being updated. This might be the only option for now, so a bit of a monopoly on this end, but different hardware keys are out there and I encourage you to do your research and find the best fit for you.', "This works great. It initially threw me because saved credentials only show up when you tap the key with your phone. They really need better documentation of how to use this- I think people are marking it down because they are confused about how this is supposed to work. I think it's pretty cool though.", "Its so much more convenient using a yuibikey than using apps like google authenticator because its all stored in the key and you won't have to worry about losing everything.", 'App is throwing "error in yubikey communication!" Whenever I try to connect my Security Key NFC with app. I\'ve removed my case, and can confirm that my phone\'s (Galaxy s10e) NFC is working for mobile pay. This is a blocking feature for me using a yubikey. If this issue cannot be resolved, the yubikey is not useful for me', 'Works great with Yubikey 5C across multiple devices.', "NFC not working - 'Error in communication with Yubikey'. Whole process to use Yubikey overly complex and instructions not clear. Disappointed.", 'Simple and plain it just works. as simple or as complicated as you want. order yourself a lanyard or a keychain(i use an high grade water proof pill-caddy which is WILD overkill... But im paranoid. dancing on a razor blade without a second backup hardware key which is dyupif to say the lease). ive been a script kiddy non ethical, grown up went to college for IT then became Ethical Hack/Pen testx whatever... and ive never slept as good, felt as safe sleeping with that 2FA key around neck.', 'Wheb i present the YubiKey to my phone the app just says "Error in YubiKey communication!". If there was an explanation of why this problem occurs or some instructions for how to resolve it then that would be an improvement, but without that the app is totally useless.', "My key scans fine through nfc. While scanning when the app is open I just received a communication error. If I don't have the application open already I'm about to choose how I would like to handle opening the key information.", 'App automatically opens when key is inserted preventing it from working correctly if a service does not need the app.', 'Getting error in Yubikey communication error, although nfc on my phone is working well, and with my case removed. Had to install older 1 0.4 version to make it work', 'My brand new yubico 5 key does NOT read in this app. ........  UPDATE:  The default NFC slot is set to "smart-card" if you change to "Slot-1" It works like I expected it to.', 'Works fine. Please add ability to edit the settings of each TOTP stored in the key, like change if some of them requires touch or change the name of the account.', "App works great, I haven't got any problems. The UI is better than it looks like on screenshots", 'Same issue as other Note 9 users. I have to scan my key 6 or 7 times to get my TOTPs. Please fix this!', "It actually works now. The new UI isn't half bad either.", "ver. 2.1.0 doesn't scan QR code for Yubikey: the camera comes on and does nothing with the QR code on key. Pixel 3 XL.", 'Got my new Yubikey 5 and when trying to use the app I just get an error message indicating "No credentials stored".', 'Works like a charm on my Galaxy and with the documentation from Yubico setup was fast.', 'not reading the yubikey over nfc, other apps do..', 'Yubico Authentication app DOES NOT recognize my new Yubikey 5 NFC. PLEASE CORRECT PROBLEM. THANK YOU!', 'Getting "error in yubikey communication" on my Galaxy S10', 'after I put all my important seeds on it, it\'s give me an error massage saying "Error in YubiKey communication!" My phone is Galaxy Note 9, Last Update, please fix this Problem quickly', 'App says "Tap or insert your yubikey" and when I insert my key via USB OTG, nothing happens, I can\'t see my OTP.', "Pixel3 XL OS Version 10 Clean system, with no other issues. Won't read .", "This app does not recognize Yubico's newest key, the Security Key NFC. Too bad. I'll keep testing and update this review when they do."], 'appId': 'com.yubico.yubioath', 'url': 'https://play.google.com/store/apps/details?id=com.yubico.yubioath&hl=en&gl=us'}
