{'title': 'Tower Collector', 'description': 'Tower Collector gives you opportunity to contribute in OpenCellID.org and Mozilla Location Services projects by uploading GPS locations of GSM/UMTS/LTE/CDMA cell towers from your area. The measurements help map the extent of mobile phone network coverage. You can use the app to collect data for personal purposes and export them to CSV or GPX files.\r\n\r\nSome features:\r\n• specially optimized GPS parameters to reduce battery drain\r\n• upload to OpenCellID.org and Mozilla Location Services (MLS) projects\r\n• export to SD card as CSV or GPX\r\n• ad-free, forever!\r\n\r\nThe OpenCellID.org project goal is to create a worldwide open source database of mobile cell locations. Tower Collector gives you opportunity to contribute in OpenCellID project by uploading cell towers locations from your area. Collected data can be used to quickly locate devices without enabling GPS.\r\n\r\nMozilla Location Services (MLS) is an open source project, aiming to create a worldwide database of wireless network infrastructure identifiers (cell towers, WiFi access points, Bluetooth beacons) correlated with GPS locations. Aggregated cell location set is available under the public domain "Creative Commons (CC-0)" license.\r\n\r\nPlease help me translate it to other languages, visit http://i18n.zamojski.info/\r\n\r\nThis application does not collect, store or send any information which can be used to directly identify user, device which is being used or any other personal information.\r\n\r\nBUG REPORTS AND FEATURE REQUEST VIA EMAIL OR GITHUB ISSUES PLEASE.', 'descriptionHTML': 'Tower Collector gives you opportunity to contribute in OpenCellID.org and Mozilla Location Services projects by uploading GPS locations of GSM/UMTS/LTE/CDMA cell towers from your area. The measurements help map the extent of mobile phone network coverage. You can use the app to collect data for personal purposes and export them to CSV or GPX files.<br><br>Some features:<br>• specially optimized GPS parameters to reduce battery drain<br>• upload to OpenCellID.org and Mozilla Location Services (MLS) projects<br>• export to SD card as CSV or GPX<br>• ad-free, forever!<br><br>The OpenCellID.org project goal is to create a worldwide open source database of mobile cell locations. Tower Collector gives you opportunity to contribute in OpenCellID project by uploading cell towers locations from your area. Collected data can be used to quickly locate devices without enabling GPS.<br><br>Mozilla Location Services (MLS) is an open source project, aiming to create a worldwide database of wireless network infrastructure identifiers (cell towers, WiFi access points, Bluetooth beacons) correlated with GPS locations. Aggregated cell location set is available under the public domain &quot;Creative Commons (CC-0)&quot; license.<br><br>Please help me translate it to other languages, visit http://i18n.zamojski.info/<br><br>This application does not collect, store or send any information which can be used to directly identify user, device which is being used or any other personal information.<br><br>BUG REPORTS AND FEATURE REQUEST VIA EMAIL OR GITHUB ISSUES PLEASE.', 'summary': 'Join the community and collect cell towers locations from your area!', 'summaryHTML': 'Join the community and collect cell towers locations from your area!', 'installs': '50,000+', 'minInstalls': 50000, 'score': 4.29, 'ratings': 238, 'reviews': 78, 'histogram': [21, 9, 14, 26, 166], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': 'Varies with device', 'androidVersion': 'Varies', 'androidVersionText': 'Varies with device', 'developer': 'Adam Zamojski', 'developerId': 'Adam+Zamojski', 'developerEmail': 'mail+toco@zamojski.info', 'developerWebsite': 'http://zamojski.info/Index,Tower-Collector.html', 'developerAddress': None, 'privacyPolicy': 'https://zamojski.info/Privacy-statement,Tower-Collector.html', 'developerInternalID': '6350420980914727504', 'genre': 'Tools', 'genreId': 'TOOLS', 'icon': 'https://lh3.googleusercontent.com/eihwfdpteuqHvqwo5Gurxts8C2E6VrZ2wW_FGXGZ0-bKbbDTNk2apDQJA7hvE2hFVg', 'headerImage': 'https://lh3.googleusercontent.com/15yf86LX9Zf8f9gcg3-AMqKHaiLKBI2YyRYGdqznLP76OfpBQaHT62H4o8of7DVUDg', 'screenshots': ['https://lh3.googleusercontent.com/tHkZ-eVyXhDUL9hz-ey8XfWFchmk-0PU99GAoyv2ECTxci7PqkShjOXTxy59QngJMoQ', 'https://lh3.googleusercontent.com/PJeJU_A2nVWYQQcxYSXnn-RaJHEgBsPtDOyy1yZcGKDm9-tMzxgFBOVEV42PP03frUu8', 'https://lh3.googleusercontent.com/fbvv6tOrPXr64DNeKBiSxcMUCsUhQf0FEgpyGBXpV1NeJ9y_VUFUyrCHi_963dZLo8Y', 'https://lh3.googleusercontent.com/G0mHHJ1zPvKP4Bh2vMsFhDoGi6svBAFBR9o3KukGo49HmlK3-PfkeboMp1UQWaD-E2g', 'https://lh3.googleusercontent.com/xC07UhxCzs8VSZxTzWNUHhnP19VrjhiGY1RET8YWVleBTV4TveIIDa_9PmwJLYHFAW8'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Nov 12, 2012', 'updated': 1589088679, 'version': 'Varies with device', 'recentChanges': '- Collect more signal related values for all network types on Android 8+.\r\n- Add Timing Advance to GSM.', 'recentChangesHTML': '- Collect more signal related values for all network types on Android 8+.<br>- Add Timing Advance to GSM.', 'comments': ['Improves open source map data. Can we upload data to radiocells just like as we do for MLS and opencell.', 'best app for uploading to opencellid and mozilla servers', "great tool... I'm still learning it and it's ready to learn s and I'm loving it", 'This app wants to manage my phone use. No way!', 'Got my curiosity to engage to develop my own revelation.', 'ANGELINA TORRES TORRES FEDERAL', "api key, what's that, so as I don't know, I can't upload........thanks for the reply, i now give 5 stars, every thing now working", 'It was okay.', 'Nutta', 'I found this app useful for showing hidden settings alone!', 'Very reliable. Good UI. Easy save to file function allows me to collect my own data as well as contribute it.', 'In', 'The GPS problem is no longer present. My only feedback now is that a link to the source code should be available in the description and a minor aesthetic improvement: when switching to dark mode, it should apply immediately instead of needing a restart.', 'Indeed great application for students when they dont have access to cellular tower data at all. For researchers as well.', "Heavy duty toolkit in a compact app package. Downloading using Captcha on the small screen is a problem, but will work around it.Update: Now this can't get my GPS fix? Bloody odd since 3 other services can. Do look into it won't you? Well Adam, i'll hand it to you, you gave it your best, unfortunately it has remained blind.  Uninstalled. The other one works without any problems with this phone. Updating based upon the latest upgrade: Working now, but i guess i should have screen shot the key, lost it! DOD?", 'Its working', 'This is an absolutely stellar application. We were looking for a way to map cell signal for a pilot test with technology needs across an un-cell mapped area of the Philippines. This app gathered 24000 cell readings, accurately (I tested it as opposed to call, text, and internet strength manually) and enabled us to export a CSV to google earth pro to create the exact map we were looking for. Battery drain was not as bad as expected, and it even gathered data with the screen off. Id give it 6 stars if I could', "can you tell me why cell id is too long, please can you give filter by LAC only, because there's so many CI, maybe you can show only by LAC. thanks", "The upload button don't have comfirmation. If you accident touch it, you will lost data tracking because after uploaded, it will reset to 0.", 'Simple, easy to use, very, very reliable and even where there are bugs the developer finds them before I do! Thanks!', 'Simple interface, but can we specify the collection frequency? It\'s also not clear what "GPS optimization" means.', 'Great app been using it for sometime', 'Does exactly what it is intended for and helps the opencellid community. I would give this a 5 star rating if it was given the option to remain persistent on the screen', 'for a great idea. Everybody scan the world so we can have gps without gps signal and cell mappings!', 'Interesting', "Been looking high 'n low for an LTE cell map view of where/what I'm connected to.  So apps many I'm trying! Finally, this one got one star because it's suppose to get location, but if only now he'd have it show on a map along with power!  Please do!", 'Just waiting for it to read both my SIMs to double usefulness, like com.themonsterit.EngineerStarter, Gyokov Soulutions, etc. apps can.', 'it is collecting 2g signals exactl and 3g signals is not giving correctly the cell id is diffrent and the same does not matching to the area.', 'Users already willing to donate battery life and data usage must on top of that create yet another account and password -> uninstalled. There at least one other Android app that supports anonymous collection for OpenCellID', 'Help full', "This app works exceptionally well.  The only problem I had was Tower Collector wasn't initially picking up cells, but after e-mailing the developer (very quick response), he pointed out that the GPS accuracy needs to be 25 - 30 meters before it will record anything.", 'Very easy to use and links well to OpenCellId', 'Hopefully will support 3g and lte soon', 'Good collector for cell sites. Use for triggering.', 'Great', 'This application really help us to collect the tower and I  think ini have some idea, do you have an email so we can discus? Or tell me so I can give my email to you thank you', 'Wish it had a map feature.', 'There was a bug on my S3 mini where Signal was always unknown until opening Settings > About phone > Status.', 'Good', 'I love this app'], 'appId': 'info.zamojski.soft.towercollector', 'url': 'https://play.google.com/store/apps/details?id=info.zamojski.soft.towercollector&hl=en&gl=us'}
