{'title': 'Zorin Connect', 'description': "Zorin Connect provides functionality to integrate your phone and your computer:\r\n\r\n• Sync your phone notifications with your computer\r\n• Browse photos from your phone\r\n• Get notifications for incoming phone Calls and SMS messages on your computer\r\n• Reply to messages from the Zorin OS desktop\r\n• Share files and links between devices\r\n• Use your phone as a remote control for your computer\r\n\r\nThe app seamlessly connects your computer and your mobile device over your local network, securely with RSA encryption.\r\n\r\nPlease note you will need to have Zorin OS 15 installed and have enabled Zorin Connect on your computer for this app to work.\r\n\r\nThe following permissions can be granted to enable core functionality in the app:\r\n• SMS - To view and reply to SMS messages on your computer\r\n• Phone & Call log - To get notifications for incoming calls\r\n• Contacts - To display which contact is calling or sending SMS messages\r\n• Storage - To browse and send your phone's files to your computer", 'descriptionHTML': 'Zorin Connect provides functionality to integrate your phone and your computer:<br><br>• Sync your phone notifications with your computer<br>• Browse photos from your phone<br>• Get notifications for incoming phone Calls and SMS messages on your computer<br>• Reply to messages from the Zorin OS desktop<br>• Share files and links between devices<br>• Use your phone as a remote control for your computer<br><br>The app seamlessly connects your computer and your mobile device over your local network, securely with RSA encryption.<br><br>Please note you will need to have Zorin OS 15 installed and have enabled Zorin Connect on your computer for this app to work.<br><br>The following permissions can be granted to enable core functionality in the app:<br>• SMS - To view and reply to SMS messages on your computer<br>• Phone &amp; Call log - To get notifications for incoming calls<br>• Contacts - To display which contact is calling or sending SMS messages<br>• Storage - To browse and send your phone&#39;s files to your computer', 'summary': 'Connect your Zorin OS computer with your mobile device', 'summaryHTML': 'Connect your Zorin OS computer with your mobile device', 'installs': '10,000+', 'minInstalls': 10000, 'score': 4.49, 'ratings': 298, 'reviews': 154, 'histogram': [11, 2, 17, 59, 205], 'price': 0, 'free': True, 'currency': 'USD', 'sale': False, 'saleTime': None, 'originalPrice': None, 'saleText': None, 'offersIAP': None, 'size': '4.2M', 'androidVersion': '4.0', 'androidVersionText': '4.0 and up', 'developer': 'Zorin OS Technologies Ltd.', 'developerId': '8326219039911479786', 'developerEmail': 'os@zoringroup.com', 'developerWebsite': 'https://zorinos.com/', 'developerAddress': None, 'privacyPolicy': 'https://zorinos.com/legal/privacy/', 'developerInternalID': '8326219039911479786', 'genre': 'Productivity', 'genreId': 'PRODUCTIVITY', 'icon': 'https://lh3.googleusercontent.com/1l5U8Emm9pog7u4n5MjNRIa08S6ZfWCVpGXbTywmWFT9h1FdChHFNn9x7CVwpd7dlng', 'headerImage': 'https://lh3.googleusercontent.com/Mmp7O_WbbsG9v9NaTOfXTIsH_teiT1ci3m5PqGIwTwcoNBU8K7kEdd202JTUvlP2-Do', 'screenshots': ['https://lh3.googleusercontent.com/RwVirrgHSLnvhk-MAptSq_eRnbpk9qRiNsuqaMx4os6ayefqM7N16TwjklW8X9D12xA', 'https://lh3.googleusercontent.com/AOcSnhw78q_DQheMNPbZUrDNrQeFaKa_xMqo1gi3Eut5cjSd9LjyK1lY2v5LJ2CsVLAi', 'https://lh3.googleusercontent.com/WHwEZ-Sv_3hQN427_r9WlvqcqaB9AVUNl_mwAS5vaXGTOh5X2eEAQ4sVXTJULyBi02mK', 'https://lh3.googleusercontent.com/QRavzzOhSD5To0STjo2ufgLChBXb_9egXWqZjrF3fThL6myWo7ycaAdA1MUfMvdDlCU', 'https://lh3.googleusercontent.com/weP6KBIw603cL3ztaZ2e3hY_s_4yzoI4GWLhBoOjr6SG5cTJVvqQdz5r4yTg8DKrnRQ', 'https://lh3.googleusercontent.com/5eDcUoT32BfCSiKBA8gJSg6vWTUyDzQXJLD1pHaX8jyL9rAh87Dg3eRo0JkmScmD4iM'], 'video': None, 'videoImage': None, 'contentRating': 'Everyone', 'contentRatingDescription': None, 'adSupported': None, 'containsAds': None, 'released': 'Mar 14, 2019', 'updated': 1575833708, 'version': '1.13.5', 'recentChanges': "- Slideshow remote now has a pointer which responds to your phone's movement\r\n- Enable controlling Android media players from your computer\r\n- Bug fixes and performance improvements", 'recentChangesHTML': '- Slideshow remote now has a pointer which responds to your phone&#39;s movement<br>- Enable controlling Android media players from your computer<br>- Bug fixes and performance improvements', 'comments': ["Love Zorin. I happily bought Ultimate (and I highly recommend!) App is an awesome job and has so much potential. I agree with other reviews: it would be nice to be able to close the app (instead of having to force close it). I also wasn't able to get texting to work: I could send from the PC, but no notification for incoming and conversations wouldn't appear. I gave the app all Android permissions, so maybe it has to do with the fact that I use Textra and not Android Messages app on my phone?", "Stumbled across this by accident. It's nice that Zorin ships with this utility by default. It works great and I'll be using it religiously from now on.", 'Despite having some "similarities"  with KDE connect , this app provides a really nice user experience due to the fact that it\'s integrated with ZORIN OS 15 ,just on a button click i am able to share files between  my laptop and phone effortlessly (the file sharing works with phone hotspot and the transfer  rate is phenomenal  around 30-25 mb/s  ).  I only wish that there is an exit button on the phone  , i don\'t really need an always running app affecting my battery life when i don\'t really need it at that time', 'Excelent. Just remember to create the rule in the firewall to connect.', "Great initiative but, need improvement. Like, an option to disconnect & close app from background, when I'm not using/Willing, now the only way to do that is to froce stop.", 'Works great but I really want to cast the screen.', 'The app is great. But the icon in the run command widget is way too bin.', "This is freaking awesome. i didn't think i needed it but once I started using it, I can't live without it... good job with the os too. once I save up enough money, im definitely going to buy the ultimate or whatever...", "This app is great. But, it would be better to have ability to route computer's audio output to phone and reverse, so that we can use a single headphone for all device.", 'Nice app 👌👍 but we need to think about Privacy , this app is sensitive permission required like sms , notification, contact ....', 'This is the best app to get into linux and has smooth experience. 👍', "Wow that's amazing! If it wasn't for my proprietary Wmr vr headset I would be all aboard the Linux train! This distro along with this app is so much more convenient than Windows!", "I really like the functionality this app adds to Zorin OS! But one feature I would love to have is 'wake on lan' where you could power the pc on remotely.", 'Very nice app, really easy to use and sync-ing my device with my laptop took less than a minute.', 'Was working like charm but once i re installed this app in my phone and forgot from pc , my pc is showing authentication error contineously "zorin connect: authentic failure" please help i want to use this feature.', 'Best OS and companion app. I use Zorin Connect everyday.', 'This works great i like the changes in Zorin OS 15 like the atomatic dark theme really helps my eyes and this i have been waiting for. Thanks for all your hard work on this and the OS Zorin team.', "At first it works fine with fresh install zorin 64 OS on laptop but after making upgrade n dist-upgrade on zorin is the software on zorin 64 OS not able to making pairing with this zorin connect Android. What's wrong?", 'Brilliant! Since I moved to Zorin Os, the app never failed to connect. Works better than gsconnect in combination with Ubuntu 19.10(gnome 3.34).', 'This app is great . . If i can controlling or typing my phone from computer, that will more useful . . Sorry for my bad english . .', 'Nice app but please push updates for better privacy & Security.', 'Was waiting for something like this since last year, Hope Zorin OS 15 will release soon. The app works fine but the beta os is a little bit slow.', 'Great, works great...this is an awesome app, works seamlessly between phone and HTPC', 'App works pretty good, just downloaded but is easy to use. Definitely interested to see what it can all do!!!!!', "Doesn't seem to work or else it is too difficult to setup. It shouldn't be harder than setting up a Linux Distro!", "It worked amazing as long it was working fine and now can't even connect my pc", 'If my mobile and laptop is connected to same router network . Zorin connect is unable to identify device.', 'A unique kind of app.. i was having issues with zorin os , so i uninstalled my os but zorin zonnect feature is awesome.', "Señores solo tengo una pregunta, como sincronizo mi Huawei Y7 2019/Zorin Connect contra mi Dell OptiPlex720 Wifi router server desktop hall/Zorin Os Core 12.4? Guys I'm just have a question, how to sync my Huawei Y7 2019/Zorin Connect vs my Hall router cloud desktop Dell OptiPlex GX720/Zorin Os 12.4?", "You should give feature to connect it with the distro using Bluetooth also, that's why I am giving 3star", 'Love it thought media player hud gets bug.', 'Awesome integrated app for Zorin. way more advance than the official version of this', 'Awesome just pure awesomeness just like your distro would probably consider upgrading to zorin os ultimate soon.', "It's awesome. I would love if we get to control laptop brightness through phone", 'Awesome, polished and integrated!', 'Very cool! I love using my phone as mouse and keyboard!', "Its the best app.... Its a shame it isn't in Zorin Lite version though.....", 'Clipboard sync not working with libre office', 'Could not get it to work with galaxy note 4.', 'I was absolutely unable to connect'], 'appId': 'com.zorinos.zorin_connect', 'url': 'https://play.google.com/store/apps/details?id=com.zorinos.zorin_connect&hl=en&gl=us'}
